[{"pageContent":"Yeah, definitely. Im not sure exactly. Is it something that I have to invest in at first upfront?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im well. Who am I speaking with again?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"So what I just wanted its just something simple. For now. Im actually a gamer, so Im just trying to find a good niche to help me stay innovative with, I guess, content. Something that will help me create content. Someone that can maybe its a learning experience for them or maybe they just like the content.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. They had their own ideas, right? He had a plan, though. He knew what he wanted to do. Heres the thing.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"So help me understand again now, you said what your company is actually doing then?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"It almost sounds too good to be true because I almost feel like this is not right. You said youre going to waive all the fees and stuff because how much would you really charge for something like that for 60 minutes?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Oh, yeah. I want you to understand what Im explaining to you. I didnt mean to cut you off. But it does too, because my children are teenagers now. My youngest is, hell be seven in August back in Louisiana. And then I have three teenagers overseas in Japan. So this was well before these ideas that Im speaking to you. These are ideas and dreams of aspirations that Ive had for the longest of time. Ive shared this with not too many people. Not too many people know exactly how I feel about building those types of foundations and mentorships for children. And the reason I bring it up, because it was this company, they were called Design Utility. I think theyre still operating scam, like, because Ive done a little bit research on them and I know I reported them to the Better Bureau, but yeah, its just been so harsh on me that they could actually do that to me when they knew what I wanted. Right. The refund process didnt go good. They barely refunded me half back. Yeah, man. My home. I was fortunate. The father figures in my life are still present now. Today, I just didnt have my own father. Even though we dont have a terrible relationship, my own father wasnt just readily there. But thats what I thrive off of on having children, to be having them to where their motivation lie. It creates the motivation within them so that they dont feel less than, even though maybe they dont have the means to purchase whatever it may be to help them make them successful. Maybe theyre just unfortunate, whatever the case may their living situation may be.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. You sound far away. I can barely able to hear you. I think you said your name is Jake?","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, so what Im doing here, Im pretty much just waiting. Ive already done everything I needed to do here. Ive been here since Monday, and I went through the orientation process. I had to take some tests and do a drug screen, that kind of stuff. You probably dont know what entails being a truck driver, but its been a three day process. Basically, I was supposed to be on my way back to Wisconsin. I believe itll be in Wisconsin. Thats actually Central Time.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Whether or not Ill be here tomorrow, 03:00 P.m. Should work fine, because either Ill be already on my way back, Ill be able to be hands free and talk and take some notes. Ill stop if I have to take notes or whatever the case may be.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, so as a part of starting a business, Ive always been into wanting to create a space for a mentorship or I just have these crazy ideas of how I would like a business to be with those resources. Id be able to, I guess.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So John Kristani has pretty much software that he sells that creates this for you through clickbank and you just kind of have to find what works. In some cases, you create funnels and advertisements through Facebook. And I started that process with him, but then I didnt really have all the tools that I wanted to kind of power me in that direction, so I kind of opted out of it. And it was about $1,000 worth of software. So when I came across the YouTube automation, how you could just create videos or you dont have to show your face or anything like that, and it kind of jump starts the whole process of you creating an audience without even having to show your face or you can still be private about it and whatnot. So Im kind of looking to dive into the affiliate market program where I can see the guts of the operation and what actually works.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"On that, for sure. Awesome. I definitely believe that would inflate me to the level of at least getting some expertise, some knowledge of how to implement those tools.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"A second, everything that I do have yeah, sure. Most definitely with me.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Most definitely, man. Sounds definitely like a plan that Im willing to take some risk on here.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"A foundation for children who are less fortunate. They can have a place where they can come to not only just to find resources, but they can kind of establish a peace of mind. Its a place where they can become motivated to become their greatest version. Yeah, I like to pass that down.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Most definitely, man. Ive been driving truck now for over a decade, so Im approaching two decades of having a CDL, and in my mind, Im seeing this vision of me because its already been planned out. I saw my uncle do it, and I kind of didnt expect to be following or tracing his footprints, if you will. But hes well established in the trucking industry. He has a number of trucks. Hes got his sons involved. I actually worked for him for quite some time, about a year and a half. And we dont have a bitter relationship, but you tend to take his family, so its not a love hate relationship or anything. We just didnt really work out. He does things a certain way, so I basically found my own way, and its working out for me. But Id like to have it where what I really would like is for it to become more lucrative for me so that Im not just in a situation where Im living struggling to make ends meet, paycheck to paycheck type of thing. My focus needs to be I need to free up more time to have to think, to spend time with my children because theyre overseas and have more time to pour into their life and give them advice on certain things. And Im just being pushed over and over because I have all of these other things that are occurring in the world that are against me that shouldnt be. Im not complaining. Im just doing whats necessary, but its quite overwhelming at times. So where Im going with this, like I said, as long as Ive been driving, you know what Im saying? Its been over a decade. Ive had some great experience, and I kind of still have nothing to show for it except me being able to drive very well and to do this job at a very high level, to.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Wow. Yeah, I would definitely say at least about at the least, probably ten grand. Anywhere from ten to 20 grand. Because you got to think I have to think about where Im going to put the yeah, you got to be thinking about where the place would be, what type of environment this would create for the children, given the location, the amount for the space. Let me keep it all running.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Well, Im not sure if you have you heard of John Kristani or any of those guys that they have their, what do you call it? Have you ever heard of affiliate marketing?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"It is about roughly twelve to.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yes, theyll be returning dispatcher will be returning in the morning, so they should have whatever they need or whatever process theyre waiting on. It should be done by that time, well before that time. 03:00 P.m. Tomorrow. Like I said, I was supposed to be on my way back. Everythings processed and finalized. Theyre waiting for the other end to process through. Theyll definitely work for me. 03:00 P.m.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, Im not sure if this actually counts. Im a truck driver, so I basically just I drive a company driver at this time, and I pretty much was looking to eventually own my own truck or a few trucks eventually, but, yeah, thats where most of my expertise lies, in transportation.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its 640, I think 646, 50. Somewhere around there.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"See, I would say the 03:00 P.m..","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Oh, man, that sounds better than good. Im just kind of like in all day. I dont know. I just feel like, man, thats crazy. You know what Im saying? I dont know what I did to deserve it, but I really appreciate it.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Wow. Yeah. Thats one thing I really dont have too much expertise on, so Im not completely well versed in what it actually. I know its a program where if you have a so certain businesses, like Amazon or like a Fortune 500 company, youd basically get in a program with them where you help filter in customers for that particular company. So in that process, theyre creating funnels in order. My plan is to do that same thing. Well, thats whats supposed to work. Thats supposed to be the whole process.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"I would say about 2000.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"You mean what do I plan to do with the resources that I gain?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I believe let me see. Im in Greenville, Tennessee, right now, and I believe that seven or I want to say that is East Coast time. It is actually almost nine.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Exactly. Constantly in that hamster wheel of that it can be a grueling cycle. Its nothing really to be proud of because it almost feels like slavery to me because like I said, I have nothing to show for it. Right.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Man? Wow. I would definitely love the opportunity to get to show awesome myself what Ive been waiting to see.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Most definitely because I tend to gravitate to these tech savvy little innovative niches that they come up with which produce some type of income, passive income online by them just being themselves or just having their own idea and just seeing it manifest however it does. But its their passion, its something thats coming from them. So Im to the point where I have reached that level of Im entrusting my own gut feelings and I kind of want to step out into that genre of creating money for myself. Essentially trying to establish I guess some type of something I can pass down to my children and kind of build a legacy behind that. At one point, the things that I had to offer and the things that I wanted to get into I had a little bit more of a depth what I wanted to do. My ideas, they were a little bit broad I guess but I was still willing to work with it. But I just kind of got bamboozled. I was just losing money. People were setting promises that they just didnt follow up on. And as a result, I just pretty much end up losing thousands of dollars, even though it was just I got scammed really bad a few years ago out of $3,500 through money orders because this guy was supposed to build a website for me that was supposed to create ecommerce. And I went and got GoDaddy accounts, set up this phone service for them to have the calls come through for the automation process. But then I started getting these cheesy emails about well when you ready to start making money then just hit me up and all of the ignorant that is just horrible. So it was a terrible loss for me and I kind of just trying to find my motivation again altogether.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. The thing is, Im not even at home right now. Im like 13 hours away from where I actually reside, and Im seeking another job opportunity here. Its going really well. Just waiting for the final process. I was actually supposed to be on my way back today. However, the process is basically still undergoing nothing bad everything. Its just a waiting process at this point because Ive already qualified for the job for the most part. Hopefully it does continue to work out for me in that light. But yeah, man, what I want to do, I know what I need to do as far as getting some background on how those things work, so I can know exactly how to establish what will work for me. And I just havent really done the homework as in depth to answer that fully.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Man. That is great. Very good.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Okay. All right. Wow. A little bit. I dont have an actual business of my own. I definitely want to get to the point where I can brainstorm my ideas and put them together because Ive just been the people that I entrusted to help me. It was a company out of Los Angeles that was supposed to help me do get into online automation or Ecommerce automation. And recently I think I ran across your ad on Instagram, possibly for the AI bot. And what I really was going to try and get into was like social media automation is what kind of have an idea to start off with.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"It was this month. I did view it briefly about a week ago.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, got you. You said youre reaching out about the AI tools, correct?","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Yes, most definitely. Wed love to hear.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And thats just for consulting, correct.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right. To be honest with you, I understand what youre asking me, but I really dont have an answer for you. I really dont know what will work for me, because thats why I was reaching out to people like you that could help me understand what Im trying to do, and then I can know exactly how it worked for me. But I guess Im looking at it a little bit backwards because I have no real history or knowledge of how it actually really works.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"No, Im still here. I can hear you.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Hey, how are you doing?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}}]