[{"pageContent":"Yeah, exactly.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, that makes sense. That makes sense. Okay, cool. Let me ask you another question. And obviously this is just something that I saw. Im not skeptical of Caleb at all. I dont know him. I can judge people what I see on the internet. But your man Coffee Zillow did grill him out a year and a half ago. Did that affect anything? Because Coffee Zillow, he is pretty trustworthy, you know what I mean? I dont think he called him anything, but I did see that like a year and a half ago when he was going in.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Last month I did I think I did, like thirty one k.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im doing everything right now. Im doing it. Im active.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, so what I was saying is, is there actually a fee with that that youre waiving or is that kind of a thing that you say? You know what I mean? Because thats a smart way. Thats a smart sales tactic.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right now? I would say I had to put a number on it.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"All I care about. You can stop. Thats all I care about. I dont care about the extra stuff. I was just curious how that ended up going. But yeah, no, thats good. But yeah, man. No, I would like to know because he was talking about AI a lot. Right. So Im curious to see how you guys are using that to get the leads, you understand? Because Im doing it right now. Im spending a lot of time and there is a one method that this guy is doing and I think he made like a million dollars in a year doing it. And what he does is he has a system. He created a system and hell scrape the leads from Instagram and hell scrape like 30,000 and hell send like 2000, 3000 a day. But the thing is, in the email hell put the calendar link so hell get a bunch of booked calls. And obviously the problem with that is they may not be qualified and theyre cold email. So you could be talking to a lot of people because its just not qualified, you know what I mean? Versus if Im targeting an account or if Im doing a post on Instagram targeting this specific people, its a little bit different.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Five k. All right.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, Ill watch. You said 90 minutes. Thats kind of buffy. Okay, what is that? Just going over everything.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Its something that I would continue to do unless I see like a crazy influx of leads. Like if Im doing like 100 and 5200 leads a month, then at that point its like, okay, well thats on the low end.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"My goal revenue for right now, its 100K every month. Its bigger. So last month was thirty K, I did 30K, this month 100K. So whatever I do I make sure that I hit that goal no matter what it is. So this month I would say 50 to 100, but Im saying 100 just because.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, so the gold I have is $500 a month. Then I have the silver, which is $1,000 a month. And then I offer the push package, which is $5,000 a month. And essentially what each of them come with is full on management, comes with content creation, comes with hashtags, comes with twenty four, seven support because I have an outsourced team to handle that. And then also it comes with another system that I use that helps them get leads. And it also comes with, obviously, the hashtags and everything like that. And then the bigger package comes with press. So its more of a branding play. Thats pretty much it. I have clients that pay me more than $5,000, but its really about it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hey, whats going, Alex? How are you doing?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay, good.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Call okay, I was just confused on where that $100 no show fee came in.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, because Ill get more information, which information is power, I could go ahead and apply it myself. And Im going to be honest with you, thats another thing, too. Im never opposed to getting the information. So just so this is clear, so if it does end up working out and the investment isnt too crazy and I could go ahead and do it, is it done with you or is it done for you?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Ill tell you. I was I got my start in sales at Verizon, and Ill tell you a little story. So I got my its like a Wolf of Wall Street story. I got my I was doing honestly, I didnt even want to do sales. I needed it, a way out. I was doing two jobs, and I was literally two jobs back to back, overnight to morning. And I said, I dont give a flying F, I just need to get out of here. So I ended up working at Verizon, and they did the interview, and the way they sold it to me was so good, they wrote the number on a napkin, and they showed it to me, and thats how much I can make a year. And then they said, this one caveat. What is it? Commission only. Like oh, shit. So I said, hey, I got to do this. So long story short, dude, I did it. And I didnt even know that I was good at sales. I didnt even know what sales was, you know what I mean? And I just knew that I had to pay my rent. So that put the battery in my back, and apparently they thought I was good. And then the head of Verizon, dude, is a billionaire. He actually told Mike. Mike Ley. So Mike Ley is a senior Verizon rep. And he flew us out and everything. We moved to Philadelphia. I rolled with freaking six guys. And yeah, man, we just slung Verizon until I said, you know what, Im just going to do my own thing. And then thats when I ended up doing this. And then now Im here. But Ive never dealt with that many leads. My big thing is, obviously Im curious on how that would work or how quality they are, because I get leads all the time in my DM. Theyre from India. Theyre from all different countries. You know what I mean?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"If I want I could ask Stripe for like twenty five K and theyll do it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So the process is, as of right now, we have different ways we get our clients. One method is using utilizing upwork. So we submit proposals on there for new jobs, and theres a lot more white collar people on there. So were able to close people for the higher end packages, higher tier packages, and upsell them as well. And then the Instagram is probably instagram has become our first meth way. Used to be our second. Now its our first. And I just started posting, putting a lot more money into content and creating content and reposting that content onto bigger pages to build my visibility. And now Im getting a lot more people DMing me, and I just have it DM me the word power if you want to grow your following. And they DM me, and then I help them, and thats it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right now? I grow peoples instagram. I help build their audience up. I definitely had a bit of success doing that. I got one of my clients just got sponsored by Amazon, and I got another client that does very well on Instagram as well. So Ive definitely got things moving on there. But I want to see if theres a way for me to get more leads, though, using AI, because I have a very high close rate, but Im trying to pump more leads into my business.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, something like that. And then Im going to be honest with you too. I have a loan already right now with Stripe and I stopped trying to get loans that hit my credit and what I started doing was leveraging. I leverage relationships at PayPal, Stripe and things of that nature and I process my transactions through their system and then from there I use that and negotiate a term with them and then I can get just as much money as the bank will give me and they wont even check my credit. They just will just deduct the money from the transaction that I make and Im okay with that because then lets say they for example, Im going to give you an example and this could be a plate for you guys. So lets say that they give me whatever. Lets say they give me 100,000, right? Give me 100,000 and I have 36 months to pay it, right? What I do is its a special way that I do it. So basically what I do is I pay it a lot faster. I want a high interest rate. I want it I dont want a low interest rate. I want a high interest rate because then I can pay it off faster and then I get a bigger loan. I got to the number I got right now and Im continuously going to keep growing because Im leveraging the relationship I have with Stripe. So I dont know if its the best idea for me to pull out a loan with a bank. Im just telling you. Im not saying thats what youre saying.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Stressed about give me 3000 book calls, thats a crime. To give me that.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"No, I find organic is the best ROI. Im spending basically pennies on the dollar and to get the clients. My profit is very high, not running pads.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"That would be ideal. Those are the people that yeah. Business okay. For sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I love to hear it, man. I love to hear it. Im looking forward to it. Im going to watch that.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"My close rate is.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Exactly, I wanted you to share this thought process and also if you could share previous experiences of you maybe doing that and that would be good too because a lot of people talk to talk, you know what I mean? Not that saying that to you.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"My company is Power Push Promo, but the service is I have different packages. I have a gold, silver, and then I have the push package. So you can call package.","metadata":{"fillerID":29,"fillerText":"Mhmm","category":"D"}},{"pageContent":"I have some solid cash. I have a lot of good money.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hold on 1 second. I would say let me just give me 1 second. Hold on, I just got to send this. Hold on a second. We check my schedule. Lets all right, calendar. All right. 12:00 p.m wont work. Whats the other time? After twelve.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"A show rate would be whats? The show rate? I would say 70%.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, got you. That makes sense because you dont want to waste your time. Right? Nobody wants to waste their time talking to somebody. Yeah. Okay. That makes sense.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"No, just because I dont need it. I dont need to scale yet. Im not at that level yet.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"All right, man. Talk to you tomorrow. All right, bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. So that wouldnt be a problem at all? No, that wouldnt be a problem at all.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"You have $100 no show. But what if they wait, hold on. But youre not collecting payment. Im showing up. I dont have to worry about it. But how does that work? Im just curious.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, its like upper sixes, mid to upper sixes.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Three. Lets do three.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, that makes sense. That makes sense. And quick question, the thing that I saw for this, I think that kid was named Caleb or something like that. Is he involved? Does he run this company? Who owns this company? Who runs this?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"And I thought by the way, I thought Caleb was cool. I never had any things about him. Ive seen his ads, but I never had Im just saying, like, did that affect you all or did they end up squashing that beef? Im just curious to know because its a trusted source, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hey, whos this?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Dollars. Awesome.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah, I dont have to worry about that. Im going to be on the call. You said 1000 503,000 leads a month. Im very interested in that because most businesses, their problem is leads. Thats usually what it is. Most people are decent salespeople. Theyre not great, but theyre decent. So even if you close, 20%, 30%. Okay, cool. Right at the price point that Im at. Right, but yeah, no, Im looking forward to it. And Im looking forward to seeing what we can do real quick.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"50%, 3000. You said 3000 book calls?","metadata":{"fillerID":29,"fillerText":"Mhmm","category":"D"}},{"pageContent":"Im on the east coast.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Say it again.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Okay, good. As long as its not one of those videos where theyre like, hes trying to tell you a dream. Imagine youre a waikiki sipping my ties and Im like, Bro, just get to the point.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"I will be there and ready to go.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"You know what Im saying?","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I was. I wanted to know a little more about that AI stuff, but yeah, for me, I just wanted to see if I could pump more leads into my business. Right now, Im doing something thats pretty effective, but I wanted to see other options as well.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"My close rate is around, like, 80. Because Im not getting because Im pre qualifying the people yet. Nobody gets on the phone by the time they get on the phone with me. Its like I tell them the price, I tell them everything. So by the time they get on the phone with me, theyre ready to go. I close them.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. Is that something that you do when you see youre talking to somebody of quality or because if it is you could be real with me. Is that a sales thing? Because thats smart. Im a sales guy so you could just be fully transparent with me. Thats actually very smart.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I am in Raleigh, North Carolina, where they just had the Dreamville Festival. Are you familiar with J, Cole and Drake?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]