[{"pageContent":"Yeah. Hows it going?","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I was thinking, is that something you guys offer or what more of a service do you guys offer? Just guidance.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Right, okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I havent. I havent had a chance to. So this is for the learning more information about AI. Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I run ads before. Well, I had a marketing agency in Sacramento, but I kind of let my buddy just kind of take over it, and then Im over here building a new restaurant. But Im here for like a year, so I kind of like yeah, I had a social media marketing agency. I bought a course to teach me how to create a marketing agency a while back. Nice chicken. Yeah, thats good chicken bro. Im getting something to eat right now, but youre good.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Sorry, from where?","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I dont know if theres a better way.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"And I kind of was using his Blueprint. I wanted to use his Blueprint to do it, but I wanted to see what you guys offered or if theres a different template that I can use or wanted to see whats the best template to use out there. Because right now I noticed that he targets. Im bilingual, I know Spanish, and I kind of wanted to tap it into the Latino community because I know here in Georgia theres a lot of Latinos and a lot of them, I feel like, own restaurants. But I dont know if they might know the proper structure or they dont have a system in their restaurant to make it the best they can be.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, the three main key points that I wanted to focus on was, of course, marketing organization and financial on how to organize a business, I mean, a restaurant business, and how to probably have the right systems in place for it to function and work without you being there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I didnt finish watching the video. You guys got my attention in the beginning, and I didnt see exactly how you guys work and how it works.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"I think its been in my head since I first started, man, when I first opened up my first restaurant and opened up my first location in Sacramento because I had food trucks and then takaria more casual, fines dining. And then five years ago, I opened up actually, like a full service restaurant, and I was just trying to get all kinds of help, and I bought a lot of courses. And then I kind of figured that right now its the time, or even like two years ago or three years ago, it was like everyone was selling consulting packages on social media. And I bought a few. I bought one for real estate, I bought one for marketing. And I was like, why dont I create one for a restaurant? Since Ive been in this industry, and I know the ins and outs, so Ive been wanting to do this for a while, man. I just didnt know how to properly structure it and how to do it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"My ultimate goal. I want to actually push on information that I learned throughout the business since I first started and the mistakes that I kind of made along the way and I learned from them and kind of helping other people with. The guidance of just because some people hop in, they dont know the whole some people may think going for a restaurant is just having good food, but they dont understand the whole picture by the people, the right people in place, the right systems in place, the marketing, the branding. So I wanted to pretty much kind of step away from the restaurant industry, just sell courses. I wanted to step away because this shit takes up all my time. I want to step away from the restaurant industry and just create a consulting agency or consulting program that I can sell to sell to restaurant tours or someone that wants to start up a restaurant with it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Do you guys help people with consulting, like creating consulting businesses or what do you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"For example, a person that I follow, his name is Mr. Temple, and hes pretty much started he has similar story to me, kind of like started as a dishwasher, learned the ins and outs of the restaurant and how hes opening up multiple restaurants all around the nation. And just him creating a system and just having a manager run it or having like lets say he has a business partner. He has all the steps and all the questions that you might have all in a program or all in a system where, lets say someone wants to buy the name of my restaurant here called MILPA. Lets say someone wants to buy a mealpa from me, or if I want to franchise it, I can even be like, hey, this comes with my full backup consulting system. That if you buy into our company. If you have any questions, you can always call back on our consulting firm and you can ask any questions or any questions that you have are there to be answered on that. If its a website or just being part of a group or Billy Jean, I dont know if you follow him, you can join his marketing agency and you just kind of go log in there and chat with other people that are restaurant tours. And I just feel like no one has done that for restaurants yet. I want to be the first.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, for now, I kind of wanted to do what got me, like Facebook ads. Thats pretty much what got me, because even now I know YouTube ads work a lot too. I was thinking about doing ads and then having back to a funnel. I dont know if thats the best way to do it, but thats kind of what I was having in mind of doing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hey, I got a call coming in. Just stay on the line. Let me just answer really quick.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I wanted to see because I know the next big thing too. I know AI is like the next big thing. So I kind of was like, I need to hop on this. It caught my attention right away when consulting and then AI, Im like, oh, shit. This is something that I can hop on before anyone else does, right?","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, because I just wanted to start a consulting company maybe. I know theres people that probably already have one, but I wanted to start one. I dont know where to start. I kind of want to see what you guys offer first. If theres something, like I said, a program or a software that I can use or type of guidance to actually start and create a consulting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Be willing to start with $1,000. I think that sounds reasonable and just kind of I see from there where to go. If I see like, Im getting results from them, then I probably want to run more and drop more on that, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Either way, if I can just have an extra income coming in in the beginning, but Im using my restaurants as credibility for people to actually buy my system. Im succeeding in California, Im succeeding here in Georgia. I have credibility, like, backing me up, because right now, my restaurant is only nine months old, and its doing really good here in Georgia.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And some olive is good. Feta cheese. You can throw some of the garlic on there, and that should be good. Yeah, thats good. Yeah, man. So talk to me.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I feel like were in a time where I feel like we need to me, its like, of course I love the restaurant industry, I love the food industry, but I feel like I can take it to the next level. I want to just keep innovating and actually leaving a legacy of a restaurant tour. Being known as a restaurant tour that kind of took like a mom and pops pop shop and just converted into a consulting firm or consulting agency for restaurants.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Kind of like I said, I wanted to follow that guys website, how he has it in his order, but I just kind of wanted to see what templates I can get or use to people to go through. Lets say its like a course and at the end I can be like, oh, you take a test or something. Simple examples on how to run a business or whats the proper way to do certain things. Because my buddy, he was creating a consulting, I think its called Teachable or something like that. Have you heard of it? Its called Teachable but its a website where you actually can create systems. You can start off for just your team, for your crew. Lets say you do a new hire, they go through it and follow the steps on how to do certain things, say a bartender or server.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, right now Im making about 85. But the thing is that the restaurants like, right now, the new restaurant here, Im not paying myself. I start getting profit. And then, of course, my because Im still paying myself from my other restaurants. But this one, I put it on pause, and Im just kind of letting the money cycle back into it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, Mill Milpacantina.com. Got you. When you send that over, I can revisit it later. I just been a little busy with my other business.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"What was that the question?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Well, once I get my first, I wanted to kind of build the consulting firm and the offer, the videos and all that that I have to because I was planning on doing videos for each step or each like the marketing side, the organization side, and the financial side of the business. So just properly structure it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"He bought it. He wanted to create his own consulting firm also for marketing, but he ended up ended up getting into Ecommerce, and now hes fucking killing it in Ecommerce. So hes like, oh, lets go. Im just collecting money off Ecommerce.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Sorry, what was that?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"No, definitely. If I can see me working with you guys in the future, that would be great. For real. This restaurant right now has me by the balls, man. Im in here every day from open and close and just trying to kind of make it work here in the area that Im in. But thats the first year. But once I get the ball rolling and everything because so far Ive been only open for nine months, man. Its a baby. And I kind of been here hands on and making sure everythings 100. Thats one of the reasons too. The restaurant business when you first open it. If I can eat all your attention. And I want to learn more about you guys because I want to see if its the future. If its not now, if its, like, maybe in a couple of months or in a few months that I get more time, then I can start dedicating maybe a few days a week to just building the consulting company. That would be great. Right now I have my hands full.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, I was thinking so look, the last one I bought is called the Restaurant Boss. Its a consulting package that he sold, and I wanted to imitate his or remix his platform. Because you become a member on his website, he charges, I believe, to join. Its like $350. But you join and you have access to all his content, like his videos. He talks about the marketing side of a restaurant, to modern restaurant to current day in an organization, on how to organize it and the financials, on how to use the money in the business to kind of keep it growing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Understood. I guess I havent thought about it exactly. To me, its not about Im not just focused too much about the money, but of course, who doesnt want to be making crazy amount of money in the beginning? But I feel eventually, if Im creating value and actually helping others, I feel like the system will sell.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I guess its probably better Im asking you these questions, but its probably better for me to talk to the person because Im asking correct me having you guys or me being part of the team, how much would it cost?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, pretty much. Because I was 14, I started with my pops in a food truck and back then, I didnt know nothing about marketing, nothing about branding. We would just be fucking there from morning to close every day without just hoping customers to pop in the sky. And thats something, that all the knowledge that I know now. If I knew it back then, I bet we would have grew our businesses a lot faster and a lot sooner. We probably have multiple locations already around the nation, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So Im in the restaurant industry, and what Im trying to do is create Im trying to create a consulting business for restaurants because Ive been in the industry for, like, since I was, like, 14 years old, man. Im 32 years old now. Their location over here in Georgia. But Im originally from California, and Im here in Georgia now, and I just wanted to kind of start getting into the consulting because I know being in the restaurant industry, youre working like, slave hours, man. Youre working there every day. And I wanted to see if I can somehow use AI to create a consulting business for restaurant tours or restaurant businesses that they can buy off me and kind of guide them through to from the back end to the front end of a restaurant.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Pretty much, man. And I feel like theres a lot of good people that are in the restaurant industry that need help and they dont know how to get in.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, cool.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay, so you said you have 10:00 A.m.. What other time?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Wait a minute.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Okay, I get what youre saying. Yeah.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Honestly, man, I have not even thought about how much money Id want to invest into it. Its an idea that ran by my head. I dont know exactly how much money it would take or if I have to apply for a loan, but either way, I have business partners that are interested in it too, so it wouldnt be just me. I also had another buddy that kind of seen the vision that he saw my vision. I told him what I wanted to do and he kind of was like, Ill invest into it. To me, I have investors that are willing to invest with me, but I just was. Interested on what you guys offer with AI.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, definitely the more knowledge I can learn that I can kind of have more awareness on how to start and go from a restaurant tour to a restaurant business consultant would be something that I would want to learn.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, let me check out that email, man. And you said you were going to send me more information.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, right now, Im invested over here in Georgia. Im 500,000 in right now. In the restaurant that I opened in, I opened up. So either way, I might have to keep this restaurant for a while for me to get my ROI.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You know what? Lets do three.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Is the latest 10:00 a.m.. Is it Pacific or Eastern time?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, last time I checked I have 700. Im not too up there. Yeah. In what way does that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Lets try and I just have to be is it like a video call or is it just on the phone?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Daniel at. M-I-L-P-A-C-A-N-T-I-N-A. Right.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thursday. Im pretty busy Thursday. Tomorrow. Whats like what hours do you guys have tomorrow?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay. Got you. All right, cool. I just wanted to know if Im actually speaking to the people that can actually help me.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"The people you guys worked with, have you guys ever worked with anyone with similar whether like a similar concept as me or restaurant businesses or you guys are more focused on real estate?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Thats what he does now. He started his own Ecommerce brand and all that and, like, fitness, and hes hes killing it. He pretty much just kind of gave up on creating a consulting firm for marketing.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yes, man, thats exactly what I have in mind, and its something that Ive been wanting to do. But Ive talked to other I forgot his name, this guy, his name is Ryan, but my buddy bought from him. He bought a course on how to create a consulting firm. I forgot his last name, but he was really popular, like about two years ago, and he bought a course from him on how to create because hes the one that can grow right now where the money is creating a consulting package or a consulting firm or something. You can buy, like a consulting program. You can buy you can buy online and create a it caught my eye, like, you guys doing a Facebook ad from your guys for your guysconsulting. Thats exactly how he got caught with that system. He bought a consulting program that teaches him how to create a consulting I lost touch with him, and I never I forgot what his name was, the guy that sold that program. Right. But you get what Im saying. I know that, you know, maybe of some people that when first Ty Lopez and all those guys came out theres a selling different courses, and he was one of the guys that was selling, like, a consulting course, how to create a consulting firm.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, not the authority, but I just feel like I want to be the one that guides people in the restaurant industry. And I just feel like just because my family Im doing it because Ive seen a lot of mom and pops restaurants that they can scale their business, but they dont know how to start or how to do it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, lets do. Tomorrow at twelve, Im going to see if theres a coffee shop next door to my restaurant. Probably step out for a few minutes and talk.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay? Sounds good, man.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"What did that company consult?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah. Because right now in Sacramento, that ones running fine. I have a GM and its running smooth. But this one here in Georgia, Ive been longer here than I thought I was going to be because I havent found the right people to put as management in the kitchen. So I came to a town where no one knows me and Im not well known. So Im starting from the bottom and Im building here my credibility and my network.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, Im confident on that because three here, the restaurant dies down. Its pretty chill and I think 03:00 should be good.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So I would just be expecting a call from you guys around three.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Because I for sure, if anything, Monday is like my fucking kind of my rewind day. And Im sure that day I can give you all the time you need. I mean, give me all the time I need to this. Thats why I was thinking about maybe scheduling it for next Monday because like I said, this restaurant does have me by the balls. And I pretty much do a bunch of stuff right now. Right now I just got back and Im outside talking to you and theyre kind of looking at me like, fuck.","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}},{"pageContent":"All right, thank you. Absolutely. Bye.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Is it possible to you send me that video and then I schedule a time with you guys? Because Im not sure if Im going to finish it, man. I just dont want to bullshit with you and say Im going to do it and then I dont end up doing it because I got caught up with other stuff.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Like, Dannys motherfuckers are using AI already. Is there a way? Because I need to talk to my manager first to see if she can cover me for that time because that is so I dont know if we can touch bases. Probably right now is like the best time. Right? Because its already 948.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Pretty much. So you guys help consulting businesses how to properly structure their consulting company. Is that what your main focus is?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Lets do it. Ill try to finish it. But what would be the next step then?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay. Do you have a reminder you guys can send in the morning to.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Today I was there all day from I got there at 09:00 A.m.. Its now 945. So Im there all day. I just told my manager. I was like, hold it down for me, Im going to go grab something to eat. I just went down the street, got something because Im tired of eating the same food. So its kind of like Im in and out all the time, man. Right now it just has all of my attention. But I just want to use a day. This week, Im pretty booked, but I dont know if next week, maybe next Monday, I can kind of book a time with one of you guys to talk to and kind of get more information on how I can work with you guys or if its something that Im looking for.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Well, the thing is that so far I was just thinking me, because the guy that I know, hes an angel investor, he kind of more into real estate and all that, but if he sees value and potential in you and I present a good product or a good business plan to him, Im sure he will invest. Because hes actually one of the ones that is now wanting to invest in my restaurant here in Georgia. So he wants to open up multiple because theres nothing like me here in Georgia, man. I brought something from California that you see in La or Modern and just this area in Georgia. Im up like North Georgia. I dont know if youre familiar with Georgia, but there is a lot of money here, like in Sugar Loaf and Alpharetta. And he wants me to kind of expand out here in multiple locations.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Your name again?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Matthew. Okay, Matthew. Sounds good. Thank you, sir.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, shit. Because I got a bunch of shit to do right now right here with the restaurant. So I dont want to let you guys down. Let me fuck. I got a lot of shit to do tonight, man. I dont know what time Im going to finish and I dont want to make an excuse tomorrow for not taking the call. So Im thinking, is this your personal.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Oh, cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"What does that look like?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah. After like 02:00, the restaurant just pretty much dies down. So I feel like at three I can let her know first thing in the morning. Hey, at three I need to take a call next door.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"And having a call with the consultant.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, that should be good because theres a coffee shop next door. Ill just step out for whatever time.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"And that email you sent, your email thats your email that I can respond to or anything?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Okay. I got you. What caught my eye is that because eventually what Im trying to do now so Im in the restaurant industry, right?","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Yeah, its been like a few years, man. At least probably like three years Ive been wanting to do this, but I just never got to it. And I know I wanted to start making videos because I do make marketing videos. I love making informational videos for my business, and I do a lot of marketing videos now for my restaurant on social media platform. But I wanted to get into pushing out information on how to run a restaurant and how to make it succeed and scale it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Would that be helpful? You said you sent me an email, right? I need to check out. Not yet because Im going to be real. I was scrolling through YouTube or I was watching something on YouTube and you guys popped up and I kind of just kind of heard I heard a little bit about what you guys talked about. I probably watched the first probably minute of the video, and then I was like, fuck it. I was like, let me see what theyre about. And I just put in my information and send it over because it caught me with consulting and AI, but I didnt finish the video. I dont know exactly how you guys help. So I want to revise that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Is that texting me? Was that you that was texting me or is that no.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Oh, so itll be 10:00 A.m. Eastern time.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, I remember.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, it does, but like I said, I just want to get no more information about you guys, you guys company and kind of like see before what is the cost for the call or how does it work?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"So you said twelve one and whats the other time?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yeah, so I got a pretty good idea on how to run ads and all that, but I was just kind of nice.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Hes the one that has the money to invest in whatever I want to do.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"For the consulting yeah, for the consulting.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]