[{"pageContent":"Yeah. Now what you do is it only calls kind of do an automated email or social media outreach.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"At the end of the day, a phone rings and the person on the other phone either chooses to pick up or doesnt. Most people dont pick up their phone these days anymore. And so Im trying to think, what could it possibly be that would motivate?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, I figured.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. But it sounds like you guys are really on the cutting edge. I saw one video on Facebook was it this platform, Odin, its called, that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, hey Alex, how are you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I am. The rub was that I was looking for something part time and who was it? That was I think I was having a Facebook exchange. He said, yeah, that just wouldnt work because theyre looking for full time people.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Man, I wouldnt even know. Im just kind of head down working all day. I havent looked around at competition. Were pretty niche down with what we do. So if there is competition, like ego side, I just dont know about them.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"This is a very tough market. Get a lot worse before it gets any better. I think were headed into some pretty stiff headwinds for sure. But thats why I think what you guys are doing, anything that is an efficiency tool that helps companies act more efficiently and more productively is going to move up to and I got to have as opposed to a nice to have.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"To youve carved your niche but this Odin thing, thats just unbelievable. So let me ask you this. Is the idea that the person on the end of the prospect, when Odin makes an outgoing call, does the person actually know that theyre speaking with an.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So it does the dialing automatically. So you dont know when its going to make an outgoing call, when youre going to get someone on the line. Youre just waiting.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Now, is this Odin? Is that your core?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, just full disclosure, thats not why I was reaching out. I was reaching out because I was actually interested in potentially working for you guys. Okay. Yeah, I actually had a dialogue with one of your colleagues and I said that, but it was clearly one of your AI bots that was responding because I said that in the text and they were like, great, when do you want to talk about how we can scale your business?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Far as joining our yeah, no, I appreciate that. Are you able to, like in broad strokes without giving the secret recipe, what is it that your core deliverable does exactly how does work?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"When you say pickup rate, what do you mean by that?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Yeah. Logan. Logan Morrison.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right, bye.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"No. I just saw the video of that young guy with the New York Yankees cap on, walking around his office, like, talking about Caleb. Caleb, yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. So you have different modules? I guess. So Odin is a Beta. Thats not what youre marketing currently. Correct?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, good question. So I work for a management consulting firm. So I sell to CEOs and CFOs of publicly traded companies and that are looking to drive the valuation of their company stock. And so we help them better understand how they can drive value through the lend with their institutional shareholders. Im simplifying it, but thats really what its all about. So if youre a CEO of a public company, youre measured and your compensation by the board of directors is based on how you perform financially and as a result, how the stock of the company performs. So all these guys are highly motivated to make sure that theyre doing everything they can to maximize shareholder value. Thats what we help.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, exactly. And thats the way everyones compensated there.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats amazing.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Thats so futuristic sounding. Even with AI where it is, its unconscionable.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Really reading what Im saying.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So I work for a consulting firm, management consulting firm, and I have for the last twelve years. And so Im a family guy. Ive got three kids and a wife and a mortgage. So Im not like a kid living in his parents basement where he can just go from one job to another and its not a big deal.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"But what is the secret sauce to establishing higher levels of connectivity?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I was on another call with a colleague. I rarely use my cell phone for business. And when it rang and I thought you were going to be somebody else, which is why I get that I called you back. Yeah. In Pueblo, Colorado.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Thats crazy.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah. Do you have any competition in that space?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"It translates into twice as much business.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah. So its like Im not in a position where I could leave that security to go do something entrepreneurial. But I do have a lot of pockets throughout the day and I have a pretty big rolodex. Okay. But I understand they want people full time and Im sure you wont have any problem identifying people to sell your magic potion.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I appreciate that. Aylon, have a good one, my man.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}}]