[{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So this one I recall is just kind of like its to explain a plan that I could follow and kind of create like a case study for me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Lets see, its about 1000 a month.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, I know thats really far out, but I kind of just clicked on your ad because I was interested in checking it out, but its like Im not really going to be doing my business for another two weeks.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I would say to be safe, probably zero. But in the next two weeks, when I move back to California and get a full time position, it should be a lot more than that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. All right. And then the video? Youre going to text me that now?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, I think when I get back, Ill first focus on the in person classes because I think Im naturally good at teaching, and Id be teaching what I do with my current clients to get them results. But yeah, over time, Id probably want to scale online as well.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, so tomorrow you had 01:00 P.m. And what was the other one in the afternoon?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, I need to do that before the call, right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So consistently, like, literally 3 hours a week of work.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. For me a good time is like its afternoons, basically.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, right now Im in Central, but in a week or two Im going to be in Pacific. So probably just say Pacific.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, my appointments are like 100%. Theyre really good, but its usually because most of them have been like I havent had a lot of online people, and if I did, I had them go to a free Zoom class that I taught first before I offered a thing, so they had a lot of hours or rapport.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Like, if I found out later today I wanted to reschedule it, would that be possible? Or now that its so close, you guys dont reschedule?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. Yeah, totally. Is this the phone number to reach you at?","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im on the phone. Yeah, I can wait. So let you know. Sorry, say that again.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Yeah, I would, but I would just feel bad taking one of those calls if Im not ready to invest financially further into the company. And so do you think that would be better to wait in two weeks until Im working and stuff?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, I do. It takes a certain amount of leads to get a certain amount of conversions. I need to do a certain amount of reach outs to get to a certain amount of contacts to get a certain amount of appointments, and then, like, one third of the trials will convert.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, so you said tomorrow you have 11:00 A.m. And they have time on Saturday too.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. And then Saturday, do you have times around midday as well?","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Okay. And then for the cancellation, you guys need some kind of card on file for that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Awesome. Have a great day.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Just in that business? Like five to ten grand.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Lets do Saturday.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. If it were in the next week and a half, like Id say, before May 18, it would be Central Time that I would be scheduling I know you guys texted me the link too though, so I could look at it. If Im able to do it before I leave, I could use that link to schedule, but right now Im not.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Ive already started it, but its just a few clients I help sales professionals make more sales or basically make more money than what they pay me.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And please just thank you. Yeah. And what was your name again?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay. Whether I do that by calling you or texting you.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, let me just ask my housemate if were not doing anything at that time. Hey, are we doing anything around 03:00 p.m. On Saturday for graduation? Okay. Theres no, like, big school events, though, right? Okay. Yeah. All right. Yeah, lets just do that. Lets do 03:00 P.m Saturday.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"At least ten K. So if I get to 20 clients at full price or 20 coaching calls a week, that would be like one hundred and forty three K a year.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, afterwards?","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I potentially could. So right now Im staying at the college for graduation and theres just tons of stuff going on and so I dont know if theres going to be like all my friends and their families hanging out on Saturday or not, so I just dont want to commit to that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, okay. Im just wondering, how do you enforce that?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, I havent been lead generating, so no new clients, but consistently, Im working with three right now, and I have, like, five active, two of them I just need to get back on board.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Yeah. Okay, I guess that sounds good. The two hour video and the 1 hour consultation.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"I can talk for a little bit longer right now. Yeah, I just wasnt sure how long this would take and I have some guests over at my house right now just like making them coffee and breakfast, but I can keep talking for a bit.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Lets see. Okay. Actually next week Im still going to be Im like moving next week, so its kind of busy right now. Maybe the week after next week actually. So probably I would say like the 24th.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Like three years.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Whats that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, exactly.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Like this Saturday?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"But my goal or my plan this summer is to get that job and then spend all my free time on scaling the coaching business. So, again, as I said earlier, definitely right now is not the right time. Im not a client for you right now, but in the next month when Im getting going on this and lead generating, Im going to be teaching classes for offices of sales professionals. When I get back, I would be looking into the AI stuff too.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, itd probably be for future business or something. Yeah, Im just curious how you guys run your business, because I think thats really smart. Okay, well and Im not planning on ghosting you guys. Dont worry about me. Ill let you know either way. So youre going to text me the email. How do I show up to this call? Are you going to text me or email me the info?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, business coach for sales professionals.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, thats pretty consistent.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Dollars. Okay. Yeah, because I know that thats basically a sales call for you guys, but its also a way to help and I dont like being that guy.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I dont think its good right now. I think its like 640 or something. Im just like, getting out of college now, so I havent really had a normal job or income for yeah, so thats why I was waiting two weeks to kind of get more secured on that side. On that front.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah. Do you think you guys can get back to me in like a week?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, thats pretty straightforward. I mean, if Im able to watch it even sooner, I might call and try to move it to tomorrow. But I wanted to give myself enough time to really absorb it and pay attention and just have that set aside that time. So Saturday, 300 p. M. Probably will be fine. I think thats okay for now.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, let me check. Youre talking about Central Time right now?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, I would say the last year has been really low because of college, but before that I was around like, 25 or 30 or it was like 25. But this year is probably like two to three to four to five around there, so not much.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, just part time, like just a few clients. Ive always been doing other things for the most part, but my goal is eventually at some point to focus more on getting clients and as I fill up just make it full time.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Who is this?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I wouldnt do that. Probably the most annoying thing I might do is try to reschedule, like, 24 hours before, but I just want to kind of know if thats okay. Like if I rescheduled? Yes. Tomorrow, if I tried to reschedule, would that be too late for you guys?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}}]