[{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And you go watch the video on the mobile disruptors. He was like, everybodys using the wallet, the mobile wallet, even, to check into their hotel and everything else. And coupons always go up during tough economic times. So theres a lot of trends converging there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Im basically unemployed. I could do Uber, but thats basically not profitable.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"And then, of course, all the programs I was going to learn in quality control, you can easily plug that into the AI and its going to do the quality control for you. Youre basically going to end up paying somebody $20 an hour to just kind of function test the program or whatever youre doing. Thats approaching poverty level there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im looking at starting a digital coupon business where, say, a company would send a text out and it would have a coupon in there, and then they select that they want that coupon, and it automatically goes to their wallet on their phone, and then they can use it at the location. Does that make any sense?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right. Okay. Well, Ill still check out that email, though, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im not certain. I dont know. What email did you send it to?","metadata":{"fillerID":25,"fillerText":"Ummm","category":"D"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, great. Well, thank you very much.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Im going to be doing that, like I said, the mobile disruptors Im going to be doing.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"The one Im just looking at is Mobile Disruptors, and its just the coupon aspect, but coupons and text, its essentially mobile marketing. Interesting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its not my business. Personally, I would be kind of like a franchisee, I guess you could say.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I might. I just want to get my feet wet, so to speak, and get some income coming in and I may expand later. I also got signed up recently with Money Toaster Monthly. I got a year membership with them. Its all about AI and everything, so Im definitely learning AI. Nice. And theyre trying to be the number one place to go for educational on AI. I was just signed up to be a quality control for software. I was going to go through that course and be an employee. And I saw chat GPT. Four was coming out. I was like, oh, hell no. And like, software engineer, thats like the first thing on the list of jobs thats going to be eliminated. If the AI is making perfect software, then youre not going to have a whole lot of need for quality control.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, we have the platform, and then other companies can use it for their offers, and they pay like, $100 a month and then like, $28 per tax.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thank you. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I guess you could say so. But like this mobile Disruptors, I can get on the phone and hit the streets and hoof it. Just go business to business and talk to people. How hard is it to go through the newspaper and see whos advertising and call them up and say, hey, I got a better way? Youre spending all this money on print advertising. Let me show you this. And its going to do more. I mean, lets face facts. Everybodys looking at their phone, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, what it is, they can use it and send out the coupons to their customers and send out a text or whatever. It does various different things. But if you look up Mobile Disruptors, thats what it is. I just went through the video yesterday, but its mainly for the mom and pop businesses. But, I mean, I guess big businesses.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, you mean money wise?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. Yeah, no, I havent really seen that yet, but Ill look for it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"And theres always businesses that need marketing and more clients.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}}]