[{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"All right, you too. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Four.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I mean, really Im more of like a business consultant life manager.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Fine. How are you doing today?","metadata":{"fillerID":8,"fillerText":"Yeah","category":"A"}},{"pageContent":"I mean, just to have the things Im working on working smoothly enough with different resources, and then I will start moving to coaching, back into that type of consulting again. You always do more than one thing at a time anyway, but then I always focus on one thing. I build companies that sell them, stuff like that. I just stay active. Im an active type of guy.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Last time you like, a 738 or something like that. Okay, cool.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Yeah, Ill definitely watch it Monday. You said that. Ill watch it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, I have and Im trying to move that way, but right now Im just trying to set this up, whatever, and then Ill get back to that. Thats really what I actually do. Im a consultant, Im a core receiver. I had a core receivership, all that stuff. I have a law degree in all stuff too, so a lot of different things. But Im just trying to get this thing moving a certain way.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thats what Im looking for at this point. Thats what Im looking for. Thats the reason why I contact you at all. Thats where Im trying to go.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I just ran into doing the financing and stuff like that. Ive had most companies building on stuff before, and as someone, as a partner that I had before, had to start doing this again. So I just started doing it before that, I was kind of stuck for a while. I wasnt really doing too much of anything for a little while, you know what I mean?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes, I have, actually. I mean, thats kind of what Im looking for overall. Thats what Im looking for, you know what I mean? But right now, its just what I have in my hand. So just trying to work that a little bit. Thats where the direction Im moving toward.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"All right. 20 1520.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No. Basically Im calling you to see if thats what you do. If not, then thats what Im kind of doing on my own. But, you know, Im not a specialist, and I mean, I build businesses, but I mean, you know, trying to everythings moving forward, you know, Im just trying to be for it. Im not trying to still have Windows 95 when we have Windows Eleven right now. I always reach out to other people already doing things or already versed in whatevers going on. You already got to learn something. You dont know everything. I was just reaching out to see if thats what it is, then yeah. Then Im interested right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I mean, pretty much everything. Pretty much everything. Pretty much everything that I need to do. Everything I couldnt do. I mean, I have young daughters, whoever else thats trying to go to school. I have things you have to do as a person before you leave this earth. You know what Im trying to say? Most people just leave here and leave people bill you know what I mean? I build stuff for my family. Thats what I do. Thats generational, you just be ahead of the game when things going on. The world is not getting better. Its actually getting worse in a lot of ways. You just have to be prepared for things, you know what I mean? I look toward the future, even though, of course, you want to live a good life enough now. So Ill be able to live good enough now, but also be able to make sure that moving forward, things are things are solid enough as can be.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Its just like Im doing a few different verticals Im doing right now. Im just trying to look around and see what will help me do it a different way, a better way, smoother way. I mean, everything is going digital or chat, GPT or anything, whatever. Anyway, I always try to stay ahead of the game a little bit. I need more movement than what Im getting out of how Im doing, what Im doing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I have five altogether four daughters and one son.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I do business financing, I build stuff, whatever. Also, Im just starting back and doing the solar right now. And I had that going for a while, but I got sick, whatever. And I selling my business or whatever. So thats like in that vertical right now. So stuff like that. I also do real estate and also business brokerage also. But right now Im trying to do for the solar mainly and maybe like the business financing part right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, got it.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I think you said just three months to say whatever you say, well, Ill do this next week, and youre doing it. But then it takes three weeks or two weeks. This is a little bit that way. But far as just reality, like a month, I would have this in a certain place where to pretty much be running itself, management in place, everything like that. Then after that, just focus on other things. So it pretty much be running itself. I wont have to be doing day to day type of things or build our team or anything like that. Thats all I was saying. That way.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes. Perfect.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im using at least 40, 45, 50 using a month. I just came basically from almost zero to be here, so Im appreciative. But same time, just where Im at. And I had a long break of not having any professional business going on, just working regular jobs, whatever. So Im 54 now. I dont have a lot of retirement funds coming, all that stuff. So, I mean, I have to do what I have to do right now to have what I need. His fourth quarter, you know what I mean? Im going to the fourth quarter of life. I have kids, grandkids and certain things. I know certain processes and things out here that courses Ive been around for a long time, whatever, but its always new things and different things. And Im taking classes right now, doing the machine learning AI logarithm, stuff like that also, you know what I mean? Its like a short course, so Im interested in those type of things. A lot of things are helping people be an assistant. Theres so many things out of AI where its helping out business a lot. I know if I take a lot of jobs, in a way, but its just create other avenues.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Pacific time zone.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I mean, really, all the things Im working and trying to get going, its probably like a three month window to have everything where I want to work that out again. So probably like a three month window and then go back to coaching. Because I almost just started out just doing the consulting and coaching again, just straight out. But I ran into this.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, definitely. Thank you.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"This part of your life, right? Yeah, exactly.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, Im saying probably in a week or two. Whatever. I have all the time in the world. Im just saying, to be realistic, I say three months. I always stretch it out a little bit. Were probably, like, in about a month, maybe at the most. Everythings working for me, kind of, sort of, but I try to get back to what I like and what Im used to, and I like and I like that more than pop shot and ticket items, you know what I mean?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes, for the call. Tuesday, thatd be fine.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, Im going to watch it Monday. Tomorrow? Yeah, put it Monday and then I dont know when the call be. Sometime later week right after that.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes, profit.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"That no, not right now. Ill just watch the video and then after that, any questions I have, Ill pose the way were talking.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay? Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}}]