[{"pageContent":"Yeah, well, I mean, basically the packages range well. Right now I just kind of changed a little bit because when I started here in Austin, I didnt have any competitors. And now I have one in kind of not the need it vary but 10, 12, 15 minutes away. And then theres two others that are a little way and theres a European model to this business and Europe equipment is cheap and they didnt have to pay FDA bullshit and all the other kind of stuff. So they kind of dropped down the prices. So I wanted to see if I was slowing down because everybody was going to these other people. But theyre kind of slow. So right now I sell like $1,500 package, which is for eight sessions a month. And then I kind of brought answer for some of the where it could be Im calling it unlimited, but its not because you can only come in every third day doing this. Right, but I used to charge backup and stuff like that. I used to charge the packages were about two grand.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Because back then, I had older equipment that took a little bit longer. But I mean, I can have most people coming in and out within an hour, right? So I need a little, say, like, minute breather. So basically, I can do clients every hour and 15 minutes.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure. Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, so back in Canada, I used to make anywhere between about 15 to 25,000 a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Youre definitely familiar thats what my frustration is down here is that I dont need a lot of people. But its just like with everything thats happened over the last couple of years, its just like people just keep dropping off or theyre coming in, but theyre taking longer. Ive just found a lot of people are lazy after COVID kind of theyre still coming in, but theyre not coming in religiously like they used to. I believe I said people, but I just got to get the right clientele. And thats what Im having problems is getting the right. And new clientele, Ive got a small piece of an existing but again, like I said, theyre coming in and out here and there and all that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, obviously Im very open to it, but its just the way things have been going lately, Im a little frustrated and discouraged. Right. But I mean, otherwise, I just dont understand why its been so difficult down here. Im in a very wealthy area of Austin. Terrytown is not very far away, which is another very wealthy area of Austin. So theres the money around here. But the one thing I just noticed between Americans and Canadians is Americans like plastic surgery. Plastic surgery and all the other stuff here. Its way more popular down here. Right. Everybodys they dont have and unfortunately, sometimes rich people are lazy and they would rather just go and get nipped and tucked.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Well, I dont know how to answer that question because I can pull money from a couple of different places, but I dont understand what your whole process is. Youre trying to get me to change my whole model. And so, unfortunately, this morning I woke up on the grumpy side of the bed, so Im just kind of worried.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay, fine.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I would need assistance with that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"It was Canadian, obviously, because it was in Canada.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Sorry, that was back in Canada. That was before I moved down here. And then just its been a struggle down here. So what Im wanting to do is get this location slammed. And then my original goal when I moved down here was to open a couple locations and sort of corner Austin as my own, but that just hasnt.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, I have some guy that I just brought on a month ago. Its a month to month. Theres no contract or anything like that, but he said he used to work for Facebook, and so he knows all the ins and outs, and hes supposed to be Mr. Magic, but so far I have a call with him, actually this afternoon because so far, Im not impressed of whats going on. Hes just another one of these and not but all you people that call me and do this, all you guys do is offer the world, and you dont perform. Not saying you, but they dont perform, and they just end up costing you. So thats another frustration that I have. So I stopped using them, and I was doing all my things, but I guess sometimes the creative so this guy was cheap monthly. He was running some special.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Improved too, as well.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No. Yes and no.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Not much. Things are kind of slow right now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Probably like anywhere between eleven and 02:00.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I guess so.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Good. I just got to figure out where I can get that two and a half hours of downtime, but I can do it in the evening, I guess.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Clients are coming here and there, but I mean, as soon like Ive got a couple of people that I know that I can bring on. I just need to get this place funding, right. Okay. Im here in the mornings, I leave for a few hours, I come back in the evenings and blah, blah, blah. Yesterday was quiet. Today is a little bit quiet.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I was actually just saying, on average, it was about 20 grand a month on average. Right. But, I mean, sometimes theres a little slow months, and then when good month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And stuff like that. Then it has to obviously be a lot more. But when youre doing centralized localing, Ive learned that you dont need to have.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You said the Capital One app is showing me I think its 630 or 640. I think Id have to log in and check.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Quick question to ask you a question just to go up because youre basically saying weve got all those how am I going to go online like this? Do I have to film a whole bunch of videos and try to go through or do you have videos that are basically there and you can just pop up or how am I going to go and establish this whole online thing?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. And then right now its kind of all in discovery mode. Were figuring out which ones work and which ones dont.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, Im fully legal. The business is fully legal. Everything is operational. Its all that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes, it is.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Because I know how to play the credit game I built up. When I moved down here, I had zero credit, right. They wouldnt look at my Canadian credit, so I built it up. I got a bunch of different credit cards with all 0% financing. And unfortunately, just the way things are going and were being deported last year is a lot of these 0% credit cards are maxed. Right. Im not paying interest on them or anything like that, but theyre maxed, so I need to get them down, and I still have lots of time to bring that down, but I need to get those paid down first, which means I need people coming in the door here first.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, people that are going to be die hard and come in regularly.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So, I run a specialty fitness studio, and so I combine three services together. So one is red light and near infrared therapy thats specifically designed for body contradicting. And so people start with that. Then the second step is full body electromuscle stimulation training. And then we finish off with the exercise with oxygen therapy.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, Ive got Facebook. I do Facebook ads. Ive got two landing pages. One is just kind of like a general guy and girl. Theres one thats edited just for girls or women, I should say.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I was curious to see what it was all about.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, because Im targeting like a central area, I believe right now, the ads that are running, theres two ads, like different ones that are going out, but the budget is 20 a day.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay? Ill do that. Okay, I really got to go, so if you can just book that and then Ill watch it tonight. I got to go.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Okay, look, I got to go, okay? So you know what? Lets just not do this right now. Call me back and you can try to schedule me at a better time. I got to go. Okay? Bye.","metadata":{"fillerID":39,"fillerText":"Yeah","category":"F"}},{"pageContent":"But youre talking about some online program system. Id have to revamp everything, right? I mean, obviously you have to come up, youd have to make online courses, youd have to whatever it is.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Well, I guess I may as well stop you right now because I have good credit. Like, I havent failed or not paid anything or done anything like that, but Im a little bit leveraged right now. And so I know that my credit score has dropped down to six something, and before Id be able to go look at getting other credit or building credit or doing the other stuff is Id have to pay some of the stuff down, which means I need to get more people in the door first.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Central.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"You know what? We got to continue this call because youre going to make me be late for this client. Like I said, I woke up on the grumpy side of the bed. I dont want to answer these questions right now. I mean, I understand that you want to vet me to make sure that Im there or not, so can you try giving me a call back some other time? Just maybe tomorrow or something when Im in a better mood and then we can talk about booking this and doing this.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"So just trying to differently than what people are coming in and getting in here. Right. If Im offering completely different services online versus in here, well, then how can you compare that?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right now Im doing everything myself, just because, like I said, I had an employee, and thats part of the reason things got slower, is all of a sudden, all these long term clients that I have are no longer coming back in. They wont respond to me. They wont do anything. And one day over the camera, I heard her talking to one of the clients, and he basically responded back to her going, doesnt he know what he has here? So she was obviously badmouthing me and doing a whole bunch of shit. I dont know. It was a fucking nightmare. She was a client before, and she lost a whole bunch of she lost like 100 and something pounds, and she was super bubbly, super nice. And I was just like, okay, awesome. Shes perfect to do that. And then she ran things while I got deported back to Canada. And I guess because I wasnt here, she got to do everything sort of the way she wanted to do it. And then when I came back all of a sudden, I think it was kind of like a possession thing or whatever. So I figured out shes not mentally right in the head too, as well. But, I mean, she basically caused a lot of damage. And so now Im basically because a few of my regulars who knew me before that came up and told me what was going on. Thats why I knew something was going on, but I didnt know what exactly right. Because I have people that have sessions left and they no longer came. So thats what Im just saying. Basically I dont need to all that. But basically right now Im doing everything myself because Im not busy enough to bring someone in.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"W-I-N-S-R. So youre going to send me this thing and I got to watch it tonight to have an understanding before I talk with this guy tomorrow?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I cant. Basically people have to come in and use my services. So thats kind of where Ive looked into other things, and some other people have done online personal training and blah, blah, and they quote all these numbers and Im just like, Well, I cant do that. In order for the way my system works is people have to come in here.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Obviously, you caught me in the middle of doing something else. So, I mean, obviously Id like it to be a lot more, because, again, if you think about it, Monday to Thursdays, our hours are nine to five. That could change the Fridays, too, as well. Basically, if I build ten packages a month at 1500, well, theres 15,000 right there. Well, I can do a lot more than ten clients, right? Because basically the average is theyre coming in twice a week, every third day, if its a rush program, but most people only do twice a week. I cant remember but how many people I can actually fit in on a slot. Right. So if Im doing an hour and 15 a day, ten a day.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Because obviously Id have to change everything and do everything and be online. I dont think that would be really that much of an issue. But right now Im just so frustrated with everything and all that kind of stuff that I dont think I have the motivation and the positivity to be doing something online like that right now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, how are you going to get that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"No. I kind of thought about it a few times, but its just like I said in the area that Im in, most of the people that are coming in dont have issues with finances. Now sometimes when running the Facebook, because people in the past who tried Facebook, theyre like, you should do them free. Get people in here for free. Youll get tons of people. And Im like, no, I dont want the groupon or the free people that are coming in. And then you slap them with a $2,000 package bill, right. So I always do an introductory session of $97 because it just kind of shows. And the other thing is, I have my pricing on the website, so anybody that looks into me, they know exactly what theyre getting into when theyre coming. Its just, I guess the way things are going right now is Im not hitting the right avatars or Im not getting it in the right way. And thats why I went with this guy, right, because he said he was Mr. Facebook and I thought, okay, well, hes cheap enough on a monthly basis. If hes Mr. Facebook and creative like he said he is, well, then he should get this all there. Thats why.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hey, hows it going?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Well, obviously it would be a completely different program and a completely different thing. And so Ive just never really considered it because whats the point?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, here in Austin since 2017. But Im originally from Vancouver and I used to do it up there and up there. The business was extremely successful and did really well here. Moving down here, not a lot of people knew about email. It was a bit of a struggle, and then it started to take off a little bit before COVID And then obviously two years of COVID Right. Last year it started to pick up again, but then I got deported back to Canada for four months. And then I had a disgruntled employee that seemed to bad mouth me and do a bunch of shit. So shes gone. And so Ive just been trying to get things really going, struggling Im frustrated and I just kind of need to get this going.","metadata":{"fillerID":39,"fillerText":"Yeah","category":"F"}},{"pageContent":"Hold on. I dont mean to cut you off, but I got to get going here because my next client is about to walk through, and I need to get things organized for this. Okay. Is there a way you can send me some of this stuff that I can kind of at least start looking at and get the idea of whether.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Austin is a very health conscious city, too, as well. And thats part of the reason I moved here, because Ive been coming here for years, because a really good friend of mine lives here, and shes like, you should move here. Your business will probably do really well. And then just from what I kind of thought, I was like, yeah, maybe it would. I was sick of the cold and the rain, so I made the thing. But its just been a struggle.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont think so. I havent had a chance to look at it or anything.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, I dont know how to answer the question. I mean, basically youre just dropping all these little teasers. Its changing my whole business model, like doing all the kind of stuff. I mean, yes, Im obviously interested in looking at it, but do I see value in it? I have no idea. Right. The next thing I know that youre going to do is youre going to hit me with some 50 grand thing or whatever. Thats whats in the back of my mind right now is how much is this going to be? Because I know youre going to come back with some 50 or 100 grand thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, basically, people are coming in buying packages, so it just depends on how many people are coming in, how many times they were repurchasing, et cetera.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I guess so. I dont know. I feel like you guys are just trying to sell me on something completely different now. Right. I understand the process. Im interested in looking at it, like I said, but I woke up on the grumpy side of the bed today. So Im just like Im tired of sales pitches that just dont perform right. Or just whatever. Or theres, like I said, a $50,000 price tag or something like that.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"So its kind of like okay, so.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, right now its been the shit. I dont know. I havent finished doing all my taxes for last year, but I would probably say its 80. Its garbage.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}}]