[{"pageContent":"Yes, well, I was just filling out I saw that on Facebook and I just filled it out.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I mean, I do I do real estate. Im a developer. I got big contracts here in Chicago. Ive done pretty good for myself.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I mean, these are people who are speaking you mean at conventions and stuff?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Thats something Id be good at, because Im British, right. Im very well spoken, and I have a great life story, and thats something Ive discussed that with my wife. Its funny because my sister in laws husband, he works for a company that books private speakers and motivational speakers.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, Im an electrical contractor, mainly, but Ive been in HVAC for, like, two years now. But I thought because it said air AI. Thats the business he was in. HVAC Air Conditioning? Yeah. Okay.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, yeah, Im a nobody. He wouldnt give me the time of day, but he deals with celebrities, and depending on how famous they are, you could talk for an hour, get paid $20,000 for talking for an hour. Its unbelievable.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"If it was that easy, they showed the screenshots, oh, I made $100,000 this month. If its that easy, Im going to be doing it.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah, of course. Well, why dont you send me something then? And is there any pamphlet I can read or like, an email or something that I can digest more before I think about it? Ill be interested, but I wouldnt want to get into it if Im scamming people out of money. I mean, that wouldnt be right. But I would truly want to give people thats good knowledge because I have a lot of good knowledge to teach. Im very good at dealing with people. Ive butted heads with some massive contractors in this town and developers and come out on top. I could really teach some inside tricks how to get your money, and Ive learned from the best. Ive dealt with a lot of people. Ive worked for some very good clients of mine over the years, and Ive worked for them a long time and Ive learned a lot from them. Yeah, Id want to give that knowledge.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"But would this product be a book or would it have accompanying videos like me standing in front of a house and saying, this house here, I bought this house for 300 grand and now Im flipping it for 500 and I can teach you how to do it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, yeah, thats a suburb. Yeah, Ive worked out there a few times. Real asshole electrical inspectors out there. Theyre horrible.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Probably for 25 years. Im in America 30 years.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, its hard to answer that question because Im very busy and I have a company to run and I have employees, and Im not going to but hey, I could do it as a side hustle. Im not saying exactly. It depends. It could take off real well.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"But yeah. Anyway, why dont you send me something? Hey, listen, Im intrigued. I could write something up and we could work together, get something out, and Ive got no qualms about stepping in front of a camera, but just out of curiosity, looks up for this is the kind of the format I would be thinking of. Its the Vietnamese guy from Seattle whos a real estate developer. He doesnt just do real estate stuff. He does other life lessons and advising about life. And he has a Rolls Royce and he just bought a Ferrari, and it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, but how do you sell this now? You just bombard Facebook and all the Instagram and everything get takers?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Well, I mean, Im a HVAC contractor. Is that guy that was on the video, was he a HVAC contractor? $4 million in business?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I am intrigued, and Ive done a bunch of properties. Ive done a lot of work in this town, but, yeah, Ive often thought about that, sharing my knowledge with the next generation. My wife said I should do that because Im a really good talker. But if you get a chance, theres this guy on Instagram. Hes really funny. Hes a Vietnamese guy, and hes in Seattle. Hes a big shot real estate developer in Seattle. I cant think of his name, but he does these really funny videos, and hes very knowledgeable. Hes one of the top real estate agents in Seattle. Hes a big developer. But you Google that and youll see his videos, theyre really well done. And he gives his real estate advice what house to buy, what not to buy, how much to spend. He knows the whole nine yards.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Im a pretty lot of people, but I could give a lot of advice to people. But is that what your company is, that they do motivational?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ive read a couple of books. Theres 100 books out there you could read.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I mean, Im a car. I mean, Im an Im an electrician. 35 years. Not that thats but, you know, Im I mean, Im an entrepreneur. You know, I came to America with nothing, with a suitcase, $500. And I became a thats a good, successful individual.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Pardon?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Why havent you? I know. I just had a different path. My life didnt go that way. But, hey, Im not afraid to do it. Hey, can I tell you something?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Pardon? Youre coming to Chicago in June?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Anyway, it would have something my wife would approve of, because if I was doing that, she wouldnt approve of it. And shes my bellwether of morality.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Let me check. Hang on.","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"He flies all around America. He knows a lot of big shots politicians, sports, celebrities, actresses, actors. You can book anyone.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"How to be a contractor.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I guess hang on. Sorry. Let me turn the volume up. Hang on. Can you hear me?","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"But let me just say, I see these guys, these like, snake oil salesmen. They have them on the TV sometimes, selling these books. Give me $10,000 and Ill make you a millionaire. And then a lot of the stuff theyre getting, I mean, its not really worth it.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I said, If I only got one out of ten jobs I bid, Id be out of business. I said, my closing rate is 50% or sometimes more.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, well, I mean, I was never presented with the opportunity to do so. I never really thought about it. Its funny. Maybe its fate, maybe its me looking at that thing today and then you calling me. Now its going to happen, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Lets come down. Ill meet you down there for a beer. Well have a beer. Yeah. I dont live far from down.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thatd be awesome.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"You can look at my website, Sentineleectric.com Chicago.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, some 200 grand a year. Good. Year? 300.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Of course, yes. Right now, whod write the script? I mean, youd have to have something to sell. I mean, you got to have a book to sell.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, good. How are you doing?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Ive been kind of doing research on how to make money online, but, you know, its really hard. And Ive been looking at these people. I mean, a lot of it might be baloney. You know, its all these people making money at this affiliate marketing, you know.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It doesnt bother me. Not at all. I dont get stage right.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, I dont.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, there you go. Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Development.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I know, yeah. But you guys are selling how much do you guys whats your percentage of that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Oh, no. Yeah, its funny. People said that to me over the years, but Ive often thought about writing a book. I said to my wife, I said, I should write a book. Ive seen some crazy shit in this town. You know that? I mean, unbelievable. Unbelievable. Chicago. Ive dealt with mob figures, you know that? Ive worked for the mob in this town.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, thats a little better. But its funny, Ive been told that over the years. Oh, Rory. Because Ive spoken in public. I mean, Im not afraid to stand up. Ive spoken in front of people.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Do me a favor. Turn your volume up. Im having a hard time hearing you.","metadata":{"fillerID":33,"fillerText":"Yeah","category":"E"}},{"pageContent":"But they were good guys to work for. You know that?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hey, if I cut off, my phone might call me back because sometimes my phone fails, I have a call fail my iPhone. So if we cut off, just call me back.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im a very good salesman. Im very good talker, Im well spoken, and I got a very good demeanor. But once you get your foot in the door pardon?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Im an under salesman now. A lot of contractors. I laughed. Let me just tell you this little story. This contractor worked for, he says I get one out of every ten jobs I bid. I went what? I said, how are you still in business?","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"I dont know. Let me look at that email first. Send me something, please, and then Ill look at it, okay?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"All right. Im sorry, I forgot your name, mate. What was it again?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"No. Never? No.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Where are you based?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"But the reason I was looking at your ad there is because Im scouring Facebook because Im looking to put my company, my HVAC company, on Facebook, or Im looking to get a social media manager because I think I need one now. Im a little behind. Im trying to get into the 21st century. I was looking for a social media manager. You pay them $100 a month or whatever and they take care of all your online presence.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sentinel Electric.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Its probably around 737 40.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, I mean, I was a contractor for them. I helped them out. I went, done electrical work for them. I got introduced. I got 100 stories to tell you. You wouldnt believe some of them. Theyre crazy. But for a guy Id done a job for, he said hes got a couple of friends in Oak Park. Went around their houses, and they were super nice people. And then some of them had what do you call it, one guy, he was in the vending machines and he had the video poker games, and Ive done a bunch of electrical work around his store, hooking them all up. Its like in the movie. Goodfellows, right? Because theyre all still here, that whole scene. They all live in one part of Chicago, the Italian. But theyre nice people. I get on older, and I worked for a couple of celebrities in this town. Ive been in a couple of politicians houses, and Ive met a couple of big shots over here. Ive been working downtown. And I once battled with the union because this is a big union town and Im a non union contractor, so sometimes they squeeze me. But I get on well with them, too. But its been an uphill battle. I started from nothing. I was told by this one guy when I worked here nearly 29, 30 years ago, he said, youre dreaming. Youll never have a company. Youre delusional. But anyway, from nothing, I built up a multimillion dollar electrical company in Chicago. Right.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Who knows? Between ten I dont want to say too much, but maybe 10,000. But listen, okay, I got to go. Ive got an appointment of free and I got to be there. I got to leave, okay? I got to drive out to the suburbs.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Alex. All right, Alex, its been lovely talking to you. Yeah, email me that again. Right? I got to show you off, okay?","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Yeah, email me, please.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Give me a call anyway. Well pick us up later. All right, bye. Thanks. Bye.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Ill meet you for a beer?","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I have no idea. Do I have to spend money? Who has to spend the money, me or you?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Right, but theres 1000 people besides me that are bigger fish than I am. Im not Donald Trump.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"And thats how I saw your website and I thought, that guy Caleb, whatever his name is? I thought he was a HVAC contractor.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, yeah. This is going to make you laugh. Ive been told I should do it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Did I give you my email address?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}}]