[{"pageContent":"Ive been so busy, I dont remember seeing it.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Definitely is. Definitely is.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, right. Now we break it down into rooms and its small, medium, and large. And theres a square foot into it because within those ranges, the prices dont typically how long it takes us to do the design doesnt fluctuate a lot. Furniture fluctuates, depending on how much money they want to spend. You can spend $20,000 on a sofa or you can spend 2000 $3,000 on the sofa and think youve got a high end sofa.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"If they have drawing files that they can send us, thats the one thing we cant do remotely is go and measure up a building and create the as built drawings of it. That piece is a little difficult, so if they have I could do the decorating side of things 100% remotely.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Were just a small two person design firm, and I wasnt even sure what it was. I was thinking it was some type of automating thing, and were trying to automate as much as we can so that we dont have to hire more people.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Drastically different that way when it comes to furnishings. And sometimes we dont even do the furnishing. Sometimes we do just the remodeling designs for them.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Probably the higher end stuff.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Good, how are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Its a different I dont know how to say it sounded snobby.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yeah. Well, thank you.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"The oversight piece of it, that has to be here in Maine. I guess I could subcontract it out if it was out of state, but they need to have intimate knowledge of the design and everything thats gone in behind it, so they know why? Because contractors like to change things, especially if they dont know and understand what goes through it. We go through a whole process to get to a certain point. You could do it remotely. I wouldnt recommend it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right. Yeah. So Ive standardized my process and stuff so each phase of it can shrink and grow depending on the client. But its really hard to do that one next step up and be unique and customized. You start losing your ability to customize it. Then I want to automate things, but I dont want to go so far that I lose the unique customizing so that the people, my target market are looking for unique and creative. Theyre not looking for a wayfare type solution.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Probably, I guess I was reading another article about I think I was looking at something on the ghost writing stuff to help speed up, like, marketing stuff we do and stuff to automate that. So Im not sure if it really correlates with what we were thinking, but Id look at it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, Im getting close to retirement age, and I dont want to grow the business. I just want to be more productive so I can take on, get more work done faster, that type of thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Inspections?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"The design side of it gets incorporated all in the fee of the furniture. Its kind of like going to a furniture store and buying furniture. The sales rep gets paid from the commission they make off the furniture. If thats the best way to look at it. I cant tell you what a room cost because I havent really started doing it. Im just getting into it now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I only deal with no more than four clients at one time, and the only reason I can do them is because the projects are started at different times. So theres different phases that require more work than other phases.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I thought about doing a marketing agency, but we dont do enough work to cost justify that when I got the prices from it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, thank you very much.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Or no, the designs can all be done remotely.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Got you. Okay. And then obviously the client goes out and then buys all that and stuff like that. Okay, cool. So what is something like that cost on average?","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Right. Interesting. Because at the end of the day, if you wouldnt necessarily recommend it, then it probably wouldnt be ideal to necessarily push that offer virtually because I know remodeling is one of the things that you do. So from your perspective right. From an actual value and really delivering an awesome service to the client, what do you feel like you could do 100% remotely and then what would that look like? Price wise?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Bye. You too. Bye.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"We usually provide recommendations and then we do the project in Maine, we actually go out and inspect. We dont hire the contractors because that would be a conflict of interest. We go inspect to make sure theyre following the plans and doing what theyre supposed to do.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It varies a lot. Size really has a lot to do with it because then youve got more materials. Kitchens and baths are always much more expensive because theres so much more detail into those.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"The clients are remote. The homes are usually second home, a lot of times second homes here in Maine. So either coastal lakefront and stuff. Seasonal property.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So we just want to do a little bit to get the brand recognition out there more and stuff, because thats the one thing thats tough for us to do because most of our clients are out of state. Probably 50% of our clients at least live in another state between New York and California.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its not part of my whereas locally I have to coordinate it, schedule it and stuff. And they take care of all of that.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I do the higher end stuff, so I only do custom. So there are people who do some of the lower, and its more repetitive. Its not as custom. If its not as custom, you can package it up and do it when its custom. The amount of work can vary immensely depending on the project. To me, that would be hard. Im not sure Id want to put the effort into it at this point in my life.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Where theyre second homes. Some people, they want it to be as nice or nicer than their home. And others, its like they dont want to make that big investment in it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Well have the growth. We can increase finances, but without growing the manpower because to be honest, theres not very many people getting employees is hard anyway. So I just decided at this stage of life, and my son doesnt I dont know if hes going to continue. We got two business. We got a property management business that were starting. So hell use the property that Im using as an office and convert it and just rent it out when were done with that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right? I guess it really depends.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Just the design business is whats supporting that business to get up and going. And he really wants to do the property management side of it. If were doing rentals and overseeing peoples rentals, thats not something you can really scale without buying lots of properties.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ive thought of it, but I decided I didnt want to go there. Im in my early sixty s, and I like what I do.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, it depends because theres so many different things we do.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Actually, thats part of my tag. What little advertising I do is I design for people who want to work hard and play hard.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im playing it by ear.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Like a kitchen design usually will go between 10,000, $20,000, depending on how big the space is.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Clients are usually typically older clientele, 50 plus. And we do all the design work on the CAD. And our back office is set up so that it acts as a big file folder for everything, does all our purchase orders and stuff like that, but it also allows us to store everything in it. Its kind of like an electronic file cabinet for every project we do, all our drying files get uploaded into it. They have a password and they have access into it. 24/7.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont know. Theres usually between a 50 and 100% markup on the furniture, so it varies on the companies and stuff. So I dont like to call it a mockup. I like to call it a procurement fee, because you have to do work to get to that point. People look at it like just a furniture store where they haul a bunch of stuff in nothing. This has been all curated ahead of time. Probably a few thousand a room and stuff in the way Im going now, where the company is doing a lot of the work for me because theyre reducing my overhead because I dont have to package things, ship things or anything. They take care of all that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Well, because you have to standardize things, and I do a flat B service based on the project size, but Im calculating it out. There are people who just do flat fees for a room and stuff, but Ive gotten away from that because you have to do so much, and unless youre producing pretty much the same thing, then youre not making any money. You have to do repetitive work to make money by doing that and not be unique. And I dont want to not be unique.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, we dont do anything. And thats where Im hoping maybe to pick up a little bit so we can do a little bit more. Now that weve got some standardization, maybe we can take on a couple more clients at one time. What its doing is, and Im still working on finalizing this stage, is getting people to follow the schedule. When they dont get back to me in time, then it screws up the whole schedule. But Im going to put in the contract that if they dont, I start charging them by the hour for that time period that I have to wait for it. Because sometimes what happens right now that Ive standardized things is people ignore the schedule and stuff. I got to work on getting that down. But yeah, right. The only part I can see that I can scale at any time is going through this furniture company where theyll wholesale the furniture to me. I put the pieces together on the website, and basically what I do is Im linking to just putting my website a link in to theirs. People dont see it. Its all behind the scenes, and theyre actually doing the sale and taking care of everything behind the scenes. So thats probably going to be the way we look at that. We can scale that and stuff because weve got a wholesale distributor type person that will handle everything on that end of it for us.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Hes starting to take over all the CAD side of things so that I can do the design side and stuff. And when I retire, the business will probably be dissolved unless I do it for a really long time and my granddaughters get old enough and they want to take over the business, otherwise it goes bye bye.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I cant necessarily do the remodeling design 100% remotely because someones got to go measure the physical location.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I like being independent and working. Im not sure I want to deal with other people. I got one person I work with, but its my son.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Say at least 50% of the furniture sale is what Id be getting minimum.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, were standardizing everything. Were in that process right now. I dont really do advertising, so thats one of the reasons we wanted to be a little bit more efficient than that. But we have like a five or six step process depending on what people need for design services. We kind of specialize in renovation and remodeling design and stuff. One of the areas we are growing, though, is to do more furnishings and stuff for people. Most of the work, because most of our clientele is out of state, is done online. We have CAD systems and I have a back office system that we use.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Getting your name out to people who have seasonal homes that are here in Maine is tricky.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont even know what it is. Ive got it all in a formula on an Excel spreadsheet and I just plug in the sizes of the space and Ive got it so that it figures everything out for me. I dont know anymore what the square I used to know what the square footage price was, but now I just use my little template and it pops it out and stuff. I need to go back in and break it out into different phases and stuff. So I got to go back into my formulas and remember what I put together.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Everything.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, probably the second.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right, okay. So pretty much like a client, they come to you and theyre like, hey, Im buying this house. I want to make it look like X, Y and Z. I need your help to pretty much pick out the furniture, lay out where its all going to go, the design, the finishes, like you said. And so pretty much youre, Chris, coming in as that advisor and saying, hey, if you want the house to have XYZ kind of vibe and energy, you should get XYZ and so on and so forth. And thats what it looks like.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yeah, I just want to make more money so that I can play more.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]