[{"pageContent":"No, I havent had a chance to check my email. My son is using our computer to watch a movie.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, well, I appreciate it, and Im sorry that you all couldnt help me, but I appreciate your advice. I really do.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"No, Im here at the house watching TV.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats one of the biggest problems, right? Basically, Ive started a point to where Im starting a video blog, and I havent even put my first one out. Like I said, Im just starting to get this stuff together. Im trying to figure out how to do it without sounding like a crazy man and bringing out the facts, showing the proof and everything, without going out and looking like a conspiracy theorist and everything, because I want the truth out. I mean, theres enough of my background that, trust me, I know a lot more things than what most people think I do. Ive seen documentation that most people havent seen, right? And thats just it. Thats what Im trying to do. Im trying to figure out how to do it and the way I want to do it, because I dont want to come off as all these other guys and gurus and crap that has come up with all these other ways of thinking, get rich and everything else, and I dont want that. I just want people to understand the truth, to think for yourself, to do the research. Look it up yourself. Dont take my word for it. Look it up, find it out for yourself. Open to your eyes, to the underlayment thats going on, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right, yes, sir. Ill step out here in the front.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I know one thing. We did like a little introduction and we put it on YouTube. It was only like three or four minutes long, okay? They took it down. They said that we violated some type of term or condition within YouTube.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"So I know a little bit about this stuff.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Well, I dont want to put it in effect of its like a course or something. Its just the fact of knowing that the documentation is out there. I mean, you have to look at it, you have to find it. And a lot of people, a lot of civilians, and its an absolute and proven fact they dont want to go to the Congress Library and look through archives and references and everything else. And I was like, you dont want to do that research. Ive already done that research. I can show you that research, I can show you the documentation. And I mean, Ive had one friend of mine was telling me, he says, well, what you need to do is you need to set up a website and charge a certain amount of money for the website. Like a membership fee where they can have their own membership and then they can come and look at this stuff and watch your videos and stuff like that and get an education that way. And I said, yeah, but that sounds like one of them get rich quick scheme websites, guru type thing. He goes, no, thats not what it is. He said, you could just charge one American news do they charge 495 so that you get the update news and this, that, and another? And I was like, Well, I dont know, I need to talk to somebody that knows more about what Im trying to do, a good platform to start with and how to get it going and everything else, because one thing, Im a disabled vet. I dont really have that much money and everything. And he was telling me I could do video blocks, Im put them on YouTube, people kind of watch them for a while and get things going and this, that and another. And Im like, well, I dont know. My biggest problem is I want to do this professionally, I want to do this right and I want to do it sincerely. Maybe you can understand that, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Do what now? Well, you have a good evening.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay. I really appreciate that. Absolutely. Thank you for calling.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I was going to see if I got something that tomorrow morning.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, Im a published author. I actually have a book. And the book is called The Truth by FBW. Brown. Thats a pin name. I was in the military for 23 years, and I guess the best way you could put it is Im actually getting the truth out because I think its funny that a lot of people are worried about abortion, theyre worried about transgender, worry about inflation, worry about Ukraine and all this other stuff. And they truly dont understand the underlayment of what the government is truly doing. I worked for the Pentagon for 17 years.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, thats my brother.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Do what now?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Oh, fine, how are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I appreciate the patio. No, my son was watching some Lego Movie.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So I was like, okay, I dont know what we did wrong.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}}]