[{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes, I would be.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thats something I always been interested. I took and talked to a few people about this, but I felt like they was too eager to just try to get money out of you because I pay attention to what Im doing that I was talking to.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"At the moment, at least around 4500.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Say it again. Im sorry.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"You mean as far as what I have saved or what Im working on?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"02:00 P.m. Will be better.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, wait a minute. I believe your passions get stronger as you evolve and you learn more, and as you grow, it continues to stretch forward. Did you hear me?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, short term goal is being able to pay bills and pay things and being able to travel.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, it would probably give me a feeling and emotion, but it aint going to do much, you know what Im saying, because its not a lot. But I can work with it if thats the case because I feel like 30,000 is nothing, man, compared to the world now and how everything went up. I really think its nothing, but it would create a feeling, it would create an emotion. And that goes without saying, I would be happy to be there, but lets.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I have accounts on there and I have studied it and I have researched it and I look at it every day and I watch how people do it. I havent implemented yet. I recently moved here in La. So really Im looking for office to implement things like that. But its easy, man. You have a lot of people thats advertising to tell you they can do this, they can do that for you, for the Instagram, far as the YouTube, any other site. And what I have learned is that all you got to do is go in there and apply and look at whats going on and do it yourself. So its not a hard thing, a complicated thing to do, I think anything in life, all you got to do is look at it and research. Not much, the phone and the computer and Instagram and YouTube, theyre huge, but at the same time they give you so much information and people go on there just to put stuff on there and put their life on there or whatever. But thats their prerogative. But I think that if you take it on the business side and pay attention to the business that come across there and pay attention to what you can do with those things, I think youll be highly successful.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, you can do that, but tomorrow is not good. You probably would have to do a Monday. Sunday, I really dont get on the phone. I really get into myself.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"All right. All right, bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Say that again?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"The other day that the sky was the limit, but then I turned around and I retracted and why I retract that is because the sky is not the limit. We go beyond that.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I can coach and consult somebody on how to not be negative, how not to let past failures, how to continue to reshape your mind in a positive way. We have negative thoughts, but you can get rid of them. You can block them out. Because if you take and you just keep gathering your mind with positive things, whatever youre working on, whatevers in detail, I think that you can really get on a road to get where youre trying to go. Im really good at teaching people how to do that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I think I have an above knowledge on again, organizing advertising and creating different things. Im very good at that. Can you hold for 1 second, please?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So where do you make your income from? By helping me.","metadata":{"fillerID":29,"fillerText":"Mhmm","category":"D"}},{"pageContent":"Right? Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, let me say this. What I would have to do, I cant give you a number off the top, because one of the reasons why I need to look at some paperwork, documentation or whatever you can send me said I can look over. On a preliminary basis, it would be like $3,000. But research it a little more before I come to a final decision. I know were talking and youre giving me a lot of good information but at the same time I need to see something that I can sit back because I dont do nothing else. Yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"What is the guarantee for that? Something like that. If I was to do that or we come to some agreement, I mean, youre giving me information, but what else comes with that?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, I guess it will release some endorphins in my mind, as they say. We can create them ourselves that are doing drugs or sex or whatever theyre creating. It aint but so many things that it can do. So thats one of the things that I know it would create. It would create a happy feeling.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, that sounds great. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Go ahead.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. And what guarantee do I get?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"One thing for sure, as long as me and you are talking delving the things you know Im going to be there.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"When you say 3000, you talking about Im paying the $3,000?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Sounds good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I didnt receive it.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yeah, Ive been that way all my life. I love to learn new things. I love to. Yeah.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"The main thing with that is I need to know and research is to make sure that I make the right decision.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It doesnt matter, really. Im flexible with that because I think thats very important.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im doing okay. How are you doing?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Well, Im involved in several different things right now, but Im trying to see whats going on with the AI thing. Its the feature, so Im really trying to find out what does it interest me, but Im trying to see if thats where I want to go.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, Im in ecommerce. I have a website on the Internet. I do Amazon Delivery. I do uber eats and Im investing.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I love that.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Okay? Appreciate you. You have a fabulous weekend.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Youre saying with that, I can start what do you offer your company?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yes. Because I think a lot of people, man, I really believe that a lot of people really they live in the past so much. You got to leave the past alone because to me the past is gone and it was here for a minute. But you cant do nothing with that. You can take and use the positive aspects of it, but who wants the negative? And sometimes we cant get that negative out our mind. But I have learned to recreate that. I dont think negative about nothing. Like, I tell my kids, I was with them yesterday and I experienced them talking negative about they wasnt really talking negative, but they were just telling me about certain things and I was telling them, I dont want to hear it because it draws your energy and its a waste of time. Time is important. Time is of essence, you know what Im saying? You have to move forward. You have to have that mindset of always discussing positive things. If you have that, if you had that mentality, then you cant lose.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, I dont. But usually what I do, I usually use LLC, a federal tax ID number and everything I do.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Thats a good question there. Whats the minimum that you can put in.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yes, very much. How long is it going to be?","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I have quite a few, quite enough saved up. I have at least around 10,000.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Give me 1 second.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"That kind of I guess what we would do is get them that option. Right. 60 or 90 days. Right. Or we just set it yeah, maybe.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"One thing about me, Im good at organizing. Im very good at advertising. Im good with working with people in any way possible. They may need to be, as long as theyre benefiting from what I am distributing to them.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I love our conversation because its giving me a lot of information because I feel as though theres something that Ive been looking into and that would be great for me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sounds great.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"What is the guarantee for something like that?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yes, I have considered it. I havent gotten into it, though, but I have considered it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, everything went well.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats where I go with that. I can tell you that. Not recently, probably about four years ago, I got an LLC for driving because thats one of the things I want to get going. I live in La. Right now and I know theres a big financial, very big in regards to driving people around similar to Uber. I had the Uber idea for it, came out and never moved on it. I think the insurance is stopped me from doing it and then they come out with it two years later. I was really upset about that one because of what I was going through trying to get the insurance to take care of the commercial insurance. But anyway, its still a market there with the black trucks and the major celebrities or major funding people that wants to use them. I really like that. Thats what I have. LLC and a few other things. Go ahead.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Okay, awesome.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Excuse me?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"No, I agree with that.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, I can hear you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, trust me, man. And I know you dont know me, I mean, to cut you out, but let me tell you something, man. With me, theres no limit on me where Im going.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Do is going to work well.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Say that again.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"ThatS just something that I would like to share with you. Not saying that you are like that, but that made me think that they was just asking my money. Nothing good was going to come out of it?","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Okay? I got you. Im in my store. You called me really a particular time, so Im trying to move some stuff around Friday with your hand. But one of the things I wanted to say I just picked the phone number. Just put it on. I wanted to say to you is that I have attempted to get with a few well, not a future in regards to what is it? Taylor Conroy? Is that it? Taylor Conroy? I think thats it. But anyway, I didnt like the way they kept coming. I mean, youre supposed to be aggressive when youre doing anything. I think you got to be really honest. But I felt like they were coming too close to me. Not close, but they were really pushing and pushing. Before I even finished discussing the contract, it was mailed out to me. And that kind of stuff made me think that theyre desperate in a certain sense that theyre desperate and theyre trying to do.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Yes, that makes a lot of sense.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Sky is the limit.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im very much interested.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes. My main thing, I guess, when I responded to you and seen it on the internet was the AI thing. That is my main goal to see what I would need. Its very much interested in that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"James Jame.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, youre talking about when youre younger. I think your passions change a lot as you get older.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, thats a good question, and I think it is unlimited. What I would like to make I dont want to put a cap on. I know sometimes people say its good to start small, set a goal, then go higher, then go higher, or continue to do small things before you go to the big one. But I always been one who makes my goals just as far as they can go.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]