[{"pageContent":"Its going pretty good. I cant complain. Im looking to systemize certain parts of it, and it fluctuates because I do a lot of work with the land as well. So I want to work this year. We have an event venue on our property, so we have a lot of events on our own property, houses and ponds and all that stuff. But this year I really want to focus more on my speaking and my coaching and make the land like my secondary income. And were doing probably 200,000 on the land right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Say the last one again.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"If I just get rid of this. If I sold this and just focus on that, it probably be better.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, I do Facebook ads. Facebook, Instagram ads. Its a lot of word of mouth, but I do speaking too, so I have quite a speaking engagement. So most times I go run my mouth somewhere, I get clients about it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. Hi.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Back the number of four to six a month?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Probably get me in front of more people and connect me to more people because I dont have time to talk to all these people. Let me ask you all the organization and whats the name of your company?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I got the email, but I havent had a chance to watch it yet, though.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, Im a coach and a consultant and a speaker.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"It starts at 5000, and the highest program we have is 9800. We have a few clients at that price point.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, yeah, we got that booked up in 2025 already.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Probably not booking too many appointments. Its probably like, the calls we get. Im probably doing about 1520 calls a month, and out of that 1520, I might be booking 25% of them.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, yeah.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Well, probably because my time is divided probably between the land, because its money, but its not my passion. We bought a nice piece of property. It generated income. And I use my coaching and my speaking to generate income even from the land. So I think part of my time is divided right now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, thatll work.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay, thats fine.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, it varies. Sometimes between 15,000. Highest month, maybe 24,000.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, so you say you took the last four businesses to over a million dollars a month?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, it is. Yeah. We definitely get like 1000 chickens and we sell a lot of eggs now to local bakers and like that. Thats why I say a lot of my time is divided into this because it generates money. We grow on food and we have a lot of conferences here, workshops and trainings here on the land.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, Im just trying to find out more information on it and whats the difference between what you do in chat CPT or at the same time?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"And is all these systems now with AI?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Well, Im a landowner, so I own 25 acres and we make money with our land. I do a lot of consultation with other landowners on how to monetize that land, but also I consult organizations for my coaching program. Its transformational coaching program.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sunset Ranch.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yeah, way beyond all that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"By my credit score, you say?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Monday would be better. Because our weekend be swamped here on the land. We have a lot of events, but we have an event venue here, so we have events every booked up, like, pretty much all year on Friday and Saturday. We got two or three weekends available for the rest of the year, so were pretty busy.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"The results, Im going to look at the case study. But you all got testimonials of people you work with because I know you said you all in beta.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"My wife is a financial credit score is 850 minus 785. Yeah, my wife is credit is not a problem. But why did you ask about credit, what we need credit for?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"How much does the program cost?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"No, 9800 is the highest one we have.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes. I like to watch the video and come up with my question. Im quite sure I have a lot of questions.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, it probably has to be probably Monday because we have a wedding this weekend that were setting up for. And I have a speaking engagement on Saturday at a wedding in the afternoon. I have a speaking engagement that evening. And I dont know if you all work on Sunday, but if you have Sunday, itd be better. If not, it has to be Monday. Robin.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"That sounds pretty good. Im looking forward to seeing the video. Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"But not completely. I mess around with Chat box. Now. Ive watched a few videos on how people are using AI, but Im not completely certain on how I can use it because my coaching is and my whole brand is based on authenticity. So Im trying to see how I can integrate AI because thats like some other artificial intelligence.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"A video that I can watch and get some questions on it.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"You asked me, do I have a six figure credit score?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"We got horses and cows and sheep and a pond and ducks and chickens and all kinds of stuff.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im all right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, let me see. You say tomorrow?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No, were going to be swamped tomorrow. I already know Friday is going to be swamped. And how long is the call?","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"One or two maybe, because I know were going to be swamped in the morning, and then we make the transition to the event at 03:00. Maybe I can do between one and two, maybe.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yeah, I like to do $25 to $30,000 a month easy, just for my coaching, like, consistently.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I have all constant contact as far as systems, I have a lot of things for funnels and all that kind of stuff. And theyre just really focusing on it and putting them systems, like optimizing the systems.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I kind of got a roadmap of what system to put in place. Its just doing it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. Yeah, I can watch it.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. Air. AI. How long have you been in existence?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah. Im actually building a sales team right now. I put somebody on my social media recently, and I had a pretty good response. So, like, with some nice assistants, some VAS, and some salespeople, because I know I need a bigger team, its just pretty much me and my wife and sometimes a couple of my friends that do it. But since Im the one that run my mouth, thats the easy part for me. All the back end stuff, my wife handed a lot of that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, sir. Thank you. All right, take care.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay? Okay. Thatll work.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Whats the difference between your company and Tech GPC? I have a lot of friends that they use and Ive tinkled with it a little bit. I just aint had time to really get into it. But is your company?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I got a lot of questions. Im filled with questions. I like to watch the party.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Just so I can get the results.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Credit and it depends on what people do. We dont have a problem with ad spend, all that kind of stuff because again, we have an event venue that does pretty well. But we had one other company that we did sign up with. It was like a $25,000 investment and it was a bunch of fluff. For real. It sounded good, but it didnt really get us to where we needed to be. We scale companies and it was a local company here in Atlanta dealing with ad spend and marketing. We dont have that problem as far as budget wise.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]