[{"pageContent":"First of all, Im a writer. Im a writer. I have a book on what you call it? Amazon. Okay. Also Im a researcher. I continue to write book. I will publish overs. Second of all, Im a business developer. Meaning I developed a business that Im implementing little by little and now Im searching for the resources in order to fully implement local domains in New York, local business and global business. Was born in overseas, study overseas, also study in America. I speak like five languages and ever since I feel like my time has come to start making transform my knowledge into money. I dont know how to advertise myself. Like I said, I study one third of the world and I be countries, French and Europe in America. Im from Africa. So with that being said, all these knowledge worth a lot of money. And its time for me to start to cash it. In order to cash it, I have to get out from my shadow, from my hidden place. So I need people that know how to put people out there, whether their product, whether themselves, and also set them into media, also advertise their product. Thats why EI artificial intelligence is one of the mean that I saw recently, that hes going to overcome Facebook, hes going to overcome or whatever the mean it could be. So those who know how to do it, I want to know how to do it. So whether I do that with them or if I have the knowledge, if I acquire the knowledge, I do that with myself, selling my product, whatever. With that being said, I could better sell my products and my expertise. Im a lawyer, international lawyer also. But I realized that the one who Im a master of law are more educated than them, even twice. So almost Im like, okay, why should I let my future in the stick of somebody who doesnt even know because he has a so its time for me to create myself. Thats why, first of all, Im creating an agency that will offer jobs and also do real estate and overmore, also investing overseas and here in America, in Europe, Washington DC, California. So this kind of agency first, and after that attack of global consulting business that will consult or advise president, head of states embassy and also global businesses installed in Europe, in Africa, in Asia, and also transferring the technologies. So this is somebody whos the head is even at the same level or even more than digging, stuff like that. But I need help in order to achieve it, even them. But in order to have help, whether I have to have a certain product that make me make money and EI is one of the ways. Thats why I want to know it, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"When we go to transfer of technology, real estate also almost the same or alphabet. But now when we go to transfer of technology, lets say what you know, you transfer to one African who want to become engineer or also invest. And you tell them, my idea is that I will be the in between. Person is a millionaire. There you have the technology and you are like, okay, in order to eat this technology in Africa or in Europe, I need 200 million. And you say, no, I dont have that amount of money. Okay, do everything to give me at least 150 and the person that will say 120 will be fair 120, I take 20 million out of your 120 that he has to give you in order for you to transfer the technology. So this is the person that Ive been thinking. And if I have 100 contract like that a year, not even ten we can grow. That means billionaire ideas. But just like I start with agency because at least I wouldnt be anymore in lack of one, two, 3 million a year. If I multiply the price of 10 million a year, I wouldnt be at least lack of that. But up to now I come from a zero from scratch. Only the knowledge, ideas but okay, another job. But now is the time to start develop this idea. If you really want to show me some, we can meet. There are websites to develop. There are a lot of things to do. I will be taking any kind of activity in order to afford the minimum implement all of that I believe that within a year I have to get out the shadow, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, thats what were going to do, ultimately. Send me the link, I will save it in archives and I will also save your name and the name of your company with the number you just send me to so that within some time I will reach you back or I will ask you, I will eat again your website. So you eat me back right now. Im about to go, yeah, well, that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Nine years ago in so born France not in Gabon where I was born in Africa, no, but after that across two years later as I was premier attorney after the PhD across into America eight years since Im in the country I had a time to learn greatly the language myself. Im not perfect but I try to reach a certain high level and after that I learned business finance, technologies, securities building, real estate. I learned a lot of things alone. Mostly because I told myself youre really a researcher. Why should you let somebody else teaching you what you can learn by yourself? But now with EI there are people who are specialized. Its not the same thing. So thats why I need people to quicken the process.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im the same age like Zuckerberg at the same age. I was doing my masters degree when he was creating Facebook. We started in 2004, that was almost a year I started university. I was doing bachelor degree. But he gave up because his mother is banker, his father is a lawyer. Me, Im the first lawyer, like international lawyer in my family, the first PSD in my family, the first to speak English, the first to know business, the first to know finance, to provide all those knowledge. Because I tried to work for seven generations after my death so that no one in my family would be poor again. Thats why I did all that. Beyond the family, it has to be that you help community, you help people around the world. Your speech can quicken the success of a lot of people.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im not sure. No, Im not sure, I did not see it. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, we have ideas that can create multimillions and even more. But its time to start. Im almost 40 and I have also 40 years to transform those gathering of ideas and knowledge into money, into value. And as people is not for me only. I have the foundation where I was searching NGO was foundation. Im also creating beside a business also. But its time beside the book, beside the shirt, to put all that outside there. Taking the board, doing all those things is nothing compared to having those technology out there or exchanging their transfer so Those Ideas Are Worth Million. And now that I just got what you call it, the authorization, like green card and stuff. So Im three years away to also get the citizenship. So it doesnt lock me to prevent me to practice my business. It even allow me to do more than I was able to go for. So its time. I need those. I want to go to Africa to create or expand two, three business in two years from now. So I really need to start to make it here. Any time.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I click on Facebook like that but actually I cannot even talk. Certain situation.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"The basic resources. Lets say if I have a quarter of a million the first agency will be seen in three months. From that, 610 months. After that, Im pretty sure we have at least a million. Because the strategies are put in order to advertise it physically. Meaning going to see every partner and every customer first. He has been settled the strategy of communication, but also online Google, online search or whatever, voice search. I kind of read all of them, but I dont know how to implement them. Also hiring the team that will do the work. For instance, if I start the agency of job knowing that there will be almost 5000 people coming to search for a job in the agency every day. But I think the minimum of 20 of them every day. Which is sure we have at least from 2 million a year. But from that there is also an audience company that will grow up to the global company. The transfer of technology that I talk about, the construction company, there are many of them until we reach agricultural and institutional companies. So we will be in that way translating any kind of technology. My idea is the matches in order to make the fire. Africans dont even know how to make it, but they are users. If the world has created a craft aircraft since two centuries its time to leave them handling some basic technologies. They know how to install them, they know how to fix them but they dont know how to process them, how to build them. So its time for them to start making Congo. And from Gabon, which is close to Congo Gabon we have uranium, nickel, cobalt, whatever the resources you can even imagine up to uranium. We can even do what you call it, energy, power, whatever, nuclear power. But lets get away from that. But the basic need like doing a piping, whatever the mirror, whatever you can imagine as item is a technique that can be transferred for them to start making what they need in their locality, in the area. So to the Chinese to bring all the time whatever they think Africa needs. Imagine if tomato for instance, or sardine if the Chinese who dont like for instance, Africa put something that can destroy the cancer to African tomato. So istanpo Africa to start building those to start making, processing those tomatoes, starting whatever they consume first. And then they go little by little by little by little, its time for me to do the conferences. So I have to be known, I have to get out of my shadow. But I need help for that. I dont care who will help me. Black, white, whoever thinks is fair to kind of do humanity in technologies, you know what I mean?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, when I got the chance I will get back to you. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"How much do.","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"It took you longer, right? Thats why you see most millionaires that made it alone, they become millionaire, millionaire by fifty s. Sixty s. Because nobody, in reality nobody helped all they were consumers or they had a kind of family that was taking their money away or nobody they have no legacy.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Can you repeat that? I didnt hear.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Last year it was about 50 or something, but this year I dont know yet. Im still improving.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats the minimum. Because in order to be successful from the day two, it has to be one person or two people in the office. Three people advertising, I dont even talk now mentioned yet online. But I have to put like five k on online advertisement with all that combined, two people to see the managers of the restaurant or whatever, the management in order to attract the people to us. In two people, that means five people plus us. And with the structure over six months, my AVK is almost depleted. So it has to be new customer coming in. Meaning if I have from the week to 20 people and more, then the money will start to come and it will be thirty k a week, a month. If the business is really scaling. And I also put some books online, I also put some shares of some other item. Then over a year, I can pretty sure we will overcome 5 million. But if its not down like that, it will be maybe a year, three years in order to take off. Because I work myself in a restaurant I know how it goes. If you see a manager, okay, if you need a worker, come to see me. I make you a discount or whatever. If you see workers, we tell them potential worker, okay, you just come in. In the country, you need to work like salad, man, whatever. If you bring me somebody instead of paying me once, they pay that. If ten people pay you, that a day, that 10,000 a day. If its 20,000, if 30, thats 30,000 a day. Over months, you have a real money. So Im confident that I will succeed, but I need a push up. A push up financially job, financially, people I can see somebody, okay, bring me two people down, like real estate, taxes, whatever, they send them to the full computer.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"For the business? For everything, for the business. In the beginning, I need one hundred k, not below 80K. Thats why after solving the administration thing, I will get back to order where I have to do like the low fall. I need to settle by Harlem or need Manetta. And after that I think everything would be smooth. I need everything to get like right.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Consulting company, right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"At this time Im not able to talk. Im in a very difficult area, there is a lot of noise. Maybe you let me call you back within the week.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"So what pushed me back, what pushed me back is the lack of those basic resources which I can do any kind of activity in order to start to happen. But Im creative and I still believe in myself. They said an adult and believe like a child.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"The last time I checked, it was like 700. That was like seven months ago. But now might be a little more, a little less, I dont know. But Im walking out. I know Im really conscious that when you do business, you have to work on those things the first time in order to reach 730. I had to work with agency in order to do that for the resources. Like I said, any kind of additional job will get me there. Meaning I know my resources now are just like, you need some improvement. I need to earn like three k more in order to achieve it within six months, six months, a year. So Im doing all that now. Right now I had a lot of meeting with the administration, so I couldnt do everything at the same time. But now that Im reaching the right people, that give a little bit pressure if I really want to achieve it in order to go back and do that. So the credit score is not that much a major problem when business from scratch. You have to sacrifice one or two years to work extremely hard. Two, three jobs, for instance, to get like 5000 if there are lot of jobs, 10,000 if you are a big job. And over ten months like that, you know, you can start to do what you want. Because good credit score lead to good financing, and good financing lead to good assistance, good hiring and localization of the structure of the business. So I know Im conscious of that. So how much do you require people to buy your services?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"We do the job. We advertise to every neighborhood in Europe, and then the next year we go to another locality like Ma, Washington, DC. If we do that like that, its successful. So thats why Im pretty confident its going to work. So how much do you ask the people?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, exactly. If I have $3 million, what I can do in Africa is like, you have a billion. Here three $5 million in Africa. You have a billion or 500 million here. So thats why after gathering all those ideas, I want you to think about the way from the book till what you call it, the T shirt, till the business. And what time frame we can work together in order to achieve it. You said if you can achieve a million, what you call it? A month, six months. You know what I mean? Six Months. And from that we scale we scale beyond the level? Can even imagine. And I took these little remaining license. I already have over 30 licenses, but I need to take the last one, like real estate, which Im taking in order to fully be authorized. And after that, I want to add the en. Once I have it within the two months now I tackle where to have the local and whatever is in between. I want you to think about a way we can walk together. Then we can get there.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, thats my address.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thank you for eating up.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Shoot that over to me. I will do my part. Im waiting for some ein. And then we go to the bank and we go to the resources, we go this and that, and then everything will be seen then I will eat you back. That this is time. I have that for you. Because online, your part is mostly online and make things going viral. And my job is physical and finding the local structure properly done legally and then start from there. Thats my thing. So if you describe that to me, send me an email. Im about go. Please match me. Okay.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"And that closed, for instance, for the t shirt. Can you start with that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I will send you the link because you can suggest you can remain remodeled. But we have to do that. See if the book I see some people, they sell 200,000 t shirts on Etsy, but I just need 50,000 to be successful. And 200,000 books, they cost 299. If they sell copy, then I will be making two, $300,000 plus the book would be amount of money, you know what I mean? So from that anybody bank, no more to stop. And really those are the kind of items they dont even know who is the author who made them.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Shirt and autocol it again and the book, for instance, lets say if I have, for instance, 50,000 sales of the shirt, $14 each. Given $10 each, that will be 500K. Thats a million. If the book, which is $20, no one dollars. If it reaches 100,000 people, thats 200,000. I will be getting there. So, end of the issue, I wouldnt need the 100,000 from the bank anymore, you know what I mean?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. You can write me a message a step away from where I was. At. But Im going to go back. You can send me a message the way you see we can work. Thats why I try to describe. So I will retain it. I have two full six months to make all that available. All that available. Like do everything from check by the credit score, improve it. Yeah, local and having people to start.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I understand. Thats powerful.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"We can start the way you used to do it, like a normal person. But if you do, like, excellent job like bringing over 1000 people, what you call it, a month, I will have no problem to give you five K, ten K, right.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Have 10,000 clients a day, multiply it by 1000 client a month, multiply these by $200, thats actually 200,000 a month. But time twelve or time ten, that 2 million. So with that, the success is being done. All that will be built all that will be built as a system. Right now, I dont care if I have to be janitor or whatever, regardless my PhD, because if I wait from the time they will appoint me as a professor, that will take months, a year, two years. I can wait for that. I dont have time for that. And it is even better because the professor will be making 150,000 the whole year when thats just my earnings. When I have a business, all that will be more. But if you can start from online, I mean, send me all the link because Im about to go. Send me all the link. Whats your name again, please? Yeah.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"The link in return to your email within two days. So you will tell me how we can work and I will tell you how we can do that and start, right?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Theres actually another resource. For instance, you can just say, okay, nurses, listen, we talk as a reminder, we talk about the way you can scale your consulting company or agency and also your online businesses. And this is the first resource that website has. So I will save it, I match you and stuff. I will save it because I can have maybe over a month, maybe ten mail concern, that kind of business. But the one I take it seriously is the one that has a reminder, he knows me, we spoke and we went through the way it can help you. This is the way we can assist you regarding your agency. We can provide this, we can do that, and like that right. For instance, if you need a page, Facebook, if you know, professional deals, we can assist you in using that. Thats what I need. And no way, if you want to, like, for instance, you make a video, you want it to go viral and whatever you present, we can do that. Thats the way we can work for you. Those are the kind of description of ideas and work template that I want you to do. Please.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I think I will remain the same Like I just told you, Im a doctor. Since PRG, not any doctor because PRG is four years after medical doctor. Since nine years I still feel like the little boy that was wise enough and willing to learn. And that will not make me feel like a superhuman, but just like it will allow me to better help, better assist other people. Better assist other people like you. Now you gather the knowledge, you are probably engineer, technician and make you okay. This one has a problem. Let me solve their problem, right? With the resources, I will solve a technical problem, but I can solve it by having for instance, companies that build up what you call it, real estate, construction, stuff like that, infrastructure and also technical resources, training people or building schools that will make people getting the right technology to learn. Not any technology learn science. Learning now is basic, yes, but they have to do something for themselves so that instead of being an employee unemployed after their school, they will be creating business. They need technical skills plus a bank or financial skill. When they gather the bot cross under management, they have their company. So those are the kind of quicken way I want to teach people because right now you just got a structure. Im pretty sure you learn also finance field because if you did not have finance and law or reach a lawyer to have your company, believe me, you would just become an engineer with just like a technician. Because you need to combine a lot of knowledge, it will come to realize them. But I want to when you systemize or you put it into system all the knowledge you can then better teach, better advocate, better coach and better assist people. Because where a kid will spend 40 years I dont want anybody to spend 40 years like me in order to create his company at 25 like you, because somebody did that before and taught you how to do that. Thats why you are able to do that. This time you also made available some resources. Me, I had known nobody helped me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"In order to reach that. When I talk about the transfer technology and global stuff, that will be overthinked. If somebody transferring a technology or issue between a state and global bank, they talk about 2 billion. You think I will charge 10,000? Becomes ridiculous. I will take at least 10% of that. We talk about 200 million. If I have only ten clients all year, which is the weakest person ever, that will actually be a billion a year. We talk about the real person. I mean, you eat the right person. I just want you to encourage me to get there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Great, awesome.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Five years, I dont know what you mean.","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Im structuring them into business. The first way to get into business very early, have the chance to make a lot of mistake. But I had before no support. So I added to overcome it and I added to think, right, what kind of business will be yielding some outcome, good outcome. So once I found it first, serving the community, also going beyond institution, going into institution and also businesses. Thats why I wanted to take time. It took me 910 years after my PhD to get fluently accent and know the business and go Yale, I studied all those institutes. But now its time to cash it, right? For instance, if I take the job and real estate that alone that will give the job to those who are searching for any kind of job. Lets take the example of kitchen in 12,000. Kitchen meaning restaurant. For instance, those who want to have a job as simply salad, man, dishwasher, cook or whatever, every restaurant has to fire 64 if I 64 a year. So if I take every day I have like 20 clients a day, I will reach like cashing 250 or 200. I will be reaching 2 million and a half only.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. And also I have etsy. I dont know ETSI. Im from Etsy shop there, which is not well built. I want to design it and put it out there. Kind of have a basic money is to put my company, they call it NGO also two companies out there. I start to search for the money, whatever. Whether I make it from my book, from the bank, or from those T shirts, those kind of items. And from that the business will start a spouse. When I become people who know me as a global lawyer, defender of human rights. But the business is being built underneath. Thats why you see, for instance, all those public figure take me as equal as Bill Clinton. Bill Clinton being known as a president, a lawyer, but one made in which a normal lawyer who is not inventive, who just advocates on basic law can only make max 20 million all life. But where did he start all this money? Because they know how they learn and know how to create businesses. You know what I mean? So its my time now. So I need people that really want to stick with me, work with me, and up to the time we get there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]