[{"pageContent":"Okay, so I opened an insurance agency.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"About to join a couple of meetings through Zoom, and then Ill review you that night, and Ill text you then.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I like teaching. How I actually got into insurance was by teaching other things. I just kind of ran into the industry. Got it. I do like it. Yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Two weeks ago. But I have twelve years of experience. Okay, awesome.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Im sorry?","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yes. I mean, we can look at numbers. I know its going to take or Im assuming actually its going to take a lot of time to create the courses and all that?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"So we have offices in Ecuador, Colombia, and in those countries, weve been able to produce that number of premiums. So thats why I know how to do it. We just started here because we had to get the licenses and exams and all that to start operating. We just got that a month ago. Got it.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay, so you guys are more focused.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So in premiums, my goal is to make a million dollars a month in premiums, which is basically what the amount that the clients pay to the insurance company. Okay.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats what Im saying. If its worth the time, then the thing that I like about here, its easy, sort of like, to make a schedule and to find a routine. So if its worth the time, I can look into it and I can do that. Yeah, definitely. It would be like a passive income kind of thing, right? Or is it? Well, do I have to do, like, in person classes?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"That would yield around 8%.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Awesome. I wonder if I could probably get it by email so I can take a look at it this evening.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"If thats okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, I have two agencies, but not in the US. This would be my first one here in the US. Weve done basically commercial insurance for a couple of companies here. And now were transitioning to personal line, which is going to be more like your everyday insurance for auto, home, those types.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, thats the plan that we created since last year.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, actually, I think it was like a week ago, somebody had told me that I should look into that because Im doing another license. And the person that actually teaches the course, he said thats something that he thought I would be good at is sort of just teaching people how to do something. He actually offered me to go to his company, and Im doing the license training with him. It could be something I can look.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, cool.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, I understand now.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thank you very much for reaching. I appreciate that. Okay. Have a good day. Thanks. Bye.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"It makes sense if you can send me information I can look at and you kind of do some numbers and see if it compensates. Between that time the agency started, we just hired five new agents, so time is constricted. But I work at night, and I work through the weekend, so its not a problem. If its something that I think is worth it, Ill make the time for it, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I think I might be interested maybe a month from now. Definitely seems like getting it started. And I think a month from now, once everything is going, I can make that time to create content and all that, which is interesting. I do like that. I understand if you have to create like, a whole platform. One of the mentors that Ive hired in the past is Grant Cardone. So Im thinking its something like that, like creating that type of well, Grant.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"That would be 80K, yes.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, I understand. So to create what are these called, these type of businesses?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Oh, hey Alex. How are you doing?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Thats my goal. Yeah. Im optimistic, but weve done it in other countries where insurance is not mandatory. Thats the benefit of the US. Is that its mandatory here to have insurance.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Morning. This is Gabriel.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Okay, cool. Ill review that this evening, and Ill text you then.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}}]