[{"pageContent":"Okay, what exactly are you selling then?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I dont exactly see it. Im searching. This might be wrong.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yes. 1 second. Im trying to figure out I was looking at a couple of different things. Could you give me a run through about what company was again?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"No, not clear everything all things considered, whats coming back in is about 22 to 26.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Branding services. More so, like advertisements, email, marketing, sitemap building for websites, UI designs, everything from not everything Im not going to say everything, but a good little bit. Dealing with brand identity, for the most part at a foundational level, marketing on a scale level, once they bring those type of fund, once thats for the most part, we havent really ran too much across marketing as a whole. The biggest deal I would say that I closed was about 32,000 on my end that I pulled in, but the deal I would say was probably worth about 280, but it was only more so through contracting real estate. So thats what I did on my own. But for the most part, I work with people that do it on a regular basis. So Im still in that learning phase, but Im trying to figure out how to implement artificial intelligence at the core level, what Im doing. So its already implemented.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im well, how about yourself?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Well, for the most part, thats where Ive been trying to figure out how to price at this point, Ive just been charging in between 300, $500 just on package deals based off of what we discussed, for the most part. But I feel like Im shorting myself, to be honest.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Due to having to outsource? A lot of stuff, man.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its kind of broad. What are you speaking of? In terms of.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"To be honest, I havent had one of those five figure months in probably about two years coming out of the pandemic.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay. Probably about 25.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I feel like theyre all over the place. Just me trying to maintain books for the most part. I feel like with some new methods being implemented, Ill be able to get a better handle on the books, to be able to figure out exactly whats being paid for that doesnt necessarily need to be paid for.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Does that sound like a robot? Hello?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"As far as profit? Id like to keep as much profit and I dont know exactly as far as whats the limit, as far as how much? And I want to cap that. But reasonably speaking, I would like to start with making I would want to replace my salaries for the most part. So I want to pull in personally, dont get me started six figures a month would be good for me. That would be great. That would be a wonderful lunch for me.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Okay. I just didnt want you to repeat yourself and what youre speaking about or whoever.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Of course.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Thats why they sent it to the dog on producer email. Okay, let me go to that Gmail right quick.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"I feel like thats the reason why Im not reaching too many clients, because I feel like they think its too affordable for what theyre asking for.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, maam.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Say again?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Packages as far as services I provide or.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay, so would you say that youre a real estate consultant?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Of course.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"All things considered? W two as well?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"For the most part, I can write them in within the state, like within the actual documentation and get it legitimized if they need to be on paperwork for that. Yeah, but upfront for the most part, its just been more so things like authorized cars and put me on lines of credit and stuff like that that theyve been doing for me. But as far as if its something that would need their information attached to it, then it would just be more so just me getting that done within the state. But its a possibility to have that done if needed, to answer your question.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Personal credit or business credit?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Oh, yes, I remember. I think I saw it on they saw it on Instagram and they just set it out.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Or a job that I could sit here and add within someone elses or whatever the case may be, as far as that bottom line is concerned.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"What would it need to be paid is a better question. Lets be as in May. Not April.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Want me to yes, they put the wrong one. Its support at Dhappyours Co. Thats why I was in the junk email the spam. The other folder main inbox.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"But I want to pull six figures off just my business so I dont have to work for no one else. Thats really what Im trying to do right now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"The three scores I checked that I want to say November, but experian updates my experience December. So Ive been trying to figure out different ways to actually put freezes on my credit for the most part. I dont know if those little things actually work or not, but Ive been trying to figure out different ways to sit here and try to secure funding, for the most part because theres some things that I would like to jump into if I could secure some funding, for the most part. Things like real estate, stuff like that. But thats neither here nor there. But Im just trying to figure out the way to sit here and work my business in a way that they can actually build it to become more profitable from a scalable aspect. Because if I need to get someone that has some decent credit involved and thats just more so I can get them on the phone while were having this conversation.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im sorry. Go ahead.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"WhoS calling?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Right. And thats the thing I didnt learn about credit until after college. So to test that to whoever is the fact that certain information, I believe needs to become more static, needs to be more upfront. I feel like that should be taught in high school. Thats neither here nor there either. But I feel like where Im at right now, I can get some things done, but with the credit, we can go ahead and get that involved. Is it something that we need to reschedule to have them on the line too, as well?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im sorry, I think this is my financial aid. 1 second.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Annual income about 112.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Id say about, all things considered, probably about 22 to 26, depending on if its a larger project or just more so a repeat customer or something like that, because the consultation is actually cost less just to maintain the account after the fact.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Yeah. I got to put this phone by the window, literally, just so I can have search as far as asking how much I want to put in. So I was saying that lets think of May more so not April. When would I be expected to pay?","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Yeah, for now. Thats why I said great lunch.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats why I feel like Im messing up.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Now as far as my personal, yeah, its a rebuild right now because I have a lot of student loans for the most part and a couple of cars that need to be paid from college for the most part. But as far as anyone that could sign for me, I have a couple of those.","metadata":{"fillerID":47,"fillerText":"Mhmm","category":"G"}},{"pageContent":"The best month Ive had is when I cleared 12,000.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]