[{"pageContent":"Five years.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah. Can you tell me your first name again?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"22,000 a year. So Im barely paying the bill. So thats what Im trying to know, how much your system is and how quickly I could get it up and going.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ideally, Id like to get something up and going and have several different income streams.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"That sounds good, but can you tell me the goal amount that I need to be striving for?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Jackson, okay. I want to write that in my notes.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, you said you promote high ticket.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right. So let me ask you this. After you get everything set up, are you paying for ads or how are you getting leads into the AI?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Well, Im a private money broker, so if I can get leads without me having to be more challenged about it right now, I can go to real estate meetings or send out flyers, talk to real estate agents, things like that. But if I can get some sort of a funnel set up, that would be kind of cool. And then I also can find overages in the county records and contact the people and help them go through the process of getting their money returned to them from the county. But that is something that it wouldnt be open to the whole public. I have to have some way for the claimants to call me back because a lot of times right now, theyre not answering my phone calls or my emails or my letters because theres so many scams out there now. Nobody believes me, I guess because I have a response yet.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay, how does that work?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, it seems pretty interesting. Everybody is talking about it these days, so I thought Id better get more information.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Ive looked at Internet marketing before and played around with a few things, but I always get hung up on the copywriting part of creating an ad.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, definitely. Because like I said, I got the LLC set up. I got my own checking account. Ive got all that and my 800 number, so Ive got all that ready to go. I think I have to apply for some small lines of credit, like its Staples or Office Depot or something perfect. And make some charges and then pay that off to get a present.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"That sounds awesome, Jackson. Thank you.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, Ive pretty much diminished all my savings. But my backup plan is I have created an LLC and I have a different entity number. And so Im starting to look at to build credit through that entity and I think I can get I havent started to do it yet because Id like to have at least one income, but I know Im talking in circles, but I got a lot of things going here in my mind. I found something that I could get into, like, $1,000 to build your own business credit. And if I can get, like, $50,000 on a credit card, then I could invest in this venture and then be able to pay it back pretty quickly, hopefully within six months.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, thats a good question because I feel like I study certain things like to do the private money brokering. I went through a short class and Im qualified to be able to look at the deal, but then afterwards to set up a website and all that that they had. It was like another $200 and flyers are more expensive. And right now Im on disability, so Im trying to get off a disability and make more money that I feel like I deserve. And Im getting better now. So Im looking for a vehicle to get me there. And Ive heard of sales and basically you look around to see whos having a big event and then you promote their event, is that correct?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I get a percentage of what we recover.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}}]