[{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"As I was saying, Im looking at it, but I havent made a decision as yet. One moment, because I was on another call.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Do you see that?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, I would agree. Id want her on the call.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right. Thats why we recently registered our US business to work on a business credit score. We have something now that were trying to build on to get a score going, because me and my partner, were both not actually US citizens. We are aware of how important credit is in general, even back home, and weve been working towards building that as quickly as we can.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Were in New York. Were both in New York.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, since she is the one that kind of suggested the administrative company, that would definitely if we do that role with her. But because I was already doing I have already had clients that I do acquisition management for, but I just wanted higher ticket items for high ticket clients for that. And I also wanted to because I did really good with, I guess you call it a closer at the time. We didnt call it being a closer when I was working with a university. And essentially what would happen if I get a student thats over $100,000 per year once a student enrolls in a program and then I get 5% to 10% off that, thats even a higher ticket. And thats just a starting point. Some programs all the way up to $200,000 per year, right? And of course with real estate, as an acquisition specialist, you also can make the same or more depending on the cost of the property. So it could be like higher, even higher tickets, more than just ten keepers per client. Because Im really like that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Or is that just.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"A hotel of my own.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, thats the thing though. Yes, I do have a Masters in Business Administration and I did focus on strategic marketing. Strategic negotiation. Sorry. And a bit of marketing. But since the whole event of AI online is a big boom of how fast the online marketing world has been, Ive not been in the drivers seat for a while. Ive been just more so going along with whats there because it changes so fast. And I dont know if its the age group because all my peers that we studied together and stuff weve been together feel the same way when it comes on to the marketing space. Even though thats what we majored in. So I have been in the classroom before, to be honest. I been presenting for years as well. Its a space that Im very familiar with. Is it where I really want to be? I dont know because I know a lot of people dont quote the sub programs now in front of the cameras and have these speaking engagements. And Ive been down that road before, just not here in the US. And its the area Im unsure if I want to go back down that road.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right, so I was just about to go into that. So currently Im doing a bit of real estate, and Im doing stock trading at the moment, but I havent really structured it in a way where Im still structuring internally at the moment. So its not a full work plan where Im already saying, okay, Im doing it now. Im taking on clients as yet, but its something Im going to be building towards. So thats hence the reason for the research, because I want to be able to stay in the know of whats happening with everything.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I like that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Going slow since I started where it hasnt been bad. I mean, Id love to have scaled it a little bit faster if possible. Thats just based on capital. I definitely scale if I needed to get more capital. But the return hasnt been bad, especially when you get into the spaces where youre like airbnb and stuff like that. Its just a matter of numbers at the sport, like, how many doors can I add? And the more doors I get to add, the closer I get. So thats the case though. But Im still open because I think its going at a good enough pace for what we can afford. But if theres something else that I could do to scale that up, why am I not going to explore that?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"This is what makes my job so.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"When Im there. The idea is to do some universities and work on getting another hospital or two there, because the people have a lot of limitations when it comes to access to health care, because they only have two hospitals in the whole island and theyre definitely in need of more university spaces that are not just Caribbean bees, but more international. Because I had the privilege of studying in England, not everybody got that. Which allows me the flexibility that I have now, being able to go places back and forth and doing whatever it is that I want to focus my time on. But I dont know if you know, but people in the Caribbean, when they get their degrees that are local, when they come abroad, its not recognized. These are things that and of course, just being exposed to other cultures, I feel like as a people, I feel like we could definitely do more in terms of giving back. And I dont see a lot of person we do have, like, Asapel and other big name Jamaicans that are out there that they havent really done a lot to give back to their people in whether it actually can impact the island. And its not a big island, so a little would go a long way, but Im like, okay, they dont do it. But once Im at that place, Im definitely giving back to my people, to my heritage, to where I came from. I dont have a big family myself, to be honest, but I do so more feel for the people that I grew up around. Im just looking at my country and saying, Id love to be able to do I dont want to just do for just myself and my family and were fine and thats done. I want to do something thats impactful for other kids, other generations. I could be gone 100 years and its probably going to still be there. Thats what I think.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, we can talk for a second. Go ahead.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Oh, thats kind of okay. All right. Im seeing what you guys are doing there. Yeah, its pretty straightforward.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, a couple of times.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Can close at least one up to five a week on the clients that you sell for high ticket sales.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, I got you.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"So we could show you how to.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Heres the thing.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Sounds good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"All right, so reason why Im shopping around? Well, not necessarily. As I mentioned to the guy that called me yesterday, I dont have an actual well, I do. In a sense, I kind of do, and not at the same time, but I dont really have a business that I can say use an AI for just yet. Im working on stuff at the moment, but in the meantime, I have worked as a team.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, if its required.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right, yeah. Its different from what you studied to what you even end up learning as you go to end up just pausing and watching the market as it just went on because it got crazy for quite a bit.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It sounds good so far.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Out something you would actually want to.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Shes just my high school friend.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I dont know.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"How does that sound? Yeah, I like that. That sounds pretty good. Great question. All right, so while were on the topic, I know you had put out the administrative marketing business, but I was wondering also because this is something Ive worked on in the past, do you do other industries? Like, do you have any form of business model that could perhaps work in real estate as it relates to instead of providing administrative services, I could also provide acquisition management services. So thats something Ive been looking at. Or maybe if they do services into recruiting students for a university, because Im really good at those as well, just to let you know. So those are things I was looking at, is there way I could scale doing that for others instead of working for a company doing it, but Im able to do that on my own. Thats another area that Im very passionate about that we could explore the same concept with.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Actually, its been going a little bit faster than to be honest.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im pretty straightforward on it, yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, I wont make no show. Its fine.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"No, I mean, just the typical ones that you see every day in terms of doing Google Ad works and all the online stuff that everybodys aware of how to basically just doing ads or whatever to get people in. So thats all I knew of.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Do you mind if I just ask.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Is that kind of what youre saying? Right, okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, thats definitely Ill make the time.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, I can.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Bank account or on a credit card? Yeah, thats 30,000 set aside in a bank account. Weve been trading it. Weve been trading it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"All right. Thank you for taking the time out. Have a good one.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Ready to take notes? Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Twelve noon.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Repeat what you just said a while ago.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"My card number.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"In order to do that, youd need my card number?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Oh, because Im wondering because I didnt know the number, and strange number kept calling, and when I answered, nobody was there, and it would stay on for, like, a minute. I was thinking its the same number. Im sorry.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Sure. Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Well, according to what Ive seen.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. Yes.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Hello? Yeah, sorry about that. Im just shopping around at the moment. I did see the case study, so Im going through it. So I did get that email.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Its going to show you how weve.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I have a ticket for like 30K.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. All right, bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats why Im Im already convinced yeah. Im already convinced that I definitely want to see and learn. Yes.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Ive been working doors since Im 19, so everything that I do kind of brings it back to the idea of owning. Because you grew up in the Caribbean, you grew up these hotels, but none of you owned by anybody local that was born there. So you kind of wanted to do that because its such a big its like one third of what makes the economy in Jamaica thrive. So you want to be that for your own people? Want to be that one person that has that five star hotel that have, like, 500, 800 rooms. And thats your legacy.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Id be open to okay, well.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"What do you think? How does that sound on that level then? Yeah, Id be open to that. To be honest, I have discussing that with colleague of mine something very similar. But the price tag that was looking at that she was confident with doing was not paying CM one, you dont.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. 90 minutes.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I go on combs. I was born in the Caribbean. Im here, but I go on comb.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, Ive done 100 calls a day before in my past experience thats as a marketing manager in Nevada, not even as a call center ripper or anything. Thats just because my business was in education back home. And so you couldnt help but having to speak to at least 100 people right here.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"At the end of the day, though.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"How are you surprising? Im doing real estate investing, but Im not doing it in the US. As of right now, Im doing it in the Caribbean.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, thats correct.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Making to be able to start getting closer to that? I need to be making anywhere from 3 million per year up to anywhere over. That is 3 million or more per year actually gets you on a trajectory because you can use the 3 million to leverage your way up. So its a matter of investing more in real estate, doing higher count or stock trading. So you get a larger pull down. And then once you scale everything up in terms of youre doing it for other people and youre scaling all that up, then that puts you in having a larger sum accumulated. And from there, I know Ive been researching and organizing and planning who we go to for what loads do, construction here and there. I do have a solid plan. I just know Im taking step by step. And I know in going through that whole plan, AI and whatever else comes into the mix has to be included. We have to learn it and eventually figure out how tied that into whatever the hell it is that were doing. So thats where I am. I saw something. I am good on it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. All right. I dont know. That okay.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Ill definitely follow up.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Exactly, yes. I like that.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, we had that discussion. Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"You want to be opposed to it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]