[{"pageContent":"Hey. Sorry, whos this?","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And is that profit?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, we do.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thats just what weve run the numbers to, but I mean, it should get way bigger than that. And were in the middle right now of raising more investor money and so were just kind of bouncing available capital and what we think we can accomplish. But I do really think its going to be way bigger than that, but you never know until you get there.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, so its kind of just with Airbnb, obviously you have your listings, they drive traffic, people are looking for a vacation and they sign up and book. And then we try and capture emails and get them to communicate with us so we can build our own list as well. And then as far as the wedding venues go, weve tried running some different ads. It was just boosted posts on instagram, and we got a decent response, but weve still been kind of working through the process of once the leads message in communicating with them and converting them, but right now its just done via chat. Or if we can get them onto a call, then we will show them the venue and just kind of like build the relationship that way. Usually thats like a video tour and stuff like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I think its just new. I mean, were testing were a newer business, so we have a nice plot of land with a lot of different ways to potentially monetize it. And Weddings was one offering, and then being kind of a glamping vacation spot is a different product offering. And scaling up the wedding thing has seemed a little bit easier for us than the glamping thing, and weve just kind of figured this out. So were kind of trying to double down on weddings, but we have our first wedding that were fulfilling coming up here. And then once we kind of have the experience of doing one, we think that we can improve all of our stuff and land a bunch more. But were basically got to have the event, take pictures, update all of our sites with this stuff, and itll look a lot better once we actually have one and have photo proof of it all.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hey. This is Alex.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"It no, Hawaii is way better. I can tell you that. Okay, Alex, I look forward to speaking to you on Monday.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay. And then you said youre still creating, you said the driving traffic for the Glamping.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Honestly, I just saw an ad for it, and the branding and stuff looked good, so I was like, oh, what is this? Seems kind of cool.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, for sure. Okay. And you did say you have a business partner.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I dont know if I did. I didnt get to watch it yet.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"And what packages and pricing, that kind of stuff. What does that look like for you guys?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I feel like these are just all the verification questions to see if I could pay as a customer, but I make like $150,000 a year that I take home right now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I have a couple of different things. I am a business coach for a company called Two X. And so we at Two X have a high ticket offer. Im just part of the fulfillment for it. I had a software company that I sold and I am working on also driving traffic to. Its like a glamping resort that Im a partner on. Yeah, I dont know if Air would be good for that or if its mostly for the high ticket space, but yeah, thats why I was kind of interested in it because it just seemed kind of cool. But I am not exactly sure where Id use it yet.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. And do you currently have any monthly revenue for the Clamping business?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Thats true. Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Definitely. Okay, so what would your goal be for the business overall and how much would you want to be making a.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im in meetings all morning coaching people. But if you were to call back around this time, then it should be fine.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Sorry. Good. McKenzie with who?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Were super hosts on Airbnb, so we have a pretty good rank and Airbnb drives a decent amount of traffic, and then we have outreach stuff going out to wedding planners and getting them to refer us as a venue. And its going pretty decent, but if we had a good way to scale that up, it would make it go faster for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, air. AI. Nice. Cool. All. Im good. How are you?","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"I havent really looked recently, but mines good. Like probably, I dont know, in 740 or something like that.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im not really sure. Its not necessarily consistent enough yet to say. I know last month we had 15 leads come in for the wedding thing, but my brother talked with them. I dont know how many converted, but I do know that our current revenue is at around 20,000 a month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I guess Im just kind of confused. I appreciate you having this conversation and all, but what is it that you guys actually sell? How does it work? Could you maybe just send me that kind of stuff?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yes, youre 100% right. Weddings are expensive. Dang.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"I feel like when it comes to marketing stuff, its kind of like you of course would spend as much as you as is profitable. So I have reserves of whatever I would need pretty much to spend. I just would not want to waste it on something that doesnt work.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I mean, I dont know, are you looking at like a total amount or a monthly amount? I mean, I think for the Glamping business, if we could get good results with something starting smaller, like maybe 5000 a month or something, thatd be awesome.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"All right, well, I guess Im interested to see it. Im a little bit skeptical, but I would definitely be open to hearing more.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And is there a certain reason why you guys chose $2 million a year?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, perfect. Well, so plan on me calling probably Monday around this time. Where are you at exactly? Whats your time zone?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Im in Kansas City.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Okay. What would be the benefit of that conversation, if you dont mind me asking?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, thanks. Is the whole Air thing legit? I kind of got a little skeptical once I logged in because it seemed like it was like a click funnels, and then the kids was, like, super young, and I was just not sure.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Yeah, that ones fine.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"But Im really sorry. Im running out of time.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Okay, so lets go back to the first business. Okay. I dont want to confuse you. So in terms of your first business, where would you say your currently monthly revenue is?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Hawaii? Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"How do you feel about the profit margins overall right now?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]