[{"pageContent":"Call me Will. For sure. Thanks.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Bill because I really dont have any. I had family. My mom and my stepdad both died in 2009 and eleven. I have a father and a stepmother that we dont see eye to eye because of religious reasons. And I dont have family. The only family I have is my son and my daughter. Im still cool with my childrens, mom, my ex wife, but thats really the extent of my family. If Im talking to family. Other than that, its my father whos really chastising me or whatever. Hes a big Sunday church goer into the Christian religion, which, hey, thats fine if thats what you want to do, but you raised me in the church and had me believing in Santa Claus and the Easter Bunny and Jesus, and I dont want to offend you, but Im just not into that. I believe in other things.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"All right. Thats what am I going to need? What kind of money am I going to need to get started?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I really go by will.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"ThatS it. So, yeah, family is a big deal to me because I used to have it abundantly and now I have none.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Shit. I cant really do anything but pay my bills and help my daughter out, and I get by. I dont ever run out of money, but I dont ever save money either. Every time I save something, something happens, and its coughed up before my license got suspended in 2019. Im just now getting my license back. Im 52 years old, and I have to catch rides to work and order Ubers and Lyfts. And my lifes not the way I want it to be. And really, guess what? The only thing thats going to solve those problems is you.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"What did I say? Aspiring Major League Baseball umpire. I started, umpiring was it 2001? I never umpired before I played baseball and I went to umpire school right off. Rip excuse me? I did one game where I made no friends. People were pissed at me because I got stuck out on the field and didnt really know my responsibilities as an umpire. I knew the game as a catcher and a player, but theres a lot of responsibilities as a baseball umpire, so nevertheless, I went to school.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right back to where you want to.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Absolutely. If you guys are going to give me a widget and something to market and sell thats going to make me money, Im all about your widget. And I know its not a widget. I understand it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Good deal, man. Im good. How are you?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I just got an update that is.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I dont believe I did. If I did, I didnt see it. Im a longshoreman. I work on ships at Port Manatees, so my schedule is kind of hectic and my rest is pretty much demanding that I rest, too. Yeah, Im working with Chad GPT four right now and Im working on a website. Its just nothing to talk about yet. And I liked what you guys are doing. I looked into you a little bit, but Im not really clear on what you do. So talk to me. Yeah, go ahead.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I just heard it come in. Yeah, it just came in.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"I lost it. I got fired for my DUI. September 2019. Another company. And its been a very eye opening experience since really since 2012 when I came back to Florida from Arizona and grabbed a felony for my own prescription medicine. It was just being carried in the wrong way. Its pretty shame. Its pretty shame that theres not a disclaimer on those keypad barrels that they sell at the prescription pickup window to say, hey, you know, you better not put this in here without having your paper torn off and slid inside. Its just amazing. Yeah, okay. I dont think people have a lot of bread that are in trouble that are going through it. I could be wrong. I mean, I suppose that people with a big bank account have problems, but I never did, you know what Im saying? Life was grand. I had money to do anything I wanted to do. We didnt have budget on our vocabulary, and life was good. What would you have in mind? Im a smart guy. I can do any kind of coaching and talk to the ears off.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Click funnels.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Go ahead.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Got you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Or was it your chat bot?","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay, so lets do this. Lets do this. Send me the case studies and everything. Ill start saying no to my children a little bit more when they need that money. Okay. And within no time at all, really, I dont spend money, sir. I go to work, I come home. I can literally like if weve got three days off, I wont walk out the door for three days. For what? I got Walmart and Amazon to bring me my things and I just work and relax. I dont spend money. I dont have a social life. And money can grow. Money can grow for me pretty quick. As long as were getting our overtime, Im getting those 1000 plus take home paychecks and my kids arent beating me up. And really all I got to do is not share with them how Im working all kinds of hours. Theyre pretty 27 year old son and a 22 year old daughter with my grandson is four. So Ive been supporting my daughter and my grandson really for several years. And theres no dad in the picture. His mom calls me dad. My daughter calls me dad. He thinks Im his dad too because I dont think he really understands. Anyway, I would like to look over your case studies and get excited about it and make that happen. And I would say we have to revisit in 30 days, man. Hopefully its not 60.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay. Family reunions are hard to do, hard to get everybody together. Everybody dreams of having that big family reunion photo like Ive got from when I was maybe 13 years old at Great Grandma and Grandpa Rileys house. There was 40 of us there, maybe 50 even. And its just something that it cant really be done, but with AI, it can be online family reunion kind of thing. And then a photo thats going to take everybody out, their background out, and put it all together and make it look like everybodys together at the same time and Grandma and Grandpas backyard, so thats kind of where its at.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Likewise. Have a good night. Great weekend.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"If youre talking about some sort of coaching for life experience, people who are going through that kind of shit unfortunately dont have any bread. September 2019, I get off work. We did a 26 hours shift. On my way home I bought some wow, I cant remember what its called. Its the cinnamon whiskey fireball. Got home, took a shower and everything and consumed. After I woke up from sleeping, I consumed two of those little small fireball shots, got on my motorcycle, ran to the store because it was almost eleven and I had a female over. And on my way back I got pulled over. I was fine when I got pulled over, I was not operating intoxicated, but ended up with the tragedy of my first and only ever DUI. I wont ever get another one and shouldnt have got that one. So I was in a DUI school where I was the teachers assistant by volunteer and there was 40 people in that room. And Ill give you a quick example. The question was, how much has this whole DUI thing cost? Court costs, attorneys fees, misfortune, whatever, how much it costs, right? And the answers were anywhere from really like $400 on the low end to $5,000 on the high end. And then when it got to me, when it got to me, I said, Im going to pass. Lets get the rest of you guys, because I was like in the middle of the room, back of the room. Theres probably twelve other people after me. So then we came back to me at the end. I said, I dont think you all are thinking of the big picture here. My expense for this thing is a million dollars. Ive lost so much and I lost credibility. I was just weeks away from being a crane operator. Right now we make a $40 an hour, 70 hours a week, bringing home 3000 gross pay a week.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"We havent. No, I dont believe we have. But we went back and forth on.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, my effort. But money. I mean, I need money in order to make all this happen. And its been a slow year. I got real accustomed to making my take home pay was 1112 and $1,300 a week. And man, I dont know. Im very lucky. Weve got a 40 hours minimum pay. We still get more than 40 hours and make overtime. But if we have a week, thats bad, 19 and a half hours, for example, we still get paid for 40. Ive had too many of those $692 deposits this year. Its not for me. I love my job. And if I won the lottery or if I have a business that takes off and Ive got a million dollars in the bank, Im still going to work at Fort Manatee. Its something I love to do. Okay. But I want more money in my life. I want it to be like it used to be.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, that sounds good.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, Florida.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"I am just putting the website together. I dont know if I should really tell you all about it right now, you know what Im saying? Its in its infancy stage. But Ill give you a little bit. Why not? Wheres my do not?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, I want to say something for you. In 2007, probably, maybe even a little earlier, I started working with a company called E Boulevard. Its the same thing as our ability to share screens and take people through a webinar demo. And I did a webinar Tuesday, Wednesday, and Thursday. I had sales reps that went out and talked to people on the phone, and just all they had to do was invite them to a Tuesday, Wednesday, Thursday webinar. Right. Whichever one they wanted to go to. And I would demo the product and say all the right things and bring in thousands of dollars every Tuesday, Wednesday, and Thursday. So Im good at selling. Im very persuasive, or at least I used to be. And its definitely something I can do. So what kind of options do you have other than helping people who are getting shit on in their life?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Funnels? Click what? Click Funnels.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Exactly. But we also are just stepping into our busy season. This is when I started last year. This, by the way, is the same company that I worked for in 2019 when I lost my job, but they branched off of they worked with Federal Marine Terminal, and they branched off and did World Direct Shipping.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, remember I said that my total investments right now are just about $1,000. However, the gentleman, father and son who owned the biggest farmers market in Georgia, its the farmers market in the cow county owned this company I work for at Port Manatee called World Direct Shipping, where they have grown the numbers at Port Manatee exponentially. Weve got new warehouses being built, a train track coming through to send produce that we get from Mexico out to Philadelphia. Its just amazing what theyve done. And they grew even during COVID-19. Those guys. If I have something thats a makes sense money making situation, I think that they believe in me enough as one of their charter employees that they would invest. So Ill say that I can get a couple of DUI got in September 2019, I ended up having to go to jail for that. For how long was it? 30 days. 30 days in jail? 29 days, actually. And when I got out the jail right there at the port, I went straight to work. Right. Those guys paid me. I got payroll the next day. And it wasnt a loan or in advance or anything. It was just, hey, we believe in you. And here you go. Heres a full paycheck. So theyre good guys. I think I can get $2,000. Really? If its something thats real, that they think that they can get their money back with a little return on investment or just see me shine, you know what I mean? Like, theyre good guys, right?","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"I got almost 63,000 for last year.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, I wish I could say I have a great son and daughter, but theyre not great. Theyre great because theyre my son and daughter, but theyre going through their own personal business in life. We were very wealthy family. We lived in a mansion in Seaside Sanctuary. It was 5600 sqft. Its worth 2.7 million now. Short sale it for 550 and eleven. And life took a terrible turn when the real estate bubble hit. I owned Help Me Sell.com in Americas Listing Service and made money hand over fist. I made as much in a week sometimes as I do in a year right now. And its a culture shock for sure to go from that kind of abundance to being an aspiring Major League Baseball umpire making a grand a week.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Again, the difference between number one and.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay. Sounds. Like a good idea. Lets talk on Monday.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"What kind of investment? Go ahead. Im sorry. Carry on. Im sorry.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Man, you know what? I am probably about to spend it all on a computer. Yeah, I dont have a lot, but.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I want to see your case study.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Noon is good. Its not interrupting a lunchtime for you.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"If Im excited about it, Ill talk to them. Ive got both of their phone numbers. Its like that. Lets do this. I tell you this though. I started work last night at midnight. You just caught me coming in the door getting ready to take a shower. I think after I take my shower, Im going to soak in a little bit of Epsom salt for 15 minutes and I think Im going to crash because Ive got work again tomorrow. Okay. Im going to look over this probably when I wake up. Im in a position at work where I have a lot of downtime and matter of fact, I do a lot of the stuff Ive done on my website at work as a header on the ship. Theres times where I have 2 hours where Im not needed. Im just hanging out.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"An extra $100,000 would be great. That would solve all my problems, put me back in the investing mode. My investments right now is over $1,000. You feel me? Its not pretty.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Yeah. Why dont we do this lets tentatively plan for around noontime on Tuesday. Okay.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"There you go. Okay. Yeah, sounds like a plan. I will schedule it in my phone right now. Ill talk to you Tuesday at noon. Cool.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"You know what? Let me send you a message on that because Im going to open up my marine tracker application that tracks my three ships that I work coming back and forth Mexico. So I think that Im probably going to have after we do the queen b two we just sent off the queen b three. Queen b one we just sent off. I think Im going to probably have two days, maybe three days off after I finish tomorrow night after we finish the ship. So I will probably have Sunday money Tuesday off. Thats my guess. Okay.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Negative. Im a longshoreman right now. In 2012, I actually quit Umpiring. And yeah, Ive had a rough life myself. In 2012. I came back to Florida, I wrecked a motorcycle, and then I got caught with my own prescription medicine in those key fob barrels and became a felony. Very interesting.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Its not good.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}}]