[{"pageContent":"Okay, got you. And how long have you been doing this? How long have you had an agency up?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"15. Like a Fortune 500 company or something.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, got it. And with the current packages and services, have you considered doing a high ticket offer? I know youve got the website, which would be from a pricing perspective in that category, but have you considered something like a coaching type offer or consulting type offer? That would be something over like 3000.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, my close rate is pretty high. Like this month is 100%. Typically its maybe around 60% close rate. So yeah, once I get someone on the call, I can close them. Im pretty experienced in marketing. Yeah, I would say if I answer.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"My personal or my business? I dont know. My business.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"It is for this week, I think its $200 a week. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, Im assuming once I get to larger numbers that will increase by the moment. Theyre small numbers, so people are typically the business owners are talking to me.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hey, good. How are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"It would allow me to maybe get an office and get some more employees to grow. Right now Im a freelancer to grow that into an actual company. So I guess that would be why I would want to get there.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, Ill be there. No worries about that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, its referrals and Yelp ads and Facebook ads, and then I pay. Like, in the beginning it was just clients just telling other businesses about me, which allowed me to get to a point where I was able to pay ads and profit. And then I started entering into ads, and then now I pay clients discount on their current bill if they provide me X amount of revenue. So, like referral process with current clients too.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Of these businesses.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im looking, and I do not see it yet.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Lead gen, obviously. Yeah, lead gen.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"That 03:00 p.m.. Can we do Monday? Since tomorrow is like Saturday?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"0%. Theyre all pretty quick. Theyre ones scheduling the call, all that.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, and then I just squeeze those into wherever I have time.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Calls yourself, assuming yeah, I have no sales, Im doing the sales process completely.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Mmhmm. Yeah, I am. I currently have a digital agency that provides web design, SEO, and paid advertisement campaign management. And Im just looking to scale, and I just saw an Instagram ad, so might as well check it out.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, cool. Awesome. Out of that, almost 30K. Well just call it sake of this. What would you say is profit? Do you know your profit margin?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I do not have those numbers on me right now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah. So I have two SEO packages. Ones 1201 is 1500, and that will consist of on and off page SEO and improving their credibility. Online. Targets 15 keywords for the smaller package and 30 keywords for the larger package. And that includes three content pieces. So that can be blogs or infographics or videos a month with that smaller package, and then five for the larger package. Thats SEO ads is anywhere like, startup costs can determine on what the size of the project is. Typically its around the $700 to $1,500 range for startup, and then its 15% to 20% management fee of the ad budget.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, Ill be there.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, Id say about 60% is typical months, but this month just happens to be a pretty good one.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, Im an individual. I have, like, an assistant.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, I mean, my girlfriend did a trip up to Bam, so we just did a road trip up.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Sure, yeah. Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Next one yeah, 50.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, that makes sense. So out of these different packages and services that you just mentioned, so the SEO, the ads, and the website, what would you say is your top selling package right now? What are you doing the most of?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, Im open to new ideas. What would that cost if they were to want if we were to move forward with that after that call? Great question.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Like five to eight. Not much.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay. Yeah. Duncan High School.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, its growing. I mean, Im getting like five, six new clients a month. Okay. So everythings kind of working well, I guess just looking like Ive just started doing ads, which has increased that growth, and then spend $20 per lead for a Facebook ad right now. But Im just looking to optimize that and scale significantly more, maybe because Im ready to go as large as I can go. For the last two years, Ive been really drilling down on SOPs and standard processes of the business so that I can do that. Just looking to see if theres an expertise. I saw the ad.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, I do not.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yelp has been doing amazing. Thats getting me like four clients, probably. I just started Facebook like last week and Ive gotten one or a couple of days ago and Ive gotten one high tick, like 110 thousand profit or revenue client from it. So, I mean, Facebook may become the best one.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Like 700 or something a month.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Hello? This is Austin. Hello?","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Im doing them myself, yeah, thats what I do for other people too, so I hope Im good at marketing myself.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Nice. Yeah, I just drove through there like last year. Last summer? Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"One dream employee, it would probably be to handle the day to day and focus in on whatever clients need at the moment. Like current clients probably take on any new requests and then be able to do those requests because thats like my biggest time constraint.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, definitely will do. I havent received any emails from you guys, from you still. Im just making sure that we do get that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, Ill spend this weekend to watch it. Awesome.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yes, well do. Yeah, got it.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yes. Like I said, I do web design for clients. Theres no particular market, but Im starting to focus on the service industry because it seems to be a good niche. Its competitive, but its a good niche and provide ads and SEO for them. And Im more of a marketing partner, I guess. Im very flexible with them where they can come up with a problem and I come up with a solution. So whatever on top of those three items they need, I can also do in the marketing space or business development.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Got it. Okay, cool. Well, with what you currently have going on to the agency in the different packages, thats definitely something that we can support. And then as far as potentially creating a higher ticket offer is like a consulting package, absolutely something that we have the blueprint for and can help you develop. The other thing with that is its just a matter of getting that in front of the right potential clients and leads that actually would have the qualification to be able to support that. But again, thats something that we can kind of dive into a bit later or a bit further along for now. Where would you say your business is currently at in terms of monthly revenue?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Newport.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Thats it.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"No. Just what does it cost? I guess? Is that training or that video free and then what resources come with that.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Austin Simpkins.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Got it. Okay, cool. Im sorry about that. And if it doesnt come through, whats your email that I could contact you at just to make sure I get that.","metadata":{"fillerID":39,"fillerText":"Yeah","category":"F"}},{"pageContent":"Yeah, I mean, I wont be able to do what Im doing now at that level, probably. So understanding how to handle it as we go.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I would be interested in that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Nothing, I guess. But its just a goal.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah. S-I-M-P-K-I-N-S.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"So at least about a 50%.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I mean, just the basic growth strategy, I guess, like how to grow your business internally to handle that amount of work, I guess would be the constraint and the biggest learning curve for myself.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sounds good, I appreciate it, thank you. Awesome.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Thats growing. But right now lets just say its 30. 40.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, cool, right on.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Right? Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"You too, bye.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, its amazing.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Whatever needs to be done. Im doing a lot of the marketing and stuff for my own customers. The SEO, I have some of it outsourced and then web design I can outsource as well on some websites when Im overloaded. But I guess the start of it is take any set up any meetings with current clients and handle their information and what they want to talk about. Make that and build that. Assign the tasks to my assistant and then check up on the SEO ads and process the development of websites.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Pacific.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Are.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I dont think so. Not really. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah. And then the website is Im flexible with that. Typically its around $3,000 for a small website and can range up to 15 for a larger one.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Very rarely. Like I said, I was flexible. I try to build a plan around each individual based on what their needs are. So typically Im running out my own so Im able to customize a package to fit their budget.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Where are you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay, awesome. And you said this is currently growing month after month, or have you kind of been stuck at that 27, 28,000 for a bit?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"200. But for instance, a couple of months ago, my goal was 20 or it was 15. Then it was 20, and now its 50. So just like, continuously growing, but just putting the processes in place to optimize. That.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Its 1919.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"I just got my assistant recently, so maybe a month or a month and a half in with that. And I was looking working long hours previously, and then when I was able to offset those hours, those tedious tasks to my assistant, I was able to gain my time back. So now Im working like a healthy amount of hours maybe. Okay. Yeah.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I just opened up a credit card for my business. The credit limit, I dont know the credit score, I dont know, but its a decent amount of credit limit. And then my credit score for personal is in 730 or something.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, its been a few days, so Im going to let it go for the rest of the month and then assess and decide, maybe remove yelp and put that budget into Facebook, if that works.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]