[{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, so theres like, an entire discovery call, things like that, really understand all their problems, pain points where they want to go.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I mean, it takes a minimum of $40,000 a year to hire somebody.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So the beginning goal is like 1015 thousand and then ultimately a million dollar company or multimillion.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Whats on the low end?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"It yeah, absolutely.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Ive had clients before. They come and go. Sometimes clients only need you for one period of time. Sometimes you dont get a client all month, but like the next month you get two or three clients. It really sometimes varies, man.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Between? Id say between $50 to $80,000 a year.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im only wearing two hats? For example, I technically run my consulting business, but I do have people on the back end that help out with clients. Client acquisition and client care, customer service.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, so you bring up one thing as well. Just like, from the prices of two K all the way up to $150,000. What do you guys want to be making per month on revenue wise?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I have a full legal team thats at my back and call. I have probably about between five to twelve people I can trust.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont. I think I was at like 710, I think.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah. And you guys are that consulting bridging the gap between their actual business and then the legality behind everything of what actually needs to take place.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes. I have a degree in strategic communications and digital media, so I can work my way around advertising marketing, especially on the social media ends of things, and even to affiliate, affiliate marketing, email marketing. Im very well rounded in that kind of thing. So thats also a method that I use. But my number one successful. Im most successful in my word to mouth within my network. So Ive gone to various networking events, connected with a bunch of industry leaders and industry people involved in the industry. Through that, Ive been able to allocate some clients that way, and thats been proven the most successful.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"A couple of months ago.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Im not really doing too much at the moment. And so Im trying to find ways where I could conserve my energy as well as increase sales and increase clients. Im not trying to do a lot of traveling. Im in the process of growing my team, and even my team, they have their specialties, and you can have a jack of all trades, but if you dont master any of them, youre not going to get anywhere. So I like to get individuals who are focused on one thing, and they can help with that one thing, and they can put their all into it. But in regards to getting clients, I feel that the more I focus on getting clients, the more time I waste instead of putting that with other clients and making my other clients already feel comfortable. So appointment setters was an option for me to be able to branch out and see if I can know, raise some capital that way, because this is not my only business endeavor at the moment. Im working on actually a megaproject, which is an international concept that Im working on. Im trying to bootstrap right now funding through clients and through my services to be able to help me fund for future endeavors.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I think that should be it. Ill give the case study a watch and well go from there.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thats the thing, right? The liquid capital is insignificant. I was in a little bit of a better position about six months ago, eight months ago, but I took a trip. I went to six different countries in the Middle East, trying to develop the connections that I need for my mega project. Were trying to put together an entire ecocity. So I flew to six different countries in the Middle East. I was in Dubai for three days. I was in Egypt, Jordan, Turkey, Saudi Arabia, Israel, Palestine, and all just trying to connect and see whats going on. But when I came back, I actually lost four of my clients, four of my high ticket clients, which was unfortunate, but a very good learning experience.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah. I guess Ill get a better understanding of what you guys really do through this case study.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Only two, man.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Lets see here. I did not.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Awesome to breathe.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Okay. I know it definitely probably ranges depending on what services youre offering for the company, but whats, like, your ranges for prices that you offer.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, I actually just started my consulting business, so it hasnt been really too long. This is my third time going and starting a business over the past three years. And through the knowledge that Ive gained throughout the industry, Ive decided to go through as a consultant to help other people grow within the industry instead of starting my own operation.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"When did you guys start helping larger companies or getting out there?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"What do you guys do, if you dont mind me asking? Can you give me a rundown?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"So the focus in the beginning wasnt necessarily to create that system. The goal in the beginning was to create the network, to be able to create the system.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, awesome.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"And are you guys based in the US?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"All right, I understand, trust me. Especially with high ticket clients, $30,000 isnt nothing. Especially when you can get a client that pays $150,000.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. And when did you guys start being more prominent, if you dont mind me asking.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No worries. So two clients right now. Whats, like the range of what you guys are doing per month? That really isnt a specific number, like a Social Security number to where we can go out and do things with it. Its literally just to get more context on where youre at right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"What was the question again?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Im doing well. Whos this again?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"People that are working with me. I currently dont have the funding to hire that many people.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah. When did they legalize cannabis in New York?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"This is real person, Tyler Freeman. You can look me up on social media and things like that. Real person.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Roughly about a year and a half, give or take.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Because Im also just one human being. I also have a fairly large family. Im in a religious month right now. We dont eat throughout the day. Youre probably familiar. Its the month of Ramadan right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And do you guys give guarantees?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Tyler.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im not going to give you an exact number, but my two clients, the one I helped develop their business plan, and Im currently creating them a website so that range under five K. And theres another company that I am currently setting up licensing structure. And sorry, I got a very important text message. My second client is literally in the startup stage, in the seed stage versus my second client, they are already acquired licenses. They are just looking for funding that I will be brokering through an investor that I have. So it really will depend on the percentage of what Ill get from the broker as a broker.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Wait, can you say that again?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"So basically everything from A to Z when it comes to running that type of business, yes.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"What are you guys doing revenue right now.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I was thinking most clients pertain to my company. Theyre mostly in that high ticket category. So Ive been kind of looking for appointment setters and also a couple of different Im trying to take a couple of different avenues to try and increase the number of clients through business. I know that a lot. Theres the opportunity for setters to also make commissions based on the clients that they bring into the business. So thats kind of where that came in. Air AI. I was maybe thinking about possibly utilizing what they had going on, but I still wanted to look into things and make sure that I was comfortable doing so before going forward with everything.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, itll probably tell me in the case study, but what is your charge to the coaches or consultants?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}}]