[{"pageContent":"My annual income? With this job in my own business right now, its probably about 200.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I have a consulting business, and I consult on everything, whether its the finances, whether its business credit, whether its personal credit, whether its purchasing the home. My business can sort on every topic that it is.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Email me. Whatever it is that they need for me, whether its asking questions, whatever.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I did.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"My price point is 1200. A package.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Um, my business so far is based on word of mouth, and thats how Ive been getting a lot of customers from the experience, from my other customers.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"More time.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay, Im sorry about that. Somebody walked in my office.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"The solitude for me.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Its me getting on a plane, going to get my hair done. Got you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Again? Like I was saying how people just want to make things personal, and when you just get to a certain point where its like people dont understand the questions that youre asking them, they go left with it. So what I mean by me having my solitude, Im peaceful, you know what Im saying? But at the same token, I still got that business mold, and sometimes can I go back and work for myself full time? Sure, I can. I can do that. But at the moment, until I can get myself repositioned with what I got going on as far as my own business and automating my system or getting some help, Im going to continue to do what I do until then because I have had events reaching out to women to come. Lets help. Lets do this. Because the initial plan that I had and I still do have it for what I does, I could make $10,000 a day.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No. Do you have anything for Monday tomorrow? Im beginning ready to go to a concert.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yes. One of my skills that I always tell individuals, because sometimes people seem like their customers are always right, and thats not true, but I teach them how to deal with those type of people when they are rendering service. I want individuals to keep that in mind. Also, when youre hiring people and you have people on your team because you have grown, you got to treat these people with utmost respect because theyre helping you take the next level into your life.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Humanity. Humanity will be on the top of the list.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Because of the overwhelming of people and theyre making it personal, I kind of, like, scale back. And so I work for an international company, and it doesnt bother me to come to work and do my job because Im in my own office by myself. Im a great access to the company, and at the same time, I still run my business. I take calls. I still set up appointments. I still do the things that I do, but I just dont do as much of it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, but let me just say its the solitude.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, 30,000 a month, a week, or whatever. So when Im vacation, I dont want to be restricted. I like to go on cruises when I get off and we dock, I like to shop. Thats just one of my goals. But maintaining, again, maintaining my business as my passion and continue to help people grow.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I do a lot of online I mean, I do a lot of in person business because for me personally, I hate when I have to call into a company and you got to talk to a robot. We have gotten away from the tradition. I know they say you cant be comfortable, but its annoying for me. So if I know if its annoying for me, Im not going to put you in that position so you can be annoyed.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Im good, and yourself?","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"That would be better for me. At one point in my life, I taught myself to pay my bills up for a year in advance? Well, lets just say I had a sickness and it caused for me not to be able to walk. It caused for me I couldnt work. It was to the point where I couldnt sit down. I couldnt do what I needed to do. And so when that took place, I got off track where Im not now paying my bills in a year in advance, and that will put me back in advantage of my bills being paid up for one year. So $2,000 on the utilities, $2,000 on the cell phone bills, just necessities or whatever, and I would just do my thing.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Because Im busy. Im a very busy individual, and people dont want to work anymore. So I just need something to help me go forward in my business. Im a very busy person.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, right now, yes, thats where I stand it. And as time progresses on, I will revamp and look at things and say, okay, where I need to go, grow a little bit more, so on and so forth. So, yes, right now, that is my ultimate goal, to have 30K addition to what Im already doing a month. Because Im the individual where I know working from home is good, but I like to go to office. Thats why I say the money, as far as the money part of it and what I like to do, the additional amount before I would even go on these vacations or whatever, I will make sure everything that I need to make sure my business is continue to be successful or more successful than what it is. I will have a lot of things put in place. A lot.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"To invest in growing my business right now, I literally would need probably about 190 to put everything in place.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, so what I normally do, I will have events promoting my business. Hold on 1 second. 1 second. Come on.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Around 7000 a month, the extra money, the money that Im making, the reason why I said 7000 is because I have a college student in school, so I had to set aside for that. So the 7000 is really after the fact that I have really taken care of all of his needs because hes going to be a doctor. So of course I got to make sure that hes in position to do what he needs to do without any issues. So we dont have financial aid, so I pay for that out of my pocket every month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Lets see. I probably would do 20 appointments a day. Lets just say when I started my business, in the beginning, I would go into my office at 06:30 A.m., and I will see my first client at 730, and I will leave the office probably at 02:00 A.m.. Wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Well, if Im consulting with the business and Im helping them with their business, as far as business credit, whatever is pertaining to their business, thats usually the 1200 is usually good for a year.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I did.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes. My financial target to be able to do 15 trips a year, I can honestly say the first seven of those trips would be just me by myself or me and my significant other. And the other include family, and I want them to be able to do whatever. I dont want them to be restricted of anything. So my target goal is vacationing. A good 30,000.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"That for thats one flat fee.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"At this moment, Im probably doing about 7000 a month.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"How you could build your business. Credit bulletproof to get ready for funding.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"The first thing is the phone. I dont like talking on the telephone, I can tell you that. I like to be transparent. I do not like talking on the telephone. That would be the one thing to help me articulate the phone the second thing is Im a very organized person, so I dont have an issue with that. Just the telephone also bringing me ideas of what we can do, what we can do next. Again, Im never going to get away from their hands on because I like that. I really do like that part of the process.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Let me just say this. I know at some point its going to be needed. Thats what I can tell you. From what I read and what I educate myself on, I know at some point its going to be a needed thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats one of my goals. And my ultimate goal is to educate and knowledge companies, individuals, about their business, about themselves or whatever theyre looking for. Because of how I was raised, I always know two things. One, we dont know what went on in somebodys household as it was. Yes, I would want everybody to be successful. Everybody.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hey, how are you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Well, again, because my current obligation, in addition to what Im already doing, I would like to do 30,000 because of my current obligation of my.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"That sounds good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"The only process is marketing. Get out and do a lot of marketing for the business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its about my passion. Its been about my passion. Ive been doing this now for the last 25 years. But it also can be overwhelming. And I try to make sure that I keep a straight face when Im talking to people. When Im asking questions. I want to be fair. Im going to be respectable, I guess more. So I reached out because I had spoke to one of my colleagues, and I had said that this is just behind the scenes. Its becoming more personal when people come in or when they do a consultation, and I dont want it to be personal. So let me elaborate on what I mean by that. So if the client come in and they say, okay, prior to the appointment, theyre going to say what they want in this appointment. They want to discuss on how they can get a home. So then Ill say, okay, well, Ill ask the questions. And so it goes left. It goes to the point where my mama just died. And this I dont want it to be personal, but its been my passion for a very long time.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I dont want to work 12 hours, but if Im staying busy, my ultimate goal here is to continue to learn something new every day. I just had a person say, oh, Im so tired, I wish I was at home in bed. And my comeback was, well, you cant make anything happen in bed. So Im not a lazy person. But sometimes a twelve hour day, you dont plan at 12 hours. It just depending on the customer, you know what Im saying? That customer is where they at, how they I try to make sure I get a good feel for individuals so I could be on the same level day on.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"That drives me because of this world is changing seconds and seconds by the second. You see so many people that are homeless. I played a part in changing the rules at a shelter. You got a shelter for people but you want them to get up and leave the shelter at 06:00 in the morning. That dont make sense. So at the end of the day, whatever success is for that person, that success could mean for that one individual. I got my own bathroom, I got my own TV, I got my own bed, and Im at peace.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I make my own decision, yeah.","metadata":{"fillerID":19,"fillerText":"Yah umm","category":"C"}},{"pageContent":"Say, for instance, I got 20 calls out of that. 20 calls, I know 15 people will sign up.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, its just my old method, my old way, because the one thing I did, I have learned in being in business. That old saying, you teach people how to treat you. And so with that being said, my process is, again, its like hands on. I dont want to get away from it. I really dont want to get away from that because everybody is taught things differently. So when you show them something different, not to say that, let me change you, but just to show them how to get outside their box and the way theyre thinking, that still works for me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I would want my day to day look like thats a good question.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"It does.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yes, Im leaving for my concert first thing in the morning.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"That wouldnt be a problem as long as I got them trained properly, yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thank you. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, Im open to that. And Im always thinking away about how I can help myself automate my business to the point where I still want to be a part of my business. I dont want to get away from my, you know what Im saying? But of course its to the point where its becoming more personal and people want you to hold their hand. So its more or less Im a very informational person. If I got a person, they say, okay, Im going to buy a house, but Im ready. But I dont know which way to go. And Ill be like, okay, heres the thing. Or they say, I dont have my taxes done, so lets use that. I dont have my taxes done. I said, okay. I said, well, this bank over here is doing no documentation. All they want to see your deposit, where your money coming from and your score up. Oh yeah, Im good. But at that point its like, okay, we got to stop the conversation because youre not. So thats what I mean when its personal. And I dont want my business to be personal. I want my business to be again, my passion continually to be my passion and to hope and pray that each one of my clients perceive the knowledge that they are paying for. You know what Im saying?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Eastern.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, thats fine.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Sure. Ill look at the video and everything, and then I guess well just go from there.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I do.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"How much more longer are we going to be on this call? Because in about 30 minutes I got to go take care of something.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"No, this weekend Im going to a concert, and I wont be back home until Sunday night.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So, as I was saying right now, again, I do a lot of things by word of mouth. Thats how my clients come. And so going forward, marketing, I have events, I have networking events, a lot of different things that I would do or that I did do and I still do.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"They would really have to wear multiple hats when it comes down to the phone line. So lets just say in the morning, we would definitely have a meeting and I would definitely say, okay, look, this is where we at with this person. If they call, this is what you need to say and do, so on and so forth. Because again, once you get a feel for a person, you got to treat everybody differently in a different manner of respect, not being disrespectful, but you just know how to treat these people. We would definitely have a meeting every morning about what were going to be doing for the day, who we need to call back, so on and so forth. I always say this, I cannot focus if youre going to call me every 30 minutes and Im going to tell you I dont like a cell phone. And now that people text you, you can read people through that text message?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right now? I probably say about 25,000.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes, my credit score is 750.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I would, yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I do something once a month.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"That you would want? Well, how to improve credit and how to build your business bulletproof to get it ready for funding. Those will be my top two how.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I hadnt really sat down and thought about it. Thats really a good question. I think its time for me to just really become more into the century and start being open and subjected to that, because I never had a website, and I think thats what people want now. They want their website. They want to get a feel for you. And thats the reason why I like to meet the clients in person, because I want them to get a feel for me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Old man, and he worry about cars and tires and soups and tires. Hes not interested in my business, but hes interested, but he doesnt play a part.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I dont. And thats the thing. I dont want to do it as much because the things I have learned over the years, I have articulated things. It would be hard to sit down and work like that. I dont want to work like that anymore. Yeah, but I dont mind working, though. I dont mind working. I dont mind getting in the trenches. I dont mind making sure I figure it out to make sure I help my business to be successful even more.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"My ultimate goal is to at some point I want to take 15 vacations a year. Yes I do.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]