[{"pageContent":"Oh, you are?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I looked at a number of other opportunities. One reason I like solar, Im somewhat familiar with it. I did some alternative financing in the past and was able to finance some solar systems. And the thing I like about it is its not finance related. So it doesnt create a compliance problem. A conflict of interest.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, no, its tough. I was in the military and lived in Germany for a while, and its always tough to connect with your friends and everything here in the States, because of the time difference, it was tough trying to stay connected.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay, all right. Maybe an option.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, I thought about it. Its just so much regulation in the mortgage industry and compliance and what you can do and what they want you to do. It seems like everybodys always checking on you. I think once I kind of scale out a little bit and get out of being a producing mortgage person, then thered be less compliance hurdles and I could do things like that. I seem to do a lot of that for free anyways because Ive been in the industry a while. Generally for my own teams, though.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Okay. Yeah, I get it. Okay. Well, heck, man, I appreciate the call and yeah, you said I called. I didnt actually call you. But do they put you on dialer?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Because its an unrelated industry.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Gig, jeff, Im going to move out of mortgages over time here it is a rough industry. Can be a really rough industry, especially with the higher rates and everything. Production is down, of course, and everything. And theres instability, of course, with mortgage companies themselves. They come and go. I guess. The other thing, too, is in the mortgage industry, unless you own your own company, youre all w two. And in the next couple of years, Im getting older, I will be taking Social Security. And if youre w two, you cant really make that much money. If youre self employed, you can structure your income, I guess, so you can take better advantage of retirement benefits.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Its Jeff. Can I help you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, theres a couple of things Im looking at. The one Im primarily looking at, and Ill know more in the next few days, is the solar energy space. And I dont know if you ever worked with solar companies before, but Id be looking to generate some leads. Not sure if I want to do that with just like Facebook Instagram funnels. I want to do it more high tech instead of low tech. Face to face.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I worked logistics, transportation, shipping, all kinds of stuff. People moving? People moving, all kinds of stuff. Cars, trucks, all kinds of services worked for are you familiar with Heidelberg, Germany?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Oh?","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, heck, I appreciate it.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Actually, Im not running a business per se right this second. I mean, I am a mortgage guy, but Im looking at doing a couple of other things, branching out and doing a side gig business. And of course, theres a million AI tools. Right. It I havent fully looked at the video yet. I got interrupted in the middle of it. But its just something I was looking at, because if I do start one of these other things, Ill be looking to scale it up a bit. I dont know what kind of services you guys provide overall.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You, too.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"It was headquarters for US army headquarters, Europe. And it was like a NATO post, so yeah. I mean, we had a lot of other militaries on base. Not just the Germans, but we had the French, the English. Canadians?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont know. Do you call yourself English or British?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Its late out there.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Good, how are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Thanks.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"If you get a chance to go over there, its really beautiful.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right, man. Hey, I appreciate it.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}}]