[{"pageContent":"Were a startup, so we have some revenue coming in now, but were basically a startup. But basically I have some things that are closing this week. So projected about $20,000 per month, but the program lasts for four to six weeks. So it is that I got an earnest money deposit, which I get part of the program, which is non refundable. So that range is between 10,020, $5,000, and then on the back end, once the income accumulates, then theres a session fee of 20% plus 5% fee. So I make 20% commission off that. So usually I would say, like, every six weeks, not every month, I make about $100,000.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, I do. I have an affiliate program as well, so I pay affiliates and things that nature, and I pay basically 5D, like in the real estate industry thatll be like daisy tanks and things of that nature, like a wholesaler to another wholesaler to me, such and such like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I dont know. I think guys might have the wrong email for me. Can I give you my email? Because I think I put down the wrong email. Its a workable email, but its the email that I dont use on a regular basis. I want to give you another email. I dont think I got it.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Im going good. How are you doing?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Delvaroberry.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I do a lot of my work on organic leads. I meet a lot of people through Facebook. I Casey, Run, Craig List ad, a lot of my resource companies from Facebook and Instagram.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont really have necessarily appointment, like, set up, but what I do have is my 800 number for my company you can call. And what Ive been doing is setting up conference calls, phone conference calls, not through zoom or anything like that, but just over the phone and doing conference calls that way through my 800 number, through my company.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I have partners, but Im the only one thats authorized on the business. I make all the business decisions. Theres nobody else making business decisions, but I have the majority ownership.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, 100%.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"My annual income is about $2.5 million.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right now? Is 951.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay. You have a blessed one. You are blessed, and thank you so much.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Urban, I can send to you, but I have, like, a pay decrease, but my other score is equifax and experian. I dont know my business scores there, though. I know I have a pay deck of 80 okay. With down in Brad Street, but I dont know my other three business credit scores.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, if you forward it to white. W-H-I-T-E white labeled L-A-B-E-L-E-D. So labeled with an E D. Just white. White labeled Realty R-E-A-L-T-Y. Like real estate, realty whitelabeledrealty@gmail.com.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You know what? If you could go to Downpaymentincome.com, thats my website.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. I would like to have a staff take calls for me.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"D as in David, e as in elephant. A as in apple. V as in victory. E as in elephant. R as in Robert. A as in apple. U as in you, x as in X ray. Then my last.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Oh, that sounds awesome. You do wonderful, though. But what date is that? April. Was that april.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"I rather you throw out a number. Let me see what Im working with. Thats why I rather know the number Im working with. Thats what Im saying. I just dont want to just throw a number out there. Im like in a blind, no clue what you guys value is. I cant pinpoint that. Its like going to a house line. You try to run comparables on the house. Theres no comparable. See what the appraisal is for the house to know what the market value is.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Money Tree.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"No, you just been awesome and I appreciate you.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"My company is in Wyoming, but Im in the state of Michigan. Thats my hometown. My hometown, but I have a location in Wyoming and in Michigan.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"A million dollars a month.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Mostly inbound, because I get calls and referrals from people. Ive dealt with the industry and people have been in the industry like that. They bring people to me and things of that nature. So its mostly inbound. I call them and theyll call me, so its mostly inbound not doing a whole lot of outbound.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im sorry, you said what now?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I have what you call it right now, text messaging. I have a keyword, and my keyword is Realty. So he texts 21,000 Realty, my company phone number, my website comes up.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, like strawberry with an E. Barry.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, so if I dont put a number, Im going to say, what can you do with 20,000 then?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"248-821-7723.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, not married.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Always looking to do more. Always looking to do better. You never stop getting better. You never stop getting more. I feel like everything is theres no cap on anything for me.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I have a system in place, as I mentioned on my website. They go to my website, they fill out a form. The form goes to me, which goes to my lawyer to put together the contract, the Escrow accountants form with my Escrow agent, then from there, payroll set up through my accountant, and then the financial wellness process put in place to create the income. You create the income and then to accumulate the income to compound the income. And it goes through that process. And after four to six weeks or during the process, they have a property under contract. If they dont have a property under contract, then they must have a property under contract for four to six weeks. The access money is enough to pay for the property in four to six weeks, plus the access income left over, which they receive postclosure.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, Im putting together a program now where Im providing earnest money deposit as well. So with that earnest money deposit, that can be used as a down payment. So Im providing financing for the earnest money deposit, and the earnest money deposit is due for closing. So actually somebody can get started with no money down. Thats how that works. But usually my program, though, when you put it down payment, you get earnest money deposit. But Im setting up financing for the earnest money deposit actually come in with no money down because we provide a finance free with earnest money deposit, and its not due to after the four to six week program is done for down payment income or thereafter after you close on the property.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"You too. Thank you.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No, Im not going to cancel. Ill definitely be there. I just want to make sure that they just text me ahead of time. Just so I remember. Is it going to be a phone call or its going to be a zoom link?","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}},{"pageContent":"What was the question?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Most definitely as much needed.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"In place I understand. I have no problem. I understand that policy. Honestly, Im definitely going to be on the call. I just want to make sure they could. They can text me ahead of time, so I know, but I remember Ill write that down. So I pick up the phone right, exactly 09:00 A.m., so I wont be a problem.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"They will be able to do everything I could do, and they will be more so like a partner than an employee. And they will be able to do the day to day operations, the administrative stuff, of course, the administrative stuff. And I will handle the foundation and structure for everybody to be able to be on board with, so she can help me manage that as well. So that would be a dream.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"My close rate, I would say about 50%. What I say these are established relationships with they know me through another person, they vouch for me and stuff. Theyre not like Im getting a lot of people to sign up on my website and a lot of people to contact me through my text. You understand what Im saying?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, really I have no time zone because Im 24/7.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"That means I hit my goal to accomplish what I need to accomplish my business, to go to the next level.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"100,000 is a bad month.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Maybe about five to ten a week.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"If I had a dream employee, what would they do or what would they accomplish? Wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"No problem. If they could just text me 1530 minutes prior, I appreciate this. So I wont forget. Rather than email, they can text me as well. I greatly appreciate that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im in Eastern. Time zone.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"My day to day looks like, well, basically 24/7. So I dont sleep, I cant, but I mean, basically just working on my business. I like to scale it so I dont work it as hard, but I work 24/7, basically. Im basically one man right now, so thats why I want to scale my business. But basically my day looks like putting properties together and putting owner financing together with down payment income and putting together deal.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"On a personal level, I mean, I would do wonders, but Im just really focused on my business right now, not really the personal Ill come later.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Of my business comes from referrals? Not really booking appointments, but from referrals and people in the industry that I built networks with throughout the last 25 years.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"09:00.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Oh, man, my credit score is horrible. Its like about 520. But I really dont concentrate on my credit score because I concentrate more. So income, income producing a lot of my stuff is, like, in my business, not in my personal. So I do a lot of interactions with my business credit pose my personal credit.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, well, let me know the price. The pricing basically starts from 10,000 is the minimum, all the way up to $250,000.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sounds excellent.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats just for one deal that happens with.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"That means I only completed one deal.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Definitely so but they always got to be available. Thats my pet peeve, though. Im 24/7. They got to be almost twenty four seven. A lot of people like me because Im like money, dont sleep. I dont sleep. But I know a lot of people dont have that mentality, so I have to digress a little bit. But at the same time, I want them to have high availability weekends and things of that nature.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats profit.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Sounds excellent.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Most definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"You know what? Thats such a broad question, because where the price is, I can make it happen. Thats where Im probably kind of at.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Yes, I can.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I just kind of started this program, so for the last two months. But this is a combination. What Im doing is a combination of everything Ive been doing. Ive been in the real estate industry investing and doing financing for a long time. This is like a new program now starting that, quite frankly, that no one else is doing right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"My success rate is probably, like, nine out of ten because theyre more so, like, referrals than organic leads from word of mouth type thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ill tell you something, if you could do that, that is priceless. So that about the matter. The price is about result.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"We have a program where it deals in the real estate industry. It is a situation offering owner financing. And when Im offering owner financing for properties and basically what it is, your down payment pays off the property. So whatever down payment you put down pay off the property. Like, for instance, if it was $100,000 house, if you put down $10,000, youll be able to pay that house off that house with an investment property within four weeks with my financial wellness products.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]