[{"pageContent":"Yeah, definitely. Just because I have the resources in the network.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"As far as concerned. Right.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"They had a whole propaganda thing. Its ridiculous. You could die from consuming alcohol, but youre not going to die from cannabis.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Do you want to send a invite?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, yeah, no, definitely, because I have a ton of resources. And then if Im lets say I have five, six, like, I have like two or three, four brands right now that I could launch. But lets say I have 20 brands now. I could purchase product for 20 brands, and you get better pricing with volume and bulk and whatnot.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"But yeah, like I was saying, our new focus is this mystery box that were creating, and we have a number of retailers ready and a number of brands ready to hop on board with it. And with that, like I said, wed be charging the brands about five K a month on a six month contract and charging Dispensaries maybe like 2000, 2500 a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im good, how are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Let me see there.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay, sounds good.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, thats one aspect, yes, CBD products. But Im also in the THC market as well.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, how about tomorrow at three?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"But I have a team, people with me, so I can actually scale that where thats something that I target.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And then also once I get this, I have two brands that Im able to launch right now. And once I get the hang of that and doing it repetitively, then all.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Issa.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Hello? Hey.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Its crazy, right?","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Well, I mean, I have access to whatever product or materials that people need. So, like, for instance, I have a client right now, former NFL athlete, thats looking to create a CBD brand. So I basically sourced white label product that we could have drop shipped to create orders and get it drop shipped. Or then we could also purchase product, put his branding on it, and have the inventory in hand to sell to different head shops and also on an online platform.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right. Be very cautious.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Thats great. Hey, if I could get that, thats kind of why I reached out. I get it, but damn.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Its flexible on a case by case basis. Thats not my main avenue because I have actual businesses in the THC market that I have licenses for that I run, thats just people reach out to me because they need that I see help them with that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, my time.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, Im here. I just have to put you I dont believe I received it.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"It would be for the brands with just six brands, it would be 180K over six month period. As far as Dispensaries, starting off, it would be about 20 to month. So roughly, whats that?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Well, Im actually in the process of absorbing a number of licenses and then creating a collaborative network of maybe like ten to 15 retailers. To start off with that, my Distro would be supplying, and wed basically be purchasing from brands in bulk to get a volume discount. And then Im actually going after funding for this within the next two or three weeks. The investors are ready to just sign a check. Were just dialing in the deck and getting specifics.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"03:00.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes, same here. All right, you bet.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"As far as what I do, its been around for a while for myself, I got to help scale up a number of different businesses, and Ive just been in the cannabis industry for over 16 years. So, I mean, it goes hand in hand with THC and cannabis.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, theres certain things that you can do. Some stuff gets flagged, but then you kind of know what doesnt and whatnot okay. Yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"It all depends. I have a tremendous amount of deal flow just on different projects. So a lot of times if Im sourcing, then it might not be like a flat fee, but its like price per or something like that. But I do have a number of clients that are in the East Coast. They want to get into the California market or theyre just coming for me to want something.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Formerly I had an agency that I created, and we had 70 agents that were across the US. And also international even. So as far as like, sourcing product okay. So it was just focusing on that vertical for a while and then just having to deal with some of the actors that were in the company that kind of messed things up. So we had to shut it down. I dont know if youre in Colorado and youre familiar with just cannabis industry type stuff. Thats very typical. So I kind of fell back taking on those clients for a little while, but now Im kind of scaling back into it. Okay. And then actually we do have international reach. Like were launching brands in Thailand and stuff. As far as cannabis, very nice. Very nice. Yeah, he consults for grows and dispensaries out there and were bringing some of the bigger brands in the cannabis industry over there to get them activated.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Bye. It.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Were actually going after funding right now. Weve had clients, but then they werent repeat clients. We just got them launched and then we get a residual off of sales, but then that takes a lot of time to build and ran. So right now I dont have a monthly check coming in as far as business, but we dont have any overhead, so that helps.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Hows your business doing with that? Well, its been not very consistent because like I said, Im in a number of different verticals. Like, Im actually the co founder of the Oakland Cannabis Kitchen, which is like a shared space facility where multiple companies were able to get in under one license. And we lowered the bar for companies, like, specifically equity operators to get into the industry. So I had been doing that plus actually bringing street brands into the market and doing so at a low cost because it costs a lot of money to be able to do it, and they dont have much to start with. I see. But right now, were actually the platform that were building as far as Bueno is were charging brands, like, $5,000 a month for a six month contract to get into our mystery box, which we have a whole gamification system. Where were giving away prizes and a bunch of different things for people to buy the box and they have a chance to win these prizes and stuff. So, I mean, theres a number. Like, consulting hasnt been my primary focus. Every once in a while, people hit me up, and I want to launch a brand. Okay.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I mean, I have multiple businesses. My marketing company here in California, the Bay Area, I have several canvas licenses, bringing street brands into the license marketing, like influencer marketing. And well have a social media play that were putting together for that brands would buy into different things. But also my consulting company, we bring create CBD product lines for people and basically create ecommerce platforms for them to sell their CBD products. And were actually working on creating a platform where multiple CBD companies could have their product advertised on.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Driving or even anything? Yes.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats on the consulting side right now, Im actually at the Warfield Theater here in San Francisco, which is a 2400 square foot venue on the head of security here. We sell basically these packages where brands could we charge brands to put their product in our Herbal Bueno box, which we give to artists and capture the content, repurpose the content and stuff like that. So that does pretty well.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sure. Go for issa. Go for Issa. I already moved my car. Hey, Bobby BJ. Hello. Sorry about that. Yeah, thats all right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Not at the moment. We discussions with brands, and brands are just like I said, theyre waiting for us to give them the deck to have our whole because we have to map everything out. Its a complex system that were creating as far as the mystery box. And then once those my investors are also waiting for me to once I have Lois from the brand saying, hey, were going to go into contract for six months, then Ill get that funding as well.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I mean, I charge at least like five k. Okay.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, right. And that doesnt include distribution and other stuff, and even our delivery service as well.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]