[{"pageContent":"Im doing all right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello? Hey, Vincent. Yes, hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Would it be good to start off with that, or would I need that in hand?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Not at the moment, but Id say a month from now would definitely be there or a couple of months from now. As of right now, my daughter is getting ready to graduate, so shes been eating my pockets up, be honest with you. Yeah. So its been kind of been one of those fourth quarter fresher situations. But I can honestly say if its 1500, itll definitely be something I could work with in the near future. Would that be a problem?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Its important to me because like I say, as of right now, were going to a new area of technology instead of industrial. So in order to continue to press and still float as a human being, best to elevate and not fall short. But I also want to be able to provide for family. I also want to have a family. I mean, I also just want to enjoy life instead of living in some type of trump and struggle due to the pandemic, due to inflation. Be able to enjoy life and be happy.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im driving. Right.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I would love it, I would enjoy it, and I would try to build to make more than ten grand a month. But as of right now, that would be definitely great. Thatd be wonderful, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, Ill put it on hold. I definitely will. But if I got back in a truck and Ill be trying to start my own trucking company, at that point, I wouldnt be driving. Right. Ill be working from home. Ill be building the AI business, and also Ill be using that as well to build the next thing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"As of right now, maybe one k. Right now, just about.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right now, due to inflation, its been up and down, but I would say average between five to six grand a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"What would that mean to you, enjoying life? Would be able to take vacations, be able to socialize more often, help people, maybe a family in the future, live the dream life, invest and just keep elevating the new sources of income instead of just one.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes. So currently right now, I am a truck driver. What I do is I drive a cold delivery break. But I also have second goals of starting an online business or like, getting into the new transition into technology. Because I know times are changing, theyre kind of changing and I want to be behind. So I definitely want to learn, have new ideas of which obstacles and steps I need to take to make it to that point.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I would assume as of right now, I know it wont be enough, but I would say at the maximum, one.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Being able to be full of knowledge and understand the process and the skill to achieve those.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right now itd be more about just knowing what would be a good amount to start off with. So depending on my savings right now, Ill be able to save to start a month from now, I can set a goal to okay, boom. I need this amount. Boom. Let me get it there. Boom. And once Im there, then boom. I have my mind, my feet on the ground and ready to run.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, that sounds good. One more thing. In order to start off making five to ten k, what would be the amount that I would need to start off with that?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Of course, yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, I agree.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I have consulting business from the past. Like back in my younger days, in my twenty s, I was in sales, I was in cards. I have the commission experience of doing that as far as appliances and things of that nature. And I had ideas of advertisement. Ive been reading up on Amazon wholesale. Ive been reading up on the way of AI does advertisements for big time corporations. Right. I definitely want to learn those things.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, yeah, then I could be able to actually live in Florida and enjoy the state instead of being gone all the time. I could be working and steady, making more money, doing the profit.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"All right, thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Five to ten grand with monthly, you mean?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"This isnt about me being no, absolutely. Just being able to have more time to enjoy life instead of life passing you by, right?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, probably if I was to do one k, Ill just aim for the 1500. But I know right now, at this moment, I wont be able to. Thats the thing Im trying to explain today. But I do have a question.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, but to start their process, I would have to be able to have my own personal laptop and with my LLC and stuff of that nature.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, so once I look at it, I just take you back, tell you I read it, and I just need the private training video, basically, yes.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Not at the moment, right now. But I say, okay, in a month from now, Ill be able to a couple of months from now, maybe that works, right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Home, right, as much as I can, honestly, the more the better. But you got to cry before you walk in it. So currently, right now, as a trucker, you could say truckers make an average of 60 to 80K yearly, but I would definitely want to meet up to those standards, but even grow as well. Continually build income process, basically.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right now Im considered good. Right now Im in the 700, basically.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. I definitely appreciate the opportunity. Im on the road, so I got plenty of time to look over. Yeah, awesome. I take webinar classes to try to learn it, but definitely I appreciate the opportunity. So we can continue the process.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Sounds good. I do have a question that was actually you and the ad that I looked at yesterday.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}}]