[{"pageContent":"AI.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thanks. You too. Likewise. Appreciate it. All right.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Probably say Im touching 45.","metadata":{"fillerID":7,"fillerText":"Yah totally","category":"A"}},{"pageContent":"Just create freedom? I have ideas of first of all, Im single, so I know if I want to ever have a family down the road, I want to make sure Im established. Obviously with the economy, where its going, got to be definitely prepared and not what happened in 2020. I want to be able to build something to just not be like everybody else, just scared of whats next. I know Ill have a foundation, ten k. Some people might be a lot, might not be a lot, but thats for me, something that life changing at least.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Got you. So pretty much right now Im transitioning into a solar sales rep consultant. Industry something new for me, but I know a business to run successfully you need to have automations. Its 2023, so automations. But a whole bunch of things will make your business much more better because you create time and when you have systems in place that could also help a lot. Tremendously. So thats where Im transitioning right now in my, I guess you could say, career.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So I went to school for media, so I went to school for broadcasting and then over the years just doing freelancing stuff, I never really found a gig to get myself into. And then when I moved in with the roommate, hes a senior photographer and hes the one that told me about it. So thats how I landed that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I was just looking at that. I was, I was chatting it up with your chat box.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No? Yeah, that does definitely click in my head. For sure. Yeah.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, correct.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"We could definitely touch base and see where Im at.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. So for media, I wanted to be a sports anchor, so I went to school for dealing with those cameras back then. This is when the first time Instagram, Twitter were popping.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I definitely sitting back and just thinking about that. Ive had that in the back of my mind, but I never really brought it up to see how I could be turn it into a business.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Pretty good, how are you doing?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"A year and like six months.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Score is right now? I just rented a place and bought a new car or leasing a new car. So I think it dropped down to like, 665.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I was in marketing, automotive marketing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, yeah, definitely help me qualify. Because overall, right now, before you get started, I was just thinking how to leverage LLC, create exactly. Get funded and use that money to get started.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Trying to think, because I know for sure right now the credit cards that I have are below that 30% but Im there at the tipping point where I just want to make sure that dont get too cleared away. Im not going to lie to you. Theres not that much space for me right now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. I was mostly through a luxurious dealership, so I was in charge of inventory, like new and used cars, photographing, editing. And then I was able to take part in creating social media posts, creating content, becoming pretty much a brand ambassador. We would go out to community events and I would help set up market, give out samples, swag bags, stuff like that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Being able to wake up without an alarm clock and being able to decide what I want to do today.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Listen, my bad. I dont mean to be rude. I didnt expect you guys to call me up so fast. That was really good. But I do actually have to get going right now, but I dont know if we could talk it up later or if we could.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"We just started the month, just finished paying off some bills. Probably the end of the month where I okay.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Texas, or I just saw my caller ID.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Well, right now I met the CEO of this company, and I have a marketing meeting coming up with them, and this company just started in 2018. So either finding out to either get into the digital marketing aspect or becoming a solar sales consultant, I definitely know that Im more of a creative person, so the marketing aspect would work for me. And I know this company, I looked into the website, its a good company. Last year they made 60 million. But obviously if you could scale a business with AI and automation, that could just take it to the next level. So that was the main thing of why I clicked on that on your ad. If Im going to go into this marketing meeting with the CEO of the company, Ill be able to offer some leverage, like, hey man, if you want to take it to the next level, youre going to need this and this and this and that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right now Im trying to start off at least ten k per month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. Im open minded to hearing everything you got to say.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure, I got time changing. Yeah, no worries, brother.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Say that one more time, I didnt hear my fault.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"No, I definitely have thought about becoming, I guess you could say, your own social media agent agency providing people with tools and how they could use social media through different platforms. Obviously, theres like five main ones. You got Twitter, TikTok, and just be able to provide. Obviously, nowadays everything is video. People are attracted to five to 20 seconds and scroll all day.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, I appreciate you for taking the time. That just shows that you guys are the real deal, because thats pretty badass.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Got you. Are you guys from Texas, then? Is that where youre calling me from?","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Not really, because most of these dealerships, they just outsource people. I was actual employee within the company hired in, so it was a good gig.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Got you. Cool. Sounds good.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So if I could provide entertainment and education and help people build their businesses no, that definitely makes perfect sense because I thought about that, but I was just like, man, just the idea. I was like, man, how could it be? It could be overwhelming. But again, I never really tried.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]