[{"pageContent":"Okay, thank you so much.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, only one problem. I cant talk right now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Im sorry.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yeah, its a slave shop. Its a lot of work. Its only been open a little over a year. I know I need to invest more time in it, but I feel personally that theres a cap to it, even though at some point itll be making money or its not really going to be life changing. You know what I mean?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I actually own a coffee shop, and its like a slave ship.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Im sorry. Go ahead.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Okay, so I think its going to end at six, but you can call me back. But I dont have much time because I have to leave out at 630 to a physical appointment in person, half hour window.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Kind of a long time. I just started to try to turn into business now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I dont know. The shop. I think it brings in like 7000 a month. I dont know.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, a lot of times because I do want to have some retreats that are going to be pretty expensive because its going to take a lot. But the one on one coaching could be anywhere from like 3500 to 5000 because its like over a period of six months to a year, depending on what they choose. And its just a lot involved and its one on one.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right now? I coach relationship people give relationship advice and coaching and all that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I tell so many people to fix their mess that I know that I can make it happen, or I could at least guide them. If they dont want to take their life, then thats their problem.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Like 10,000.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Oh, its trash the shop. I had all my credit cards at zero before I opened the store, and I used them all up. And Im just now, literally this month, Ive been paying them all off to zero. So I should see a little increase. I dont know what kind of increase, but I do have a little something that I could use for ad spend to begin with, so its not like Im broke.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Growing up and mortgage, Im trying to write a book. Im already working on the book. Its just a lot. Im trying to use it for my personal freedom and my familys.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, I have click funnels. Im trying to see if I can the problem with the shop is that it takes a lot of my time. I havent been able to create the online course yet. I have most of the stuff I just have to create. I have click funnels. I have the YouTube channels in Spanish, English, and all these other social media junks. I use chat, GPT and stuff to make some of the stuff faster. But I got to do ads. I know that I got to do ads.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Going well.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"It was the last time I saw it. I think that its like close to like six, but Im sure that next month when they see all the zeros, its going to go up a little bit. Yeah, Im hoping to fix, but hey, you just never know.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, during the pandemic is when I started to get into the whole online thing, and I was doing, like, marketing for people, but I got out of it and went into the shop and left that alone, and now Im trying to go back to it, but with my own thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, my gosh. I want to get to, like, 30,000 a month. Im trying to do 1.2 million in my first year.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"I know, because everybodys just getting all my life and everything, so Im like, this is nuts. I should just do it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, I dont really know exactly how I do it. If I want to schedule calls or whatever. I dont know if I want to do an online course. I rather do whichever one allows me to automate it faster, but I dont mind doing some one on one if people need. But thats just going to be more high ticket because my time is valuable.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And its taking up all my time. Freedom. I cant have that. I need to be free. I need to be able to do it from anywhere and all of that.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, I need to get there.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I do have to cut you only because I do have an appointment at five on the dot and I cannot miss it. But I want you. I didnt know that we had this call right now today.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"But it has a lot of expenses.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Weve just really yeah, thats the hard part.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]