[{"pageContent":"Well, there really isnt. Were still trying to get vamped up now, but my husband used to pastor a 6000 member church before he got divorced and so hes starting over. Were starting over. So theres a smaller church that were looking to relaunch towards the end of this year, but right now its in developmental stages.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Im going fine. Well, how are you today?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sometimes, absolutely.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"This panel, you cant pay for it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, we started the company last year. Its been registered about a year, and we really just started doing the podcast. We started filming to do sort of a TV pilot thing but that did not work out because of the person who was shooting it and that kind of thing. So we had to kind of regroup and decided to just start with the podcast. So thats where we are now. Were in the development of mental stages of the podcast.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure. Today is Thursday. I would say probably Monday.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"If we can just get the income up to even like 2020, 5000 a month to start as we grow, thats our first goal and then were just going to do what we can to just grow it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I would say anytime between one and three.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Tell me about some of your AI tools. Like in what way do you guys help?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"We dont really need someone who can just kind of hold our hands and just say, oh, do this and do this and do this. Wed rather have someone who ideally we understand how AI is growing and that kind of thing, and if thats Sherlock or whatever system that can help or do automate, whatever, thats great, but we really just dont want to be put in a position where were just being guided and its like, do this because we dont have the time. We have so many other things going on.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It. Im trying to remember. Air AI. What is it that you guys do?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"It could be whatever the person qualifies for. Thats the beauty of it. It checks like each individual person youll put in. We always recommend putting zero down, so anything we do would also be zero down because thats the best way to do it. People arent necessarily always expecting or ready to throw down a bunch of money up front, so getting that zero down is important. And then you set the amount that youre looking to get them cleared for, and Midas will see who will lend it to them. Theres definitely traditional options, theres more complex options, but Midas will find out basically what the available options are and itll display it all on the screen and you could talk over options with them and get into the details with that. And then the third one would be Sherlock, and thats more of like a logic based AI that our CEO, Caleb Maddox and our executive team just really poured all their thousands of hours of knowledge into it, and basically acts as having one of them with you at all times to basically look at where your constraints are, where your roadblocks are, and basically make sure youre focusing on the right things that are really what you need to be focusing on. And then, of course, if you wanted to ask the actual people themselves, if you do work with us, you have the ability to just ask the consultants directly themselves. But even if its two in the morning and youre working on a project, sherlock would be there and he would tell you basically what they would recommend because he has all their knowledge poured in. So thats like the main three that I think brings the huge value, and its really the core secret to the fact that we could get people up to that million dollar a month mark when they have the right niche and all that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So, Midas, what type of funding is it? Is it like this for pay Klarna kind of funding, or is it traditional, like loans and credit?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"For me, its usually in the afternoon. Real quick. Hold on. Yeah, usually in the afternoon.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, well, if you guys we have just a little bit were starting a brand, a podcast and a consulting agency where its really more focused on relationships. And we have sort of a niche because were divorced, remarried, Christians. My husband is a pastor, and so were looking to target those people who are in the second half of their lives dealing with the dynamics of church Christianity specifically, and remarriage.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh no, not at all.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I appreciate it.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Oh, Im sure, yeah.","metadata":{"fillerID":19,"fillerText":"Yah umm","category":"C"}},{"pageContent":"They wouldnt want to talk absolutely.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes, absolutely.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"You no, we know were going to have to do something. Were going to have to bring on someone or a couple of people here or there. We absolutely know that. But with filming the podcast and trying to grow the business at the same time, plus my husband, I said as a pastor, Im self employed doing my own thing in the financial industry. So theres only so much time we have. So were not fully totally dedicated to this in a way that we can allocate most of our time to it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"If were going to sign up for any type of assistance, whats most beneficial for us is to have someone who is something AI, whatever, doing this work for us because we dont have the manpower to do it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Yes.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Brian. I-A-N.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, let me just ask my husband if hes okay with that because I dont want to commit to a time frame because, again, were traveling over the next three weeks, and so I dont want to commit. His time is limited during the week as he prepares for Sundays. So I dont want to commit to a time frame without him. So, yeah, if you want to send me or just tell me what the next steps would be, maybe Ill call you back or send an email and say, okay, we were on a book, and sometimes that are good for us.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, thats exactly what I was thinking.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, we wanted to do one all along but we just felt like the podcast would give us the exposure. Its a platform to share what we are offering, doesnt cost a whole lot to get started and we can just kind of start building a following based on that and hopefully have those people spill over into the coaching and consulting where we can offer these high ticket items.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, so you guys show businesses. So you coach businesses or you coach coaches?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Great. Thank you so much for the call. Whats your name? Ryan. Ryan, got it.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Eastern.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]