[{"pageContent":"I do a lot of things, but Im a voice coach and Im recording artist, singer, and vocal trainer of everything, vocals. And I have two, three books Im about to release. The first one is going out this week for speakers, speakers, entrepreneurs, podcasters, everybody learning how to love the sound of your voice. And Ive been doing this for 15 plus years, and Im an expert in this field.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sounds good. Thank you very much.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"60 seconds, and I got to take the next call here.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes. Whatever the calendar said, I set in the morning. Yeah.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, its awful. Thats what I fix. And theres a lot of vocal trainers out there that can do a little band Aid, but I do the overhaul. I take you to deep, deep levels of your voice and it doesnt matter if youre an expert with your voice or youre just learning how to understanding what the voice does and why it does what it does. I am just about to finish the book. I got my lead pages going. Im going to self publish it here this week and put it up. And Ive been trying to figure out and Ive seen so many AI websites, theres a lot of things out there. And Im going to release a few intro videos here that are up on my website, but I want to find out how AI is going to work. The interesting thing is that AI can do the talking for you. However, I dont know that thats going to be the answer. Like, people still want to use their own voices. Now, granted, there are some people that dont need to and they want to use AI, and thats great, but it doesnt replace the human connection. And I really feel like thats an important thing. And I think people will cheat and feel like Ill just use AI and I dont need that. But the AI voice and all of that, I feel like AI is good for. Probably what you guys are doing is content and identifying the areas that AI can do the job for you, where you can focus on other things. And so as a creator and an author here, I would like to figure out ways that I can get things done faster in the marketing aspect of it and how AI can assist me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I do a few different things so it looks different on paper than what Im telling you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And I translated some of the vocal techniques from singing into speaking, which most people dont do. Most vocal coaches are either youre a singing coach or a speaker coach, but you cant be both. Im both. The reason that speaker trainers dont go where I go is because they dont have the classical training of singing behind them. I have the magic sauce between the two, and the reason I can do it is because I understand how people learn and I know why they dont like their voice and I can help them to create voices. The premise is that when you talk to different people, you use different parts of your voice. Youre not going to talk to a client the same way you talk to your mother or your aunt or your friend down the street, or when you go to the grocery store, or when youre standing in front of a group of thousands of people. Every communication is different.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Kind of, but thats something I would need to focus in on. For sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes. And the credit score is rough at the moment because I just rehabbed the house. I just sold it. So now I have to pay off all those bills and wait a couple of months for it to go back up.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I dont remember.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Corporation and personal.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. So teaching them how to turn on those different personas sound of your voice and also the sound of your voice hits people differently. So understanding those dynamics. And one of the reasons why people dont like their voices is because they dont know their voice. You only know your voice inside of your head, not amplified. And most of us just listen to ourselves recorded and go, EW.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, theyre waiting for me to call them, so I got to get back to that call.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right. I can change that, and I can change that in a very short amount of time.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yes, it will. Once these books are done in the next 30 days. Yes.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"WhatS that going to look like. Its currently sort of a word of mouth and also on my social media reels and that kind of thing. People that know me refer me. I do business just fine. If I want to keep doing one on one coaching and that kind of thing, which I do not want to do. Im going to more funnel driven group online courses and then have people buy into a course. To start with, I would offer something that I think $2,500 for eight weeks or ten weeks or something like that. I think eight weeks is good. And give them a few days a week. They come to the class, I give them homework, they pass the homework. I have a whole system set up for that. And then at the end, they have a set of reels and they have an introduction to their business and they have a better sense of what their voice does. And they have a system. Like, they have a practice schedule in place, and in three months theyre up and running and their voice is at least 50% or more improved. Probably at least, probably more. So some of the people that I just tell them what I do when I go back and listen to them talk, they sound better in a week. Awesome. I can do magic in like, one session, so Im that good.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"April, whos calling, please?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"You know what? I dont know. Last year was 120,000 or 140,000, something like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Like 653 or something? Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, Ive been a vocal coach for singing for ten plus years.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I think I did on the calendar there.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thats what I called in on. Thats what I said.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I dont know. Id have to figure that out once I get through this transaction here because Im about to shift over, so I have to do a new business plan. Here.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, at least a couple of grand. Of course. Because I understand Google Ads. You have to put ads on Facebook.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, you guys are fast.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}}]