[{"pageContent":"Yeah. Honestly, Ive kind of given up on the idea of having a family at this point. I dont think its in the cards. Okay. Yeah, owning property just sounds like sort of a beast in itself. I just came from Salt Lake and the cheapest housing there you can find for bare minimum is like half million dollars. Yeah.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"88 an hour a year and then theres benefits and stuff to working at the mine. Got you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Im doing well. How are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I think Id just like to leave my current job, probably. I mean, Ive been working in medical devices for a while. Then I got laid off and I moved up to Fairbanks to work in mining. But Im just not really passionate about metal extraction. Too much? Yeah, I dont know.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"No, I was a research engineer. Sales would have been better, though. Probably.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, sure.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"It might get me there fast enough, maybe, but the sacrifices definitely there. I liked working in medical devices before, but I was making what, 65 ish in Salt Lake, which you just cant really live on medical devices.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I guess just like financial freedom or creative ability, I guess Im not really sure. A business is really demanding in a lot of avenues, so it really just depends. I wouldnt say Im particularly passionate about one thing or another, but I find myself programming quite a bit and involved in things like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Hello? Zach. Hey.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"AI.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I went to college at the University of Utah. Got you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Oh, I dont know.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, I was born in Spokane, which is why I was intrigued you called from a Spokane number. Okay, yeah, but I lived in Salt Lake for eight years and then I moved up here just recently, last month.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Oh, youre good. What about yourself? You sound like youve done sales and things and I dont know, seemed like a pretty.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I mean, Ive done crazier things, honestly. Like, Ive taken out, like $50,000 in loans and put it into cryptocurrency, and nothing really fazes me at this point. Id be interested in trying it or trying any program. Yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, that should be right.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Good stuff.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Right on.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, but if Im doing my own thing, I guess its not like too big of a deal, right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I work in metal energy and stuff. But yeah, I dont know, Im just looking to really try anything. Ive tried a lot of different avenues for income streams and things, but Ive never quite had capital to start a business necessarily. So thats always got you a challenge.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Probably anything materials engineering related or software. I know quite a bit of Python, JavaScript, things like that. And Im familiar with artificial intelligence in the form of TensorFlow and Keras and things like that, but high level chat, GPT type things. Im not an expert in Tensors and those transformer type methods. I use them, but I wouldnt say I could just go out and build myself. Yeah, Id definitely be happy coaching people through any sort of software related thing, especially with Python. Ive been programming in Python for like a decade.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I guess thats a good question. I guess I just figured if I could just get financially stable or have enough of a down payment to buy a house at like a decent interest rate, that would be a good spot. And then maybe I could think about starting a family or something after that. But currently my work hours are pretty extreme because Im doing two weeks on, two weeks off, and its like twelve hour days, 1214 hours days for two weeks straight. Its not really conducive to really settling down or anything.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I dont know, it seems interesting thing, I sort of day trade currently using like, a Lorenzian AI model and some other things Ive done, but I dont know, I did some machine learning projects on thermoelectric compounds and things like that. I dont really currently have a business, but Ive thought about starting one, I guess. Yeah, okay, cool. I would just reply to the ad and why not?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im 27.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I dont know.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I guess Im not too sure. I feel like if I could make 4000 a month in my own business, that would be awesome. Right? If I could just work my own sort of structured business and fulfill client orders or whatever and make four grand a month, that would be awesome. Because I mean, currently I make like 88 salaried. But youre still working, you make eighty.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]