[{"pageContent":"I have a few of them, but one of them have online course that I really want to get more revenue from. Its a course that teaches musicians how to get their music on TV. And I have a lot of experience teaching for the Grammys, teaching in London, and yeah, its basically a course with video and text to help independent musicians be able to get their music on TVs without a label, licensing company, or music library.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Not slowly.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im getting 20 clients. I dont really do appointments, really. People will ask me in person about what I do, and Ill break it down. But its usually, like I said, Im usually interfacing with people in a panel or in a conference or on Live. So if people are trying to if theyre interested, they go straight to the site.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Honestly, Im inconsistent about it because its not super effective. I feel like whats effective is yeah. When Im converting, I do well with converting in person, converting a person, or converting via an online tutorial. But I myself, I sign up for so many different webinars for peoples knowledge and stuff all the time. I think the thing is, I need to maybe a lot of consistent amount of money for ads or something. I just want the right formula, truly, that I can scale up from. If I could start modestly with whatever my formula is and then continuously add more into the marketing pool as Im making more sales.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Which is not substantial.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Im well, thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, I just think thats like 40 classes, 40 people a month. I just think that thats just so doable. Yeah, thats just been my goal for it for a long time. And like I said, I get conversions when I go live on Instagram or when I go live, or when Im teaching at a conference or on a panel. But Ive just hired so many people, man, and I havent had a lot of good results when it comes to running ads or doing the whole whats that website? Running funnels and all kinds of stuff like that. So Ive had more conversions. When there is an interpersonal exchange. And thats why I was interested in the AI situation, because if I can have something automated thats having people to think that theyre in a communication with me and Im able to be more personal with them, that I think I can get more conversions. But 200K is the goal, minimum.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Last year, I think about 75. 75.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hold on, whats his other company? Because I feel like I have purchased something from him before.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"600. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, that sounds good.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So is it just used for messaging or does it do more than just messaging?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I think I should have that kind of buffer, though. I think that thats great because even like, having someone that you could talk to or someone that to share more about the features and the why, I think Im open for that if thats.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"One employee. Oh, wow. Yeah, that one employee would prospect for me, prospect for more clients for me for music booking opportunities. Music booking opportunities with festivals, with venues, with museums. That person would also act as a PR. They would help with growing my visibility in entertainment. They would optimize and help create ads that have a call to action. I mean, not ads. Posts on Instagram, TikTok, YouTube, facebook? That would have a call to action for people to buy the course, for people to connect with, streamline music. And they would help optimize my schedule, my calendar. So Im actually having a work life balance and not a never ending to do list.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"No, Im giving you credit. Yeah. Even if I could get there within four months. Okay, cool. You know what Im saying? And Im literally like taking 80% of what Im making each month and just pumping it back into the machine. Im cool with that. But I really need to hit that goal for me.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So if youre saying, have I thought about there being a human to convert these leads in a short meeting or conference, a call, I definitely have the passion and the knowledge about it, but in a perfect world, it would be someone who I could pay in a point to make those calls. I think that also gives the project a little bit more value, and maybe I connect with people once every week or something through a zoom call. I like that in a group setting.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So currently, as it stands, its just Modules, a video text. Its about eight modules that goes and teaches them how to create music that sells for a sync, how to submit your music, how to protect your music and copywriting, how to become your own production company. And yeah, so everything that Im teaching them is valuable because otherwise you would have to get these sync opportunities through a label or a library and they all would be taking anywhere from 50% and up for your sync fee. And also maybe a large percentage of your songs ownership. And so the reason why my course is valuable and unlike any other courses because no one else is teaching artists how to retain their ownership of their music and cut out all middlemen for them to make these sales directly to these networks by themselves, people always say.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, its really just like, Ill get hired to speak on a panel or a conference for a school or for a nonprofit, and then Ill do conversions that way, or Ill go live. Yeah. What else? I had the click funnel situation, so I have a webinar already created, and its on my site now. And so, yeah, its just like me making posts from my Instagram to draw people to my site, which is syncyourmusic.com S-Y-N cyourmusic.com hang on.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right now.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah. Jesus.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Perfect scenario is my SEO is super up there, so I dont have to pay a whole lot in actual ads to get clients and they go there. I have articles and stuff. One of my business partners, hes helping create more targeted blog posts to boost my SEO. But yeah, so I have SEO articles that are putting me on the top of Google searches. So Im answering peoples questions and its leading them to my site from Google searches or from YouTube searches. So Im taking a whole bunch of peoples questions about sync licensing or how to make money with music. And a bunch of posts are made on YouTube, TikTok, Instagram, and its drawing people to the course. And that my monthly minimum on marketing. Starts off moderate, I mean, 2000 or something and under to start. And also I like the texting feature, so, like when people sign up for my webinar, like, hey, did you get into the webinar? The automated texting feature and what else? Yeah, texting people so they to make sure that they got got into the course, texting them to see if they have any questions. And I have an idea that I was thinking about as far as making the community a little bit more interactive anyway. So I dont know if that was going to be through a discord or through a telegram or a Facebook group, but basically I want the community to feel more engaging as opposed to it just being a removed static course. For example, I want to give people prompts weekly. Like, okay, for the first week, were all going to make Im having a brain fart. Hold on for a second. Were all going to make trailer music. So were all going to make trailer music for the first one. The next one, were all going to make music for cinematic dramas, you know what Im saying? So I want there to be something where Im giving people prompts weekly and so I can engage as a community and people are able to create amongst each other and together. But yeah, thats kind of my perfect world for this. I know.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I think for this first month, it would be like around $1,000, but I could increase in the next month 1000. And under is where I could start.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"It just varies because sometimes Ill put ads, run ads to it, sometimes I wont. So its not consistent in how much it generates. But when I do actually run ads or when I do actually push for it, it can go to around like five k and up the course is $500. But yeah, I just have had some issues with really figuring out what is my method of automation for marketing the course.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, when youre getting your songs okay, I land on that price point because I really could have made it 997 but I was thinking about a few different things. Well, first of all, when someone gets their song on a TV show, usually the minimum that theyll get is anywhere between 500 to 100K for the use of their song, $500. To ended up making it $500 just thinking about the price point of the user, the independent artist. So Ive toggled with doing a few different kind of things. Ive had clients that paid me $1,000 a month for my one on one service plus the course. And so, yeah, just a standalone course by itself. I just have tried making it 500, but Im open, Im flexible.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I mean, Ive been on the committee, the foundations committee for like three years for the La chapter.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Did he have an offer for creating a course?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"You know what Im saying? Because its going to still take some time. This industry is a fishing game where how many times you submit to these supervisors determines your success, you know what Im saying? So its not like its an overnight thing, but it can happen in a month, it can happen in six months, you know what Im saying? So Im open to changing the model so I can sustain whatever my team needs. But also I want to be considerate, you know what Im saying? Thats all.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, whos calling?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Do I want to be the one?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, Im down to talk to the person, but I just want to know I know that theres a process with how you guys the timing and the way that you guys lay out your services and then share the pricing, but I just want to kind of have a ballpark of what is your service like, all bundled in one? Or do you have all the cart where people can kind of decide what parts they want or dont want, or have something tailored to work with you all, or is it just kind of one or two options?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"My goal is two hundred K a month. I know so many people who are doing far beyond that. And Im just like I really know that the product is valuable. I have so many testimonials from the people who Ive who Ive taught and like, I know that its valuable, but Im just really trying to figure out the right way to scale. But 200K minimum is my goal monthly.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Go ahead.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, because I have a few different types of clients. I have a client who is a target audience, rather. Some small labels will buy this and if they just take this information, then like I said, in your first time submitting, you can get ten times the amount of the class. So I do think that its possible that the price can raise. Im just concerned about the independent musician who is looking for this knowledge who may not have that.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thank you, Alex, you have a good one.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So your website I looked up Caleb Maddox, I think the founder of Air AI. I just want to make sure this is the right guy. He looks like a young guy and a T shirt.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, yeah, Ive got tons. Ive done all kind of commercials for Nike and all kind of things for other shows for Showtime, Stars, Fox, all kinds of shows.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So are you going to email or text the video link?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"No, not anymore. I was. But Im in the Arts district area where I am. Its a little quiet, quieter area.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Lets do tomorrow Friday. Lets do 09:00 A.m..","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}},{"pageContent":"Okay. And the video will outline your service details.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"My first one, it was a show called The Shy on Showtime.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Its been a while. Ive redone it and Ive tried to find different ways of marketing it, but yeah, its been some years. Ive had it for at least maybe like three years.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Listen, this is my ethos surrounded the musicians that need it the most, that need it the most, like $500 is like their rent money, you know what Im saying? And so even if I were to cut it up in some split pay or something like that, because I was that musician, I was that musician who literally this sync licensing changed my life. I came to La. From Chicago and I was struggling. I could not find a job for nine months. And Im like a professional person, and Im a good looking girl, and so Im like damn, how am I not? I have all these credentials, Im not able to get a job. And I was financially struggling until I got one song on TV. And do you know that one song bought me a Mustang. That one song took me on a trip to Berlin, got me tickets to go see Beyonce, got me an opportunity to tour. From the sale of one song, I went from being broke to being like, wow, Im able to like I have multiple tens of thousands of dollars, you know what Im saying, from one song. And so I dont want to take advantage. Thats not the truth. I dont want to say that. No, I dont want to take advantage of it. I dont want to burden them off top.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"To talk, Im open to delegating whoever.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right now I havent been consistent. Im going to be real, Ive paused on, I would say like per year. When you say appointments, I dont really take appointments. People just straight up book by the course, I would say when Im actually pushing the product, Im right now making around maybe like 20 in a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Scott is he a lawyer?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, I mean, I hear what youre saying. Im going to have to give my card information before the meeting.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]