[{"pageContent":"Yeah, its what I already do.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I usually dont share that sort of information, but my credit score is about 820.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont know. Ive spent in a day. I probably have at one time I did I was doing 1500 a day, but I probably would never do that one again. But I did it. I usually try to ads down to anywhere from 150 to 350 a day if Im doing.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah. That right there is my lane, what you said, because thats what I do. I literally help labels get started. I help artists break their records. Im a former member of the Rick James Stone City Band. So, like I said, Ive been in the business for years. I still got records, and people come to me for consulting constantly, celebrities and known people and unknown people. And its always about how do I expand and get the most out of the music industry when I dont know anything about it, how can I be successful? And so I set them up on the road to be able to be successful by the tools and just the knowledge.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Jose.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, Im going to have to end this conversation at that note, brother. This is just a little bit me.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"And all the management system I can. People that are serious and the ones that are just fluffers.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, you guys asking some crazy questions, man, to say that I dont know you.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I only have a few minutes before I got this conference call coming in.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right, yeah, I definitely wanted to have a conversation with you guys thats thought you guys called me yesterday.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So I told them, Im sorry, if I do that, Ill be doing it for myself, not through you. So you can take advantage of my history in the entertainment industry because youre not the face of it. People dont know you in the music industry, but they know me. So I turned it down. I laughed to myself because thats what Ive been doing. Ive seen a few people go online and like this girl, I can show you how to get booked anywhere. Shes using that same system you were talking about that that young man was using and all she do is show how to get how to get artist shows all around the world. So I know that what I have to offer is valuable because people come to me all the time. My distribution company, people go online and they log in and they pay a fee and they distribute their music worldwide. Its turnkey. I dont have to do anything. I can sit here and theres people logging in every day, putting their records out, you know what I mean? But I want to take it to another level because people that I deal with in the music industry and the people that I produce and written for and worked with and the history of me being a former member of Rick James band, just all the other history I have. So definitely its something Id be interested in as long as it makes sense. For sure, yeah.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"A distribution company, music distribution.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. Stone at talking to you. Nice to meet you, buddy. Ill talk to you. 130.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Ad spend? How many Ive gotten in one day.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Is that something in the budget? Yeah, thats not something I would be opposed of.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, well, this is something I deal with all the time. If Im doing a distribution deal and a clients coming in and Im doing a distribution deal for maybe 10,000 or 15,000 and they cant afford it, I scale it down to where I get a percentage on the back end and they just pay a smaller percentage on the front end.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I did six figures last, but that wasnt from my company, that was just from me.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Bye.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, 130. Yeah, man, lets do that. Plus, I still got to sing you my song. So we plan on 130 then?","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"New records that are coming out, new albums, new stuff that Im promoting, a new concept book, stuff like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I got a lot of people that follow me on Facebook and a lot of people that follow me on YouTube. I have fans all over the world and people who just trust. What if I say I went out and bought a new piece. Im endorsed by three major equipment companies, music equipment companies. So whenever I buy you got a following. Yeah. People go and do it. If I go get a new guitar, I say, Man, I just picked up this new Les Paul. Guys will go get it. And theyre like, man, a stone is using it must be good. So I have that influence as an.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"I got two corporations, so I totally get the whole credit score versus not having a great credit score and trying to build a company based on the credit score because you can get certain funding and access to money because of that reason. So, yeah, I got you. Im deep thick into it, but without indulging all of my business, I dont really like sharing my financials, brother, Ill be honest with you.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"But high turnover.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Ive heard of ClickFunnels. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"The money comes in this business, so I dont really focus on the money because it actually comes as long as its properly set up right, and its set up right. So more awareness is just going to not just help the company, but help other people as well.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Absolutely. Yeah. I can go on Facebook now, tell people to go buy something. I just got endorsed by this new liquor company called Bora Vodka, and I went to Facebook and posted, go get the vodka, people. Where can I go get it?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, Ill call you then.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"130.","metadata":{"fillerID":29,"fillerText":"Mhmm","category":"D"}},{"pageContent":"I got this conference call coming in, and then I got a meeting at twelve that I have to go to. So after 130, Ill be available.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Too bad. Facebook ads.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Doing it through you guys system would just put it like this. I just had about four or five offers with people trying to get me to get my knowledge and put it on the platform. But I felt like these people were trying to use me to make money off of me.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Bye.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Set the other camera for me. I got to get on this zoom call. They just check. Can we try?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Because Im a better closer. Im going to be a better closer than anybody on my team because they dont know my system and they dont know whats there to offer.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, generate clients on demand for me would be getting them to the site to sign up. Im a member, so they would go to the site. I mean, thats really the biggest form of me generating clients, is getting them on the site. And I can see everybody that actually signs up at that moment and moves forward. Yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, Im a safe utilize. Because one thing about me, I utilize what the brand has already done to make it work. And then I add to it some advertisements so I dont have to go that necessarily that hard on it. Unless theres something special coming up like the Grammys or a show or something. Then Im like, okay, I got to double up or triple up on my ad right now.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"If Im doing 20 appointments a month, I wouldnt frown. Id be like, thats something I can handle and manage. It wouldnt be over too much. Itd be just enough. Not too less. Not too much.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, well, considering the gentleman didnt call me when he said I really wasnt even going to entertain the rest of this phone call, but because you have a very comfortable way of how you approach people, I said, you know what? Hes a gentleman. I like the way he cares. So I continue to stay on the phone with you.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"$3,000, something new to lead them to that offer.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, lets just say how about this?","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, everything just in general, just worldwide digital distribution.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure, yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"For people that cant possibly afford the price, having a lower price point, youre saying?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay. Around what?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Through the backdoor.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yes, I have.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"How are you, Daniel with what?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Okay. Sounds like plan.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Sounds like a plan.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. Got you, brother.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Yes, sir.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I dont.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, I didnt receive anything to my email.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Called me at six yesterday.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Im probably more person one. Im just more about the awareness of the business and just growing the business because Ive been in the music industry for 38 years, so I know the business. So this is just basically creating awareness, giving opportunity to other younger artists. And that is awesome. Using that tool to increase the awareness.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]