[{"pageContent":"Okay, hold on. Its a video.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"You too. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Oh, hey, Alex. Its going excellent. How are you?","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Ive already put everything I can into this business. All I have to do is flip the switch, and Im doing it this weekend. Ive already positioned everything. Im just making some tweaks to the website, and I have everything ready to go. I was just going to leverage my network. Because I have a large network, so I was just going to leverage my network. How many people Ive helped, and I know they have a network, so I was just going to leverage that to see how much money I can bring in in the next 30 days. And then from there, I was going to ramp it up market. And get somebody coming to help me with marketing. Because everything is already done automated. So once the clients pay itself automated, its just easy for them to go through. Okay, just pull up my credit. I didnt even know it was this low. Its 563, so it has truly come down.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Sounds good. Alex, thanks for reaching out. I really appreciate it.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Im testing the market because its only minimal access to the information. Im only releasing the minimum, and Im trying to proof up the market so I can tweak and get feedback from the customers. So this is considered to me in my MVP somewhat, and then tweaking and get feedback from the market and the customers and build it up a stronger product. Now, if this works and it doesnt need much tweaking, and I will release I only release about maybe 30% of my full content. So thats the reason.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, my gosh. Ive been doing it way before COVID But what I would do, I would go into organizations and then do it live people that have an idea and show them how to start their business to some degree, right from concept, and then walk them all the way through as much as I can within maybe an hour, 2 hours, depending on how long they sign up for the workshop. But when COVID hit, I just automated it. And so Ive been working on this now since about 2021. More seriously, all of 2022. So Im about to launch, and what I did was just automate myself. I should say duplicate myself. Instead of me standing, talking, I look for white labor services that did what Ive done and help people, because a lot of people really dont have a clue. They have an idea. They dont have a clue. They need somebody to hold them. But I did not want to be that kind of like an online coach, but I automated it. So Im looking for third white label software that I can integrate and string together to help them.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. I did get it. I just havent watched it.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So, my pricing structure, I have an introductory price right now. Im going to go to a High Ticket later. But just for the introductory, I have about four packages. One is 99, and then the next one is about 700. The other package is nine, and then the last one is about 2100.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, hold on. I have to access my phone, and I was multitasking, so just let me stop what Im doing. Im here putting the final touches to my site. Yeah. Okay. Let me save this. All right. Let me go see what this is. Yeah. And another thing, too. The reason why I never really even go any further. With any of these programs. Because Ive been out of work now for going on two years. Ive just been having my head on trying to build it. So anytime theres any loans or anything. That people want to know how Im able to pay it back, thats where I get stuck and my credit score just take another hit. So I just decided, just put your head down, sandra, and build this thing out. Try to make some entrepreneurial journey. Yeah, because I know what I have, and I really believe that it will do well.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes, I did.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, I dont. I havent checked it. My head has been done just trying to get this product out.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay, because Im building an online business portal for people who want to start their business, and I was looking for, like, white label. I probably were going to take advantage of your program, but I was looking for something even beyond what I can do when I launch my online business platform. I was looking to see if I could offer it also for the people who are going to sign up for the same thing that Im taking advantage of. They could too.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Do you guys do white label of your business?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Its probably in the six. I could check real quick. Hold on. Let me check Credit karma real quick, because thats the way I go.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Say that again? If we could just focus. So I still keep my four packages that I have now that Im about to release. I still keep that.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Im providing them all of what they need, some of courses, which is like Mindset, and then how to go through doing the business structure, planning and marketing from concept to commercialization.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. So, of course, this has taken me longer than I wanted, so, of course, my money kind of ran out, and so thats the reason why I was really just trying to put my head down. Because Im so close, right?","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"My heads been down. Hold on. I had a couple of things I needed to get out. Let me go into my email. Okay. Yeah, its still here. I havent clicked on it. Let me open it, see if theres a link.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Oh, yeah. That would be good. Most definitely. I want to be honest and upfront with you, Alex, is that Ive had other people solicit me concerning these high ticket and how much it would actually cost me to do it. Money has always been because Ive been just bootstrapping this thing myself, and so money has always been an issue.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"It wont be a problem for me to bring this back up, though.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, what happened is that I had saved a lot of money. Because I didnt save enough. Let me just say that. But I saved a lot of money to push me maybe about six months worth of my expenses. I thought six months would do it after I resigned. Hold on. I have to stop to make sure Im doing this correctly.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Hold on. Im multitasking my no worries.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Hi.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I was up over 700, and it has taken a dive. Oh, my goodness.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}}]