[{"pageContent":"Yeah, I work as a maintenance mechanic. Oh, youre from Washington, right? I work as a maintenance mechanic in the Kaiser Optical Lab. I work night shifts. Okay. I work there for more than seven years now.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"05:00. We are of the same time zone, right?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I live in the valley. I live in city.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Oh, no, I dont know if I ever need a case study. I just kind of maybe click your links to know what youre added to my Facebook page or I click it and then check how do you do your scaling. But maybe you have a certain model of case study. For example, Im just startup. I dont know how can you help me?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, I dont know what you do. I mean, hows that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, one time I was thinking of doing some blog or Vlog, I mean video blogging about things that I could teach or things that I already or things that I could demonstrate maybe not wholly for this invention of us, because theres a little bit honestly, theres a little bit greed in it. We want to kind of profit from it. Thats why we would like to patent. But of course, I have other things in me. I mean, I have like 30 years experience as an electromechanical technician. I do have a masters degree in electrical engineering and a bachelors in electronics. And I work in many places already abroad. I work as a sailor, a seaman. I work offshore jobs. I work in factories. I work in automation. I did a little computer. I did a little sales when I was younger. I also manage some projects when I was younger. Yes, those are the things maybe in that aspect, if I read what you were saying that you are into those things, maybe you can give me some hint of how to do those things, because Ive seen that those things you post videos on YouTube or you blog somewhere, I dont know, Instagram or Facebook. You get income from it somehow, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You may call me something like basically a startup, but in relation to that, Im pertaining to one particular business. Im also trying to do some other things that would bring me income, like when Im saying like other business types of business modes. But let me talk about my main goal. Actually, I was part of a startup, an international LLC that I set up three years ago. Until now we dont have any funding. Its actually a company which will build a device which could be scaled not in term of maybe revenues. What I mean is that it could be scaled into a bigger system. Its a small desalination equipment using solar thermal energy desalination from seawater or brackish water to drinkable water. And then its like a filtration thing in small setting, but you can use it home or you can use it in larger housing complex, maybe a factory or company, a building. Then you can scale that into a municipal desalination thing or even the whole county statewide along the beaches. So thats what were talking. Its an invention that were trying to build a prototype and then well be able to market it as soon as we have the kind of good enough working model which we can show to people so that we could scale the system. You know what I mean?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Many things to do in this life, man. I just dont know if you offer me something. I dont know if I could put some time and energy on it. Im already kind of like into so many things. So well just see, right?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Around six we go out. I guess companies can come back. Lets try.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"On Saturday.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"What I was saying is that the one I told you about our project is not the only thing that we have in mind. We have smaller things we have seen and then we have compared various technologies regarding this and that and then we have other ideas, you know what I mean? Or I dont know, maybe Im just kind of like confusing you.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Night shift? It was good. It was good for a while. I mean, its a nice thing that I can do while my eyes my eyes are closed. And its honestly the best job I had in my entire life, so its okay. But you see, Ive been thinking maybe were set for other things. That job is okay, but there are better things to do. I enjoy it. Yeah. If you ask me directly, I enjoy it. Im kind of, like, about to make a change.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Were trying to enter granting funding for this one until we have success. But anyway, Ive thought about this, and maybe I can just use some other technique of making fundings, as well as I could do some other income streams. Right now Im trying ecommerce, some digital making things, and then a little what you call the activities. I mean, contemplating, just contemplating maybe real estate and maybe business or just contemplating still not, like, done yet. Im planning to maybe do some shop, something like that. Maybe coffee shop. And then later on, if this works, maybe this could fund our greater goal for the invention that we had, which would I dont know, I would sound like a boring visionary.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"But not Saturday, maam, because I think we have some kind of event on Saturday, the whole day. What Saturday are you thinking of? Anyway, let me pull up the calendar. I have to send my son to school in the morning. If you want, if you want. Can we do it on a Friday afternoon next week? Yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im interested in that, except that I just dont know if I could get more time in it, but maybe few conversation of few instructions. You were saying if you could show me then maybe Ill see if I can do it. Like if I could put more time in it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Statement? Yeah. Because I was grabbing my pants. Im actually in a hurry. I need to get out of the house. Yeah. Okay.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"It.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Those are times I have already kind of filled some slots. Do you have a Sunday morning?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah. My actual curiosity about you is that your company is like AI something. So it sounds like an artificial intelligence into going to business. So I just dont know how that currently done.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Maybe well just try okay, man, were not getting into anything. We can try 06:00 tomorrow and then well see if that will be possible. Prior to that, I mean, probably be available. But I was thinking that the whole day tomorrow. Im kind of full also.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Those are correct. Nothing those can be taken off. Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, nice to know.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes, all of them. But of course theres more.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im good, how are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"If it doesnt harm you and that doesnt harm me. It doesnt harm me, actually. That is okay. Yes, sir.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"ThatS one facet or one item that I actually would like to be doing? Not really like the majority of it, but its a side activities that I would like to accomplish before I kind of call it quits or just retire somewhere. Or maybe even if Im still breeding, I will still be doing that because thats not really a very tennis or physical thing. Its just like to kind of teach people the wisdom you kind of gotten over the years. So I think thats it. Thats very nice. Ive actually before thought writing a book about my electromechanical experience. But so many things has gotten in the way and then you need a little focus on that because its not progress over perfection. I think when you are kind of like at the end of it all, you want perfection. But of course, when you are looking for income streams, you look for some kind of progress. You know what I mean?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"In? California. Okay. Oh, cool.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay, yeah, fantastic.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"My goal, if Im still kind of like doing this, aside from my current work or job, I should have a funding of like 500K. If I have more than a million dollars in my pocket right now, I could kind of take myself out of my current job and just do what we go before. I mean, we envision before because its hard to get off my job. I make like one hundred k per year. So I think if I have to kind of get out of it, aside from the funding I should have for two years in a cash flow, I should employ myself and give me a salary of what I make in two years. Because Kaiser is already like if you get out of Kaiser, you also give up your pensions and benefits, something like that. So thats the thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Come again? Did you finish your youre already asking me. Okay, thats okay. Thats one thing that I would like to do. As I was saying a while ago, its all cool.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Midday? No, I dont think so. Thats a Friday, right?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Lets try on Friday, tomorrow night maybe around seven.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I just dont know if I could avail those consultation yet. But you just show me your kind of instructional or demonstration videos for now for what you offer, that may be good enough for me, then eventually Ill see, Ill decide if I can go on with the way we start our conversation with your guys there.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, I got you.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Okay, we can try 05:00 p.m then.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Credit karma, just like 710. The credit score is the only thing that you want to see. Im telling you, point out that I have more problems than that credit score because I actually played the credit score well and I was able to kind of benefit from it. But to tell you the truth, the reason why Im also doing this is because Ive also accumulated a lot of debts and something. But of course alongside with that, probably Im playing it a little bit extreme. I was also trying to acquire more assets into other business or something like that, you know what I mean? But anyway, I also was actually also trying to diverge into our conversations. But yeah, if you talk of credit score, my credit score is a little bit good.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, sometimes when I talk about it, I got bored with myself. And then maybe some people will think were a little bit nuts in the heads, but anyway, thats what we are.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, of course.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Can you repeat that?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"There will be no confusion.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"YouRe saying Saturday, like in the evening?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Thank you. Thank you. All right, bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"06:00 P.m., 03:00 P.m., 05:00 P.m., 06:00 P.m., its a 1 hour call.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Oh yeah, man, Im sorry. If thats the case, I cannot kind of take off what I already have for tomorrow and Saturday.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"My kind of knowledge that I accumulate over the years also being in the skill set that I had and also a little I was talking of like an electromechanical skill sets that I learned from factories, automations and some other things. Apart from that, maybe I could somehow give or point to test out some ideas that could possibly be useful. Not really the one that we are trying to build, but in relation to that is some renewable aspect feedback thing. Many things in which we could harness energy out of nowhere. I dont know what else people could make use of those. Its not an exact Ruben theorist most of the time. But what I was saying is that there are like proof of concepts but in which you could try it out or maybe, as you were saying, its like a demonstration. Its a training or demonstration for demonstration purposes. I could actually, as someone is doing it, progress into actual experimentations of those things. What I mean is that just like in any other business ventures, as you were saying, scale, you try out this small thing and then if its proven and its okay, then you get some revenues out of it, smaller, little bigger, and you try the next thing, then do other things. I mean, prove that it can be done and prove that it can be useful. Precisely what I would like to do with my main thing with our main invention.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]