[{"pageContent":"That could be.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"But again, some of the greatest coaches never played the game, right? Some of the greatest basketball coaches never played basketball, but they understood the strategy. I guess what Im saying to you is I feel like its like almost saying, how do you teach it if you cant do it yourself? So I want to get back up to bat and hit a couple over the fence. You know what Im saying to you?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Ill tell you what Id like to do. Yeah. I would be interested in that. I think what Id like to do is I feel like I got to get back into the race again.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. I have someone that used to work with me who I mentored, and he said to me, youve got so much fucking knowledge, you dont realize how much you know that you should be doing this or you should be doing that. Do you play sports at all?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, see, this is whats so funny. So Im in residential and commercial. I do brokerage. I also used to buy and sell property from my own account. I got out of it in 2000 and got tired of being a landlord. I am looking into getting back in and raising capital and doing it again. I am working on some hotel deals. So really, right now what Im trying to do is Ive been out of real estate for a couple of years, lets just put it that way. And while I was out of real estate, there were a flood of idiots that came into the marketplace. Okay. Im in La. Im in Beverly Hills. And back in the late eighty s and ninety s, whenever youd go out to dinner or on a Friday or Saturday night, you go to the restaurants or clubs or bars, what do you do? Hey, Im an actor and Im an actress. Im a model, Im a director, Im a producer. Okay.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You know what? I absolutely did. Lets see, what is it called? Airai.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"My name is Brand. I just wrote a book. How to Become Financially Independent. Okay.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, I got Im being sarcastic. So what are you up to?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right. And so what I want to do is I got to get back in the game, and then once Im back in the game, we can talk about what you suggested. But I think I need to spend the next year or two because were going to be going through a lot of stuff. I think I really need to spend the year or two hitting some doubles and singles and a couple of home runs. You know what Im saying?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Where did you go to high school?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"What I usually do. People come ask me to come in and close the deal. Theyll go and try to get a listing and theyll say, Marty, it comes to close the deal so we can get the fucking paperwork done.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Thats how you learn. You have battle scars. This time I got knocked off the horse and rolled down the hill. Im just getting back on the horse. Does that make sense?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Could you imagine what position you play?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Because the old thing is you cant buy experience. Right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And also, you know when you meet someone immediately, its like, oh, my God, Im going to marry this girl. Right. Its the same thing when buying a house. You know, when you walk into that home, thats it. This is exactly what Im looking for. You cant sell a house. What I am is really a matchmaker. I need to listen to your needs, your wants, your desires, and I got to match you with the right product. Now, if were talking about youre going to buy a house as a rental for an investment, then I can argue with you all day long, right? Because theres no emotion to it. Theres an emotion to buying a home, just like theres an emotion to dating someone or marrying someone. Does that make sense?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right, so my analogy, Ive been in Beverly Hills since 62. Ive been in this neighborhood most my life, so lets call it 50 years. I dont have another 50 years to move somewhere else and establish that rapport, that relationship with those roots.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay, so today you go out. What do you do? Im a flipper. Im an investor. I buy homes. Im on this. Every fucking dick is in this fucking business. Okay, right. Its like when you go to Vegas. Do you ever play in Vegas?","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Youre from Arizona, right? Right. How long have you been there? Your entire life.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"We could possibly do it that way, yeah. So basically the way you guys are structuring, if youre selling a $10,000 package to work with me, you guys are getting what, two grand, $1,000? Whats the percentage are you taking?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"And thats whats happened to this business. Everybody and their fucking mother is in it, playing the game of Blackjack, which is, Im a realtor, Im a broker, Im a flipper, I spec houses. I do this, I do that. And so whats happened is people have overpaid. People have overbought. People have gotten fucked by brokers that dont know what the fuck theyre doing. So they sell them shit that they shouldnt have bought or overpay for stuff. And so were now starting to feel I just looked at three properties now that are in foreclosure that are bank owned, okay? And its all starting to happen again. Being that Ive been out of the business for a couple of years, Im trying to reestablish myself, okay? The AI, this whole fucking artificial intelligence concept I love, and I want to see how I can incorporate that to help reestablish, rebrand, and reposition me in this hood of mine.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes, sir.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Lets back into this a little bit because I think we need to talk about something and look at something at a different angle. Sure. High ticket offers. Buying a home is a high ticket offer. Buying a 3 million, 4 million, 5 million, 10 million, $15 million home is a high ticket offer. You want to place that person with someone like myself that knows how to play the game.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, what it does is I pay them for a listing. If they set up a listing appointment, they get credited, lets say $500. But if that listing turns into I mean, if that appointment turns into a listing and they get 2500, they get now 3000.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And chess is like commercial real estate. Its very analytical. Checkers is like buying a home. And see, buying a home, you cant sell a home. Selling a home is like setting someone up on a blind date. You know when you meet that girl, whether theres a connection or theres an interest, right. But come on, shes really nice. You should forget about it. I went out with her. It was horrible. Im not doing it again. Right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Air AI. Okay. Air. Dot. AI. Were obsessed with helping businesses scale. Okay. You need to get into therapy if you have obsessions, my friend.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I need setters because I can get on the phone. And once you start to talk to me, you realize that I know what Im fucking talking about, right? Okay.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"So for me to pick up and do it again, I cant. So Ive got a route here. So I think the reality of it is maybe if theres a way we can take your technology and be able to go after high ticket buyers that are buying 510 $15 million homes, $20 million homes that are looking for investors. And maybe what it is, is there are these young 25 to 40 year old people that want to diversify their portfolio and buy real estate here in California, Los Angeles and Beverly Hills, in Hollywood and whatever, and rent them out and keep it as an investment. And that kind of situation there is where you could help me with a high ticket item.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Brian Page, the musician?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Hold on 1 second. Where are you located?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"And what I mean by that is 2016 17, I sold a $5 million house to a client of mine. It was a friend of mines house that I grew up with, sold it to some asshole that came from Florida, and he wanted to remodel it. And I said, Listen, thats what I do. I can help you do all that kind of stuff. And like a schmuck, I say, Look, I normally charge, like, $10,000 a month to be kind of like a project manager, like a design consultant to oversee it, since we probably take six to eight months to do this. But well do some more houses, and Im in for the long run, right? Well do this house, well sell it for ten and a half, and well move on. Well do a couple more deals. It turned into a two year fucking nightmare. Two and a half year nightmare. And he wanted $12 million for the fucking house. Okay? I spent six months trying to sell an overpriced house, which I knew I wouldnt be able to sell. Long story short. Then we hit COVID about six months later. So I was really out of the cycle for four years, you know what Im saying? Im 64 years old, and I had some personal things within the family I had to deal with and so forth. So in the last year, I have been back to work, and what I realized is how much fucking COVID fucked me up psychologically. I had kids to worry about. My son got COVID and really bad, like an adult. I had an older mother who Id make sure you know what Im saying to you. I wasnt single and 25, and fuck it, Im just me, basically. I know a lot of people that still dont even leave the house like they used to because theyre so conditioned. Do you know what Im saying to you? And I was always on the streets. Thats who I was. So Im just getting back into that. So what I said to someone before was, like, I feel like Ive been knocked off the horse a couple of times.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Do you know what Im saying to you?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay. How old are you now?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Not really, because heres the reality. And Ive set this up with people in my office that were working for me. At one point I was saying, look, it, for every appointment you set up, Ill give you a bonus. And for every listing, every appointment that turns into a listing, you get $2,500 for the first three houses. After that it goes up to $3,500. After that it goes up to five grand.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"What is called? Air. A-I-R-A-I?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"So I just need to get back on the horse. Let me start riding again. Let me get that trot going again. Im going to make it happen and then we can go to the next phase.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Because then it lists and sells right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So $5,000 10% is 500.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"So youre talking about.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Im in real estate.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, in essence is to me, when you play Blackjack, the last seat at the table is the most important seat because thats where that person can take the dealers bus card. Right. Youre playing against the house. Okay? But just because you have money doesnt make mean you know what youre doing. Just because you have money doesnt make you smart. Right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats fine. So basically, your program is really that is building high ticket item programs.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. So my question is when you were, like, 19, 2021, just out of high school, and you still had that groove going on, you know what Im saying? Youve been playing, and maybe you were CIF or whatever, right. There was something in your step when you were moving and grooving. You know what Im saying to you? Because you were in the game, you were playing it and you could speak it, you could talk it. But if I talked to you about it today, 20 years, 25 years later, you probably would be a great coach, right? And the whole thing is those that cant play end up teaching. Right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, but thats a good point. I want to be current because, look, my focus is working on ten to $15 to $20 million homes, okay? I know the business. Heres the deal. Commercial real estate and residential real estate are both real estate, right? Okay. Checkers and chess are both board games. The strategy of playing chess is completely different than the strategy of playing checkers. Right, but theyre both the board games, right. Theyve got squares and you move players. Yeah, but playing chess, you got to fucking understand that game, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]