[{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes, I am.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"The training? The physical training is usually what Im doing. I dont have time. Im doing it one on one. Im trying to get my model to be more a subscription basis where my one on one training would be very high end for a really exclusive subscription. And theyre paying for that at a higher end.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, I lost a little bit of your halfway.","metadata":{"fillerID":38,"fillerText":"Ummm yah","category":"F"}},{"pageContent":"AI.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. I wanted to see exactly what you guys do with you say scaling AI. I dont know anything about it other than what I do. I have a life coaching consulting business and physical training business. So individual personal train with working with kids and motivation from the physical, mental and emotional approaches. So what do you guys propose for businesses like that? By the kind of service?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im not going to have that.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Clients care about me.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, in my mind, thats exactly right. I would love to do it even to another level. I would love to do it to another level. Im going to be in debt right now, but.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, our lives are going to be changed each and every day as Ive seen dad do. What you feel me making a decision? You want to eat tonight? Pick a place because you like that place or because you dont like I dont feel like eating there. Okay, well, what do you want to do? What do you want to do? Im that guy. Changing your life, all that. I dont know. Im not saying it wont change my life. Im not saying it will change my life, either. Im just saying when you talk to somebody older, theyre not as much on the change of life thing. It probably was. It did, and I told you before, thats why I said to you, money isnt the big change of life thing. To me, the money isnt going to be the option. You get money so you can appreciate the things, the people, the things, the relationships. You appreciate it and you can show it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Dont just sit there and think youre going to do the same thing and youre going to get different results. It aint going to happen. So thats in a nutshell. Got it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Basis, $50,000 a year. Let me back it up in next six months. Id like to see it get to about $10,000 a year. $10,000 a month. Okay. At $25 a month, 24, 95 a month youre getting some things. It could be more, but Im thinking that could be a middle line of it. I have three different packages. Id have a free package too that I get people sort of like chum in the waters free. And then they would see what I would have on the higher levels and they can make the decision if they want to be at the medium, the intermediate, and then they want to be at the pro level and then they get to the higher level. So those things can generate up to $10,000 a month in six months if you get 1000 people or so, not even 1000, but you get a certain amount of people, 500 people. Okay. So the end of a year Im able to be able to offer some regional things. Ive had some things, Im coming places, I have a good showing on social media. My community is building. Im having the guests, Im having the coaches, Im having the parents, Im having the athletes, Im having the psychologists, Im having the people in there who are giving them information that they cant get from a parent that they cant get just from one coach. That they cant get from one team.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"No, I dont feel its an offer Im turning down. Im feeling its something youre proposing that you guys do. And I am saying to you youre telling me you do that, and Im saying, okay, you do that. Can I find out more about it? Oh, well, this is the parameters we work in. Okay, well, I dont know if thats going to work then, right now. Okay. Its not going to work right now. It aint going to work right now. That aint got nothing to do with what Im doing now. And Im about to go and have some lunch with my daughter and sitting with my friends and doing this. Id love to do it more. I would love to do it more. Yeah, thatd be great.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I have to hear them. They can do a lot. Im just being honest. I dont know what they can do. Obviously you do. And they have scalability and all that they talk about. Im going to be listening to them just to see if they make sense and if its credible, if its something that I believe in, if its some way that I want to go, if I think that that can work, a lot of people tell me what they can do.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"How much this is in the business? Yeah. And I dont know exactly what that entails for what youre talking about and what you can do. I dont know what all that means of what you said earlier about what you do. How do you do it? What do you do? Were on talking about money right now, about putting up money, and I dont even know what the operation is.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I know right now is right now. And thats why Im saying hang up the phone. It isnt going to its not going to make a big difference. Am I hang up the phone or say, okay, were not going to do it right now. Were not going to do it right now. Or is there another time? Is there something else? It may be another time you call. We can try to get this to work or something possibly.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, three or $1,004. Those are high end tickets, no doubt. I would say that $3,000 would be great if I had financing option in there from the people that Ive met so far. Those are high end tickets for people. If theres a financing package in there where you put so much down and youre financing at 100 something dollars every month and youre getting this, they would be able to work that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Im not even close to the same person I was before, right? Im older, but Im not super human. I know Im going to make mistakes. Its just now that I dont make those mistakes. Im not in jail. I havent shot anybody, killed anybody. Im not trying to kill anybody. Im not trying to get over anybody. Im not making craziness, never getting drunk, getting high, doing this, robbing people. No, Im too old to be doing stuff like that. Im a little wiser. So my wisdom has saved me because Ive gotten better as a person. The Lord is my savior. That wasnt always the case. Wasnt always the case. Its amazing. Its an amazing thing. When you live long enough, what happens, somebody saying, if you only knew. Ive been through only if I only knew stuff. I dont have a lot of regrets. When I go at something, I dont go sometimes just Im a little nervous. Im not nervous. Just make a decision and go from there. Things happen. Life is like that. You got a life. Youre going to have to be no, it has to be. No, it doesnt have to be. But everybody has their own initiative of what they want. But you got to accept things, too, on your decision. Just make a decision. Thats all it is. Just make a decision and go. And then the decision will control you. You cant sit and be wavering in between and go. It doesnt have to be, but thats what life is. Its okay to have 1ft in and 1ft out. Aint going to have that. I dont thats why I dont have that regret or have that animosity of, man, if I only wish its over. Thats not the way.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"CanT get into it. Tell me too much about it. Its all right.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"When I have a better gauge on some things. With my time, I can watch a video in 48 hours and I got going to be this I can call back, I can take calls. Im in a car now talking to you now. Im not somewhere sitting here. Im about to get off the phone in about another five or ten minutes once I park, because I got to run here. But my point of it is that everything is about decisions. Everything is about making those decisions. And I live and die by that. The business lives and dies by that. It thrives by it, too. So you called, I answered, and now were trying to see where it goes. Okay, call back.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thank you. I wish the best of luck to you guys, too. I really do.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"If I have the money to do anything to put me in a better spot, I do it. But what Im doing just want to know what is it that I go into a store, I look at the product that I could buy. I look at it from the shelf, I look it over and see, is it what I want? If I look at it and I see its what I want, I look at the price after that and go, oh, either Im going to not get it or I am based on it looks like it does what I wanted to do, but I want to get it. Do I have that in my pocket? Do I want to spend it on the credit? Do I want to? And thats where it is. So I dont know what Im looking at right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, maybe its going to have to just wait until I get a little bit more handle on some of the things that Im passing. Through right now with time of my clients, with time, because this is very important to meet my clients and their time and their time. Im loyal to them than I am for something that Im just establishing a relationship with you guys.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, the next step is just for me, it just depends on what your step is. What my step is? My step is what do you guys do? Thats all. The question is, what do you do? We scan what I do and I understand you heard me tell you where I would like things to be, but what do you guys do?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"A lot better. It has to be for us to get some things that we can do, but I dont put her even near anything Im doing because I dont want it to damage anything that she has. Theres things that we do for 25 years, but I dont put her in a liable position. Ive had it happen before, and I dont even consider it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"To be honest with you, Id say no. Weve had the quote, guarantee and have gotten burned by those guarantees. The trust factor isnt going to be there. Anything Im telling you is coming from me. Anything we got to do with spending money is going to come from me. Its not going to be because of her credit score or anything. Input.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Thats why I havent checked yet to see if anybodys in there right now. Thats the only reason Im saying its a good chance that they havent checked.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"It my credit score. As I said, I get my bills down right now. Its risk bad. Its bad. Im not going to lie to you. Its bad. Its under 500.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Theyre paying like 75 an hour.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, its the same thing I run into all the time with everybody else. Everybodys time is valuable, and they put value and they put their time into what they think is valuable. I dont know if this is valuable. Its valuable for me to fill out a form to say, call me and let me find out what you do. You ask me to watch a video for a weekend for 2 hours. Okay. Then you ask me to just spend an hour block out of time for an hour. Now Im like, block out of time for an hour.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"That might be the only thing that might work.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I guess I am. Thats exactly right. I guess some things are more important to me right now. My relationship with the clients that I have are more important to me than some things that I could probably do later on. I wont sacrifice that relationship. I told you about my wife. Im not doing that. So with this, Im not doing this. I can always wait and just say, hey, okay, this aint going to happen, aint going to happen, aint going to happen today.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"How soon after the video am I to be on that call?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"How do you do that? What does that mean?","metadata":{"fillerID":25,"fillerText":"Ummm","category":"D"}},{"pageContent":"No, I do not.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"There is having a business that entails having money to operate the business. Okay. And with that, there are things that are always decided upon which way were going to go and what were going to need and which way were going to operate, how we like things to be. With that, I put out there to try to find out whats out there. And Ive called people like yourself, I called organizations like yourself or companies like yourself who do this scaling who can take and make and produce it. They say, better than what I can. I believe they could, but just their way of doing it is sometimes different than what I probably am used to. I guess the best way to say it. So Im not leery of any of this. Im just kind of like, okay, this scalability. And theres always a factor of you have the money to do this, to do that, and we do a lot of things. Doesnt tell me a whole lot. We do a lot of things for how much money would it cost? We can do this, we can do that. Im not going to it blind. I just like to know if I drive the car. I like to know, can I get in the car? Can I see what the options are on the car? What are the different packages that are available and what do those packages entail? So if we cant get into it, I understand, but its not going to be a dollar line to me to just say, yeah, lets just start. Ill give you this amount of money.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Im doing it now. Im doing it earlier. You werent. No, I didnt tell you that. I told you I was duty.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, they have. Not on the Friday night or Saturday night, but they do on the weekdays. Should I say? Yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Do doesnt mean that I think you can do it or that I want.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Um.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I dont think so. I dont think wed be open to it, no. I dont put her out there for if theres no certainty on it. No, its not going to happen.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Im sitting here next year, and Im doing well, let me see. Doing a couple of things going to be my sounding board. Im debt free. One, okay. Im debt free. Meaning? And I say debt free, I should just say my credit cards are all paid off, okay. Im able to travel, get a ticket when I want to travel to anywhere to see who I want and spend the time what I want, and taking peoples dinner whenever I want and enjoying those relationships. Im not going to just make money, just keep the numbers. Just because I have money in the bank doesnt satisfy me. I want to be using the money to enjoy my relationships. Thats one big thing. Second thing is going to be if Im sitting here contemplating getting a new car, if I get the car I want, I go in somewhere and I get the car and I say, okay, I would buy it. Im going to drive out of there today, and its all paid for and its done. Im not going to have a payment.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh yeah, definitely. Thats part of what I want to do with a higher end package like that, which would include a personal consulting time with me once a week, twice a week. I have all these other things involved, which would be you would get the one on one, you get counseling, you get motivation, you would get working through visualization relaxation techniques, mind. You would get the mental and the physical and the emotional training. So you can do this stuff before games, during games, after games, all of that. Youre working through that for lets say, a years time, even during your season evaluation. So thats what I would see as a high end, the lower end, lets say. The other end of it would be you would get a newsletter. Youd be able to subscribe and get newsletter and get some information and resources that I would be presenting to you. Once a month. You get this newsletter and some things that you can do, goal setting, things like that very cool, more high end or say higher scalable things would be that you would get the newsletter. You get the same information, but you would get these weekly video calls. You may be able to sit in on a group zoom call or a group, whatever video meeting that I would present. Something from relaxation. It could be anything Id be having on with a guest speaker or whatever. Plus you get discounts on when I am going to do a talk somewhere in a regional area or something to that effect. So thats kind of what Im looking to build. A community of people, families who have young athletes, athletes from just beginning to higher end or going into college or some that are in college that would benefit from the mental approach, the physical, the nutrition, the mindfulness, the goal setting, the visualization, all these different tools that they would have. Or you just get a newsletter and you get a little taste here and there, but youd be paying the regular price for a seminar, a camp piecemeal. If you want to join us in one of our videos, youd be paying for that. Something like that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes. If Im sitting down. Which is it, the video or this training thing? The training hours.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"A lot of things about things in life with me, it was a time when I didnt go to church. I was acting this way, that way neither. And if I realize a lot of things when I was younger that I realize now, that is the riddle of life, isnt it? Life.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I dont know. Thats just something Ive always looked at. Im always looking at I want to have, like, seven streams of income. I always thought $10,000 a month just from some things that I would do would be great, just something that I have in my mind. But for me, and thats only like, about two and a half times of what Im making now. But if I blow my mind per month, youre talking six figures.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, she may. She may say the things this is what I dont understand when people do that, because you sound like a young guy who has that. And I get to believe and the thing you dont see is that you havent seen me. And my daughter, when I have said things to her about what I want to do or people have proposed this, and shes presented people to me, and she knows what Im doing. She knows what people but you know what shell say to them? You dont know my dad. Hes going to do what hes going to do.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I can only go on what I know. I only go on what I know and what I believe. And I do believe they care and everybodys going to have their own caring aspect of what they care about me for or even to that level. But thats an individual and Im an individual in this whole process too. And Im the one thats making the call. Im the one whos making the shots. Theyre not, they dont know half the sacrifice Im making for them. They may say, hey Anthony, dont worry about this, dont worry about that. But Im the one whos making the call. It means something to me. Now. I aint worry about what you all got to care. Im the one whos got to live with it, dont I? So the decision, Im not calling them up and saying what do you think Im trying to do? Im making that call. And they have been more than appreciative of some of the calls that I made behind their backs. They didnt even know until they find out. So I understand what is trying to be put together and if it doesnt being put together, okay, its just the way it goes right now. Im not saying forever, but thats just what it is right now. I make hard calls every decisions, every day. I dont have to weigh it too much of well, this is what I think and things are progressing and thats a benefit.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"SheLl say that too. Shell say that, too. And I laugh at it because its like I understand young people who are I love that. Its great, okay. But its okay. Youre not related to me, and I can feel you really want this for me, but its okay. You dont know me from just a phone call and its okay. I dont know you from phone call.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Dont worry about, go ahead.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im in a week. Thats fine with me.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No. Youre saying Im shooting myself in the foot. I dont know if I am. Okay, but heres the thing. You called me, okay? You dont know how many times you might think Ive shot myself in a foot. You dont know how many times Ive been successful. You dont know what Ive done before. You dont know anything about any other thing other than what Ive said to you.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"A couple of things have to happen. Id say thats 80% chance that will happen. Because I say that because when I dont have anything scheduled, because people havent scheduled it, I usually have somebody. I usually have them sometimes I usually have them. They schedule it and I give them a window.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im in Pennsylvania.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"It is only charged by the hour.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thats the time, but yeah, its going to be time. What time Monday are we talking? It has to be after 05:00, my time.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I dont know. Were talking. I believe you have a business plan. I believe you have business. I aint the first guy in the rodeo here, which you are, man, you probably have had successes. Youve had some people who didnt have successes I dont know. Im just saying that Im in it now, and so my percentages, its not as just I wonder if this can really work, or it probably could. Is this the right time for it?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Right? Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Probably a 07:00 P.m.. Im thinking right now.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"These are little measures that I go, wow, somethings changed. My life has changed. We were on the phone in April, April 13. I was on the phone with this guy, and here I am. And they go, when that changed, that would be my wow, okay. Not something is changing. Im going to take my family to a dinner or a restaurant. I get the bill, its $500. I throw a card or credit card down, its done. And it was like, order what you want, friends, whatever. Im donating $10,000 to take these kids to Disneyland, four days, whatever. Thats my stuff. I work at the high school now. I work with kids with disabilities, and theres things I want to do not just for them, but just for the families of them. Yeah. Businesses are great. Making money a little bit here $10,000. For me personally would be, okay, a game changer, but the real game changer, nice looking peoples faces would be these kind of thing, my relationships. Hey, you want to go to Florida and play some golf? Or you want to come to Pittsburgh and play golf? Hey, you want to go to California? You want to play golf? Im not trying to be joining the club or doing this because it cost $100,000 for me to join a golf club. Im not saying that kind of money. Im not going to be thats just not my boat. What I am, if I get to a point where I can buy an Audi R Eight, Im a car guy. So that just was going to be I just would buy it. I would buy it. But I know Im blessed that I could do it. So when I put stuff out there, like I hear stuff on the Internet and I have guys call me back and tell me, oh, we can do this, we can do this. Im like, okay, Ive heard it. Ive seen it. Ive done some things. So its a matter of taking it to the next level. What is the next level? What does it cost to get to the next level? Blah, blah, blah. Thats it? Yeah. Okay. It takes to get to be a millionaire in a year, six months. It takes a whole lot of gumption. It takes some things to be somewhere Ive never been before. And I tell people this when I train them and everything else to be somewhere youve never been before, you got to do something youve never done before.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"In some ways it might be. Thats a good question. In some ways, it very well may be. People do it all the time now. Im not saying no. I know people are very happy, and its not because theyre saying they arent making more money. I know people who are very happy, and theyre making under. I know a lot of people making under $40,000 that are very happy.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]