[{"pageContent":"Because Im still in the process of even building up my audience for the podcast also. Right. So everything Im doing is on my own. So never done marketing. Im just getting into it where Im starting to understand marketing a little bit, so everything is new for me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Do I see that as well?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"578. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No, I dont have clientele. I think I have the knowledge. Yes, of course. I think I do have the knowledge, but I dont have the clientele.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I launched this podcast in November 2021.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Twelve and six.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Because I just started, so I didnt know I just started off low.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I need to work on that right now on my website. Im only doing 15 minutes coaching, but its only $15.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I do taxes. Im a tax professional, but I was an office manager at the tax office that I was. So Im not the office manager number, but I do have my side hustle of taxes.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im learning like Im in like a coaching class and stuff now. Well, this is how I looked at it when I was setting it up on my website or whatever, because I wasnt even going to do coaching, so I was just like, I dont know, you know what Im saying? So I was like, okay, but then I was talking to someone, and they just like, you give everybody advice. You let people vet to you. Thats what makes you doing self care. Good, because you have that. Im a very sensitive person, and I feel when people said, I feel all these kind of things, and so people was like, you should start doing it. And then I was like, oh, no. So then I was like, Im going to just start off as like, Benton or Coach or advice sessions for 15 minutes and $15, because I can admit I probably dont I believe in myself. But my knowledge as far as like, oh, I never worked in this field before. Everything Im doing is just off of my life experience and other people life experience that I have witnessed around me. So I just was like, well, the more my knowledge increased, the more my price would increase. So thats the perspective Ive had of it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im doing good, how are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, it is rough. And I know if I do this with my business, I can work from home and still be able to do things for the kids, do all this. So I just dont really want that. I like the freedom that working on my own business from my own home. That makes me feel good because Im still able to do multi tests around my house. Im able to take care of this while Im working on this, Im able to do this while Im working on this. And then I have like ten years of work from home experience. So its no thing about being motivated at home, I can do that part. Its just get the resources and the knowledge to be able to do what I need to do.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Not much, I havent did any ads this year. Last year I think I spent about $100 to $200.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"578.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Ten K plus.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"About 2000. I really dont have a lot.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No. Well I mean I have ran like a couple on my Instagram as far as that for the podcast. But Ive seen something like Google Ads. Ive seen all these kind of things as I research and I just never dabbled in it. But the Instagram and Facebook ads, I do.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So I just thought of these two numbers and both of them gave me a little anxiety. But the one that gave me the most anxiety, I put 30K.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Okay, let me see. Sent it to my email.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"That sounds amazing.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Correct. That is 100%. I was just telling my mom the other day, I said I feel like I can really focus on my goals if I didnt have my financial financial things that come with it, because then Ill be able to really focus. But Im really ready and willing to put in the work. Im very ambitious, Im very hard working, so the work part aint the thing for me. Its just that nobody in my family ever owned a business. So Im basically learning from scratch here and just reaching out to people I dont know or different things I see online to try and get that knowledge and resource.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hi.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"What would I have them doing? That would be my marketing, my phone marketing and responding to emails. Those are my biggest thing that takes the most time for me. Setting up post, making sure posts are going out on the time that we have them set up for, and just being that consistent because thats one of the things that I will say will be the hardest for me is just the constant posting and recording and editing and everything. So the marketing will be my biggest thing and then that will be my biggest thing. What would you call it? Like a marketing receptionist kind of thing?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I know, but yeah, I think that would interest me because I see a lot of people stuff thats like that. Then Id be like, theres a lot, but then I understand too.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. I heard the first part about watching it, but you said the last thing you want me to write down. What kind of questions?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, so right now I started a business and then I dont sell anything. I started a business and then I end up pivoting to just a podcast. So its a self care podcast or whatever drops weekly. But now I was working like full time, but now I have open space, so now Im trying to open up to make money from the business now and from the podcast. So I know I just dropped merch and then I was looking to do some one on one coaching and try to put together some courses and I wanted to kind of I dont know how to go or what to do to go into that direction of the coaching and the courses and how to set them up. And I think this is the one where you can use someone else face to do the courses. Right. Is this what I did? I think this is one. You do the videos?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Each year? Unless I made more, I think it was like close to 40K.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, so I dont have a number goal, but I know Im going to tell you what my goal is. My goal is to be able to strictly work for this business, like live off of my business. So I want to pay my bills effortlessly, and I want to be able to save and invest. My monthly expenses are around $3,000 a month. Thats just the max, $3,000 a month. So I want to cover that and have extra. So ten K. But the end goal for me is to be a millionaire. You get what Im saying? And thats the goal for me is to be a millionaire, take care of my family effortlessly, take care of my kids without the headache of how Im going to pay this bill, or I cant leave this job that I hate because I got to pay bills. I want to be happy in life and not stressed out. So I want to live comfortably, but with extra, if that makes sense.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I have lately, since I havent been working the job I was at. But thats another thing. I was just going to say I want the freedom too, because I dont get to see my kids. Im working this job, that job, by the time I get home, cooking dinner and sending them to bed. So I do want that freedom that it will give me to be able to really be a full time mom to my kids and be hands on.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Oh yes.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Regarding my business personally?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Obviously, thats just my mix. Ive been heading to go for a while now, but yeah, ten K plus.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, thats my savings.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes. What is that though? Can you explain that a little bit more to me?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"But Ive only been out of my job for like a week or two, so it just seemed like a little vacation instead of like I dont know. I dont know if my mind hasnt came to the realization that I dont have a job yet, but before, no. I take them to school in the morning, Im gone till 07:00 at night.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes, I have two.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I want some assistance with that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}}]