[{"pageContent":"Thats where my primary office is, in Scottsdale.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"And that just depends on how much it cost.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"See, thats where I think theres a miscommunication here. They dial for themselves to set their own appointments.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, man, barely. Its still raining cold here and it doesnt turn to summer until July 5. It rains on the 4 July every year.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Would it be more than $100 a month? $150 a month?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Well, I do that already. I train people outside of my oh, you do? My agency as well? I dont charge for it. I just want people to make money. Im not interested in making money by people paying me to be a trainer. Okay, thats fine. I want when the money exchanges hands, its because insurance is sold. Thats what I want. And the reason why is because when I have trained people in the past, I do get a cut of their commission when they work for me. I make 1020 25% off of when they make their sales. But it adds to the legitimacy of what Im telling people if Im not charging for it, and then they make money anyway. See what I mean? Right? And so this AI is everywhere, and so people are asking me about it, and I use a rudimentary version of it thats not all this new stuff thats out now, so it doesnt work the same. But what Id rather do is this is what Ive been trying to do. Ive just been trying to put together a game plan for my current people and for new people so that they can come on and things will be easy. We know that they need leads. We know that they need appointments. They already have enough stuff going through, and theyre getting licensed in the insurance industry, learning product knowledge, how to talk to people and all that kind of stuff. But the hardest part for everybody in this industry and why they quit are because people are assholes on the phone when we call them. So you have to have a really thick skin in this business because everyone thinks youre trying to take advantage. And so if these were interested people that set their own appointments, which means that theyre more than likely going to have higher intent instead of because we dont cold call anybody, then thats going to make everything easier for everybody. Then everybodys going to make more money. And so I was hoping to have a game plan where its like, hey, do this first, do this second, do this third, and your tools sounded like they could be something that wasnt marketed to me, but its something that may be adaptable to my industry.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, you too. Bye now. All right. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, if thats the case, then is that what you want to do? You want me to make an appointment with this guy, then? Sure, yeah, lets do that. Thats fine.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Cool. All right.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Pivot to say you dont know. Yeah, I completely agree. I am interested in that. The reason that I didnt make an appointment to talk with anyone is because I dont want you guys to waste your time with me when you could be actually selling to somebody else. Im in sales too, you know what I mean? And so I was just really curious on if its even adaptable. What you just said is appealing. So I would like to hear more about that. As long as the person thats going to be calling me on the other end of the line understands that thats really all Im interested in, unless they can adapt it to my industry, you know what I mean? I dont want to waste anybodys time ever.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, I am an agency. I have agents that work for me. Okay. But primarily what I do is I generate leads on Facebook and Google and stuff like that. And they go through my funnel and my CRM, and it follows up and does all that kind of stuff. But in general, Im just on the phone all day. And what I was hoping for, because sometimes people do make their own appointments on my calendar. Those are the primary people that I talk to. But the rest of my day is really filled up, trying to get in touch with these people, to set appointments with them so I can go over things with them. And it takes up a huge portion of my day. So I was looking for a tool that could help me get more people to be setting their own appointments, to have these phone calls.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"It works a little bit differently. So I dont generate leads for them. Usually what happens is a lot of people buying leads through lead vendors, which are just people that generate leads and then sell them to us. And all they do is they sell heres the name, phone number, their birthday address, and they inquired about life insurance. I dont really like that. So I generate my own leads. Its at their expense. So technically, in a perfect world, what I do is Id like to just generate enough leads and have people set their own appointments enough for me to just work with the people that have set their own appointments, so then I can dish these other leads that didnt make appointments off to my agents. See what I mean?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Great. Sounds good.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Because I use predictive dialers all the time. I have three of them that I bounce back and forth with because my number, it does get labeled as scam. I make sometimes 200 phone calls a day. So getting around that is really difficult. And thats why most of my appointments that Im scheduling now are usually through text message or through people setting their own appointments because the people dont answer the phone. But thats an industry wide problem. And so we have all these different tools. Theres phone burner, theres prospect boss, theres ringy. Theres all these different tools that people are trying to use. And they call themselves predictive dialers. They call them all different kind of stuff. But if theres one that avoids the spam filter and doesnt get listed as scam, likely that is appealing to me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"About 30 minutes. Yeah. If we schedule the 331, its going to be cutting it extra close. I have an appointment at four. Okay. If it goes longer, Im going to have to tell them. Look, I got to go. 630 is I have appointments booked there and I do in the morning. I have this gap in between eleven and three right now thats open tomorrow.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im good. How are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Is not going to help you.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Go ahead.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I have about 30. But as far as people that stick with it and actually write business consistently, theres probably only about five. And the reason why is because nobody answers the phone anymore, and they cant set appointments, so they get frustrated and quit. So if they were just appointments on their calendar and on my calendar, you know what I mean, the same thing, then it would be not only would they make more money, but they would stick around. And of course, I just use myself as a guinea pig trying stuff like this out. I used to sell stuff online using ClickFunnels and all that kind of stuff. The kid in the ad, I recognize him. Yeah, but anymore, I dont sell a tangible product anymore. So as far as people going through and buying on their own, yeah, we have an insurance company that they could do that with, but I dont make as much money as when I talk with them on my own.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, this is Brett. Hey, man.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, so I was curious about it. I didnt know if it was worth taking up peoples time to schedule a time to talk about it. In all honesty, Im not in digital marketing or I dont sell products or affiliate stuff. Im in life insurance. And so Ive been curious about this AI. Just as a time saver, I need to generate leads and I need to set phone appointments with the leads that come in. And so I was really kind of hunting around, you know what I mean? And it sounded interesting, but thats why I opted in for it. There wasnt a lot of information on there, obviously, because you guys are open to set appointments to do that for people. But yeah, thats why I put my name in there, to see about more information. But I hadnt made an appointment to talk with anybody yet.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. How much would something like that cost?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"115. That works. Oh, wait, hold on one. I was looking at Texas time. How long do you think the phone call is going to be?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"30 minutes. 115. That will be you said 03:00 too much. 115. As long as its under 45 minutes, Ill be good. When I said a 04:00 appointment. Thats Texas time. Thats central time. Its 02:00. Here when my appointment starts. And then Im running a zoom meeting from two to four, which is going to overlap that, but thats a sales training, so I wanted them to hear me on some live appointments. Yeah, 115 will work.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Know if it would work in my industry, you know what I mean? Because Im not selling things on Amazon or that kind of stuff. Sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im Pacific. Im in Seattle west coast.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]