[{"pageContent":"Yes. So being that Im kind of still kind of new to the opportunity, I would say 100,000 is feasible based upon the knowledge that I do have and then also the knowledge that Ill receive as well. But I would say 100 plus. But Im open to more just to scale it up and to grow it as much as you can grow. But thats what Ill go with for starters. Just 100,000 per month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Just business. Like the basics of business, having a certain acquiring a certain mindset and just kind of elaborate on that particular topic or those particular subjects. So that way, I think if you have a basic foundation and a general knowledge of business and kind of the ins and out of it, then I feel you can pretty much get into any business and be flexible. To run that business and be successful once you get into it, to maintain it and to keep it going for as long as you want or need to. I love that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I feel I could, but not quite the way I want to, not quite the way Ive gained insight on how to do based on some of the things Ive learned and some of the knowledge that Ive acquired. I would say, to a certain extent, not fully, but yes, to answer your question.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Yes.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"All right. How are you doing? Good.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Good, and yourself?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I would say, lets see, give me 1 second. Let roughly about 60,000 annually.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I think so, but if you wouldnt mind, just resenting it so I can.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes, I think its a good balance, but based on our schedules and their schedule, yeah, I think its good now. But I think, like I said, what my motto has been there since I was a teenager. Theres always room for improvement. You can always improve and make it better. And thats what Ive been doing. Ive been trying to do diligence and researching and kind of looking and seeing what opportunities are available or anything that I might come across if it piques my interest. Something that Im kind of lines up with, what Im kind of familiar with to a certain extent or maybe just learning about, then I try to pursue it. But now Im at the point of where Im trying to just take some action. Been doing a lot of due diligence and doing this and doing that, but now Im really trying to take action. Like I say, just a lifestyle. The lifestyle that I want to live or the lifestyle that we will want to live. My family and I will want to live. I feel like Im still fairly young, but then Im not that young. So I was like, of, I need to start now because then I want to set myself up and my wifes up for success financially. And then also I want to set my kids up for success too. Give them opportunities to take advantage of as soon as they can or at a good age, and then just give us options. Different options is what Im looking at right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. Its 605. Not really that good.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes, but they keep me in order. They keep me going and keep me on my toes and keep me doing what I need to be doing, too.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I guess kind of based on what I was saying, having the time, and time is money, not just money within itself. And that will free me up more time to dedicate to opportunities like yours and do some of the other things that I explained as far as, like, the needs, first of all, thats priority. And then also the once. I mean, sometimes the once is kind of a need because you need to kind of take a break here and there and do things with your family, kind of get out of the normal routine, daily routine. Your wants kind of becomes a need, too. So you need to need a balance and need to pace yourself. And to me, just think off the top of me thats some of the ways I think I could do it. Or maybe just go to a social event here locally, like a zoo or I dont know, an event they might have at school, social gathering, things of that nature.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. I dont really have any businesses at the moment. Im looking to get some going. Im not 100% sure when the time frame and all that good stuff, but I noticed kind of something trending and that could be giving a little more leverage with the businesses. So you want to take advantage of that and kind of doing a little due diligence, so to speak, on my own. And Ive seen that, I was like, oh, okay, that should be a good opportunity, and to just incorporate that into the business or businesses that I acquire at some point, thats kind of where Im really thinking.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"You too.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Work wise, Im doing working from home, customer service work.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, I sure do. I have two girls, seven and twelve, and I enjoy them, try to spend as much time I can with them and its never a dull moment. And enjoy family time and helping them with their homework if they need to and all that good stuff.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"As much as possible, to be honest. Minimum. I would say minimum. 100,000 plus.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I would say when I say need to do, maybe like taking the kids to school, picking them up from school, or maybe doing chores as far as maybe groceries, picking up groceries for the house and things like that, or doing things around the house to keep maintaining a home, and then thatll be the needs. And then at once, I dont know, maybe going on a vacation somewhere or taking a trip, doing something locally. Yeah, just kind of go with the flow like that. I would say.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, sounds good. I dont mean to go, but I have call I was waiting for and that time, but no worries. Thank you for your time and Ill be of course.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Not really. I think I feel I could do better as far as time management, if I was to have an opportunity that would allow me to do that or the opportunity like yours. But its okay. Its all right. Itll be better. But I do what I can when I can and as best as I can.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Sure. Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I think they got to get to the point where its automation, and then I think thats where the AI come in. And then making money while Im sleep. Making money 24/7. So that way I dont necessarily have to be doing the opportunity. Or I could do it, but I wont have to be doing it all the time, and itll free up a lot of time. Time is money for me to do other things and maybe do other things that I want to do or do other things that I need to do and not really have to second guess about it and just to be spontaneous with it and have it work in my favor.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Trying to improve any income is just me alone or combined with my spouse.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes. I dont really have any all I have is $100 right now. So I know thats not really much to put into it, but thats all I have at the moment as we speak to allocate toward it. So just being transparent with you.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}}]