[{"pageContent":"Yeah, I am.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Its not the kind of business that falls into business processes like youre talking about. I did some work in the middle of all this career where I got a job in the largest company in the world on the stock market at that time, which was Cisco. Because of my education, I became a technical trainer at Cisco. I took a hiatus from the whole construction thing, and I did that for a number of years. I became an expert trainer, but I understood and I learned about all these corporate processes. Its a lot of overhead in companies like this because theyre huge. Theyre 150,000 people, and theyre global, and theyve got offices everywhere. Multi language, the whole bit.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Doing what we do in America with home building, its usually just a guy like me or two guys partner up, and Ive done that. And the worst kind of ship is a partnership. So I just dont see how we would fit at all. I just dont think we do. And I think Ive run out of my time today. But I want to say thanks for calling and talking with me.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, in the old days before color TV and before the Internet, I would do a lot of door knocking and I would just be working on one house on Oak Street. And when were in the afternoon, when were about finishing up, Ill start walking through the neighborhood, knocking on doors, literally saying, hey, were working over on Oak Street and I see that your house is also in need of a roof. Would you like a free proposal? And I would measure the house, I would write up a handwritten proposal. This was before computers, right? And then people believed me and trusted me. And I sold a lot of roofs like that. Or my husband will be home later and I would give them a card, give me a call if youd like to talk about a roof. And youd be surprised how many times the lady of the house would give me a 50% deposit for a roof on a cold call. Ive got that aura or that face that people just trusted, at least back then. And Ive supported. We did roofs a long time ago. Then I grew into doing building. So now Im going to be basically completing the circle and heading back to doing the roofing stuff. And well also do home exteriors. Like if I get the roof job and they need a paint job on their house, sure, Ill call the painter. Subcontractor. Everything is subcontracted. Ive got no employees.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. I only have a few minutes though, is I can find cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Yeah, man. Thanks.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"The day, I just dont want to do that though.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Mike.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And Im looking for apartment. Ive got some apartment complex opportunities that Im bidding on and those things run into a million bucks. Okay. And Ive got one, thats 121 townhomes and its just under a million dollars. I got another one thats just ginormous and its going to be like six or $7 million to reroof all these apartments. And I dont have those jobs yet. And thats a totally different kind of sale because now Im talking to corporate owners, big dogs. These companies are worth hundreds of millions of dollars, if not a billion dollars, in fact, with all their land holdings. And then a little guy like me comes in and says, hey, Ive been to a lot of your properties around Raleigh, North Carolina, and you need roofs everywhere. How can I help? And of course Im loaded with a proposal and a price for what its going to cost. When I did that, and this has been well over a year that Ive been courting them. Then I went over one day driving by and I saw another roofer, was putting a roof on a couple of buildings. And I watched. I actually talked to the guy while he was there. He thought I was somebody that lived in the neighborhood, so I was just picking his brain, and he was short changing this apartment complex big time. He was doing things youre not supposed to do right now. I cant be a Tattletail either, but I can say, hey, I was buying one of your jobs. We dont do the same kind of work. Were way better. Were going to have a longer life on our product. Were going to have a better price. Were going to have were going to have Im not sure that Im even really appropriate for what you guys do because its a one man show.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Good. Glad to hear I remember what you guys are about.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats the business driver that Im doing for myself what I need to try to do.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Were in a transition right now. Ive been a custom home builder for about 100 years and literally like 45 years, and Im transitioning into doing residential reroofing. It takes me a year and a half to get paid. When I build a house, I can do five roofs in a week and get paid five times in a week.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sell it and sub it, not shove it.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"At the same time, though, this is still a cottage industry. Its a mom and pop shop kind of an attitude. Right. Meaning you dont go to college and get a degree in home building. You work your way up through the trades. I happen to be a guy who got a masters degree, and I was a public school teacher, and I was a broke public school teacher when I had children. And I said, Ive got to find something to do for summers. And I started painting. And the lady said, well, the paint looks great. Can you put a new roof on? And I said, I guess. And I put a roof on, and it leaked, and I had to come back and fix it because I didnt know how to do roofs really well. And off I went. Learning. And then I started building houses. And Im an expert now, but its still a cottage industry almost. Heres what I mean. The divide in doing home building is either youre a giant corporate big company and you practice in like, seven or eight states, or youre what they call and Ill say this with affection, its not usually meant that way. Youre a truck, right. Youre a one man band, and you find opportunities however you source them, and you get to do the work. Like going and knocking on doors. You dont go knock on doors and say, hey, would you guys like me to build you a new house? That doesnt work, obviously.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"More or less. Yeah, thats right.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes. Interesting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So just a whole different thing. Obviously, Im an older guy now and I want my transactions to be excellent, but I want them to be short. Right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]