[{"pageContent":"Im going to apologize for the dogs.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yeah, absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I dont. I could check while were on the call. Its been a lot of a roller coaster because of my divorce. Theres been actions that my actual wife has taken that have damaged my credit score. Having said that, one of my best friends actually has a credit repair company. And so he said, Look, I know for a fact Im five weeks away from wrapping up my divorce because weve got a date on the calendar to go to trial. So if it doesnt happen before then on that day, well go to trial and well wrap it up. I say that because his name is Chris. Chris castigar his company. He said, look, with the kind of stuff that youve done to your credit, two to three months, we could get this 100% fixed. And he actually proved this to me. Five years ago, I bought a two and a half million dollar house here in La. And I wasnt in the best credit space. He made me write a few letters, make a few phone calls to the credit agencies, and Im not shitting it within less than 30 days because we had already kind of decided we made a final offer and we were going to start the closing process within 30 days. He raised my credit score like 180 points, and I was, like, over 701st time in my life. So Im not worried about that. Im in the 600s right now, but I wouldnt worry about that. Like, if I just had to push pause and say, okay, well, lets wait for all that to happen three months from now. All right, lets just table this.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Its going okay. Tell me about Air AI.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I could do more. I could do 20 if it was like, okay. I could really see a lot lower risk than what Ive seen in a lot of the country companies Ive looked at. Yeah, Id feel comfortable.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Got you understood. Very interesting. Im curious whats your overall results youre selling? Are you really trying to get people from zero to that Series A? Is it specifically on that startup stage? Is that primarily what you focus on?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Ill answer that with a weird answer. Ive never really been focused, and I think thats the problem. Ive always kind of like when people come to me. They come to me with a problem. They come to me with, hey, I took a perfect example. I was at a wedding. Gentleman invented a medical device, comes to me and says, dude, I dont know what Im doing. Someone told me, you can help me. And next thing I know, Im flying to La every few weeks and redid his pitch deck, redid his PNL, started going with him to his investor meetings and just being like the second voice, that kind of stuff. And theres been lots of other things. My ex wife, when we had our son, she was just bored being at home. Hey, you dont have this idea for a beverage. We built a brand called Kids Love, which is whats called a functional beverage. Its basically gatorade for kids, no sugar. She had no idea what to do with any of that. She went to college for, like, dance and spent ten years in bands. And when we got married, she had no idea how to even run a business. And so, boom, I turned her into a CEO. Shes now very successful. Yeah, thats the thing, is, I felt like if I talk to you guys, you can look at me, because everyones so good at looking at you from the outside and seeing what you are. We all suck at seeing ourselves, how we are seen from the outside. And I felt like if I hooked up with the right people, you could look at what I do and say, look, buddy, youre doing these 100 things stop doing, like, 90 of them. Ten of them are really money making opportunities. The rest either its just not 100% authentic to who you are or whatever. Thats the conversations I want to have.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, man, for sure. So what kind of industry do you work in?","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I feel like the second one is going to be more money making. Right. I also have been playing in that space heavily for the last 1518 years, so Im very comfortable in that space dealing with younger people. I would do that on the side. I mean, if you told me, hey, look, Alex, that makes a lot of money too, or it makes just as much money, then Id be like, I got to think about it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Tell me your name again.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I think its right. 650.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"100%. Yes, sir.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I have no idea until five weeks from now because I dont know what my alimony, child support, all that stuff is going to look like. And its going to change. Id say right now, if you ask me right now, what could you do for the next five weeks? Id say, youre asking how much I could put in the business a month.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I havent checked, but I can check right now.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"One thing I suck at is marketing.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yes. Lets see. I guess you guys texted me a bunch. Just got your info. Are you new to the high ticket coaching agency Space? Are you looking to scale? Yeah, I saw those messages, but I havent gotten anything else.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Exactly. A lot of this is also, like, sometimes being able to if you told me youre a computer science student and you told me, hey, I dont know really what side of computer science to get into. What Ive done as a mentor with college students is. And by the way, I offer my mentorship for free through a company called Everwise. Its on my LinkedIn profile because I enjoy it that much. Like mentoring people, coaching people. It is such a source of energy for me that if I could do that all day, I wouldnt feel like Im working. It would be, like, awesome to do that, you know what I mean? But I have to do all this other stuff because Ive shoeboxed myself into like, oh, Im the It guy, and that stuff pays more, and thats the catch 22 for me. Its like I want to pretend Im going out and playing golf all day and coming home feeling like Im that guy, but right now I go to a job all day.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I do not. Everything I do is word of mouth.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I want to be realistic. Right. So Im comfortable if Im going to go down a different path. Remember, the key point for me was as long as Im making the same amount of money, but Im happy when I come home at the end of the day. Youve solved my biggest challenge. Having said that, Im in the process right now of evaluating a lot of different business opportunities. I guess because Im an American and I believe that money makes me happy too. I know thats a fucked up thing to say.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, more. So no, sorry. No. On that end, Ive only been doing about maybe two to three K a month. The rest of that number is coming from essentially being like, youve heard of all these things like software as a service or this as a service. Im kind of a CTO as a service right now. Yeah. The 80% of me is really just doing the tech stuff that I hate.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Perfect.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"YouRe able to get by the end of the year. Yeah, if I be pushing about this, my ultimate goal. Look, the woman Im getting divorced from, her family owns a very wealthy theyre very wealthy. Theyve had a great run of success. And during the ten years I was married, Ive been used to flying on private jets, going to Europe in the summer, and renting out fucking ten bedroom villas. Im not saying I need that, but Im trying to get there. Im trying to figure that out. Yeah. We go skiing 810 times. My buddies go to Alaska on helly trips that cost eight grand a week. I want to keep doing that every year for the last decade. On my birthday, I go out to Indonesia, and I spend two weeks on a boat, and I surf with them. As I get older, its like, I want to do more of that, not less of it. I used to own a boat and go wake surfing with three of my buddies. We all own the boat together. Its like, yeah, I want more of that. So I dont know what that number is. Go ahead, go ahead.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah, great.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Got it. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I mean, I get how all that stuff is done. Its just not something I enjoy doing. If somebody gave me, hey, heres, like a little recipe book of how you do it for what youre trying to do. I jump on that, for sure. Im super tech savvy, so I can figure it out. Its just not something I enjoy doing. So I guess thats why I havent.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That sounds great.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Well, Im in court in the morning and then Im probably going to be sitting down with my team to just go through some stuff and then same boat on Tuesday. Monday is a prep day for that. And Im just being honest. I dont want to position myself where Im going to not be successful at that. Thats like the biggest thing going on in my life right now. Im wide open the 17th and wide open the 19th, 18th. Im free from like eleven onwards.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Ethan from air dot a I Correct.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Ill be out of court like by 01:00. Im free again for phone calls. Thats what I mean.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"All right, Ethan. Hey, this is a good call. I appreciate your time.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, if you called me Tuesday, anytime after 01:00, that would be perfect.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im actually in court tomorrow. Is there any way to do this on Tuesday afternoon or Wednesday?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im just kind of closing my eyes and sitting on it for like a second before I love it. I feel like if you ask the business version of me, the business minded version of me, what I would probably do is set up two totally different websites and as a product manager, this is what I do for a living. I would test them out. I would say, okay, lets make one of those guys and lets make another one the other one of those guys. And I would just market the shit out of them and do both of them for like three months. In that way, I would test them out and see, okay, how do both of these feel when Im in motion? If Air AI focus is to say, no, you cant do it that way, you got to pick one. I would say I would want to have a conversation around whats your experience in either of those camps, and if you have a lot of experience, guide me a little bit in terms of because just a quick story about me. Im going through a really nasty divorce. I currently blow around. I have a $6,000 mortgage. I have another $6,000 rent. My ex wife has just destroyed my finances. Im so oversubscribed financially on everything. And so that stresses me out and I have to be fair to my future me that, yeah, I have been for the last five years making over two hundred K a year. Id love to double click on something like this, but if I do, Ive got to make sure that it at least does above what Ive been making within the first four to six months.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Last two years were right above 200. I think one was 208, the other was 220.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Pacific Time.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"The other thing is one thing Ill just throw out there, and I dont know if this is in the wheelhouse of what you guys do, but a lot of my plays in the last ten years have been with the very early stage. Startups have been, hey, I dont have to charge my full rate as long as Im willing to get some, you guys are willing to give me some equity. So a lot of times Ill come in for, like, Medtech startup was a great example. I was only making normally Im making around 161, 80 an hour with those guys. I came in, I said, Look, Ill do it for half, and then I want to get I got a pretty substantial I think it was around 3% when it was finally diluted with all the investors. And then what was nice about coming at it from that angle is that I created an invention, a patent, basically. And so if I would have worked for the company, that would have been just part of my job. The company would have acquired the patent. Right. But as a consequence of just coming as a consultant, I acquired the patent of which I shared the rights with the company. When the company actually sold to a larger company, I cashed out on that invention. So Im always open to really weird structures, and I like looking at those kinds of things because theres much bigger upside and theres a little bit less risk for the client because theyre like, all right, well, this guy gets to prove his worth, right? Were not really paying him that much right now, but if it pans out, it pans out for all of us.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And the way you guys structure that is well, I have one question. So in that hour, how much of that is structured in that conversation and then how much of that is open to kind of QA?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, sure.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Obviously, Id have to look at the ROI of all that, but I feel comfortable putting ten K in.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, that would be sure.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"All right. Thanks. Goodbye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Its my birthday on tomorrow, actually, and Im doing something with my kids on Saturday.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Okay, hold on. Let me just walk outside. So its been around, like I say, on the lower end, around fifteen K a month, on the higher end about 20. And thats been like, Id say the last two years have been like that. So thats a pretty good, I think, benchmark for where Ive been recently.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, Im kind of like in between what you guys, I think, are trying to get people to do better. Ill mention it real simply. Ive done business and It consulting for about 20 years. A few years ago, well, during the pandemic, I opened my own company to do the same. It was for a variety of different reasons. And then I have spent the last, I dont know, eight years doing more, like, on the coaching and mentorship side of the house. Now, I havent had a ton of clients from that direction. It was something that I really enjoyed it doing, and when the opportunities come up, I do that. But I would say its like maybe 10% of my time is spent that way. And so it was like, oh, when I saw that, oh, thats compelling. Id be very interested to understand how to do more of that and less of the other stuff that I do, because, honestly, 20 years of doing that, Im kind of getting bored.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So is this a one time thing or is this like a monthly thing?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}}]