[{"pageContent":"You a little more internal resource. Yeah, sure. Im a consulting coach, I teach credit, I teach branding business. So basically I teach people how to start a business as far as first Adobe credit, and then I make digital courses on what they can watch, ebooks that they can get to help them as well. What else I got? I think thats about it. Just courses, ebooks and classes and stuff. Ill be doing like coaching classes and stuff.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, I was happy. Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, I got two.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yeah, Ill be right wait on you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So I got introduced to a guy that was doing credit. It was one of my mentors, and he was fixing credit, and I was, like, following them. I was following him. I was following them. Im like, you know what? Let me go try. I tried it. The results was good. I kept going at it, and then I just added the business credit to it because it has something to do with regular credit.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay? Yes.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, Im still here.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I did.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, really?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont know. I would love to do it any way I can. Whether its on social media, whether its out in the streets, whether its at work or something like that. I always wear my brand out so people get asked questions, and thats how I get my clients.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"When I was rocking it, I made, I think, like, seventeen k. Seventeen k?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Probably like 20 00 30 00 40 00 yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Theyll go to like, Sam Cart and then theyll get this stuff from Sam Cart.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats brutal, too.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Im good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Line cook.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yes, thats what Im going to start doing. I just didnt know I was getting more into learning the whole content thing before I started the ad. So basically making the content for the ad, making the ad video and stuff like that, I wasnt too strong on that side, so I was just like, let me get a little stronger here and then I can run ads and all that other good stuff.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So just being consistent and I wasnt being consistent and I kept getting distracted by little things. I was letting myself get distracted by stupid stuff, so that stopped me up a lot.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"All right. Meaning that I walk around with a shirt on or whatever the case may be, I might get a hey, so you fix credit. How do you do this versus me being on social media with the bio structure? That what I do. You know what I mean? It will say, like, the credit tutor, or I fix credit. Got the link right here and stuff like that. So people will go to the link versus me outside, going to the gym or going to get some food, or just walking around with the brand on. And its like playing fish, like going fishing. Might get bait, might not get the bait. So might get the fish, might not get a fish.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That sounds good. Sounds about right.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah. Amazing.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Give me 1 second, please. Give me 1 second, please. Hello?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So the front end, I went over this a couple of times, like a while ago. So the front end will be like the offer, whatever I offer, theyll go there, theyll go to the link and theyll get whatever they see on the link. I think see the ebook on the ebook. But then the upsell will be like, let me upsell you this course for XYZ. So pretty much basically try to upsell the person at the end of the sale. Yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"One, I wont have to do it too. It makes them more comfortable with the business because somebody reached out to them, like somebody actually cares about them. So it gets them that. It makes them want to tell people, Im with this company, hes amazing, he makes credit. They reach out to me often. They tell me how my thing is looking. They send me emails of my credit and stuff like that, whatever the case may be. So the person will be reaching out to them. And even when it comes to putting people in the system, you know what I mean? Ill have the software, though. The person will know how to use the software. So if I were to hire two people right? So one people were the software, getting leads, generating leads and stuff like that, getting everybody in the system, the other person will do all the cold calls. Like anybody needs services or need help with anything that I can do to help them, then thats what they will do to reach out to them to see what they need help with something.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Okay, thanks.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"No, I just want to be the regular person that teaches finance or literacy, whatever. I do like my credit. They know me for the credit. Just the credit guy. I dont want to be XYZ. He do that. Thats too many. Thats too much.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hell no. Its cold as heck out here.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Oh, a week. A month. I want to see more than that. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No. The only time I did something over the phone, if it was like a consulting call or like a consultation, and then after that, then Ill see from there. So I never did anything over the phone unless its like a family member. Ill close the deal on it or somebody I know. But if theres somebody out there that I dont know, then they normally hit me up on Facebook or Instagram and ask about some stuff, and then theyll click the link, and then the link will get them to where they need to be at. As far as questions, I give out, like free games, talking about a lot of credit stuff, little hacks and tricks and stuff like that. So answers their questions as well.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"West Philly.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"None.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Like ten to 20? Maybe more than that.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"You know that. Yeah, definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I wont have to do it, one.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Almost a year now.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Just hire a sales team.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"The internet in boxes.","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}},{"pageContent":"Thirty k. I wont have to work. Kids will be taken care of, will be paid, and Ill still have money to do whatever I want to do with it.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Okay?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So my course was for a regular credit course was like $500, and for the business and credit course, it was like $1,500.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It was working great. People, they wanted my service, they wanted me to teach them, so it was pretty dope. If I didnt stop what I was doing, like last year and stuff like that, I probably would have been at my 30 month. But things happen.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Okay. No.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So right now, Im not making nothing. I had to take a quick breather. I had a couple of losses in the family and just dealing with a lot of issues and stuff, so I just stopped. Im starting now where Im not making anything yet right now, Im just pretty much putting everything together as far as getting my emails list out, getting to the phones and all that put together and situated just pretty much backtracking where I started at before, but just finishing that up by putting that back together.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"So the bee grow is probably like 30,000 a month, 40,000 a month. Once I start getting that, then Im going to shoot for more goals. I just wanted to touch that to see if I could touch that first before predicting a different goal.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So they all will be one cart. The only way I would package is all together. I would charge like a high ticket for all of that to be packaged in one. But I separated all of them so people could just grab individually.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes, of course.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No, Im using the money that I get from my job to put into the business.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"ThatS one of my no, not really. Because you can wear your brand anywhere. They just want to ask questions. But not nine times out of ten, not a lot of people want to actually go look it up. So its better if they know about it and they already have in mind that theyre going to look it up. You know what Im saying?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, its on and off. Last week was like, in the stuff like that. This week is like mid 50s, low.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Nothing actually. I was actually thinking about making everything once, but I didnt know if that was like the right thing to do or if I was doing too much. You know what I mean? If I package everything up, you know what Im saying?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"C-H-E-A-D-L-A-I just saw an email address. All right. Are you going to send over the resources and stuff?","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Like closing closing in on the person, like closing the deal, actually getting the client to get the product and just like following up. I wasnt being consistent with following up on anybody, which is terrible because I was supposed to be checking up and see how everybody doing. They got something to do with me. So that was just a lot of things that I wasnt doing and it messed me up.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes. Have training calls with them, meetings, et cetera, et cetera. Cool.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Im not sure.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes. Thats why Im looking for different types of approaches, different types of things to do to figure it out, to help me as best as I can.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Last year? As far as working? Yeah, like 6000 in Texas or something.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"There will be a consulting call. When theyll click the link, it will be book a call with me. Then theyll have the hours or the minutes, how many minutes or how many hours and the price. So they will always be able to book a phone call and then talk to me about whatever they want to get or if they have any questions and stuff like that about the product or about something. Theyll inbox it to me like, hey, I dont know about this. Then Ill be like, send them to the link, book a phone call with me, then got them there, and then I close it off from there. Got it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"If I was to hire somebody, probably if I had the lead and the client probably cold calling. What else? Just cold calling, reaching out, see if anybody need assistance or like anybody thats on the email list, just reach out to the people on the email list, see if they need service or anything and just following up.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Got you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Amazing.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"No, what is it?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, I was by myself, so I was doing it by myself, so yeah, it wasnt too bad at all.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. And just being consistent with them, consistency and stuff like that, it was keeping me back.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thank you so much.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No. All right, so they will get the ebook, upsell the client after that. Then Ill follow up with the call or email on how everything went.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Whats that? Me, the front end and the back.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Yes. And if they had any problems with getting it or receiving anything, then feel free to welcome the inbox or write me on email and then well figure it out from there.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Ads would change a lot because its an ongoing thing, you know what I mean? Ongoing video. Anybody from morning to night overnight will see whats going on without it going away. So I will get better engagement in ad via me just outside for a hot second, and I got to go do something else, you know what I mean? So its like ads will work a lot better than what Im doing now because I wont have to re upload a video. I will have the ad running for five to ten days, 20 days, and I could switch it up if I want to and have that running. So theres a lot of ways you could play with the ads.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"It will look like me not being that much reachable. So it will have to be like probably like a virtual assistant helping virtual assistant. This automated systems will work and help me tremendously. Instead of me doing everything like, all right, well, I got to do this, and now I got to figure this out and then I got to figure that out. So theres a lot of figuring out. A lot of figuring out.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"P.m.. 03:00 P.m will work.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Good looking, bro. How was I getting my client? Facebook, Instagram, I knew a couple of people and thats it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So the curriculum I was teaching, I started over the basic stuff to credit, to move on to more intense credits, then move on to how to make money while you build credit, then moving on to the business, how you start the business and how you gain capital from the business and stuff like that. So it was, like, very intense.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"So the upsell will happen at the end of the when they go to check it out, when they go to check out the checkout page, its like an upsell and theyre like, wait before you hit submit or something like that. Whatever the case may be. Would you like to buy this course or would you like a coach call from me for XYZ? Or would you like anything to upsell the ebook?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I will. I really need it. Thank you a lot.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, so I fixed credit, actually, so mine is like 760.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, I dont think I did. I didnt receive nothing in the email.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yeah, it get real hot.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Come on.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, dang it.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}}]