[{"pageContent":"620, something like that. Horrible.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Sounds cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"The more the better.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Because its not consistent. I operate through thumbtag and central piano business listed there, so I depend on their leads. And 90% of customers, they dont even answer. So maybe a lack of my marketing knowledge, despite I know a lot about marketing and stuff.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I tried to get rid because Im pretty old actually, but obviously its no way up working, especially when you have minor keys, like seven and eight. Yeah, 67. Its a new stage of life there with the young wife. Left them in Princeton. But to get less field job because, frankly speaking, to attract the customer or make a nice expensive repair, I start to move pianos again individually. So I have a piano band or some helpers, some guys. I used to have a big shop, actually, in 90s, but 2008 its collapsed. Now, just before COVID she divorced me. I had to provide it for kids, obviously. But to make a story short, now its a new stage of life. I have a younger again, a younger woman at least shes close my age and shes in Manhattan. High maintenance girl. So I got to have some income. But my goal to do less. The freaking physical job, I dont mind to tune, but the moving is it would be better to give it to the moving companies. You see, its ridiculous to do that. I get good money if I take the order. If I see people usually toss all the older pianos, which is completely out of range. And then thats where my expertise begins. I regulate them. Clean tune level, culture services. Upper class piano, I do, or I do from old American piano, I do like completely beautiful sound and contemporary sound. So its a whole world in itself. I dont mind doing that. Same time, why on planet Earth the guys sell brand new items just to not even have them in stock? Thats what Im talking about. Ecommerce. And I kind of spend a lot of money.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im not sure. I have a small company like piano service, piano tuning business. Moving, tuning repair, try to sell, maybe open the store, set up, sell the pianos on the Internet, stuff like that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Now, at the very moment, its unfortunately almost none. Its kind of almost nullified. I dont know how I spent the last month was almost ten grand, and its gone. I dont have even money for a mortgage right now. It was stupid of me.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, sure. How it works. Actually, maybe not. I still cant comprehend it. Kind of.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Mortgage that we said yes for April. Well, I probably jump in the van. It is horrible. Yes. I shouldnt do last month. I should save money for because I barely recuperate my mortgage and Im still kind of in the house. It was horrible. Years after divorce, people live in my house, and they didnt pay the first guys and all Latinas, they didnt pay two years and another month, year and a half, and I barely repassed my house with the courts.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Very natural, right?","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Like ballpark, its like 47, but everything goes on business expenses and stuff.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Its bad. Now you said its bad. Yes, it is bad.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Sure. Currently, Im open to learn if its not too late. But it seems like a physical world, like piano tuning grabs so much energy and you never have kind of strength to pursue a new venues.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"No. Maybe yes.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Sorry, from where?","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Maybe? Yes. Sure.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Give me an idea that I do consulting and I do the physical service for acoustic pianos. I play digital with the bands and stuff. But the company doing business servicing, piano, moving, tuning, buying, selling, and hopefully set up something from dealers to try to sell it as ecommerce stuff.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, not much. It goes up and down like maybe three, four, 5000. At least.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, it should be, frankly speaking, contemporary life. Like with my new girl, it should be at least 20 grand a month. Like very minimal. Just to have even the place to live. I dont know if its better. Opportunities will be better, of course.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, piano lessons, I have conservatory degree, but piano lessons, I kind of leave it for the girls and women. Im ten times better. Master piano technician. Like the concert. I can teach how to tune pianos, obviously.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thanks a lot.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont know. You tell me what your company is capable of.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, I can imagine I just a little shy about going public or so especially frankly speaking, just in terms of a Dyslexic, youre always by yourself.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Unfortunately, its not available. I spent a lot money on similar guys like you about investments. It was stupid of me. I didnt understand the nature of investment. You have to have, like you said, assets to make an investment, invest here and there, and a lot of spend on those virtual venues. Yeah, I understand. So you actually coach coaches. Maybe Im in the wrong spot right now, but maybe if I accumulate some funds Im going to get back to you.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah. It was a big.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I told you.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Sure. If I sort of keep myself physically moving around, I can make sometimes 10,000 amounts, but its still kind of not enough. It seems like it needs upfront investment. I spent, frankly speaking, lost money on those kind of enterprises. And people usually charge I cant even find them, like investment.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]