[{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"ThatS very vague, what you just said. High ticket consulting business. I dont, I dont really right.","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}},{"pageContent":"Okay, all right. Maybe if I could understand a little bit better what it is you do, then I know how to better answer some of these questions. Like asking me a question like, why do I need money? I dont get that. Its like, why does anybody need it? You got just as good a definition about why you need money as I do. I dont really have a good feel for what you do. Right.","metadata":{"fillerID":29,"fillerText":"Mhmm","category":"D"}},{"pageContent":"What kind of consultant? What do you mean?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Yeah. Okay, so thats the end result of the whole process. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Well, this particular program also includes pension plans, life insurance, and annuities. And Ive been a financial advisor for 35 years.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats kind of cerebral. That kind of question is not germane to the conversation of making money. I got plenty of reasons why I want to do that, and a lot of them arent that much different than yours, Im sure. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. Well, is this what you do? Is this what you help people get into consulting?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"We share in the profits with them.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, awesome.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Okay, well, I dont really know what your process is, and I guess I need to understand that a little better, which I could do sometime next week, or if you want to send me something, I can look at it.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"40,000 a month? Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"What am I consulting?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Itll let me live the way Ive been living my whole life. Okay. I dont know how to answer that question. I could ask you the same question. What does money do for you?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay, yes.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No, that isnt right. Look, theres 2 million financial advisors around and they all say exactly what you just said. I got a better way to help you make more money. Okay, so this whole other program that saves you introduce yourself by saving companies money, thats not something a financial advisor gets in the door. Traditionally, the traditional financial advisor gets about five new clients a year because they all do the same thing. Theyre all swishing around in the same bucket and they all do the same thing. This is a different angle and a different thing. Thats how I built my business, my prior business with a different angle to get people to be interested in talking to me. So thats what its for. Thats what this cost saving thing is for. Because what you said is theres 2 million guys that say and companies are just totally bored with hearing about that. What are you going to do? Look, one of my last job or the last thing I did was when I sold my company to Morgan Stanley. I worked for them, okay? So I was getting five new my system, I was getting five new accounts a week. The guys that were in the office, in the Morgan Stanley office in a very affluent area were getting five a year because they didnt have anything to say. They said the same old crap to the CEO. If they even got it to the CEO. They said the same thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"The reasoning?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"No, I dont own it. The name of the company is Growthmanagementgroup.com, and theyre in Michigan, and they have a whole suite of processes that they go through to save companies money. Okay. Old fashioned saving money for companies.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats a lot of conversations.","metadata":{"fillerID":44,"fillerText":"Yah totally","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats a lot of people.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, thats a good place to start out to build a big company. Okay.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Well, your answer fits into pretty much 90% of the people why they work and try to make money. So thats pretty much what Im after.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thousands of people every week? Correct.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right now? No.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"All right, very good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, its a program that Ive got about ten different ways to save companies money.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]