[{"pageContent":"Okay. On the low end, its what is it? 2200. And the high end, its about 20,200 to 20,000.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"The way they do it? Like this. Because when theyre part of the system, when theyre there, because what it is, when you send it out, you give them the name. They already have the name. And what they do, they got access to the CRM, right? And then what it is, they find the lead because they find it through me. Oh, here it is to set up, because we give them the information, and then once theyre set up, they put them into another category where they put its called getting started. And then once they do the getting started, they have right there the information to what you call it, and then that information is sent, which is basically wire transfer or credit card.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Believe it or not, Ive gotten quite a bit of leads when I really put my head into it. I can probably generate about 80 leads a week or so. Okay. But thats mainly like Facebook like form leads, you know. But the form leads are very dime a dozen because people just put, you know, theyre just hitting their button with their finger. And then it seems to get a little better luck when I put out, like I say, a landing page, and then they go to the landing page because it makes them work a little more for it. But it just seems that its far and few in between who really want to get into this type of business. So thats been my experience with it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, great.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Its mainly trying to find how can you say? Well, its targeting that, if you ask me. Its a very specific niche in the sense of youre looking for people who want to do something else besides what do you want to call conventional type job and try to get into this type of line of business, which is an online business. So thats basically it. This has been my take on this. Theres a lot of people who want it who want to do that, but it dont seem like anybody does anything about it. Does that make sense.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"But the majority do go into it for a business.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No. Yeah, of course. And thats the thing with this thing. I basically call them, I only call them back. I only give about three calls. And after that, I just let the autoresponder do its job. But Im very weary about not weary, but Im very skeptical with the emails. The only reason I know who doesnt for how many years havent we gone into a list? We get emails for years and years and years, but I am a believer of when somebody is ready to whatever it is to sign up or do whatever theyre going to do, theyre going to do it. And I know its a bit of a numbers game, I do get that, right. If youre trying to sell a little quick $50, something, you might have a better chance. But here it is, really high ticket. And I understand its a certain crowd, and I kind of know about people got to be warmed up to it. That I do get. And its a process.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im sorry, repeat that again.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Okay. The way the company works, if you look like this, if I see theyre qualified because we got a script we got to go through. Right. And we kind of go through like an interview process. They seem like theyre potential. Its funny because its almost like the same questions youre asking me. We ask the same we just want to see. I know youre just trying to do the same thing, just trying to see if were a fit. And then what I do, I set them up with one more call, and in the same company, they got some people who have a lot of years experience, and then theyre the ones who try to close the sale, you get me? And they dont get anything out of it. They just do it. Theres a lot of people who just do it for the same people like myself or in it that theyll dedicate, whatever, a couple of hours a day, and theyll sit on their calendar, and they just try to help, hey, let me help this guy close it. Let me help this guy close the deal. Or you can try to do it yourself.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"And then what it is, its high ticket, but its marketed as a business opportunity as well. Not just a product. You purchase a product, you can go market it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, I set a goal, obviously when I started, because I just started, Im very new to it, so Im not going to say Im an expert. When I see something online, like, I probably ran into you guys somewhere, I dont know where, something. And I go, well, this seems to be where Im at because its a very high ticket, but its like a high ticket business opportunity. So thats the way Im trying to sell this thing as not necessarily just not necessarily a self development product. Right. The same product helps you keep you not just motivated, but helps you get into break your limiting beliefs about the business, if that makes sense.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Just do this. Put me down. What email address do you have for me? What Ill do, if I have an issue, Ill just try to reschedule it. Do you guys use, like, a calendar or something like that? Or was it a calendar?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, I believe so.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, I put a goal about 100,000 a month. Okay. I gave myself a twelve month period. But Im coming into that when I got into this, everything I do, I go like this, full bore, wide open. Its not the first business, its the first online business I really attempted, but Ive had conventional we still do, I think got me a little frustrated was the amount of money you spend on marketing into the return. Okay, I can generate leads, but like I said, not very high converting leads. So they cost money. So then what I did, what I did, I scaled down on the marketing and what I did, because when I first started, I just kind of went I was going slow tweaking and tweaking. Then I went a little crazy and put a little more in it. And I was getting leads, but nothing was happening. So then I tried that for a couple of months and then I go, okay, maybe Im going to scale it back and just go one kind of with an ad, tweak the ad a little more and just work it from there. So Im really just trying to find the audience, if thats the word. Like I said, Im new with all the lingo, too. So I think thats what Im trying to do, really trying to find that right audience that resonates.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ive taken some and Ive passed them on. It depends.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay. Heres the thing, though. Today my date is literally booked until seven or eight tonight. I want to promise him that. I do want to see it. I want to see what you guys are about. Im curious. But you know what? Because I do the same thing. We send them a two hour presentation. Its funny, its almost like we have the same almost process. And then I try to book a call. I hate when people say, oh, I didnt get no time to look at it. And I go, well, you should have told me. I dont want to do the same thing to you.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"For instance, if you go on the low end, if you do like the low end, its like something like 1900. On the next tier, you get 5000. Okay. And then the next year its like I think its $18,000.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Oh, yeah, of course.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Oh, its probably somewhere in well, last time I checked somewhere it was like in the 700.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Typically both.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, correct.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, because thats the thing a lot of people book, and Im not kidding, Ive had my calendar full and literally wasted about, like, 6 hours in a day because people just dont do shit. Id rather be upfront and say, hey, you know what? This is whats going on, and cancel with plenty of time where Im not I dont want to waste your time because I know the feeling.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Probably more evening. Are you going to email me this two hour presentation?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Got it. Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes, because the majority basically when I get a lead, it comes in, I capture the information. What I do then I try calling them, or I call them, lets say, and if I get them on the and its probably one out of 20 may want to learn more about it, and then the rest are you get a lot of is this going to cost me money up front? Thats the very first thing you hear. Thats kind of like almost half the people part of it. I think theyre just so used to seeing so many ads about I think theyre so used to seeing ads systems that you have to pay upfront. But thats a whole nother issue because people, they want everything kind of free sometimes, and they dont want to do any work. They think, oh, Im just going to push a button and Im going to get income coming in.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I looked at it, and obviously something caught my attention.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its kind of a strange thing. It revolves around its a personal development, like digital product.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, I do.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, we keep talking over each other. No, but what I meant is like this. If you send me the email with the calendar on my calendar, and then if I seem that Im running behind, I cant do it just because this week is a real busy week for us, because, mind you, we have another business we do run. And then I do this kind of more. Not on the side, but theres some weeks where I can put a lot of time into it, and then theres some weeks that are a little more not as much time. But I want to be able to say to reschedule or cancel with the guy, because I dont want to. Like I said, I hate when I got a scheduled call and they dont even answer me, not even get back or just blow you off.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes, it does. It goes directly into mine. Then I pay the company back. I mean, honestly, its really solid, what they do. And their stuff is really good for me, its like in the marketing, because some of the people like, for instance, like I told you, the guy who got me into it, hes been in about six, seven years or six years. He does well. He does really well with it. Hes an older dude, but he does well. He only works me about 40 hours a week. He likes going camping a lot, but he has it kind of set up. Its just interesting how he gets consistent. We call sign ups a month. Interesting. It is, trust me. I dont know what it is. I just think maybe hes been in the game for longer and knows how to he has a little more mojo.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"For about maybe about four months.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im in California.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im trying to remember or something familiar.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Look, like I said, Im a distributor in this company, right. And there are some people in the company that do six figures monthly. The person introduced me, he makes somewhere from the 40,000 to 50,000 averages every month. Theyve been doing it obviously a lot longer than I have, but Im trying to just learn say that right, okay. They have a funnel system. Obviously the way they work is like this. You put an ad, obviously you try to generate a lead, you call the lead. And if they seem like because you got to kind of either or disqualify them. And if they are, you send them what we do, we send them another video presentation. You call it follow, proceed forward. And if theyre not, then you kind of try to what youre doing the process we have, what is it exactly that you guys offer or do?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Go ahead.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, yeah, lock me in for 03:00. Im just curious when you guys deal with other say, what do you want to call high ticket? Either coaching. What kind of coaching? Fitness coaching or any type of coaching, man.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You know what? Honestly, that works much better for me.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Until 03:00 in the afternoon.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Go ahead. Im sorry.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Not too much. Maybe about average, maybe like 7000.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Lets go in the afternoon.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. The ones that actually answer the phone is probably a third. Youd probably know that. Probably a third, if that. And then out of those three thirds, maybe another 3rd May, I say another 3rd May. See the information, keep proceeding to the next level of this.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Of course.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, sure.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No, I collect it and then I pay them.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Is that like replacing ads or something?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}}]