[{"pageContent":"I dont do VMware. Im just clarifying this. Im not an AWS guy, and theres a lot of work on the street. I was contracting as corp to corp. I came off of a contract in February. Right now Im in on a W Two situation with company called Kindral, which is the spin off of IBM thats handling all the IBM systems. Sort of a different business venture that IBM is elected to cast. Theres a lot of mainframe systems out here that need modernization and a lot of applications that still run on them. And theres a lot of demand for people at my age, Im 64, who still have and understand those skills to come into a relationship whereby youre providing that service that got the demand for those skills, as well as training up those behind you so that theres people available to continue to support these systems. Theyre not going away because the applications on them are robust and large volume transaction. And the cost of trying to rewrite those applications is seriously way too expensive. Most organizations will not take it up. So their best course is to modernize their platform. And thats where I come in. I do all kinds of software engineering and system engineering, network engineering, and the whole gamut, project management gamut associated with projects related to customers need. Thats me in a nutshell.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So I started the business in 2012 after semi retiring with at and T. I started the business in April of 2012. I operated out of Florida. I moved up here now to Maryland, so Im running the LLC out of Maryland. Particular contract I was on started April of last year, making $100 an hour through the end of February, basically February 20. So Im still seeing ten grand a month net right now. And Im looking at myself, what am I doing? Am I just satisfied with just that opportunity? No. Im actually online looking for another gig that I can also do.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Got you with someone not to disclose.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Youre saying selling the model of how to build the business, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"It is not a monolithic thing anymore. Its multi. Multidimensional. But what standardizes it is n number of different types of operating systems. Theres x number of apps. And that kind of brings it into a common zone or domain space that you would be providing tech services in. Theres a couple of spaces. There telecom, datacom, security, networking, probably auditing. And I would stop right there. I dont think thats enough. So Id have to be very strategic about what Id want to offer in terms of It. But the business consulting that can stretch across businesses that dont have the same maybe theres external building cleaning service.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats constantly evolving. Its all not necessarily. There are certain components of it that are transferable customer to customer, but a lot of customers are doing different things with it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Hey, man, whats up?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Going into a business and Ill say and doing an environmental internal environmental scan. External environmental scan. Looking at their suppliers, right. What kind of business model theyre functioning in, whether they have merger, ongoing joint venture partnerships, relationships, and synthesizing that and saying, look, theres a better way you should be operating your business. Heres what its going to get you. Three months, six months, twelve months, 18 months out. Your growth trajectory is right. I think we can move you up to 20, but heres what its going to cost to do that. Basically, were going to take apart your business and were going to put it back together with some additional handles and bells and whistles that give you competitive advantage.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I agree. Lets have that conversation on the 24th.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"So youre talking about scaling up to 100 grand a month. Right now Im doing about anywhere from 15 to about 24 a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Finding discovery early before Im analyzing it and deducing synthesizing how it might best fit my objective.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I do want to hear about it. I dont want to do it right now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"If its the type of thing where Im out looking to land opportunities, where companies see, I want to say have a vision, where AI provides a need that enhances their business yeah. Thats a quick environmental scan of a business. What is it that you do? How do you do it? Whats your process?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Take five minutes and Ill let you tell me what you do for sure. Theres two sides to this. Theres the side of it that says it may be a fit, may not be a fit for me, but theres the other side of it that youre telling me, and I may think, hey, but that is a fit for this other area of work that Im very connected to involving, which is correct. Its actually international in nature.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, essentially that is the model Im working from currently because well, even though I took the W two gig when I started back, I came back into the market It space last year. And the way I came into the market was as a startup, not as an employee.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. And Im okay with the transparency. The conversation is an eye opener too.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"The sooner I move away from the It space, the better. It requires you to continuously sharpen your saw. Its changing a lot, and its rate of change is rapid.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I got seven minutes.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Because youve been doing consulting size.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"They dont like data to be left on machines. Theres that and then theres the support, just desktop support, the Windows support. Theres a lot of that required all over the world right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I operate out of Maryland.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Build relationships with other small medium businesses, qualify so that I can be able to bid on, set aside government RFPs along with teaming or teaming along with medium and large companies as that niche skill set and minority business. Having the box check to say that I meet that qualification so that I can compete with a small pool of entrepreneurs, small businesses, rather than sort of sitting out there on the open market. It takes a lot more effort. But I have people great, I have writers, I have people who are adept in contract administration and I do have folks lined up for office management. So I have my own team that I can launch if I land a contract to run the operation.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I sell a product. I have a service. Its it services, publishing services.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So youve got to do a little discovery. There fact finding. And then now youve got a handful of opportunities. Then youve got to sell it. Youve got to sell that. My business has the competency and the capability to do the things that are on that sales brochure or marketing brochure. Right.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"In the government, theres everything from managing projects, documentation. Theres all kind of opportunities that you can sole source on or bid on that pay, competitively pay. The government is fighting for resources, too, so theyre their offers for resources, for contracting is lucrative.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Schedule might look like.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right. A million bucks is not a lot of money anymore. It used to be.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Communicates the expectation.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Then these folks are thinking about me and then its about being sensitive, but Id say proactive and following up and trying to get in the room where the person who got the pen to close the deal is ready to sign off.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That kind of a mindset, but has very an entrepreneurial, aggressive hunting kind of tactical approach.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I havent really researched your company, although Ive heard about a couple of one off success theres, those that youve been successful with. And whats your win loss ratio? How many clients do you have in my space? Who am I talking to that in my space? Thats done well by you in terms of few references. Were not there. Were not where Im settling on just an idea. Take a little more than that to.","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Way or taking it on, taking that piece on with my company and then facilitating providing the resources that will perform the services. Do you have connections for that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"You sound like youre talking about an. Onboarding process now, not quite.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Understood. I dont know. Is your floor above that ceiling?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Im not available until the 24th or the 25th.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"You got a security breach. We can talk about that. You have requirements for modifications to an existing website. We can discuss that. You have needs for a more secure environment or moving from the back office to a cloud environment. All of those things I can have talk about all day long.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, but Im saying for me to be ready to hit the street running, I got to run in a direction that I have an advantage in. So I need to be strategic about which way Im running. And thats marketing to me, thats identifying the market youre running after.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Ive been doing this type of work since 1981. Im expert, and my wife has been doing her thing for 22 years. When I think about growing the business, although I can go out and find a gig myself, I know I can. The idea thats not really ideal. What I really want to do is grow the business in the service area of it, either from the desktop or for the network and find additional resources to do that. Im right here near the Washington DC area. Im in the process of going through the application qualification for different programs within the Small Business Administration, minority Business, MBE, Eight, HUBZone, SBDC are all different apps and qualities that Im focused on, and Im growing the business. Id like to grow the staff so that I can take some of those operational day to day management workload off my shoulders. I dont need to be doing that. Im the founder.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I mainly focus in a specific area of networking and security on the land Wan infrastructures. So that includes router, switch, bridge, firewall, trusion detection devices on the Wan or the land infrastructure. Ill say host network standpoint. I do IBM Systems.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It sounds like more of Im walking in framing the need that the customer has or perceived derived requirements that the customer has for some type of It service. And then basically Im outsourcing the whole deal. Maybe taking a finders fee.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats 130. So Ive given you my soapbox.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Keep talking, though.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"It sounds more like business development.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Probably 2000, $500,000 a contract. 200 contract.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thats a swing and a miss. Swinging a miss. Swinging a miss.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"So I do other areas for me. I can go out and go on side projects. They might call me to upgrade a wiring closet with all the equipment in there. Theres a lot of techs out here that do that kind of work. I get calls to come and wipe swipe hard drives or destroy them. Im down here in 20 minutes from downtown Washington. So things get destroyed here.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I dont mind being involved. I actually dont want to be involved in the technical. Id like to be the guy doing the management, but I need the cash flow right now, which is why I grabbed the W Two, because it was pretty much I wouldnt say its total wash, but theres some advantages to S Corp as a tax structure in your business versus being someone elses W two. I dont see all of the income coming to me first. Write it down. But I can maneuver.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"They clean windows inside the building 40 stories up.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Is long, that two to six months is designed around that I would be doing as the consultant. So were not talking about that right now, correct?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"And I, truthfully, would much prefer to do the build the business than line some large companies pockets with the overhead that theyre getting on me. So yes, but Im only one resource and I can only do so much. So Id rather bid on, go after opportunities that I think I can find and know Im pretty sure I can find the right skills and bid those opportunities.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"My quality of life. I probably live in a different location. I probably would travel more often, and it would just make it enjoyable, that scenario. Ive done what I call work hard. Work hard, working ethic and work hard, play hard.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats probably some of the spaces I would see. My Id have a pole portfolio that I would have to develop or develop it with you guys right now. There it is. Theres my capability statement to be able to that would match the needs of several It areas. Dont try to do too much too quick. Focus on one area, two areas, and build out from there. Build that niche there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Scalable in that sense. Thats a different scaling than Im doing right now.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I call it keeping the lights on for It, that kind of service business.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"What do you mean what does that close at? It would close with a contract that designates the scope of work that perform the time frame.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"And whats limiting you from expanding, growing organically or inorganically? Thats later, Im going to have to drop off this bridge call with you. I apologize, but I got some commitments. If youre going to send me some stuff, I will be looking at it between now and the 24th. You can set up some time at 07:00 on that Monday or a day in that week, and I probably will commit to that time and be ready to have that conversation with your guy.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"What you said at the end made more sense to me than what I heard. Lets just do this. Ive got a break. Its 226. I dont know what comes next. I cant afford to hear it. Monday is not going to work. Im an April 24 man. Im not going to move before that date. Im not going to move to commit to something prior to that. I got too many commitments. I dont think you would expect me to drop your commitment for someone else either. So thats what works for me.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Next weekend is maybe Im two weeks out from this week. Realistically, I cant take this on. I cant take this on. Im trying to pull my calendar up here.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Whats it going to take for me to look at? Sounds like you have a video in mind, right?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, you have already have a success. Well, listen, Im open minded. You have a proven process. I might be able to run with that process. Ive got to adapt it to my style.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"That fit goes both ways. We both be able to fit in and then adjust enough. Be able to adjust, be able to adapt, be able to have enough be flexible.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"It is a better vision for me because I cant continue to technology is a, you know, its a mental its a mental day at the gym every day, you know, not a walk in the park. It takes considerable analytical thinking, and you reach a point where youre like, you know what, Im done with this. Ill talk about technology all day, but I dont actually want to be the guy doing the work.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Possibly.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, tell me whats involved.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Long is probably six.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thats pretty decent.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Is there a residual on each deal?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah. You make your money in the front, youre making your money on the close.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I think you nailed it. Im still in the fact finding phase.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay. This is, for me, a good point of.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"You got to close deals. You told me your sales cycle is two to three days.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"You before, I cant look at that right now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"It does. I do that all the time. I have business engagements with some folks on the West Coast, and we usually queue up around 07:00 p.m..","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"East coast.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"I dont make that kind of revenue. But Im just saying to get that one time Ill cycle through a million dollars. Realistically, the way I operate today, Id probably cycle through that in two years. So its got to be repeatable. Its got to be something I can repeat again and again and again. Id rather you say to me 100, 250 monthly that is in front of me more than the millions in front of me, but its a bigger star in the sky. But its a hell of a whole lot harder to get to reach than something more realistic like 100, even 250. You got to achieve that before you get to a million.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I can tell you this weekend is not good to have this video conference. Not for me.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I cant right. I would not be able to give it my focus.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"No, I got too much on my plate. Im not available until no, thats a cut over.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im stretched.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Thats interesting. Absolutely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"If it moves a little bit unflexible, I already mentioned that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Delegates the mission. And if I can delegate to those who I delegate the mission, the responsibility and the accountability to deliver on the objectives of that mission.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"If were coming back together in a couple of weeks, thats perfect timing. More time. Today is not perfect.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"How does that translate to revenue?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"If Im building different teams to do that, and Im charting the course, strategically adjusting the vision as the dynamics of the business change, as well as the external forces that can cause the business to shift, thats a space Id rather be in. I dont want to be that guy thats tactically on the ground, running out, doing the mission. Because a successful business has multiple missions and you cannot do them all at the same time, you need correct that goal.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Text with a link is fine. Okay, cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Im just saying thats my earliest start to this on as a serious engagement. To consider taking it on as a serious engagement, thats my commitment.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I wouldnt show up to that meeting. Im more inclined to want to be involved in a process thats repeatable. That sounds like a one time one off.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So its in the front, not in the back.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"If that doesnt work, then well have to figure something else out, or we may have to agree that to agree to disagree that its not a good fit and the exploration was there, and maybe itll be a better fit down the road.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I havent clicked on any of the links that youve shared, so maybe I just need to do that. Maybe I need to start right there and then boomerang. Back.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I run a small business. Im an S corp. Single member LLC.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Maybe Id have to watch the video.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont want to do a blind commitment, and its over my head, and then I have to bail out because I cant take it on as rapidly as you guys might want to be. Your ramp up might be something I cant handle because I got ongoing commitments and I didnt make any enough space to be able to engage it. I can get traction and move, not just take action, take man.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Good deal.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Especially if theres a lot of activity that I got to go out and do relative to being ready to take on project like that, Id rather be able to be in a more prepared what do we do next? I dont know, but thats availability.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right, good enough. Send me the calendar and some information. Im ready to take the next action towards being ready for the 24th.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sure. You sending something? An email? Is that what it is?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Honestly, what you said at the end there makes the most sense. Id rather be the general that comes in and communicates the vision.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Whos speaking, please?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"No, Im saying I need to get my head around the idea once I what it is that it is.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, it actually has been because it takes time to hunt. You got to hunt down opportunities. You got to build relationships. It all takes time.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I have a very lucrative connection with that. I have other areas that Im going to be tapping into.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Change my lifestyle. Not immediately, but it would change my lifestyle.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right. I got to have a hard stop. I given up a half hour already, so I got to have a hard stop here.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I would be willing to look at the process because thats going to tell me right. Also whether or not thats once Ive had time to think it through, whether or not thats a good fit for me, too.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"How long.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Imperfect, but I dont understand what your service? That is something that Im an avid reader, voluminous reader. So if you send me something, believe me, I will review it and want to have a conversation, follow up with you.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Trying to maintain the edge technologically requires you to maintain an edge educationally. Thats tough to do by yourself.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Two five of two.","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}},{"pageContent":"Always have, Ill say, inorganic growth in mind.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont know. Your product service portfolio.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"If its not possible, then lets put it down. Its been a good conversation, but lets put it down. You have my number, and I have your contact. Give me some literature or something to look at over this period so I can kind of get a warm and fuzzy feeling about.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Seven, not nine, but not this Monday. Im not committing to this Monday. Im committing to the Monday, the 24th.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"That might be incredible. Is it sustainable?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Lets get to chat. I use chat GPT a lot. I do a lot of Q and A with it. Right now. Im not programming with it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I got commitments.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I cant answer that right now. I dont have enough information to make that its premature for me to answer that right now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Typically, Id say about two to short. Two months?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Oh, really?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I can prepare for that between now and the 24th. Right. If that coming out of that conversation is financial action, personal commitment, and then immediate action, I cant do it before the 24th.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, things happen in order. You got to do the marketing first.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im 64 years old. Ive got a window of time that I want to do this work before my wife and I retire, which takes us up to about just at the crack of 70. We want to be done. She works for the public school system, the administration, for the State of Maryland, for the county of Montgomery, County Public Schools, and shes paying off a graduate loan through that federal loan program that some people were eligible to get. Well, shes in the program. It ends for her in six years. Were both 64. So weve scheduled an earmarked, a time where were going to at least fully transition out of any kind of w two work at that point. So that kind of has a lot to do with the time horizon. Theres another space Im probably going to engage in, but I dont want to care to discuss that. Its very lucrative though.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats interesting. What percentage of the business are you taking? Equity or are you just taking no.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]