[{"pageContent":"Say it again?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Because Ive been training for a while, and I just didnt want to do it because Ive been kind of like a business owner with a job, basically.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So now I want to be able to, let say, do all that, and I can be working on other things.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"1 second. Basically, right now, I am a basketball sports developmental trainer.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Say it again?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Yeah. I got other niches too, but I guess thats the one I do every day.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. Yeah.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Ive been doing it for basically for 2030 years, but training specific because I played ball for a long time in college of the pro, and I been serious about training probably between 2013, 2015.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And I train, and I want to be able to come when they go to Google, when they find my stuff, they can go right to the page and sign up. Do everything from the page.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Okay, just to where like, you got people making 50, 1050 thousand a month. I mean, thats what the norm is right now. People trying to upscale to 10,000, 20,000, 50,000 a month doing different things. And I research a lot and its just a lot of stuff because Im into the affiliate marketing space as well, but a lot of stuff Im just really just tapping in on it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, thats good.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I definitely will, and I appreciate you calling.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right outside my niche? If its doable, of course, I definitely give it a try. And I mean, if you dont try, you dont know.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I cant hear you. Say that one more time. I was talking to my cousin. Okay. Say the size of the coins again.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"And I havent been like right. I havent been exclusive with it. I hadnt LLC anything and nothing like that yet. So I just want to have everything in order once I do do those things.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Im the second Im on that mission.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Then just have it have an AI system.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right. It takes them to make some it takes money to make money.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Because Im so tied up right now, and Im waiting on some revenue, and what I got going on. I got to wait on it with the process, with it. That is kind of where Im at right now. Thats why I said I know.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"No, but I can check.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Whats going on?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, but thats something I can change that less than 60 days or less than 30 days. Im actually in the process of doing it right now, like, rebuilding. I say in the next month or so, itll be back probably seven something.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And what my plan is right now, right now Im back in the boost my credit mode. I want to say it went back to the 600, but this is my plan. My plan is to, in maybe 30 to 60 days, have my credit score in good standings. And my next move is to build business credit and get funding with my credit. And thats when I can basically fund the AI. If the numbers exceeds $10,000, I will have the funds to imply to that AI system to get it up and running. Because I know, like I say, it takes money to make money, and thats my avenue of creating finance for any other new opportunities that I take off on.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Just being that everything is going to AI, and I wanted to kind of scale what I do all in one nutshell, I want to have it to where people can book a session, sign up to get training, sell merch.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Basically to upscale my clients and have it to where Im getting so many clients with AI that I need to hire a couple of guys to train and do the system.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, yes. Actually I took a major hit on my credit because my credit was like 750. It was like 750 maybe a couple of months ago. Actually, Im in the process of rebuilding my credit because I do my credit myself.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I guess all in a nutshell, just basically pretty much everybody in America, in the world right now is residual income. Well, finance, upgrade your financial situation.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No. I got a question for you. How much revenue does it actually take to get it off or start the process or however you guys set it up. What is the number?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I want to say it may be, like, right at 600. If not, its like, low or high five. I looked at it maybe two or three weeks ago because it was like, four something, but its been climbing, and I aint really just done that. I just been paying certain things and its been rising. But like, three months ago, my credit score was almost 780. I think the highest guy was, like, 770.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats a crazy question. Like I said, because I got so much going on right now with the finance department, its like, because Im moving and this and that, and I just purchased a few things for other business ventures, so Im kind of tied in right now. Thats why I said I need at least 30 days, 30 to 60 days to really just jump out there and do it, because I know once in 30 to 60 days, I will have the funding to go in like I want to go in. But right now, its kind of thin. And like I said, I got a couple of other ventures going on thats a little costly, so its kind of blew my leg a little bit, so Im just panning that out the next, like, I say, two to three weeks. Ill know if this situation, Ill just nip it in the bud and chalk it up. But yeah, right now, if you had.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, roughly, give or take.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So if there was a real path.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hopefully itd be less than 40. Im pushing for 30.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Its not, because basically I feel the reason why its having it because I havent went full scale with it as being exclusive and havent did any marketing or anything like that. So the clients that I have right now is basically word of mouth. I have a couple of apps that send me clients. I got a lot of my clients from the apps that they send me clients. And Im just at a standstill with that part. And I know exactly I got to upscale it. I have to put marketing, maybe even ads, just stuff like that. I havent did that yet. And Ive just been doing what Ive been doing. I know I can go through my phone, probably have over 20 to 30 clients, but its to the point where I want all of them. Ill save probably 30% to 20% of them are consistent. The other ones are they may come this week, three times this week, they may come one time next week. Its just consistent. So Im trying to build my system to basically either have the clients on the contract for a certain amount of time, they pay for certain packages to where I can upscale the revenue and the clients and it looked more professional. And then have stuff like, lets say I got a shoe that I created merch, like shirts and hoodies and stuff like that. I want to be able to promote all that on one platform.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Everythings smooth. I should anywhere between two to ten grand. Somewhere around there. Like I say, once I take away this situation, two to ten grand or even more. I cant really put a pin on it right now.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Have to yeah, I definitely want to thrive. I dont want to you dont want.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Were its kind of hard, probably, right now. I couldnt even put in 500 in right now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Im trying to think. You say the people that are really serious about it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right now, I think thats been took a hit. I think I was making around four to five grand. But now its like I probably bring in anywhere between 15 to two right now. And then, like I said, I got a lot of other things going on. I didnt move. Its a whole nother process. And thats the only reason why its down, because right now I dont have the time to do it because I have so much other stuff that I need to get done. So thats the real reason youre bringing.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}}]