[{"pageContent":"All right, I appreciate that.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Thats all I need. If you can help me there, thatd be huge.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Had accounting offices, so I did a lot of bookkeeping. I did a lot of tax work. I know about cash flows. I know about depreciation and I know about tax incentives. So I can talk to talk. But I think Im coming across very too salesy and they suspect that Im trying to sell them something, but I really dont know whats going on. When I saw your ad, I reached out to see what you had. Sure. Yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, the reason is I dont want to spend too much time the accounting work I dont know if you know that, but accounting work is very time consuming and I want to get out of being tied up either solving peoples problems or teaching unless I could record it and let the recorder do the teaching for me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, it doesnt make sense to me, because youre talking about starting from scratch and doing a lot of work, and then once its set up, now youre going to be faced with a salesperson. And thats where Im at right now. I have a good offer, the best offer that I know of. Whenever you bring something, every business needs cash, right? Every business, no matter what kind of industry youre in, they depend on cash flow. And I have that the same thing. Lets say I have that class set up, my teaching class. Now, how do I go about selling it? Now you say, well, we can teach you how to sell well, how to sell that class. Well, teach me how to sell this. If youre teaching sales, Im already there, but this may not be a fit. But listen, I appreciate you calling.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Right. The only tweak I like to do is look at your precedent. How are you coming across these people that youre talking to? And I think thats the key, the way I figure it. So Im reaching out to different places to see who can give me a good forge for me, a good talk that would get people to listen a few minutes. And I think theres a lot of good money there just laying there. But it looks like in your operation youre looking for somebody to develop a class of some sort.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, Im fairly new at this particular business, but I have an offer to business owners to discover or recover cash flow from tax incentives that theyre not paying attention to. And also and I do all this on my dollar, and if I dont recover either from tax incentives or from credit card audits or from property tax audits, if I dont recover anything, they dont owe me anything. And if I do, and were very proficient, we find cash, and when we do, we collect a portion of that recovered cash. I see.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"For about nine or ten months, but Im having a hard time getting people to buy into it, and I dont understand. Im not asking for any money. It must be in my presentation that I must not be doing a good job.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, Im not making anything because Im not getting people to look at the app, the potential, the average is $16,000 a month.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes, thats correct.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"If Im not a fit for what you we want to discover that. I dont want you to waste your time, but Ive already been through the wringer of developing and teaching people how to do their taxes, how to save money as an accountant. And now I just want a quick way to show a business manager or business owner what kind of cash they can recover right now to improve their cash flow. All I need the only sales that I know is from salesmen that come to me and do their presentations. I dont want to come across like a salesman. I want to come across like a consultant thats bringing them cash right now. Right now I just need some help in how I can better my presentation.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right. How are you? Doing?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"God bless. Bye.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"About 25 years. Jesus.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yes. What I have now is once I show you through an app the potential money I can recover for you, the next step is to switch you over to one of my experts. And those experts or the CPAs and the engineering that require the tax attorneys, they do the work. And thats the way I like it because it frees me. I dont have to actually do the calculations. I go on to the next person. All I want to do is show him. And I have a Duper app that uses artificial intelligence to come up with the potential that they can recover from accelerated depreciation or from tax incentives that are available right now and how theyre getting screwed by the credit card companies and how to put an end to that. And the property tax, theyre again screwed there too. But I offer all these services, but I actually dont do the work. I pass it on to another group. Thats my ideal position where I can develop clients that can, and it be similar to the promotion of a class. If I can talk them into a class, I can talk them into just looking at my app. Give me 1015 minutes. Let me show you how much cash youre leaving on the table. And if I can develop a presentation that would make it where theyd be eager to listen to just a few minutes, I think they would be convinced, especially when they dont have to spend any money until they get the money. Understood.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Id be satisfied with 10,000, $20,000 a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, it doesnt. But what do you do with AI?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"All right, thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. All right. And its coming from AI, you say?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}}]