[{"pageContent":"No, I dont use too much. Nothing to put me in no debt or nothing like that or mess up the name. Ill just preserve it so when Im ready to actually build it up and do something, I can just start. Yeah, thats how I got it on the personal. It just had a zero right now.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Ten grand? Okay. And then what all that will get.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, I got it.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Yeah because really the type of stuff I do for people actual companies is charge your arm and a leg. I just do it for friends, family, people in the community just to help out. But I know for sure I can charge it with that skill that I have. I see it all day every day through other corporations and companies what theyre charging. So if I find the right people yes sir.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well were just a consistent flow of money with that because not only can I start brands I found my own ways and secrets to take a little bit of money and do a whole lot with it to make it seem like oh my god you had a million dollars to do that. So that money is small to be honest a month. But the things that I can do with it is free up my time to be more creative to I guess teach more people. You know what Im saying?","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, true.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Who?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Yeah, Im going to check that on because thats more of the type of person I am anyway. I just invested myself. Thats how I did all the brands anyway, so even the documentary absolutely, like 60 to 80,000 to produce the kids book took a couple thousand and all that. So thats more on the side of my Im going to check this out and say get back with you.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. Well, how much you could do with your own money? Because I never have to depend on a credit score. I invest in myself. So how much will be needed to create a course just to jump start?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Would it be good for me to start off in the year? I say like 5000 a month. Just to start off with thats? Like yeah or between ten and 15.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, you too. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, no, Im single.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, I got a few brands already, so childrens book, brand, brand documentary series, and another brand just dealing with marketing and merch. So I got Ecommerce store. I want Ecommerce, all of them. Thats the main thing. I have literally three brands, all Ein, LLC companies, social media, branded, and all that good stuff. So Im just trying to see how to use this different AI to take it to the next level.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Jackson, okay. I appreciate you. Thank you very much.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, I can teach you how to brand. I could teach if they want to work a camera, create documentaries, tech, I guess. Tech? Little AI. Tech prompting, stuff like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Not an actual coaching program officially but I never even see myself in that realm but thats what Im kind of do already because Im I guess a resourceful person. So people always calling me in hey how I do this, how I do that and stuff like that. I just never thought about you know what Im saying?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No. Is that a zero? I can build it up.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I think thatll be something Im very interested in. I think thatd be pretty easy because I got different skill sets that I can let people know how I did it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hey, how are you doing? Good.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, thank you. Whats your name again?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Personally, I dont have none. I dont have no bad credit, but its zeroed out. And then business credit wise, Im working on building that up.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Have you ever considered Ecommerce on there? What was that about?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I got a job, so I can create one.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Zero.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Thatd be easy. Yeah, thatd be easy. Because I guess thats just easy to me. I just can do that, like, too easy. And it seemed hard for other people when they come to me for the information they need to start up their business, how to get they done, how to get the Ein. Its easy to me but its hard for other people because I can just brand something like that. Im thinking of a new brand right now so I think yeah thatd be something that would be good in coaching people with.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"That the whole coaching thing.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I just did that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]