[{"pageContent":"Good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"You got it, man. Hey, thank you.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Out, what do you guys do?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I will look up until was it the vital dash or groom ninja email?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Well, the space have been well, the pets have been all my life. Right. But dealing with this, going up there and going and calling into the stores for this, been doing it for, let me see, six years. But I was battling out with a competitor and I said, all right, you can pay me X amount of dollars and Ill sit out for a period of time. And now thats expiring and ding ding, were back. In fact, strangely enough, I might be working with that competitor, also helping them along. So Im going from almost a dead standstill, going into Canada first and just starting out and getting that going. We went from, hey, millions of impressions a month going out doing sales online, amazon, our own website, and the dealer channels to absolute zero, right? So now Im getting up there, just starting up. Im looking to do a I still love the phone weapon of choice, smile and dial go out there. And if we get somebody to try it, theyll absolutely want to carry it for the grooming shedding cleaning tool. So thats where I am right now. So have Zoho and for call center stuff, done things with 59, just Google Voice. Have done Kixie and one that Im really looking at and just actually testing and playing with a little bit company called Dial Pad. Okay, got it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Zero, absolute zero. Im just going out there and just firing it up. And its like the way I want to be able to do it is juggling myself. One call up there, get number one, be an assistant, looking at all the things that a rep is going to be doing the calls and such, have somebody else that Ive worked with in the past, theyre like, great. As soon as I get going, theyll do some call stuff for me, and its just like juggling, then put in another, put it in another, and its just like, off to the races. So thats what Im doing. So right now Im doing a little bit of everything, calling up the stores, talking to them, doing up there. Now its order fulfillment, customization auto fulfillment, order fulfillment and stuff, shipping and logistics, getting that and rinse and repeat, doing a little bit of each thing every day. But looking at, hey, how does this look like? How can I optimize getting people to help not only do it for ourselves better, but as soon as they bring people on board, what does that look like? How easy it is to use? How can I get them to be able to help facilitate some of the calls or initial outreach and such? And Im totally blown away about this whole chat GPT thing and just like data coming off of phone calls and stuff, kind of like gong. Its just amazing. So like I said, Im out there just starting up, got zero. Probably one of the worst customers to talk to because I dont have a center going time travel. Go back to 2017, Ill be like, oh no, this is awesome, right? How many do you have? 15. What are we doing? What you got? Right? But I dont have anything right now. Im just going up there, and thats where we are.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"What was the offer? What do they do?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Oh, its unbelievable. In some of the markets, like, where I really think its going for the animals, horses, cats and dogs. And this is the thing. That the real thing. Right. So if you break down, what are you looking at? If youre looking at something thats on the horizons and its like really wild. Are you a pet person? Dog, cat?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. So thats your angle. Your angle is the booming of the actual industry itself and not necessarily just this tool. Thats why you jump back into it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So you guys are part of hey, we do. So its not just a platform play that you guys are doing?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That makes sense. Thats more the sales angle that I was wondering. Im like, what the hell are we doing here? I get the big picture now, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So its air. AI. Hold on.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Take care. Bye.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yeah, but that would be down the road. Okay.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"What do you guys do?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Hey, I appreciate it.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Hello? Speaking.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, in the past, we were one of the first people that brought a second chance FDIC insured bank account to the masses. Right. National platform to be able to do that, built that up and private equity merger with two companies. We were one third of them, and within 60 days, they went public. So I know about mass sales. Ive lived that before where we had 80 people on the phones. I love sales, and I love marketing. So what Im doing now is like, hey, Ive got not just a pet business, but some other things that were playing around with that would have real size and scope. Im kind of obsessed about it. Just out of a curiosity, hey, heres a tool. Heres a thing. We want to go into the pet. I know a bit about that space. I want to get it going. There are people that love helping out in the manufacturing, and theyre learning about sales and marketing. I want to get this up and going and let them handle it and get that off the ground again. So I want to go do something else.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So depending on the angle that were going, Im looking at just reaching out, you have two or three prongs approach. One you have with the actual pet owner and the other is interfacing with people that are part of that chain, whether it be veterinarian or other type of service provider or service or type of monitoring equipment that you could have with your animal. Right. So its all of that to go out to the mass market and then just looking at I like to be the database of all the things connected, have the central database where you can connect everything together.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Perfect.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"So how does that work? What does it do?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Its not coming up. Air AI. Im not pulling off I dont see it.","metadata":{"fillerID":38,"fillerText":"Ummm yah","category":"F"}},{"pageContent":"So when you have for your animals, right, to be able to have everything about them, youd have information about your pet, veterinary records, information that you want to be able to do. Fast forward, you have the internet of things youd be able to hook up to. So all that data youre putting into a deposit database.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. And thats my question. Have you thought about doing some sort of marketing agency for companies like yours in the process to where you can eat out of both sides of your mouth?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I totally get it. So I appreciate let me just grab up there. Hold on. Let me just do this right here. Let me search it for so where would that what you emailed me be coming from?","metadata":{"fillerID":14,"fillerText":"Mhmm","category":"A"}},{"pageContent":"Thanks. No, I really appreciate it. Please do. And I just pulled it up there, so I teed up later on today. I can watch your video. I really appreciate it. Thank you.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So currently we manufacture grooming shedding, cleaning tools, like one of the things, one of my lives and things that Im doing, and built up a business, scaled back, built up a business and agreed to do a non compete for a certain amount of time. And now were back being able to do that. So were going back out into the marketplace and Im just gearing up, trying to figure out the best way. So going through and this is for the business to business and looking at going after the dealer, the retailer space. So were going to go outbound calling, smiling and dialing, digging market intelligence up and then calling and sending a sample out and getting the store to carry us also.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats why I was looking at kind of like what do you guys so you are the AI dialer. Is that what your main thing is?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, so I grew up in horse racing. Right? Got you. And third grade horse racing with the barns. You have horses, dogs, cats. So I grew up in that. And then fast forward to about 2010. The next girlfriend was doing some things where theres a grooming tool that was out there for decades. Right. And she just did a different version of it and had some success with that. And then she said, hey, dont want to be working with you. We teamed up to do that and said, all right, Ill just see out in the marketplace. Ill figure something out. Right. So I went out there and did a competing product and went out there in the marketplace. But people love what these tools are. And Im like, this could be a fun business. Not just an interesting kind of hobby thing, but a business. And thats where we went there. And youre right now, where do you go? To the point where its like, hey, this is a business. Id never think in a million years that Id be into that. But it really took off. It took off when we did some social media, theres some marketing out there. Just really took off. And its something where it just simple tool and people liked it and it took off. Im like, all right, treat it like a business. And thats how it happened.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}}]