[{"pageContent":"The 1099. I think I work for entertainment company probably around about seventy k. All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Basically, Im in the process of launching. Over the years, Ive been doing a lot of freelancing for doing websites or various different agency skill sets or whatever. And so now Im just finally trying to put it all together and really just start building with an agency to where Im pretty much trying to bring people in, either doing their website or something like that for them, and then getting into the SEO, Google My Business, and all the other various digital niches.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I have no card right now. Anything? Im pretty much operating right now for the last 1500 I kind of got in motion. So pretty much thats why Im picking my software and just banging it out. Were trying to get a couple of these deals closed to then try to put it together.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, this is him.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"At the present moment? Everything is kind of a little at a standstill on that, trying to transition into this a little more because the entertainment company Ive been working for is a one owner establishment, and the owner had to have like emergency spinal surgery about three, four months back. So its kind of like the business has been very slow, so I pretty much burned through my reserve in this process. So now Im kind of out of necessity trying to lunch my agency. So its a little tough, honestly.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"I should have been doing. But its like when youre working for a company and a lot of the tasks I do for the company, which I rose up to being president of it so far, but I did a lot of the tasks of all the contracts, all the setting up all the CRMs, building all the websites, doing the social media, so on and so forth. And its like I could have been spending a little more time on getting the agency going, and now its like Im just having to do it in the moment type thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Im trying to definitely get going with it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im all right. How are you doing, brother?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, thats correct.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im not too sure, honestly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"For sure. Thats helpful, man. And Ill definitely try to reach that goal and target, and with luck and a little hard work, hopefully it wont take long to get there. But Ill be getting back up with you, man.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I havent.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"All right? For sure. Good.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Its a drive link.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, I do.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im really like mid to high five. Nothing spectacular, for sure.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I was going to say Im fully open to getting back up when I get in a better spot. Definitely reconnecting. I like the idea, for sure. I do have the things where you can help get funding because Im definitely going to be working on that business structure and trying to get it together. In terms of that, is it any formation? Can you have someone with a DBA? Do I need to have the LLC?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sounds good to me.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I have not.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Still kind of putting together right now? Im just still prospecting a few people. I got about three or four deals Im trying to put together in the moment and just still trying to go. Im going back and forth from various software. I got the dash clicks. Probably going to jump on the go high level. Just trying to figure out the best way to organize it all and then in the same sense, keep it together, but also trying to diminish the cost a little bit, too, because dash click is pretty affordable in terms of right now. They got the pro plan going for $100 for the month to go. High level agency. It seems to have a little more organization with kind of like setting everything up, but then the agency plan on that is like the 497 for pretty much the works.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]