[{"pageContent":"Fine, how are you? Today or tonight, I should say.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Roughly on the pricing, its about $5,000, correct?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"My average sales about five grand. On the smaller side, you may have one for three and you may have one for nine. But if you want to average it out, its about five grand.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I hadnt even checked it yet.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"But again, the commission and the commissions.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"First that you do meet the basic financial qualification that we would typically recommend you have before rapidly scaling your business on how we do it. Right. Because I just really wouldnt want you to get looking forward to rapidly scaling your business if you dont have the means to go out and be successful right away, because, honestly, it wouldnt be fair to you. One of the biggest challenges I see holding back businesses that we control is their ability. Weve just seen it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Having now, is that profit for you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So where is your business currently? In terms of monthly revenue?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"And so what is your ultimate goal for the business?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"The signal is not very good. I cant really hear you. That good.","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}},{"pageContent":"Youre breaking up.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Okay, wonderful.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I just didnt know if I wanted to learn a little bit more about it. I dont know if itll even fit with what I do, but I just figure I would request some information.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Are so good, you dont really have to make like, right now, Im at 65% commission. So if I sell a $10,000 package, I made $6,500. So I would like to remain that way, but I need some more consistency, I guess I would say.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I was replying back to the text that was sent to me when you called, so I havent had a chance to look at the email.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Hey, who is this?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Im an independent contractor for a company called Mitchell One. We are Snap on Tools software division, and we sell software, and its not like 20, $30,000, but my average sales like, five grand. My issue is our primary product has as close to a monopoly as you can possibly have in the industry. Were in about 80% of our target customers already, so theres really no growth in that one. So Im trying to push marketing and management stuff, software, and Im in a specific defined territory, but my territory is rather large. So Ive got about 30% of Texas is my territory. So I have all of Central Texas and all of eastern Texas. So its a rather big area, but it is a defined area. So what Im trying to do is I am trying to increase my leads and trying to bring new business in that way. So I dont know if Air AI can help me with that or what.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, wonderful.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"To.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"So really, I just wanted to make sure that Im doing my due diligence and provide you with the most value.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I can hear you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right, okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Oh, its okay.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Be honest with you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, wonderful.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Like, how much do you want to be making?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"We offer shop. Were the industry leader in repairing diagnostic information for auto shops and truck repair shops. We also offer marketing, and we have a really good management system that is integrated, that actually orders parts and everything thats full shop management integrates with QuickBooks. Its really good, but people get thrown off with it because its pretty complicated. But we have a marketing suite, too, that attaches thats integrated to it as well. And thats really what Im looking to add. Im really looking to add since our diagnostic software is already everywhere, Im looking to find customers that are looking for the marketing package and the management package.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, thats my sales, so I would get well, it was 35 last month. Its 21 right now. Last month, I was at 50% commission, so I got about 18 last month. Well, I qualified for a bonus last month too, so I guess I made 21,000 last month profit. By the time you take taxes out, its 16, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So I did want to make sure.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"There and make a sale. But if you drive around all day and you dont make a sale.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Can you hear me?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay, well, let me tell you what I do, what Im really trying to look for, and Ive already gone with Im on my second company right now, trying to and the first one went three months and didnt produce anything. And I liked it, but it just didnt work for my industry. And now Im on the second one, and the second one is not working either. So Im literally seeing zero return on investment on these.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"All right. Yeah, let me see if its any better.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"If you stay down there two or three days, you dont make any sales. Its kind of like you went down there to burn money and not make anything.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Honestly, because I dont have any residuals from this either. So its one big sale, and then you move on as long as they dont cancel your golden. So I would like to consistently make 40 grand a month, and I would like to do it to where Im not having to drive, leave my house at 04:00 in the morning and get home at midnight or 100. So my goal would be to consistently make 40 grand a month, and if I can do that at 50% commission, that would be fantastic. It was 65. Thats great.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I can do that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, maam.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay, let me know.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Could you call me back? Because its really jumbled.","metadata":{"fillerID":38,"fillerText":"Ummm yah","category":"F"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"And so what is the result that you deliver?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Ive been doing this since December, so its ramped up every month. Last month generated 35. This month, I had a big charge back. So Im looking at about 21 so far this month. But the month is not over. The month. Prior to that, I was at 17. So its ramped up every month. But its been inconsistent. Its been a couple of weeks without a sale here, a couple of weeks without a sale there. Then Ill have because Im going door to door, phone calls are okay, especially big territory. Im having to drive, like, say Im in eastern Texas. Im in a town called Kilgore. So Kilgore is all the way by Louisiana border. Well, I may have to get up and go on a Go prospect in Georgetown, which is by Austin, which is a five hour drive. So.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Can you hear me? Hello?","metadata":{"fillerID":33,"fillerText":"Yeah","category":"E"}},{"pageContent":"And so that 25,020, 1000 that youre.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Yeah. Okay. And do you split this company with any business partners?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}}]