[{"pageContent":"Hi. Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Solid. No problem. Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hey, hows it going, man?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"To be honest, thats exactly why I didnt respond to the message with simply that, because I already know this part of the situation.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"And I have no doubt. I mean, I sold almost 200 cars last year, so 197. Im not even joking. It was incredible. I have a really good knack for connecting with people. And honestly, nowadays, you buy a car from your couch. So its really not like the old school. I need to be a snake oil salesman and shine your shoes in order to get you to purchase. So its a different world now.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Thank you. Ive been working on it for years. I finally got it. Yeah.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Sorry, I just had, like, five things coming at once. Okay, now you have my attention. Could you repeat that one more time for me? I apologize. I got, like, three calls at once, and then somebody walked through the door right as you asked your question. But you have my attention now.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Ballpark last year I made 97,000.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Just being real, dude. I wish I could say that there was more to offer and shit like that, but it got a little tight over winter, as it always does, and its just been on the rebuild.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Your business, I think tomorrow I could do that. So Wednesday, Thursdays are my day off. So if I go in tomorrow and it turns out that I have a few things lined up that happened over the last couple of days, then Ill just have to let you know. But yes, put me down. Lets make that happen. Tomorrow should be all right. I can pull away from work and pull 30 minutes off. Okay. Do you think its going to be longer than that?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Absolutely. Yes, sir.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, absolutely. So my name is Christian. I started a business. I call it original business. Coach LLC. And basically what I am doing is in the process of patenting and trademarking. Its called lean on ontology. And its using a cross between ontological coaching methodology and lean methodology in order to improve bottom line and overcome obstacles as a team to help with better growth. Which is actually where AI is so relevant to what Im doing because the capability of a computer to process and you knowing the right information to ask it in order to help you better and grow information and get it even a quicker place than we ever have ever been able to do. But in a world where we are all so stuck in our phones, I want to bring ontology into that, which is the study of being in existence. And its causing you to reflect on personal relationships, interpersonal relationships, and then that kind of challenging and questioning the state of being and who youre being and how thats affecting everything that youre doing in order to cause a place of creation, I suppose, be able to improve.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im fully engaged. Please. Im listening.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"In Washington State, the average coach makes anywhere from 130 to 300K, like a successful one. So ideally for that, that would be awesome. I would love to hit I mean, my goal of course would be seven figure a year. So that would be amazing. I dont think that this would be the one thing that would take me there, but it might help me with the networking and growing that. Ideally though, I would say around 15 to month would be would be the ideal goal to start and then I would set my goal and find new ways to grow.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thank you. Appreciate it. Have a good night.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Theres no way that Ill ever be taken from me. They know exactly their process.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Like I said, I will be in right at 10:00 A.m. And I will know the answer. So I will be able to text you immediately and let you know right at 10:00 A.m. Once I sign in or give me five minutes so I can sign in and check my email. And then after that I can let you know whats going on.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I have no doubt that I could come in and turn that around. Absolutely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I dont know. Im in the 600, honestly, two years, I have a beautiful little girl, and two years ago I found her mom fucking the neighbor. So fucked my head up, ruined my world. I had all the bills and everything in my name. Its taken me a while to get to. I have my own place. I see my daughter whenever. But I also pay a lot in child support to support them. So its been a little difficult to rebuild, but I do make a decent amount of money at the moment. So I have been in the building status with things going up, and I know what itll take to get there. And prior to that, I had a pretty damn good credit score. I mean, I was the sole provider for our family for the last seven years. Last two years or a year and a half now? Two years Ive been on my own.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"WeLl cause it to happen for sure. Somebody shows up, well make it work. Its not a problem. To be honest, if I have to, Im still enrolled at school. I could tell my boss that I have a zoom call or something for an hour. You know what?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I know. Im sorry. Trust me. No.","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}},{"pageContent":"Honestly, right now, my capital is pretty much absolutely nothing. I just dropped I put another almost 1800 of my extra into this business and got all my paperwork, everything officiated. I have all my documents. It is an official business, fully set up website. I paid all my dues, I paid my domains. I got my website name and my trademark documents are sent in. And so I probably put 28, almost three grand into getting everything I needed done. So as of right now, that was my extra capital was dropped into that. Im pretty much right at my budget line. Yeah, for now. Not for this moment. Also last month, I put a lot of energy into this job or into starting this business, and I did not sell very much. So my last months paycheck was the worst Ive ever made in my life, actually.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay, yeah, so Ive thought about this a little. Im still trying to understand. So I think for a six week session with the company, which would involve a workshop once a week to start an extra workshop for the managers, and then one on one involved with the CEO of the company with however many sessions we need until we are at that point. And I feel like that level of management and that would probably bring me to $15,000 for a six week session with a company, an hourly session online. As far as a one on one personal coaching goes for anybody that wants that, I would say I put that around 65 an hour to start, but I really dont know thats. Just looking at my market, my competitors, they range from $20 to couple of, but the average price for my state here is around $63. So I definitely say that $65 to $80 an hour to start. As far as one on one goes online, Im not sure how many seminars I see all this stuff, but I also see a lot of fake crap out there where people are like, hey, send me four grand, and theyre all awesome videos. They still do teach you a lot. So I dont know where the line is between I dont know that part. As far as should I charge a membership fee online where you pay a certain amount and then you get access to podcasts and start doing that, and then looking at affiliate marketing with podcasts or extra things with videos because theres a lot of money that can be made just through allowing advertising through that. Yeah, so that part Im still a little stuck on. I dont know if that means that for me to do a consultation for a business for the general, that should be that original. I dont know if thats $200 an hour or not. So Im still working on that part. Sure. Yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"AI.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Absolutely not. Yeah, cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Exactly. And I agree. I think, though, that that is already because I do have potential. I may have a source of income that will work already as a potential investor goes. So if that is the case and this is something that works out that way, honestly, 700, thats actually really not a scary number. Its a very doable and reachable goal. So I feel like thats something that I could continually find, especially if I can show or prove that I can create a return, then really, I know that I will have that investment, no problem. Okay.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Absolutely, yes. You are deadass on point.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"It yeah, absolutely. Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, honestly, Ill watch the video this evening and then I will get back either tomorrow or are you off weekends?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"This case, I dont either. This really feels like for sure. Ive had a few coaches. One of them, when I asked them honestly, I told them the same thing. And then I was like, honestly, I want to know how Im supposed to profit from what you have to share. And then he proceeded to tell me that, oh, come on, you just need to do it, and then coercing me, I suppose, into paying for it. And then when I was like, you know what, dude? You literally have not answered a single question. Im good to go. And hes like, well, youre a little bitch, and starts literally swearing at me over the phone after previously asking me for anywhere from five for the basic package to $20,000 for his premium package. And Im like, you literally couldnt answer a single question. So youve gone about this in an entirely different fashion than I have found. From the few resources that Ive decided to Ive looked at a few online. For sure, there are a lot of coaches out there that are scamming it, and there are a few that can teach you a few things, but AI is honestly the future. So I feel like you guys have something very different. And then the way you approach this just now, it did speak volumes to me.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Time is value and money plus it costs money to return money. So people who book that I totally understand. No, I respect that. Honestly. It literally comes down to if over the last two days somebody called in and said that they were told by one of my coworkers that I will be in on Friday and working over the weekend and they set an appointment for me. Thats out of my control. Thats the only concern that I have because that means the customer is showing up and unfortunately I cannot do that to one of my guests. Good. That is my only concern. If it turns out I show up tomorrow, my bosses are still in their meeting by 1045 and theres nobody waiting in my lot ready to go then? Absolutely, Im good to go. I can say, hey, I got this call and I can take it, so that wont be an issue. But its just something that might be out of my control. Thats my only concern. Otherwise I would fully commit to. All I ask is that you keep.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, solid.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay. Yeah. And I hear you on that part, which is exactly where my idea in doing podcasts and blogging comes into play. Because that is an easy way for you to start pulling in other places, other coaching other items into that, and doing that kind of affiliate marketing, so to speak, to help push that along and get that recognized. A name out there and a brand out there and a trademark, even for the lean and ontology. So as far as that goes, credit score wise, Im still in kind of a building status. Im currently a car salesman at Schedule Hyundai. Thats my daytime job, so I work with that. And my credit score is the strongest at the moment, to be honest.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Okay, so, yeah, actually its a little bit of both. I do want to do the one on one coaching. Im not sure if thatll be like, online doing the zoom one on one chat. I also want to look at Ive already spoken with a couple of universities about coming in and speaking with college level students, graduates about this kind of same ideology, causing them to really get a grasp on where they want to head in their life. And then also I have with actual businesses maybe dropping a retainer, doing actual sessions with a company, which I do have 1 bar that I am starting to do work with who has no online presence and a ridiculous menu and in a Nam. So I figured I have that as a good start as well.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thank you. I agree with that. I also feel like I can do the exact same on your end. Because if Im going in and being the physical face, showing up and having a resource or a platform that I can present to a company in order to help them continue success even after I leave, that was the key. Thats. How do I continue? Long lasting relationship.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Absolutely. So heres the thing. As a car salesman, the weekend is when I make my money. So its really dependent on its just dependent on this. If its a beautiful day out, I know for sure Im going to have a car sale or two. Then I can let you know. You texted me on your number, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Not really. I do. Youve been my baby for a long time, but Ive had to be careful in going about it too, because I dont know, not careful per se, but Ive just been taking my steps. Its not about jumping in too quick and getting over my head. I want to actually save people. So I do want to quickly make money, but I also dont just want to quickly make money. I want to be comfortable and be able to afford a lifestyle that I enjoy, as well as afford being able to travel and speak and teach, which I know thats expensive too. So between. Both of those. I do have a desire to make good money, but I dont have a desire to put that over serving.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Were not quite there yet, and Ive come to kind of figure that out. Which is actually why I was looking at this little mainstream. What little things can I do with a website and having an LLC that I could bring in as a passive income that still relate to the business. Thats actually what drew me to looking at your guysprogram.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You as well. And Im so sorry. You told me your name once at the beginning and I totally missed it. Could you repeat it one more time?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"An hour? Okay, perfect. I start at 10:00 A.m., so its not like I can take a lunch right then. Its just really dependent on who shows up.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Alex. Alex. Alex. Thank you Alex. That was a very engaging conversation, I very much appreciate that. Thank you. Look forward to tomorrow. See you. Bye.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]