[{"pageContent":"Email.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, at the end of the day, it would actually take quite a bit less. What I would like to do is minimum, Id be happy with less than this, but if I got to a point where I had twenty K a month in passive income coming in, Id be pretty thrilled with that. Now, a lot more than that would enable me to do more awesome things, helping other people, extended family building stuff in communities in other countries, that kind of stuff, and also live a life of luxury. But I dont need those things anyway. So for me, if I was bringing in because I can always make money from other stuff, but if I was bringing in 10,000, $20,000 a month, Id be fucking thrilled. I mean, frankly, if I had any sort of passive income coming in from anything, Id be thrilled. Thats why I love rentals.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Right. Thank you. Sorry, I was going wait a second theres seven days in a week. Sorry. Okay, go ahead.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Okay, Im going to shoot that to.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"DidnT catch the word high tech. Ive had a career in software that typically people its mostly male. Almost all of those people have a computer science degree. I dont. I have quite a bit of real estate knowledge, but now people, they have 300 properties. I dont have that kind of Im very good at taking, how do I say this? So Ive been doing business intelligence and analytics for years. Ive had a mans career for years. So Im really good at career coaching. Im really good at big data space. In that big data space, Ive spent a significant amount of time doing whats called pre sales work, which is like the technical arm of the sales team, right? In addition to that, its within the big data analytics space, which is really huge right now. So I havent done any sort of business to consumer stuff. Its all business to business. But Ive coached a lot of women on their career, on their resume, on how to manage their LinkedIn profile oh, what was I going to say? Just on different maneuvering tactics to manage getting the jobs that they want. What was I going to say? And then Ive spent seven out of 20 plus years doing cybersecurity. So anyway, I could just go do business analytics consulting for I would love though, to create something for people for their personal life, like to.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"How many clients do you have per year? Or how does that work in terms of how many people are you guys building, coaching, or courses?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Oh, I have other businesses. Im entrepreneurial, so I have some rental properties. Yes. Right now, thats why Im leaving the country. I got to go down. I have an airbnb down in Mexico. I need to go prep it for the summer. Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Yes, that is it. Via email. If you did not send it via email, if it was just like, download and it came to my browser, it was downloaded.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"And so that was generating 3000 appointments a month for him. What happens on those appointments?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Wait, just clarify that for me really fast. So your last offer you were generating are you saying the last course you put together with somebody.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"It is AI software. Well, I sell other things in my other businesses, but my nine to five job, if you are familiar, most people in various roles in leadership roles are looking at reports and dashboards to analyze their performance. That might be sales performance, that might be marketing campaign performance, could be supply chain analytics. But theyre looking at Analytic Dashboards. So what we have done is essentially leveraging AI. We are automating the narration that goes along with those KPIs. So very similar to like, an Apple News feed. So instead of looking at some squiggly lines on a chart, it actually uses natural language to look at the data and automatically create compelling news articles about your internal business. So you can be like, hey, Sales is up in Iowa, and put a tone of voice on it and all those kinds of things.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im sorry, with who?","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yeah. Typically, Sales leadership, as its getting close to the close of a quarter, its like, how are we doing? How are we doing? Where are we? Whats going on? And theyre trying to make. They dont want to just know what is the number, they want to understand why the number is what the number is, so that they can make business decisions about it. So typically you have operations from every department that spends a big chunk of time putting together these PowerPoints and these reports to sort of do after the fact analysis on why the metrics are what they are and what it means to the business and all that good stuff. And thats what sort of presented to leadership, presented to the boards. So essentially what our technology does is it automates that narration to create that internal newsfeed for your business. Ultimately, it can be used for any type of analytics, but were focusing on sales because thats sort of where the money is with low hanging fruit.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"This is alisa.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thats really fascinating because arbitrage typically people are going that route because they dont have a lot of money to be able to buy a property. So theyre doing arbitrage.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, Im just saying this is what I need. I need to take some of this knowledge that I have that Ive from some of the incredible things Ive done with my career and with my personal life and package it together to help more people and finally get some money out of it because hell yes. Well, Ive been helping people for so long for free. And even this guy, I just saved this guys job, and he wanted to get me something. And Ive always turned people down when theyre like, well, then they go forward, and then theyre making $400,000 a year. And Im just like because I had them tweak something at work. And Im so fucking pissed. Not pissed, but Im just like, fuck, I wish I got a kickback from that. I wish I got some sort of percentage. So this guy, I finally was like, listen, in four or five years, if youre making this amount more than this, and if you have these things happen. And I set the bar really high because hes a friend. I didnt really want anything from him. He was trying to get me a present or something. And so I basically said if you hit this really ridiculous high bar, which I already know hes going to hit, he has to he has to go buy me a Chanel bag that I want. So Im going to get something out of it. Its the stupidest thing in the world. But I was like, oh, itd be nice because then you have an actual thing and Ill have something in my hand. But really, I should be making money off of this stuff.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, fabulous. Which email address did I provide you?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, tell me. Sorry. This may have been something that I was investigating for my own purposes, as opposed to work, as opposed to my nine to five job. So you help people package and create coaching for sale? Is that what youre saying?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"What you sell like a package to help somebody, like create a course and launch it. Right. What do those typically run in terms of cost? Because I also dont want to waste your time. They cost 5000 or 50,000.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay, now, are you franchised? Are you like a one man shop where you take a portion of this business or whatever and you try to bring on people? How big is your company? Five people, 50 people.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Right, okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay. Now we were talking. Okay.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"I find that hard to believe.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Hes really awesome. Thats cute. Okay, so youre working for a kid is what youre saying. Im just kidding.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hold on 1 second. Give me 1 second. Okay. Lamatic, co founder, People Products. Sorry. Keep going, keep going. Okay, Im listening. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Do executive or career coaching. Ive done tons and tons of presentations, typically at my companies. Im very good at presentations and at figuring out how to take the technical knowledge and figure out how to craft that in a way that resonates with the public. So you take all of this really complex, muddy stuff. How do you explain it to your grandma. How do you recraft that to make it make sense? So Im really good at doing those kinds of things. Whether that is how an employee stock purchase plan works, what big data analytics is, it could be just about any sort of topic. Thats sort of my sweet spot, which has enabled me to have careers that people dont normally have with my education.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah. Hold on 1 second. Now youre going to make me go get serious. Let me put it on my calendar.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Okay, so now you know why my name is spelled weird. Because Im named after the Greek fields of paradise, which is Shawn Elise as well. The French people get it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No. Please tell me. Dan. Yeah, but you have to wait. By the way, if were going to be having more than one conversation, its Elisa or Elise. Just call me Elise. Its much easier.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. Because Im looking at stuff. I dont sleep very well, so Im always looking at stuff in the middle of the night. Now I know who you are. Okay. So I have tons and tons of domain expertise in a variety of different categories. I am literally like I mean, sorry, this is super socially inappropriate, and we.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, that would be very good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I would love to do that, actually. That would be awesome. Im mirroring. So yes, you said I would love it, and I would love it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im actually pretty smart. Im really stupid about certain things. Im kind of like a little idiot savon about certain stuff. Like I dont know how to I probably could not tell you where my wallet is right now, or yeah, like.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Because Im familiar with Arbitrage. So if you could use a different example than the Arbitrage one.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Daniel woods.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"First, because were a big, by the way. I mean, Im literally sitting in bumper to bumper traffic in La. On my way to Mexico. So I dont want to waste your time, but Ive got all this is no. So not only am I a captive audience, but Im trapping you here with me because I have had so many people over my career that are like, god, you finally made this make sense to me. Whatever it is, stock investing, real estate. How interesting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You can I may not answer them, but sure.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. I have $500. There you go.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"K. No, Im asking what did it cost him upfront?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Whats the low end versus the high I mean, whats the low end? Whats the low entry point?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"That sounds great.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Right, so you guys were doing this before, and now youve done a small spin off a little child company called AREAi, and youre using all the same processes and technology. Why did you spin it off from the bigger company?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, thats okay. I dont have a degree in computer science, but I have a bachelors degree in psychology, and Ive been dealing with clients and helping close business for 25 years.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, so I want to make sure I understand air AI has only existed for one year. Correct.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats awesome. Whats his course? Teach?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"For somebody to spend when they dont have money.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Okay. But, like, the guy that did the arbitrage I can never say that word. Arbitrage. Okay. The guy that did that what did that package cost?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So who am I going to be hearing from? What happens if I dont get a call at 10:00 A.m.? What do I do?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Consultant.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Wait, say that again. Youre a what?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay? Because it sounds like some people who approached you already had content created, like theyd already been doing it for a few years.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, I have severe Add. So part of the way that I manage it is by taking on stuff like this. And I go, oh, this looks really cool. Let me kind of growth hack this.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Have January of this year. So you guys just started like four months ago? Five months ago?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Right. Okay, Im sorry. I really just need to make sure that I understand this. Who was doing something two years ago? Because Air AI didnt exist two years ago.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Is the coaching content, is it one on one coaching? Is it recorded videos? What do people get typically when they.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"The question is, how does that work in terms of youre saying X number of calls per week, and then you close a third of them, which thats very I mean, if you have hot leads. Hot leads? Yes. A third is the standard math. Lose a third, win a third and push a third. So you need to have whatever you want to close $10,000 a month or $100,000 a month. You need $300,000 in pipeline that youre actively working that month to hit your goal. But thats for hot active leads. How do you get to that?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Exactly the way that we do it. Right, okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah. Take a look at a couple of different options. Normally Im just going down there and taking care of stuff, but my girlfriend, whos never been there, is coming with me because shes out visiting from Virginia. So Id like her to have a good time. So I dont want to be like so if anything, well be leaving from there, and then I got to stop off and see somebody in La. So Ill be back by next Wednesday.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I probably was looking at it on my phone, but Im out of town right now, and Im getting ready to leave the country, and then Ill be back towards the end of next week. But I probably only opened it on my phone.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Okay, you were talking about something for six years. What were the things that were going on the other six years?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"If you go see the movie. Have you seen the movie Air about the Michael Jordan shoes?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You fabricate rain?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"That would all start going on Saturday is what youre saying.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Watch the video before the call is what youre saying.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I dont really know. Im not going to tell you a number because, coincidentally, thats kind of what it would cost.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Either that or, like, how much would I need?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So how do you get in touch with those people? And is that like a one time thing? Do you set up something thats automated? Where do you have a contact database? How does that whole you help with the content creation, how do you help with the CRM side of reaching out to people?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"When you say high ticket, like high ticket coaching or high ticket courses, whats considered whats the spectrum on high?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Elise. But just call me Elise. Yeah, just call me Elise. It makes it easier.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Really? Did you just get into this space.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, so question for you. You mentioned having a girlfriend. So do you have a girlfriend out in Phoenix?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"What do you guys typically do? You do any like theres somebody that theyre a yoga instructor and its like, okay, Im going to put together a class or whatever on yoga, whatever it is. I could do something on how to be an effective public speaker. I could do something on managing personal investments. I could do something on career growth. I could do something on women in technology. Theres a lot of different things I could do. So do you provide any guidance to people on this is what is most in the market and out of your skill sets and out of these ten things youre saying you could do? Because I think the really focused things, my guess is those probably sell better things that are very targeted, like Arbitrage.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay? And I never really needed it for income before, but I kind of quit. My daughter had an accident. I sort of quit working to take care of her with her accident. And so I was off for about a year. So with the downturn in the economy, with the way that everything with stock being down, real estate investments being down, and I burned through an unbelievable amount of fucking money in the course of a year, and Im like, oh, that sort of changed things. And so now I took a job. Im at a small little startup where its with friends and stuff, and its not like a lot of money, but Im used to actually making a fairly decent amount of money, so I always helping people for free. Now Im like, you know what? Id like some money out of that.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, the same number works.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I dont want you to waste your time, but I also dont want mine.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Okay, perfect. Well, thank you so much. I really appreciate you reaching out, and this makes so much more sense now because normally if Im looking at stuff, Im looking at it for my VP of Marketing job, for my software, my startup software. But thats what Im doing. But thats not really my passion. I want to be doing my own stuff.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, I did. Oh, this is some of your dance stuff. Wow, that is very cool. Is this your side gig and thats.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"And what do you say in terms of, what was it, about 3000 a month?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Let me see.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Well, the other thing Id like to do is I dont know if you have this on the error website or do you have other than the arbitrage? I just want to see public faces.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Apex. A-P-P-E-X no one? P-A-P-E-X.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"I know, but woodsair AI. Im not seeing you.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Need 20 to 40,000 to create a course.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I did a lot of work in cybersecurity. Like, Ill find out your middle name. Thats fine. Im just messing with you.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Nine months means it was happening last year.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right, yeah, very true.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Enough and then where do you guys advertise this kind of stuff? Because Facebook ads is it instagram?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"In air. AI.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Hold on a second. Hold on. Not finding it. Okay. Is it Dan Woods or Daniel Woods on LinkedIn?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay. And theres something to get validation that this has worked successfully for people from an outside source other than from somebody at your company. Correct?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Wow. And by the way, you asked me.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Oh, this is you.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yeah. Totally.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"You shouldnt. If its worth it, I have the money for it. Okay. Its about the ROI. Its about the ROI, and its about what I would have to come up with up front versus what I would need to pay long term. Its one thing of funding something up front for my own information or educational purposes versus is it this amount up front versus this amount ongoing? Once revenue starts coming in, somebody tells.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, Im guessing Ill probably want to do it, but Im not going to stop and be sitting down doing research and running numbers and stuff while Im trying to launch. Im trying to get stuff. Ive got major concerts and other things going on in this area, so I need to get my Airbnb revamped before the major season, and then Ive got to get back, and like, two days after I get back, Im literally helping throw a wedding for somebody. So I just am not going to put the time in it to be able to decide if this is a good Im assuming its a good financial investment, but Ill need to do a little due diligence.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"What was I going to say?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Okay. Enjoy and drive safe.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, of course.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, let me just tell you then I would probably prefer to wait until I get back because Im not going to make any financial decisions from Mexico. Im just not.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Oh, Boulder City, Nevada. How long have you been together?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I just filed my taxes and I quit last year. So what was my income before I quit working? Somewhere between three and 400,000 a year. Around 353, 75. Whats my income now in the toilet? I can afford to pay for what makes sense for me, but Im very thoughtful about that. Does it make sense? So everything to me is an investment. Does it make sense to invest in my leisure time? Does it make sense to invest in real estate? Does it make sense to invest in getting massages or in something like a course? Right, right.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Well, you could be a kid, too. I have no idea.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Oh, thats very cool. I just graduated from massage school. I had to quit work to take care of my daughter, so I was going to go insane. So thats the other business Im getting ready to launch because I had to do something for my personal mental capacity. So I went and got certified as a massage therapist. Yeah, because nothing goes well with geeking out on technology. And side hustle of real estate business and massage, which now that everythings kind of imploding in tech, Im like, oh, thats kind of nice. But anyway, I was just going to tell you. One of the guys in my massage class is like a dance choreographer that just moved up from La. And lives in San Francisco. And I watched him in a couple of shows. Hes really phenomenal. Hes like little semi whatever. Not famous. Nobodys famous in dance. Theres like three. But yeah, he does dance choreography. So he flies out and goes and does like hell get hired to go do some show and then flies out to wherever, does the choreography and then takes off.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ill just tell you if youre like, hey, this is going to cost 1020 grand up front, and I have to be fully invested in that and cut a check up front. Im probably not going to go that route just because yeah. Do I have 20 grand? Sure. Do I want to sink it all in on something Im rolling the dice on? Probably not.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Youre in the Phoenix, Arizona. Okay, sounds good. So if I want to move forward with this.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"I have whatever it is that I want to have. The question is what does it cost?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. I basically was like a couple of years away from retirement because we built the company up so big. And then I found out he had a whole secret life. Like full on crazy, crazy secret life, like throw away cell phones, taking steroids, had stolen my financial, like, all that kind of shit. So then I signed away the company because he wanted me to raise the kids, and I was like, trade my kids for business. Fuck yeah. So essentially I invested all my early stuff into the business, like built it up, put it in the business, built up the business, walked away from the business, and now post divorce, built up stuff again. And then my daughter had an accident, so I took off to take care of her. So Im still okay financially, but Im like, I got a pretty high burn rate on like, thank God I had the resources to be able to stay at home with her and take care of her for a year and stuff. So it was a blessing. But Im also like, fuck, I need to go back to making some serious cash because this is not the norm for me.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Stud Muffin?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well be driving.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yeah. Let me ask you this. So why havent you put together a course yet?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"So is that like, a low end entry point? Like, somebody would spend two K? Or is it more like 20K?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"All right, cool. Got it.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Oh, thats fairly simple. Well, not fairly simple, everybody the goalposts move. I mean, it takes very little to be financially comfortable. You just have to spend less than you make. Right, but Ive established a certain amount. First of all, what are your packages? Like, do you have different packages? What are those tender run?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I dont as long as Im not paying right now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I just helped my friend, a friend of mine, this guy who I greatly respect, hes ex Department of Defense, like top security guy, and hes a fucking moron when it comes to managing his career. He got put on a performance improvement plan, and I just like, I put in about 40 hours working on his LinkedIn profile, working on his resume, figuring out what he needed to craft in terms of responses to his bosses. Everyone else got laid off and he got kept.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Lets see.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Well, because of the Air Jordan shoes. Its all about that branding with Nike.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So welcome to the divorce club. Yeah, thats why I have like I built everything. I owned a lot of real estate in my mid twenty s. And then I met a guy and talked him into forming a construction company. Built a construction company. I was the breadwinner that was like and handling the financial shit and working in software, working myself into the ground to help fund this dream of building a big successful construction company, which we did. And then those people that work three jobs to put their husband through medical school. Yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"A little bit. Why?","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"So think of the letter L and then the letter E and then SA. Have you seen the Shangha lize in France? Or the elite? My name is spelled weird.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"We start them in house, but what changed in January? Youre saying youve been started helping 400 businesses since January. What were you doing before January and what changed in January?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Ill be in the car until 745 tonight.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, some of these people already have. So are you helping people develop the content or distribute the content and get enclosed business or both?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I just want to make sure Im understanding thats. What if I became a customer in yours? Ive given you money to help me develop some content, correct?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I dont know. What are the options on Saturday?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Or is this your main thing and thats what you do for your side gig.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"That would be fantastic. Well, thank you so much. I really appreciate you reaching out, and I hope well have a chance to chat and I hope well have a chance to laugh about this in the future, and I will be one of your success stories you can tell other people about. Okay, take care.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Got it. Whats the bigger company called?","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"How long have you guys been in business and roughly how many people have you done this for?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Oh no, right. So what Im asking is the people who a course is created for, how is that course typically sort of consumed? Are we talking about are they buying one on one.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I like it. Okay, and how long will that take?","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Wow. Very cool. Well, the reason I was asking is because one of the most fabulous women that I know whos truly, truly amazing anyway, she lives out in Scottsdale, shes divorced and shes like, Im fine. Anyway, shes like brilliant. And you know when you get really brilliant people and theyre not happy and theyre not funny and stuff? Shes actually really happy and funny, which is like, weird. And shes like a DNA analyst. Anyway, shes like one of the goofiest yeah, shes like one of the goofiest, craziest, coolest human beings I know. Anyway, and she was out there, so I was like, hey, Ill push you off on my girlfriend anyway, but I.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"I havent checked it since I quit working. Normally, I run right above the border of what is considered excellent. I run somewhere between 720 and 740.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So you are working for a kid. So what was I going to say? Hold on 1 second. I just need to make sure Im making the right turn on the phone. What city or state are you in?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"On Saturday, did you say? Okay. Oh man, that sounds early. What was the one after?","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Round four. Round one?","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, thats fine. Its a lot of money. So some people package things and do like the twelve point 99 cent course, you go the other end of the spectrum, which is a super expensive high dollar package. Is that correct?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So whats your company then, if its not Air AI?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Im just popping south at San Diego. Rosarita beach? Yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. And thats something that I can go once its mentioned in the video, I can go research it on my own and actually see what the advertisements for those courses look like and who the person was that had the course.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"This is the funny thing is that literally, Ive taught classes for people in technology, like at client sites. Ive done lots of internal enablement type stuff inside businesses. Ive helped lots of women, just helped this guy. Literally, he just was supposed to be let go on the 7th and now hes great and everybody else is let go. So, yes, I would love to put something together. What the cost is, is definitely going to make a difference, but I would love to do something with this.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. Saturday. But I dont want any of sort of like, okay, no, its right now. Because Im going to be like, hey, I got to go take care of my Airbnb, and Ive got to show my friend around. Ive got to get back middle of next week, and then Im hosting a wedding for a friend on the 28th. So anytime after the 28th, basically after the first month, Im available, and then I can sink my teeth into it and all that kind of stuff. Thats where I wouldnt want to be.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im moving 2 miles an hour over to our consulting call. Hold on 1 second. Who is that? Is that an actual person?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Yes. Okay. Ill have the call with them on Saturday. And what usually happens after that call? How long does it take to get things rolling and all that kind of stuff?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"And can you give me your first name and last name again?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"There you go.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"I moved down there in the pandemic. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"If I had been born with a Y chromosome, I would have been filthy rich ten times over by now. Ive been fairly well off a couple of times, but I made the mistake of marrying the wrong person, so whatever. So I have built my little empire a couple of times, and Im going for round four. So round four. I started investing in real estate fairly young. I had a career in high tech that very few women have, and I sort of like grow tax my own career, like most people. Its kind of like being a doctor. And I didnt go to medical school, except that what I do doesnt require an actual medical degree. Most people have a degree.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, ten on Saturday would be awesome.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}}]