[{"pageContent":"Exactly. Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thats what Im saying. In the starting of the call, Im not looking that much in the initially at least if you can show me that, at least if you can get me the gesture sign saying that if I can able to end one K for per month, also Im very much glad for that. Okay. So if it is less than, also Im glad. I want how I can with my abilities, putting my less principle how much I can get in. So down the line, if it is consistent, if it is consistent and maybe after one or two years I may be increasing my principal and I want to grow my business, but initially for next one, two years, Im not looking for very random growth. Just I want to be consistent and getting some amount, some X amount, it can be anything. I dont have anything like in purpose that I need to get this much. If you can show me like two hundred K per month, also Im very much happy for consistently for one year, two years.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Im good. Thank you.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thats the one.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So I can coach them in writing their resumes or getting onto the It side. I can give a guidance.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats what I was saying. Right, so its like passive income. I dont have anything in my mind at least. Im thinking that at least for starting, if I can make it per month, like below one, k is also fine with me. So I just want to have a start off and going around. So I was thinking like, next in five years. It should grow like that. Thats it. I dont have immediately, I dont have anything I want to set up first. I want to set up and getting some X amount, so Im not so keen about that amount. But at least for your number, I can give you some number, like one K at least.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, I should be. Let me open my laptop, and then can you give me five minutes? Middle of something in the office, so Ill just finish it, and Ill connect with you in five to ten minutes.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, I think I didnt get your question also properly. I didnt understand properly, but I dont have any scale currently. I dont have that one that at least I can answer your question.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Yesterday? I didnt receive anything. So morning. Due to saying I didnt check emails today.","metadata":{"fillerID":38,"fillerText":"Ummm yah","category":"F"}},{"pageContent":"Let me go to the code. So I want to set up some small scale business which gives a passive income and which can be useful for donating for the charities and all. That was my intention. So thats why I just started. Also. And I want to this one under my kids name so that they can explore and use these AI tools for that and build up their skill set and all on that side.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I have a job. Yeah. Its like a passive income, and I want to give it for a charity and want to build a skill set to my kids and all. This one like a passive one. I want something like that. I want to generate it. Im not sure that did I reach out to you on the correct way or not? Im not sure, but I want to be sure about what I want to tell you. I dont want to hide anything.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, correct. Building a resume and understanding their personality and suggesting that which one they can choose in the It industry, that type of coaching. I can help that with my knowledge, with my experience.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Initially start off with a very minimal amount. I want to go. If you say that if I can start off with one k also it is fine and I can guide you from there. Also means I can put minimal amount and based on the progress, I can increase that one.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I can.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, that sounds good. If you work like that means perfect, then of course.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. So I am a Budding. We are just exploring all the ways we dont have any set up, actually. So we just want to start up a small business for this one. I need some details. So I just signed up so that if you can give us some details on that one using AI.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"You say that this is the minimum amount means if Im affordable or not, I can tell you that as well. Yeah, that sounds good. Okay. If you are saying the minimal 2000 is the one you will be starting off. Okay, fair enough.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Okay. Coach or consultants. What? I can do that right. On my side, you are saying?","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Can you come again the question?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Career coaching, yeah. Thats perfect. On the it side.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, sure. Thank you all.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So we I was thinking we were thinking about something like affiliated marketing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Tell me in those terms so that at least I can yeah, so I.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Im not comfortable in sharing that one, but Im good with my income currently, whatever I have. So its like just passive side, whatever the best I can get it. I just want to explore that side.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. It makes more sense if we can talk on the June call with the showing some sharing the screen and putting the numbers that make me more sense than on the phone call.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, some amount I need to put it that I didnt decide, but I can give you for at least you need it immediately or I can give it later. Also this amount because I didnt think of it that side. Also.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Its above 50,000. Its around 100.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, I have signed up for that. Correct.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, awesome.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Hi, who is this?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}}]