[{"pageContent":"Hello? Hey, Rick. Hi, Rick.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Did you take a business writing class somewhere in college? Theyll say, yes. I say, okay, you can do it. You can get this. Well hire a tech writer to fix it later, but we got to get the stuff captured. And thats the role you come in and fill. You clean up subject matter, experts, material, and in some cases you go and dig out stuff. And as a sole contributor, a sole provider, youre going into the company following the instructions of some mucky muck in the It department and writing about things now. Right now, I am currently not having any. It mucky mucks upstairs because I got laid off from my last company, and its harder to get a job this time around than its been in a couple of years. Its been like five weeks, which is long for me. So Im going to go ahead and start writing articles, keep my name out, keep appearances going, and keep something that mail people to say, heres an article I wrote. So we have two things. We have get a day job again. Love that. I enjoy day jobs. I like the money I can make as a tech writer after 30 years. The other thing is, well, great, lets just make some kind of presence and lets write about new and interesting things, get attention, get words out there. And thats how youre hard to put a numeric goal to. Its more like youre dealing for tonnage for body count, not tonnage as opposed to normally youd want higher value articles to be published that people pay more. But I dont have that luxury right now while Im waiting for the next day job. So I dont state it in terms of I have this much book of business and I want to ramp it up. Im pretty much either employed full time somewhere, or Im writing things just rapidly to get them off my desk so I can have some income until the next day job starts.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"My life before the layoff and before each layoff, just technical writers tend to be considered as when the chips go down with a company, they look around and say, well, okay, whos an engineer? I am.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Very well, thank you. How about yourself, Tony?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Obviously the kind of information I would normally look for would be from Microsoft or whoevers behind the other two products, some of which are developed and some are still coming. And then they would flood me with all sorts of their stuff. But you have the advantage of applications in the field, and heres what we did. Heres what we think you can do. Now, because Im a technical writer, it doesnt mean that contracts cant end suddenly. And one from Amerisorth Bergen did. They laid off 500 people. And if they can do that, then theres something, and thats just for my staffing firm. I dont know how many people it was company wide, but just the Spectra force released 500 people. Thats just pretty dramatic. So that means that I have to do something in the meantime. And that means that Im going to be in addition to entertaining recruiters, because Ive worked primarily as a contract writer, I will also probably produce some of my own work. And that means Im interested in knowing the market I want to write, finding interesting stories, putting these things together, and developing and hopefully delivering content just to keep busy, keep my fingers limber, as it were.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure. Again, someone who used technologies or used AI based on information you taught them, or someone who was able to increase their revenue, because if I were to use it, Id just get more done in the same amount of time. It wouldnt increase my revenue. Id get the same amount per hour. Then anyone whos making advantage and seeing advantages and how AI helped them do it, now, thats really high on interest to me, because I can convert that in my current situation to articles or case studies or things that would actually be works of work product that I could sell individually until my next job comes by. And then Im beholden to the boss of no one else.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"My email. You gave us romeo, lima, echo, hotel, tango, india, novemberecho@gmail.com.","metadata":{"fillerID":47,"fillerText":"Mhmm","category":"G"}},{"pageContent":"Whatever your average $60 an hour worker makes. No, I dont have a number for my credit score. Im not a business. Im a worker.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Wait, cat. Im sure if you have anything that resembles a case study or a success story or something where I can get a grasp of where AI can help these businesses scale, then that would help me as someone who produces content that would actually be of high value to me 100%.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, if you look at the current market for freelance articles, a nice rate is like $500, and it will take you a few days to make one. I might be able to shave some time off of that with information I can glean from your application folders, your file of people whove done it. Well, that would be a learning process for me, and I would be glad to undertake it, but basically my take home. Normally I work for $75 an hour for whatever client is currently contracting me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Rick, thank you very much. I really appreciate it. Im glad you reached out. I try to follow technology, and theres a lot of technology, and at the same time, I have to get my own skills using my own tools in place so I have an interest in the AI stuff. So I could write better, faster, cheaper. At the same time, Im interested in seeing how other people do it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Really varies by no, really, I dont. I honestly cant say that I dont know.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Thank you for the call.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"If I was a business person, if I was a business person, Id have these answers, but Im a worker, not a business person. No worries.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Its a weird question from my perspective. If I work at McKesson, they paid me $60 an hour, and then I work 40 hours a week. And then at Ameritz Bergen, it was a little bit more about 62. So the check comes, I put it in the bank, I pay my mortgage, and I let those rest be there. Right. If I had a small corporation and I had to keep that records in that kind of language, I would have an answer for you immediately. But Im a working dude. I work at a wonderful job that Ive worked at for 30 years, and pretty much all Ive done is writing about technology. I used to be a magazine editor. That gave me a good start, and its worked ever since.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont even know I dont have any debt to speak of, and so my credit score goes wherever it wants to go. I pay my bills on time, and I dont know the numbers. I havent looked for years.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, that would be just a function of my paycheck. Its not related to what I do. The level stays constant. Regardless of what I do. I negotiate a salary. I normally am able to ask about $60 per hour on a 40 hours week. So I guess we do some math there and then multiply by four would answer your question. But the next job might pay $55 an hour, and the one following might be $62. The jobs usually ask for last three to six months. It sounds to me just that what Im hearing is that you normally work with, if it was roofing, a guy in his pickup, and each month he makes a revenue target and does things, but he doesnt have a salary necessarily like I do. Most of the time I get paid by the hour.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Thats is one of my looks. Im actually in the process of retooling as a technical writer, and Im finding that a number of hiring managers appear to be a little bit positive that GPT-3 and GPT four will make it easy to avoid hiring technical writers. And having done that for a while and also worked with a number of offshore authors, Im pretty certain that whats going to happen is Ill still have plenty of work, but it will be editing text prepared using AI. So my actual use is find use cases inside of technical writing where AI might be of use. Im not trying to scale a business. Im a sole proprietorship.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ive been looking for I think right now theres some reason people arent responding to my request for information, nor as a magazine editor, I was, like, swamped with information. I just opened my mind and there was this damn would break and suddenly thered be all this information. But Im not saying that with the people who are championing CPT or those guys.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, my name is that, but my Gmail address is a modification of my name, and I can spell that for you, but I have to use fancy airplane letters. Are you ready to copy?","metadata":{"fillerID":33,"fillerText":"Yeah","category":"E"}},{"pageContent":"Well, in terms of it just doesnt fit my equation. When I have the job, my money is my salary. Its determined by what I negotiated before I started the job. When the job ends and I have to go scrambling, which I normally dont, the next job usually presents itself. This time its being slow, Im going to go scramble. So, I mean, I would have to get some track time to figure out what articles are paying these days and who the good markets are.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its just a question. I dont get asked that often, I suppose.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im employed by companies on a contract basis, and some staffing firm pays me a nice check every week, but thats nothing you can scale. You go by what the market is paying. Now, the thing Im discussing in the meantime is write stuff and sell it to people. And so I dont have a baseline. I dont have a book of business to sell.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, again, I dont set aside capital to grow my company because I just keep my job going. What would I use capital for? Ill show up at work the next day like I did the day before. If I was on roofing or siding or had a mechanic shop, I would set aside capital. I might set aside a reserve to guide through periods where a job doesnt come. No one is hiring me to work for them for three to six months, but that would also be a function if the roof needs replacing, nor if the house needs painting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im sorry, I didnt mean to say anything. I think I scraped my finger against my phone or something, and my phone picked it up as me saying something. Thank you for your courtesy, though.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]