[{"pageContent":"If I add them all together and stuff like that, I would say high good end is ten K a month. Just like kind of doing affiliate stuff, like low end and stuff. Trying to sort of new one right now. Just be like 200 pretty much. I get as much as I put in.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, its not necessarily like my entire granted, I could make great money and stuff from it, but its not necessarily my passion. So Im putting more into Valuation Conquest, where Im just kind of like building up a whole bunch of stock of I wouldnt say Equitable type of value for other projects and stuff that Im working on, just so I can build up that when I come back to these entire creditors and stuff like this, Im like, hey, not only did I bring you all these entire clients, now I have these entire offers to kind of offer that way. So I was just kind of more project developing and stuff that entire regards.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, this is not. Im just kind of doing, like, the affiliate marketing on it, just kind of.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Air AI. Okay. Air AI.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, no for sure. And I mean thats why Im giving you this specifically is that exact thought process. These are literally going to address how to properly build this business. If you wanted to a to Z. Its going to give you context on starting this, getting an education on what it takes, how to do it right? And then furthermore, its going to break down on the back end how to collect the cash that you need, because thats where so many people fall flat, is ultimately they dont understand how to take proper cash with every single human being, right? Because people can close ten people in their agency in their consulting business be like, Fuck, Im rolling deep. My family is like, Whoa, you just collected a million, and then youre sitting at Christmas dinner stressed out because you cant pay your bills because you closed 20 people, but youve only collected $1,500. Right? Its understanding how to take every single person that youre working with. And if I close five people, Im collecting 25 grand cash, making it where I can actually achieve my goals. Does that make sense? Does that sound good? Its going to cover all that in.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. I feel personally it sounds like great to be completely honest. Like how you guys are even communicating stuff with me, even figuring out where my entire laps are, what Im doing with my personal scaling business and stuff like that. I feel like it could definitely be a benefit.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"General? Honestly, for about ten years, since I was back in high school. To be completely honest with you, Ive.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, of course.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Industry, what the entire project is on as well. I cant just be like, this is the entire sure way to get X amount of leads, or this at the third when I dont know what the entire project based on.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. Cool. You guyssystem. I was like, all right, well, way to automate this. So I dont have to be messaging every single person individually in my contact list before I go over to the Internet and just kind of like, reaching new customers and stuff like that. Well, new potential customers. I thought that can be kind of cool to kind of explore.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I mean, I kind of do it now, just kind of like freelancing my entire friends personal businesses and stuff like that. But I just never thought about making it a career. I was just like, okay, well, you should do this if you want to get to this entire scale, then, all right, leave me alone, I got to go finish this entire project and stuff, you know what I mean? Yeah, but yeah, the way how youre saying is maybe I could kind of turn it into a full time position, but I wouldnt necessarily know how to go out and sourcing how youre saying obtaining other leads to be like, hey, all right, let me help you with your entire business. It was just always like people in my personal network just kind of like, hey, check out this entire brand and.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, I can hear you taking notes.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I have other income streams and stuff right now, but like, working a regular part time job. But I was thinking about just kind of like switching out from doing that and just kind of making this like a full time thing since Im about to get ready to project.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I could say that I know pretty good with that entire process and stuff like that. Im kind of more proficient in building pitch decks and business concepts based off one persons interest, et cetera. So building out an entire project, Im like, hey, heres all the entire pros. Here are all the potential cons and stuff like this. So if we hit it, I think we should attack it this, that the third. But since you have other people that are kind of throwing their entire money into it and stuff like that, they have their voice and opinion. So Im like, okay, this is what I personally recommend we should do. But you have a lot of say and stuff in here because youre helping support this entire project. So we could do it this way, but now I have to potentially figure out how do I go around this entire potential con by not doing it the same exact route that I want to do. So it kind of brings more difficulties and stuff to me just because some people just kind of like, hey, I want to go down this entire route to see if we can pass this entire potential problem and stuff versus just like, getting it all right at once, if that makes sense.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, absolutely. When you say all the dots lined up and et cetera, Im kind of like, all right, will that also help me in all these other avenues and stuff? Project because I have a game that Im kind of developing tech Project thats developing more enhancements for the entire individual persons vision and stuff like that, kind of exploring that entire realm. Then another one with more like the satellites and stuff like that. So just kind of like a whole bunch of plants and kind of written up and ready to go, but just now, just kind of getting to that entire I guess that equity Im not quite sure what the appropriate wording is where I have the entire financials just to kind of put them all in position, in place.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes, absolutely. And you dont mind me asking, can I get your name one last time youre giving me info? And I was like, wow. I have to write down your entire name?","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"No, thats completely understandable. And I actually kind of like that entire set up and stuff like that. I can tell you how many times I miss appointments and stuff like that just because people just ended up canceling and not showing up. So thats a great policy to kind of have. So, yeah, Im there.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So why pick that number in general? Well, that number, I dont know, 25? Im just like, whats a good average? Like, if were talking sports and stuff like this, Im a basketball guy, 25 points in an entire game. If I can achieve that entire number on a monthly average, I feel like thats just like, a good number to achieve for. So just like, nothing I want to say I have any major purchases or stuff that makes me attracted to that number. Obviously I want to get surpassed it, but just everything works and stuff like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, so right now, Im in high invest in high risk, high reward right now. So Id probably say probably like $500 to put into another project and stuff at the current standing, just because Im putting so much into all these other projects, just in hope that they all turn around when Im ready to kind of launch. Thats why when I saw you guyscompany and stuff here, I was like, okay, well, maybe they could find a way so I can automate something to kind of scale a lot faster. So if that helps answer the entire question.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, pretty much.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I think that makes sense.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Absolutely. Yeah. You hit it right on money.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"The 09:00 A.m is fine. Im up in the morning and stuff like that. I get started probably around 1112 time, then to five, then five afterwards. Its just like personal time.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Oh, yes, sorry about that.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"No, that sounds great. Its a good opportunity to kind of test out to see where I kind of currently hold off with the entire big executives and stuff that are currently in the game now. So I think that even right there is a huge bonus on this entire project. And stuff like that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"This company that Im working with, Credit Gyms, I just kind of started with this one probably like, a week ago.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Affiliate marketing with this entire company that I just started with. So I would say nothing like a week ago. So I have one client that come in, so probably not just a personal thing. So probably about like $200 right now with just this one so far, but in general, its completely case by case study.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. No, that sounds great. It kind of matches what I kind of do from a day to day and stuff. Anyways, now you guys are just kind of showing me how to kind of do it at that high scale.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, because I love that as well. All the marketing sides being how they say your network is your net worth and stuff like that. Build an awesome network of people that are all on board for these types of projects. Now its just like kind of me finishing the entire project and I already have that entire verbal commitment from everyone else. I kind of have the contracts already written in play, just send it over to them, they sign off on it. Then I just kind of press play and everything. Just kind of launches and automates and stuff like that.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Oh, hey, hows it going?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I think it just kind of depends because I guess you have MLMs or where you get those leads and stuff, kind of like already automated stuff where they just kind of create like an entire ad campaign. So I think it might be MRM I forget what the entire technical term is called. So I would say, like, pretty average, not like anything sufficient or anything like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Honestly, I guess like every other person, I feel like the entire appropriate answer is just to say financial freedom, financial literacy, both. But realistically, if were just talking about a number of value, Id be personally content making like twenty five k a month, where its just like thats, like my net, not growth.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So Im in the Los Angeles area.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So I was kind of focusing on that one, our limits. Just so now I can have that entire secondary conversation, like, hey, if you guys want to invest on this entire project and stuff, right here, youre all the entire details.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So part time, Im still a content creator. I do music and entertainment, stuff like that. So everything on the social media world, whether its like posting TikToks, YouTube videos and stuff like that, so I say thats more of a part time position since its not really paying for me to just be full time in it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I cant say much experience and stuff like with that one. So Im kind of interested to learn more. I had people that not had eligibility, like backers and stuff like this, where they didnt have enough to pay for a service and stuff, but we just kind of did little small monetization projects along the way to downsell, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I know you said youve been doing.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Annual income? So I guess it would be around like that entire, like 42 mark.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So right now Im just kind of assisting with a couple of other businesses that Im working with. So one is like a credit repair agency that Im working with right now. So just kind of helping people increase their entire credit scores and getting them approved for personal and business credit cards, et cetera.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, right away, if I can do all that, yeah, still like that tie, like 500 number thats kind of like what the entire entertainment space is like when youre considering YouTube, like the music platforms, all those entire DSPs, et cetera. So it kind of works the same exact way. When youre kind of putting money into marketing, then you just want that entire return at the end of the month. So thats kind of like what Im expecting to thats why I havent dropped any more projects, just so I can just kind of do like a big launch at one time and just kind of get all the higher numbers that I acquired to hit and reach as many people as possible.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Have a good one.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"But just consulting, thats what Im curious about.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"That sounds great. Like pretty good. Thatd be honestly pleasure, truly awesome.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I wouldnt say Im looking to get away from it. Its just that Id rather go ahead and have that entire automated system where Im generating money so I can do this at the highest level if possible. So thats where it comes back to, like, hey, I was just building up a whole bunch of project content, et cetera. And so when I get back to that entire twenty five K a month number and stuff like that, I would know how to diversify all these entire projects to ensure that they kind of snowball and have positive returns each entire time I drop something.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I could definitely do that, but what? Putting on 1.5 speed, like make it faster than the 60 minutes?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Jake from State Farm. I like it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, its pretty straightforward. You explained everything. Just kind of like if it was just like bullet points on an entire sheet, kind of follow these entire structures, you should be successful if you actually put the time and effort into it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes, sir. I love it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, just with part time jobs and just kind of like everything right now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"You see, right now my entire credit is not at that high number. Right now Im at like a 641. So Im kind of going through and getting those things repaired since I dealt with identity theft and stuff like in my past. So Ive just been yeah. So I was on the phone with creditors. Theyre calling me. Theyre like, did you sign up for this? Im like, what are you talking about? I dont have this entire phone line and all this entire other stuff. So theyre just kind of like a whole bunch of stuff like that right now.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yeah, in a way, a little bit. But it still comes back to what is that entire individuals need and stuff to that entire client, stuff like that, because I can help scale any style of business and stuff like this where all the entire parties can win its just now Im like, hey, are you going to be like a good guy or bad guy? Like when I help you and stuff like this, because some people kind of just want to make things, I guess, play like a villain role and just kind of like destroy like a whole bunch of stuff. But I dont understand why its just.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Jake from air. AI. I love it. All right, sounds good.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"You said its a Iare, correct?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"My current day to day? Well, right now Im just kind of developing more projects and stuff like that and just kind of reaching out to my personal network and stuff like that just to see if we can just grow as in a small circle. But right now Im about to go to the casino and stuff like that for work. So I guess just kind of casual. Im not entirely sure. Normally Im free in the afternoons and stuff like that. 05:00 P.m. Like PST where Im just kind of like on my phone where Im just kind of like brainstorming or reaching out and just doing research and stuff.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]