[{"pageContent":"Yeah. Whats that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Its time because I have proposals, potential clients that want to work with me and I am fielding and nurturing the current clients. That got a lot of projects going on and I havent had time to get the new business proposals out there because Im serving the current clients again. I think some people with a business model where they want to really push push hard, theyre willing to spend 18 hours a day. I am not. Im just at a part in it. Im that much closer to retirement, but its just I dont want to spend that much time.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"125 an hour.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Sure. If its not too personal.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"No worries.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I think so. Depending on the software, depending on the tools, being able to get familiarized with them that maybe help me service these clients, particularly this Latin festival getting familiarized. Then hopefully when I do have the time, when that is over, Ill be more proficient at it and can understand how its implication for my own business because what Im doing for other clients is basically helping their business. So its just a question of turning that back around and using those resources to help my business, if that makes sense.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, the retainers I have negotiated for several clients is just a monthly retainer. And then I work on projects, and it fluctuates. Some months are more time consuming and other months are lighter, but it all kind of works out at the end in terms of the overall project or yearly compensation fee.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. When I launched my business, I basically decided on my birthday that I was quitting my job and starting a business. Yeah. So it was great. It was awesome. It was a nice present to myself. But I know other people that spend six months getting themselves prepped and ready to go and get all of their sort of structure and tools in place. And I just quit my job and started a business. And I was very fortunate that I had a couple of people that heard that I was quitting and they said, Would you come and work for us as a consultant, and this is what we need you to do. So I immediately had income coming in, so I have not even had time. Its the head space, too, of doing the research on sort of setting myself up in a much more organized, more legitimate manner. And now that its been successful for a year, Im sort of looking back in hindsight and realizing that because those systems arent in place, that its going to cause my business to be a little bit more chaotic and laborious for you. Yes. Im literally right at that apex right now, again, sort of exploring if I have to spend 60 hours setting something up or I can figure out something that will help me get it done in 5 hours, Im going with 5 hours for sure.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"No, I was just going to concur that when you are basically a sole proprietor and you put your shingle out with you say, I have a proven track record, you got to put up or shut up because then the clients will disappear. Im open to some ideas that can help me look like a superhuman, fantastic thought leader with all these nonprofits that they see a tremendous value with working with me.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, Ive been a nonprofit my whole career, but I just started my own business a year ago. Instead of working for one, I am now working for multiple. But theres scalability in my business Ive had some outreaches from film festivals across the country. Film festivals are also in my background, and they want my support and help, but I get really bogged down with part of the follow up is just the proposal writing and the ideation for how you can connect a national brand like a car partner or a beer partner with one of these nonprofits. So and Ive been using Chat GPT over the last couple of days, and its just been kind of groundbreaking to be able to push out and through a lot more communications without having to be bogged down with language and making its like not all of us are writers. You want to, well, represent yourself and the nonprofits when youre reaching out to a national or international brand.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, thatd be great.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"About 25,000 is probably where I would be comfortable right now. I mean, Im still a fudgling business. I have no website present. I dont even have a website. Ive been gaining all of my clients through word of mouth or through relationships that Ive established over the last 30 years.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, its a whirling dervish. Yeah. Its basically all me except for taxes.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"To be honest with you, I am jam packed with part of the reason why I like GPT. Im behind on proposals and getting back to clients, so I havent actually had some time to check it out. I hope over the weekend Ill be able to look at it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. This Napa Valley, weirdly enough, is target rich for smaller nonprofits that could really almost use an organizational or strategic overview. Theres deep dive analysis of nonprofits and then theres more of a you can almost see where theyre missing opportunity especially. Ive been doing this for 30 years. And I wouldnt say that Id put necessarily a boilerplate together, but I think that theres some things that could be presented in sort of yeah, this is what I can do for you, and heres the four things I can do, and heres the four measurable outcomes of those things and people would pay it. People would pay it. Napa Valley is very philanthropic, so theres a lot of donors out there, but many nonprofits dont know how to reach them, dont know how to talk to them, dont know how to market themselves. And again, were also very close knit. So you have a few that are like, hey, I worked with this company and Monica Barrows and Associates and she got us results in six months. That would be fabulous. And I also have a friend, shes working too with just employer situation with a nonprofit. Shes very interested and has talked about maybe we collaborate and just kind of take over the market. And neither one of us are in a position wise perspective to really put a whole lot of energy in that, at least right now. And my season basically is May through September. Thats all Im doing is events and activities and fulfilling sponsorship activations. So I wont really even have a whole lot of head space or time to really make any type of significant transition until probably October. But Im doing some homework now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, it sure was. Giving you way too much information. But since were from Arizona, I dont know if you were there during the housing crisis in 2008, that was not a fun time. But those of us that stayed true, we bounced back for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Absolutely. Oh, absolutely.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah. Im just saying though, that at least from my perspective, when I get overwhelmed by new information and I cant process it or I dont understand it, sometimes its just easier to turn it off and go back to what I know.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"From Monday, the following week is my event. So the 18th through the 21st is my event. And what Im saying to you, we could schedule something that week on Monday or Tuesday, but come Wednesday on, Im out of pocket. Im literally in the car and going from event to event. Im part of the set up. So its not just the event, its all the set up and tear down, too. But the following week, Im open until my next event on June 10. Thats what I got for you.","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}},{"pageContent":"That week, I dont have my calendar in front of me, but I think that Monday is open, completely open. I prefer to do mornings because a couple of cups of coffee and theres a window of where Im like my best fresh and BrainWise. After lunch, I get sleepy. So probably 1030 on Monday the 15th.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I did, yeah. I still have a house there.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Which of course you always want to make more because taxes seem to take out a lot of money.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, this is just a little over a year and its pretty napa centric. And I find that I do like to work more regionally, but there is opportunity to expand national. And I even had someone approach me that has a music festival in Spain and wanted to ask if I would be willing to provide services. And I just didnt have the bandwidth to say yes. And that was a disappointment because I would have liked to have done it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Youre looking probably at people who are, I dont know, doing B to C, maybe some B to B work. Mine is very specific. I charge by the hour or Im on retainer for my time.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"The because I mean no, its so funny because I put a call to voicemail from someone today that is interested and I was like, I just cant because I have deadlines for print deadlines and have to run up to up valley and have a meeting here in 30 minutes. Ill call you back on Monday. And that kind of hurts because you know that theyre calling to see if youre available.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It kind of looked like the caller ID that youre calling from Arkansas.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Im sorry? You cut out just a tiny little bit at the last there. Do you know what my growth do.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Oh, well, actually, I used to live in Phoenix.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thank you. Okay, bye.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"And its possible that, like I said, I havent really dived into the specifics yet, but this may not be the right fit for what I need. As I said, I am very new to the AI game and theres a lot out there. And of course, with algorithms, as soon as you start clicking, it connects you to just another avalanche of did you know? And some of it seems very, on the surface, very relevant and maybe something I can use as a tool and others it may not be. And I dont know if just having this conversation with me, if youre hearing enough that says, yeah, this might be a good fit for you.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, Im fine, thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, I was going to say, I appreciate that. Thank you. And youre going to hear me. I have a jump in the car because Im heading to a meeting up Valley. So forgive me if youll go to my car speaker, hopefully.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, I wish I could put a band aid on it to Tide and then suture it up in about six months.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. A person or a bot. Sure. Like I said, Im pretty clear I get bogged down in the proposal writing. Where I really am successful is in sort of the creation process, having that phone call with someone, having an engaged conversation, discussing various opportunities that might be available for sponsorship, and then my subsequent I will follow up with a proposal and then being able to concretely and being very descriptive and sort of elaborate on some of those conceptual ideas. That boggles me down.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im preaching you to the choir, but Im giving you a little insight of where my headspace is.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure. It sounds very intriguing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Field to be able to I dont think so because my clients are diversified. So I have a healthcare client here in Napa. I have a music festival in Incline Village. I have a brand new Latin music festival that is direct appeal to the Hispanic demographics thats also Napa Valley based. I have a childrens theater group, so theyre all over the map. I do word proposals. I also do graphic proposals. Sometimes its easier to convey a message with a few key hero shots and doing a template for each is what I have done every year. You rinse and repeat in terms of sort of a little bit look and feel, but you have to update the language, the dates, the artists, the hero shots, all of that. And thats just time consuming. Did I lose you? Hello?","metadata":{"fillerID":34,"fillerText":"Uh-huh","category":"E"}},{"pageContent":"My business score is low because I havent been doing it very long and I havent put anything into place to kind of help build the credit score for the business. But my credit score personally is like 780.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Whats that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"About 13.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, well, Im just exploring Chat GPT and sort of getting my feet wet and seeing all these additional sort of support apps. And some are relevant, possibly relevant to my business. So youll see me? Well, you wont see me, but I am signing up for various things just to see if I can get a demo or play around with it, see if its something I want to do permanently, for sure.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"150.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, Im very small scale single proprietor, consulting business that I work with, nonprofits in the greater Bay Area, so concentrating in Napa Valley and Tahoe, and theyre typically performing arts nonprofits, so with events, marketing, sponsorships, partnerships. So thats a little bit about what I do. But Ive got about four or five clients and I have no resources other than myself.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I think its very valid. I think over the years, you know, nonprofits, as you alluded to, they dont compensate well, and theyre always looking for the best, but also the cheapest, and they pull a lot of heartstrings like, were so poor and we cant afford it. But when you deliver a product and you can prove that they can make more money, more in either ticket sales or in philanthropy, and then theyre a little bit more open to paying sort of a commiserate price. And I dont anticipate going to the moon with it because I want to work hard, but I dont want to work hard. I think this whole AI is revolutionary. Its moving really fast, but theres opportunity for those of us who are sort of getting in. Not so much on the ground floor, but maybe floor number two right now, to be able to really harness the resources to be more be more the word Im looking for, but just be more timely with responses and outreach and success and goals.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, it does. No, I appreciate it. Again, having 30 years experience of you offer a free concert and you get 50% drop off if you offer it at $10. Not to say that this is worth $10, but you offer it at $10, you have an 80% participation rate. So if its free, people dont take it. Dont put a value on it. So I can appreciate where you guys your business model perfect.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, I I totally agree. But just just as sort of a clarifying point, this Latin Music Festival is a startup and Im on the originating team, the founding team. So the focus in trying to make sure that that is a slam dunk because it has incredible amount of growth potential. Thats where Im spending a lot of my time and energy. Now, if theres tools that can kind of help me be better at sort of servicing that particular client, but to really turn the spotlight back on myself and say, to scale up my business and everything like that yeah, I have to be really honest with myself and say it probably wont happen until that September festival is over.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Okay, that sounds good. I really appreciate it.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Are you visiting Arizona?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Like I said, this coming week not even my desk right now calendar, but I think its the 8th through whatever that Friday is. If you saw my calendar, there is like no window at all.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, so I feel like theres still an unspoken sounds to me like, is there a cost for me to commit to today in order to get that video?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Its a nice balance, actually, when you think about it, because everybodys so concerned about artificial intelligence taking over and sort of taking over relationships. But you do need the human touch to kind of help bridge the two.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, well, I am not handing you a bunch of bullshit back, but this is a very weird week. A couple of weeks for me, actually. Im committed all weekends, various events, and then next week I am solid with client visits, site visits, venues. And then the following couple of weeks, Ive got a major four day destination weekend that is going to be taking up a lot of my residual time. I have a break after the 21st where a window of about two weeks. So Im open to the idea. I can appreciate that you want the 48 hours window, and I am not bullshitting you, but if you send it to me right now, I looked at it over the weekend and we had a call. Next week, I would probably give you about 50% of youd be taxing and maxing me out, and I wouldnt be benefiting from it all. Now, Im happy if you want to send the information, like the week of the 22nd and book a two hour conversation that week, if that makes sense for you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yeah, right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I have actually, since discovering the Chat GPT and literally it revolutionized the amount of time, to be honest. I think theres also a deterrent for procrastination because sometimes you put off things because youre just like, oh, I just dont have the manpower, the brain space to be creative, or I need to be thoughtful in my response and I just dont know where to begin. So thats been really like I said, its revolutionary. And Ive shared it with a couple of people that they were worried about the implications. And Im like, its just a tool to Google when it first came out, instead of going to the library and spending 20 hours trying to research a subject in multiple books, you had Google, you researched it and you got the information at your fingertips and you used it and you saved yourself 20 hours. So theres nothing wrong with saving time, right?","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, certainly. All of this sounds why Im stayed on the call is this is all sounding very interesting to me to take a look at in terms of time and investment and see if its the right fit and everything that weve talked about. Kind of its leaning me very in, a very positive but Im always a little reticent to just take a leap. I quit my job and took that leap, but that was out of character for me. So I would be really interested to see if youre sending me some more collateral material that I have a chance to sort of digest. That would probably be my preference is to take that sort of more slow approach for sure.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, lets do eleven.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. Well, I imagine you probably see a lot of people that get overwhelmed and they just sort of tune it out and turn it off because its too much of an information. Too much information.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, I cant this coming Monday, Im actually driving to Tahoe for my client. But the following Monday, probably morning, 10:00 a.m. Ten to 1015? 1030 would be best. Not so great in the afternoon just because Im trying to close out some of the days and I, for whatever reason, have a lot of meetings starting one to about four.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}}]