[{"pageContent":"Yeah, thats pretty much what Im trying to get to right now.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, Im committed on growing and scaling a business on my own, but its always good to answer the phone, to be able to inquire about what you guys do, actually, and how does that process work. I just want to see the different ways that people are able to grow and scale their business so I could figure out if its right for me. So Im committed to doing it after I figure out what type of information you guys have. You know what I mean? Just want to make sure its the best decision for me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I have some investments to my name, probably have like $5,000 in savings. But towards everything else and all the grants that Im doing, I wouldnt know. Im trying to get a couple of thousand. To be totally honest with you, Im not really an out of pocket cost type of person when it comes to growing anything or starting anything. I usually get grants in that sense. I have people who have no docs loans who will be able to help me. To be honest with you, this is like the first time that Im thinking about the financial side of me actually putting in something. But if thats the case, then I probably have like 5000 set to the side. I probably need more, but I just always get the different way.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, depending on startup, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I think its like the first year, but I think, like I said, this is the first year that I actually ventured off to going independent. Ive been under businesses and stuff like that, so its good to acquire about different means of how to build funds for business, whether its like grants or whether its through help from a company or program, its good to inquire about these things because its totally different from being under somebodys wing and working with people.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Can you send it to me via email and then also attaching your phone numbers or communications and contacts for me so I could be able to.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Always below. Like I said, Im working on it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Freedom means freedom means a chance to be free, your own world, to just do what you want with whatever means that you have. Whether freedom is going to be different things to certain people, as far as some people can do it with less, some people do it with more, just the ability to be able to have carbon means that you need to be able to survive and to be able to fill shape things and secure your environment.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hold on, quick.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Um, yes, and at the same time all depends on when it is. And I just like to see, to know the information and just go for it from there. I would definitely love to look at the webinar and the seminars and just figure out if thats get more in tune with who you guys are and what you guys stand for.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I was just going on social media and I probably was one of those things just like, sign up now or whatever and just send you info. And I was like, oh, cool, AI. And I was just like, press the button to sign up to see what it was about. You know what I mean? Yeah, Im all for exploring, trying to figure out if something is the best thing for me or not.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sometimes startup mode is a long time. Its been about three or four years now, but its like Ive finally got the things in order to actually go more independent. Its easier to follow person than to lead sometimes.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. Thank you. Appreciate it.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I dont mind.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, especially if its feasible or anything in the best interest of the business, then definitely. For sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, Im good. I dont have nobody.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Eventually I wanted to scale like, you know, six figures, but I want to be like more, like more so like hands off. But I still want to be overseas, kind of like supervisor and stuff just to make sure Im able to still have a hand in my business.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Give me 1 second. Im sorry.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I definitely want to take what I said before. I definitely wanted to tap into the webinar, the training to figure out that something for me. I want to go from there. But if thats not something I can do, then thats as far as I want to go right now, so I can figure out if thats something I want to do.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, Im just getting information as far as what the company is about and stuff. Its not about getting help or anything, but me personally, like I said, I think its just like following leading, you know what I mean? Just like learning a business and thats like where a lot of the constraints and stuff comes from as far as somebody creating another business. Like, some people go out and get degrees and stuff in business and some people just go and get experience and then just kind of move forward that way. But Im just inquiring about different ways to be able to help out with business investments, if that makes sense.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I have a business right now, and its online and creating different ways to be able to scale my business. Im a service provider, so thats pretty much like when my business goes.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, Im still at the start up point, but Im a travel massage therapist, so its easier for me to get stuff when I travel, but I got away from the clientele aspect of them coming to a business, so thats what Im working on right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sorry, Im in a bad area.","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}},{"pageContent":"Yeah, thatll work.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, I think thats a good question for everybody. I mean, I feel like everybodys shopping for a certain amount of freedom.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I am cool.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Hold on quick. Im sorry.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yes, possibly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. I definitely understand where youre coming from.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I rather try to get better time to be able to communicate, talk to you for I dont want to get caught up in the area that I understand.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Just know that Im just working on that right now. But as far as my business side is good, its just their personal size.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, please. But also, is there a way because I dont want to interrupt, but I also have this happens to be bad timing right now. Is there a way where we can schedule another time so we could fully talk with no interruptions?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Then also just having a better time as well, because Im out here and Im driving for real.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im a massage therapist, so the prices vary from place to place because Im a travel massage therapist, too, for different spars and also for myself. So the prices range from anywhere from if Im splitting it with a spa or something like that, like $50 per massage, or if Im doing it for myself independently, its like anywhere between eighty dollars to one hundred dollars per massage. And then theres extras where you have either high stones or other modalities that I do. And then usually there are extra $20 to $25 added onto the ending cost.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"To be honest, right now, Im just looking on another side of the fence and just looking for grants right now. And then Im coming back to the funding aspect of everything else later. But as far as this, thats pretty much where I was looking towards grants and stuff. I havent even looked towards that aspect of anything yet, but I dont know, Ill probably figure that out as time goes along.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Name? Matthew. Yes. I would appreciate it if I could.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, Im literally about to get more deeper into the road and I just started driving, so I was like, thinking about it, like driving and talking on the phone.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}}]