[{"pageContent":"And things can get mishandled. And Ive noticed that in the political environment since 1996 and also Ive been listening to other people in politics and theres a lot of, lets call it garbage that is being put out in the news media. It would really take hours to go through some of my concerns about how things are developing. I dont really know you, so its like Im hesitant.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"My thoughts right now are, okay, Ill just work on business and try to make decisions to develop good business systems. My entire career has been around software development.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im just talking off the top of my head, really, I have a lot of interest, but basically Im earning at the moment. Okay. The last three years, my mother got sick and she died just recently. During that time when she was having struggles, she died at 90. Okay. Shes gone now. So I spent the last few years just trying to help her. So I stepped out of the career. Now that shes gone and the estate is settled, Im going to go back into my full time career, even though Im 69 years old. So thats kind of the situation. Simple jobs. I dont want to work on stuff that I worked on in the past. Im more a business systems analyst. Right. Ive taken a look at the country politics. Let me give you the biggest thing thats on my mind. Okay. Im being kind of open with you. I have worked since 1973. Thats my high school graduation year. There were no software systems developed like on the Internet. It didnt exist.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Business systems.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I developed software on four different total approaches to software. The software systems that won in the last 60 years have been website development systems, and theyre all running on databases like Oracle. And Ive worked with six different databases other than Oracle, Ingress, Sidebase, all that stuff. Just in a nutshell, my thinking is I should probably just try to work on website development and stay out of the way of all these, what I would call uncredible people that are corrupt. As one person, I cannot handle dealing with all of them. I think they could just kill you.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I understand what Im faced with and I dont know, at this point in my life, Im like looking at what should I do? So its interesting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So my entire career has been developing software. However, I developed software in the industry of warehouse systems, and thats my strength. However, I discovered in 1996, around that time frame, that the voting systems were corrupted and all the software used by government voting systems, in my opinion, my assessment, are garbage that are totally corrupt.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im convinced. Now, bear in mind here, that as my mother was dying and I was helping her, thats the only reason I know this, because I stopped working to help her. And you know what she did as an 88 year old woman? She asked me to check it out because she was concerned about his politics. So while I was helping her, I studied what Joe Biden was up to.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"The Kshelton CPIM is my email address for gmail and MSN accounts. I use those two email accounts. Beautiful. I prefer for business. The MSN.com account.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Your email, let me check 1 second. Sure.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I was doing that with Catalyst International with about 46 clients, and then the company lost its mind. Catalyst International went under. I figured I was going to spend the rest of my career there.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Oh, that was like 1520 years ago. I have lots of education. I graduated Milwaukee School of Engineering with Bachelors of Science and Management. Right. The website developer. And its a complex study right now thats working on website design right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, either way, its fine with me. Its just I havent worked in AI, but Ive worked in other development environments, four different development environments for years. And website development and database systems beat everything else out. I think it would be interesting to get into discussions with people that know what theyre talking about. I dont want to spend the rest of my life doing nonsense. Its like, you know, its its like Im Im actually I won the 1969 Marquette University Science Fair when I was in 8th grade, which you had no way of knowing, but I won first place in the junior division, and I did it by building a perpetual motion machine using electromagnets. And what I did to win I think you might find this fascinating I titled my apparatus as a perpetual motion machine, but it really was running off of a power supply. So what I did is I actually kind of made the people that were judging the fair open up their minds to possibilities. And yet my project itself was not actually perpetual motion, but the ideas that I covered in the project discussion were all dancing around, how would you make that happen? And I won first place, and I also won the Education Award as the prize. They gave me a brand new set of World Book Encyclopedia. And that was 1969. My family was very interesting. My father was a brilliant guy, and he was supposed to go into the Korean War, and he was actually a master sergeant in the Air Force. And he was getting on a plane to go to Korea, and a lieutenant came up to him, pulled him off of the plane and redirected him to Alaska. And the reason that the guy did that was the Russians were talking about invading the United States through Alaska. You may not know anything about this history, but my father was sent to Alaska. And thats part of my history is the things that he trained me on. And winning that 1969 fair was really because my father pointed me in a direction. This is like, really interesting stuff to me. Artificial intelligence is the future, but its also a very dangerous set of possibilities. People like Elon Musk are saying its very dangerous.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay. There is a guy right now who is running for the President of the United States. Okay. And Ive been studying him. Hes won several first place awards at engineering and physics topics, and now hes running for the President of the United States. So you may see him in some of the election stuff, and I think hes the only one that I currently believe is really on track with whats really happening in the scientific world right now. Im sitting here thinking about him, but I cant remember his stupid name. Hes from India, but I could just stop talking to you and look him up. Its no big deal. But the idea is, I now understand that the elections were fraudulent since starting in 1996, and then Donald Trump was able to get in to be president, and then he was overturned by corruption to bring Joe Biden in. I dont know if you know anything about Joe Biden, but he ran for the presidency back in the he lost because of his corruption back then. The guy is like a complete historical moron. And then they tell us that he won the election. He didnt win, he couldnt win. Hes a moron. So it was all corruption that he got in. So you see, in my own personal views, I believe that keeping people on a healthy living structure, you would think that medical science is the correct way to learn things. However, all of a sudden, we had to go through the COVID-19 bullshit that was all garbage made up for political reasons, which Ive studied enormous amounts. This may even shock you. I now firmly believe that the entire medical establishment keep in mind, I worked with the medical establishment my whole life because my father was paraplegic and drew me into it. I now believe that medical doctors and the medical industry is, like, full of shit. I dont even want to talk to a doctor. I have no medical issues. And what I do is I study the science and fix it myself. So thats my mindset in healthy living. And if you study medicine, like I have for many, many years, you see that they have been corrupting. Like, lets say, the food supply. Keep in mind, I worked for 16 years at Carrie Ingredients making food in that company. The food supply in America has been manipulated in a very strange set of ways. And so what I do is I grow my own garden and I study what do I need to survive things. And what they did with the COVID-19 was they started having people put stuff in their bodies through shops that were developed to hurt people. Now, why would they do that? See, I lived by helping my father in the medical industry all his life. He was trying to improve his situation. So I had a super high level of belief that doctors were good people. I havent visited a doctor in, like, 20 years because I am now convinced they are. Like, enormous amounts of doctors are just out for themselves and dont care about people. My mindset is, like, pretty wide, and it may be even shocking to you to hear me even talk. And Im being honest. I wish that this didnt happen. And remember, my mother died recently. But in the last three years of her life, she asked me to investigate if what the doctors were talking about concerning the COVID-19 junk. She wanted to know if it was true. And sadly, I had to go back to her and say I discovered that its corruption. And that was the best thing she did at the end of her life. She actually forced me to investigate the legitimacy of the medical industry because I believe, because of my dealings with my father, that the medical industry must be good. And it actually was very damaging to myself that I now understand that they are not operating in an honest fact finding method. Theyre actually manipulating scientific information to make money. This shocks me. I always thought in America that we were doing things to help. And in my industries, we were. I was a software developer for production warehouses. But guess what? Theres a whole lot of people that werent doing that. They werent being honest.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"In 1996, the government of the United States was corrupted, and it took time before finally, I think its been taken over. Now, I was unaware that this happened back in 1996. I was developing software with Catalyst International in the warehouse systems companies. There were no problems in the software. We were doing wonderful software development. And Im being honest here, I was actually shocked when it was proven to me that the voting systems were corrupt. Since 1996, it just got progressively worse. So one of the things, as an older gentleman, Im thinking, what can I do to help correct the garbage thats going on in the voting systems? So I tried to get hired by a voting system company. They wont touch me. I wonder why.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Greetings.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Okay. And if you could give me your name and contact information, maybe an email too.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So in a nutshell, thats whats on my mind. Its like, okay, Im too old to do anything about this. I lived through the entire development, 60 years in software development, and the future holds AI, artificial intelligence. And I think thats what youre calling me about, is that correct?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I mean, being honest, I would like to try to help. I did not believe there was a software corruption issue until about three years ago when I personally looked at some of the code. And let me give you one example. There are lawsuits right now with the Dominion software that are like, in the billion dollar settlement ranges. Well, I cant walk into that environment. You know what Im saying? Now, I dont know what your beliefs are in software or any of this, but Im an honest software developer who believes in America. I think, for example, in politics, the only reason that Donald Trump won the election a few years ago was because so many people voted for him that it crushed the software that they had put in place. In other words, the people voting overwhelmed the corruption that they designed into the system. That is what I firmly believe allowed Donald Trump to get elected. And if you look at the politics involved with Donald Trump, theyre attacking him constantly. I dont think he did a damn thing wrong. I think he was actually trying to help the country. The economy was in very solid condition until Joe Biden supposedly won. Joe Biden is the biggest moron that Ive seen in 60 years of my life. He did not win. This was complete corruption.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im interested. And right now, I have your number as 904-867-8986. What is the associated with that?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, send it to MSN in the future. And Im very interested in helping the country do things correctly in whatever you could live your life in one small little industry. I worked in a fairly large number of industries in my career, and Im comfortable with that. You are sparking my interest, and hopefully we can go forward with something.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"According to people like Elon Musk, AI, he strongly thinks could be corrupted just by being developed improperly. So I dont know much about AI. I would like to get involved in AI, but in a way, its like, okay, its artificial intelligence. Its being designed. Have you ever heard of the psychologist whos been looking at this as well?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, thank you very much. Beautiful.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So at any rate, I probably told you too much already.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Well, I do myself as somebody who would be able to build a business. Ive attempted to do that for many years. But it is rather difficult to do everything yourself.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Well, Ive worked in a number of different areas. Im 68 years old right now. The thing that Im trying to do at the moment is get a website up for retail. Im a website developer. So thats one thing. I worked the last 16 years in carry ingredients, helping them with different production lines. Before that I worked as Catalyst International and basically business systems analyst. Thats what I thought I was going to be doing for the rest of my career. Thats sort of like where my heart is.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, Im interested in possibly working in the area. I think that other people should actually run the start the businesses. I think I could certainly contribute.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I just took a look at that. We dont know anything about it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im being honest. This is my understanding is software has been fairly stable and strong in certain industry groups. Other industry groups are being manipulated. I cant imagine the ways I dont believe that the four major voting software development systems are legitimate. I think theyre completely corrupt. And I was thinking, well, maybe I can do something about that. And Im kind of of the opinion that theyre not going to let me in.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]