[{"pageContent":"I have. Thats kind of what my business is, is Im working on it. I just dont have the I dont have everything in place yet. So I have as I said, Im like, 75% loose end on, like, 100 different loose ends, and Im ADHD, so I keep adding on little things into my business, but I just need to be able to focus on one thing. So its got little parts of a lot of different spectrums, like marketing, affiliate marketing. I have branding, like digital art creation. Just like a bunch of shit. I need to just consolidate it into one.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ive got it from nothing, literally, the last four months. Like, literally 300. Its at, like, 590 right now.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, it was like a couple of weeks ago, right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"My resume wasnt too good, so I just kind of got the first job I could.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, basically right now Im just an affiliate marketer, to be honest. But I have an e course and also planning on getting some licenses just for ownership of some different SaaS products and just basically running with that. Im kind of all over the place, Im not going to lie. Okay. Yeah, so I dont have anything super solid. I dont have my own product yet. And thats my problem. Thats what Im in the process of getting.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I mean, start like just a beginning goal. Ten grand a month would be awesome. Once I get that, Ill be satisfied, but Im not going to stop, you know what I mean? Thats where Im reaching for.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"With the job, Im at 34 take home.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"And a lot of it was also I was looking for what kind of website I wanted, so I played around with a bunch of different hosting sites.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont know. Its just kind of a good number for me. Thats 120,000 a year on the side. Not complaining with that, its enough to actually be sustainable and kind of do what I need to do in life. If it was just that and it stopped there, Id be content, basically.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Awesome. Is this your line then, your direct number?","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thank you. Im just trying to do something with my life for the first time.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its not good.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"See ya.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, I have a full time job. Its just kind of like my side gig that Im getting going. I started late January, so, I mean, Im just barely getting it ramped up, but I put in just as not I work 40 hours a week as a groundskeeper and the other 40 hours I do my site business. So Im putting just as much time as I do with my full time job.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Also, the thing is, if I did that, Im basically skipping the affiliate part because Im already gaining contacts in that way anyways. Id be kind of skipping one process almost.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Not good.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Not terribly much. Most of it right now is just like, getting my name out there and at least my website views have gone from nothing to now. Im getting about 40 to 80 people a day on three different websites each.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Perfect.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Thats awesome. Yes. 100% down. Cool.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats thing I need to do. Any company that I do reach out to will be like, hey, I see the value in this. Lets work together.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Before taxes, before 39 ish somewhere in there.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"But its growing. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Is that the only one I have? Eleven and or 07:00 A.m.. Thats even trickier. Actually, lets do eleven because I can take my lunch at that time.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"I had no idea what I was doing. I had a great coach. That was a huge thing.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Whatnot?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Because Ill be at work. Yeah, thatll work.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"ThatS all Im looking for because I put out my feelers in a lot of different categories and Im still looking for that one. But that exactly what weve been discussing. Sounds a lot more fulfilling.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. Because they have their bureaucratic infrastructure already set up they dont want to change.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Cool. Yes.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"You know what? I actually just moved here. I got out of Wisconsin and came out here to change my life.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, every day Ive been just building onto my business. So it kind of just started off just, like, writing articles, and now I have so much stuff going on, I just need to tie up the loose ends and get a good product behind it. By the end of the week, Im going to have some sort of licensing done on a SaaS product that Im going to use from Clickbait or something similar to that. And that way Ill have the rights to sell software in my name and its in my company name. And that way I actually have a product to promote fully because right now I have just, like, 1000 different affiliate programs Im working with. And you know what I mean? Every time I go to a new website, I just sign up for their affiliate program every time.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I appreciate you too. Thank you very much.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah. See, Im in recovery, so I am almost eleven months sober for the first time in my life. Congrats. I have a lot of motivation that I never had before. And its crazy how much energy I have compared to what I had for the last 15 years.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I havent found the exact what I mean when I was saying product. Im no code type guy, I have no idea when it comes to coding. So I wasnt planning on making any type of my own software or anything, but thats what I was kind of trying to mean by getting the rights so I could market a software of some sort or a program or anything. Yeah. I believe in.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, Im single. All right, cool. Literally came out here with my backpack and starting right.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"A full time entrepreneur? Not at all entrepreneur. When I was younger, I was a marketing manager responsible for $50 million a year by myself when I was like, 18 to 24 at my best friends dads company.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im pretty solid. Im pretty adaptable. As long as I know when I need to be ready, Im good. Cool.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Boise, Idaho.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Kind of defeat the whole purpose without watching it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, that makes sense. I would have the same thing.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"The way I look at it is the person that knows everything never will learn anything. So I try to absorb as much as I can from anybody. You never know who youre going to encounter. Thats going to teach you something right theres. Professional. Anyone that knows better than me, which is everyone, Im going to listen to them.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh no, Ill be in my own office. Itll be okay. Beautiful hunky dory.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"So I guess altogether traffic, Im getting like, 250 people plus a day already. So thats good. Im just trying to monetize that as best I can.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, definitely. Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Versus yeah, thats what Im seeing.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So my marketing was responsible for, on average, about 50 million a year. So I have a lot of experience in it. But since I was a drug addict, I kind of just went down the whirlpool of shitty jobs, so my resume wasnt looking too especially since I didnt work for the last three years because I was doing what I was doing.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, I appreciate how much money yeah.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, its actually Mountain Time.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, I actually did my taxes yesterday.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Perfect. Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Good, how are you doing?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, you can use that one. Yeah, thatll work.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Were on the same page, brother.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, cool.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah. And thats actually kind of like what Ive already kind of implemented. Im right there. I have all the infrastructure ready for that. I havent reached out to the right client, basically, or the right clientele.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure do.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Probably 1500 at the most. Yeah, thats another thing Ive been dealing with, is just battling with finance constraints.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, pretty much. As far as operations go, Ill say Im at, like, 50% of where I need to be to just actually be bringing in money.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, pretty much, because I have a pretty good I know where Id look to start with, what companies I want to partner with. I already know I just basically need to set up the model. Thats really number one.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, perfect.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"A mixture of just, I guess, presenting my model, because I havent really set down a solid time to just present my model because, as I said, I kind of started here, did a little bit off there there. So what I really need to do is kind of sit down and just structure my model that I can pitch out and create that sales funnel in itself. Just creating the value in my product, in my company.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}}]