[{"pageContent":"Im good. One of your fellow colleagues, I just got the phone with him.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"James Rick.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, he sent me email with the information for me to go through the tools, stuff like that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Absolutely. Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"You have a good night as well.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"This way relationship. So Ill get in a relationship. If were not in a relationship, this is what we do. This is lets go this lets go up. And then in a relationship, its like, okay, dragged away from that potential of growth individually or together, me and him moving forward. But then when we get in a relationship, we stop that because we get tied up in the relationship, get tied up with the female, get tired up with whatever were not. And then now you get all this negative energy and all this negative vibrations on not emitting that energy that we have when we not in a relationship, because were down because of the relationship aspect of things. And so whenever were happier when were not in a relationship, even though in the beginning of a relationship, because obviously were not together, me and him in a Potomac relationship or anything like that. But when youre in that for us, when were in a platonic relationship and want to be in a romantic relationship with a female, I feel like that romantic relationship tends to drag us down in a way whenever it can be. Yeah. Because we allow it. And then we get sidetracked. We get distracted because they kind of hate or dont like how we are together, you know what I mean? And what we do and like, oh, well, why you cant really hanging out with him. I know thats your best friend. And then its like, hey, bro, in order for me to be in this relationship, Ill holler you in a year or two, stuff like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, mine is probably right around five. I think the last time I looked at it was like 525, 60 maybe. It was one at one point, but mines in the upper seven at one point. Mine was maybe four or five years ago was right there at seven. And then relationship and departing from that relationship, and then relationship after that, depart from that relationship and trying to do things to grow in that relationship together and then not be together for longer than we wanted to be. And now I had taken the hit on those trying to help out and do whatever I have to do. So then it just lowered lower and lowered.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Respectful, respect given, respect earned. And you dont have to earn it to be respected, you know what Im saying? So as long as you know that you have respect for others, you see it, you feel it, the energy is there. The vibration is there. And so between the two, theres not a chance that I could get a separate call from two different people, from the same company that has that same vibration and energy that you all both had. Theyre coming through right now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"It did. Absolutely did. You could tell the level of the tone. He has to say it, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, he did.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Very well said.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, absolutely. But I told him as well because I am going to try to bring a lot of my friends and family into that situation. And for me, not having the full scale of education on the topic of insurance or anything like that and being able to be coached to coach is exactly what I might need.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im sitting here with one of my buddies, and were actually searching to get information on stuff. I just got the phone with one of your colleagues, and I forget his name, but anyway, he has the same enthusiasm, that conversation piece that you have. And I was just talking to my buddy, and the phone rang. I was like, hold on. It came up Washington State. So he said the guy I was talking to said that he was calling from the office number. And I said, all right, this might be the same guy calling back, but as you, but you have the same enthusiasm about the business. And I was like, yeah, this is something Im going to look into because of that conversation and enthusiasm that you do have.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, I know where mines at. Unfortunately, I dont currently have the income to debt ratio. Its more the income ratio to offset it to where its looking really good for lenders. I mean, Im still getting hammered with just the shittiest loans that come down the pipeline.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Youre not talking to people. Oh, well, its this persons fault. He and I both know whose fault it is, and its solely with us. But its time to grow up.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Neighbors. Nancy a apple.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"So 04:00 P.m and 04:00 P.m 100%.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Ive had goosebumps this whole time. Thats repeatedly, as if Im standing outside in cold, Im having hot flashes of goosebumps. Its like crazy. We got the phone. Im like when I get those. I know its a good thing. I know its a filling. I know its an energy feeling. I know its a vibration. I know its a step that we need to look into more. This offer means a lot more than.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Were not too different. We pretty much feel our mindsets are pretty much the same when it comes down to working together and what we want to do so together. On my aspect, on my end, I know that financially, everything that is a profit is a plus, right? So I even had a conversation with I forget what company it was, but anyway, she asked me what kind of income did I want it oh, it was Lincoln heritage. So hes like, what kind of income do you have that you want to set for yourself? I said, I dont look at that anymore. I dont care about how much money Im going to make or what Im going to make. Everything I make is going to be a plus.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No more distraction.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Well watch it tonight.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I mean, totally understand it, but were going to be there. Were going to be there. Were waiting on the call.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Want feedback after, dont you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, because were doing it necessarily not saying that we dont want to help others. Were just not helping others just for ourselves. But thats exactly what it is because we need to help others in order for us to feel solid, in order for us not to be down that emotional roller coaster ready to jump off jump off the roller coaster and say, hey, man, whatever. Ive lost friends. I have friends all across the country that call upon me for advice. Call upon me whenever theyre in the gutter and whenever theyre in those thoughts and whenever theyre in those feelings because Im the one thats able to talk them off the ledge. But I dont have anyone. I have that one person, that one person sitting here that helps take me off the lid to help me be this positive. If I wouldnt have reached out to him to bring him back into my life, me and you would be having this conversation right now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Grow.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, lets go again, too. We aint trying to be anything. Youre literally talking to two people who, again, its not as homeless like were on whatever, but I mean, sitting here in a car trying to plan a piece.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"As you were explaining, Ive had goosebumps this whole time. He already teared up once and I was about to you know what I mean? Because I feel like this is that platform that weve been waiting to help us get to, that were not going.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"You even know.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Its just a byproduct, right? Its mental success. Wanting to wake up every day, wanting to actually do this, communicate and spread the love that that we have and do it in a way that is helping other people. Your income is just a byproduct. At that point, you dont have to worry about it anymore. At that point, you will be okay.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Whats that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"So its crazy because conversation with Rick, I was like, Im going to look at that video and all the information you sent and then get back to him whether or not you call back. And now weve been on the phone for a good half an hour, 45 minutes on top of Rick has more of that. Okay, this is it. This is definitely going to be something thats going to help us get to where we need to be mentally, that we need, that we have to have. It just absolutely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And thats all part of growing up. I mean, with you being as successful as you are at your age of 26. 1st off, congratulations, man. Thats great. When you take that step from childhood to adulthood, which he and I are just in the process of doing, and hes 44 and Im 43.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Absolutely. 100%.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Its 100% necessary. Yes. Ideas are great, and he and I are both full of ideas. Getting them to maturation, getting them to fruition is where he and I lack at right now. But it might be a weakness of ours currently. But in order for us to get where we need to go, we both know that it needs to be a strength of ours. So 100% is something that is needed.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Was he explained a little bit about I explained to him where my goals and goals or where Im at Molded. Im a little mile of clay right now. So I have my insurance license, and I have a couple friends and other agents that might join together and proceed to do things. And my 215 here in Florida, I sell health, life, and annuities, so I know that those three parts can generate a lot of money financially. So right now, was looking into the IULs and seeing what is the right platform to reach out and get those leads, as opposed to the old version of lead chasing and getting paying for leads and reaching out to get to those clients, how to reach those clients. And so the AI really sticking out because of everything thats happened in the past three or four years. Now you dont have to go door to door anymore. Technology dont have to knock that zoom. Meetings and stuff like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You sound young, too. He seems a little older. You sound a lot younger than he does.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, Phil. Coming from my mouth, Im not scared. Its positive. I know good things are going to happen, but it took us going through what we went through to where we dont allow ourselves to go back to that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Boy o ashes r roaster s. Sam at Gmail. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"But again, thats just he and I choosing to not grow up. Youre talking to two people who put all the blame on their shoulders.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Are you in Colorado as well?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I want to share a private idea that I just picked up. A couple things that you say.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thats why we wanted to hear you exactly 100%.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Mine is low, but he might know exactly where his is, but Im sure its a lot better than mine. And Mike is my buddy thats sitting next to me.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Special going on yeah, absolutely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Traditional bullshit.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, its on top of my tongue, but I want to say it was but give me a second. I talked to so many people in the past three days. I could be wrong, but give me 1 second because he sent me the email. Let me look that up. And his email, that was Rick. Rick. We didnt know Rick. We knew it was Rick because we have a roommate Rick. And as soon as said Rick, and.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah. Thats so crazy. So I was in third grade, and the teacher asked us to spin the globe and stop it, and then we had to do a report on that particular place, and I did mine on Scottsdale, Arizona, and I always said I was going to move there.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Thank you. I want you to know the words that you just spoke there again. Were sitting in a car and he was doing his thing in the back, Im doing my thing in the front. He got the call with Rick. He and I started to talk to come together, but the energy thats going on in here, like you said, the goosebumps.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thank you. Thank you for believing this.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"You were feeling something in that like, okay, hey, great. If I cant help, fine. But let me hear what you guys have to say, and you cant help anybody until you listen. And again, I can sit here the little bit that weve done all the talking, but the little bit that you have talked, especially for your age.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Now in this video, spell his last name, please, Phil.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"You are too young. You are, baby. Right? You might be. I havent walked in the bank, and theres a lady over the age of, I would say 45, 50, you know what I mean? That doesnt say, are you going to Gym Neighbors? So he was a guy that could sing, but he also acted, and he was in The Andy Griffin Show. The Andy Griffin Show. You ever heard of the Andy Griffin Show?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"DoesnT matter your age. Its just investing in yourself and stopping the bullshit. And thats where its at. And really just hearing your voice, its that high vibrational tone. As soon as you came on the line, it was the same thing that Rick had. I mean, thats why he and I looked each other right in the eye and were like, yo, we got to find out whats going on with these guys.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"B.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"You know what?","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"This conversation right here, man, phil, youre going to be part of that.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I feel about it. Theyre not ready for us. Theyre not ready for that message. So they just drag us down and its time to invest in us. Stop that stupid bullshit. Have conversations like these with people, as opposed to the conversations of people that are just going to take and take and run you down a path that is just going to continue to be right here, and its just time for us to grow and grow up.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yes, please. Absolutely.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"What is it? Phil.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Eastern.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Allowing ourselves to let other people stop our momentum.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"It already is.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"What theyre doing there, man. He has the same enthusiasm.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Phil, Im just going to be totally straight with you. This man and I are sitting in somebody elses car and pretty much homeless right now, and weve allowed that. Its not homeless, desperate, anything like that. But were sitting here saying, okay, were at rock bottom. I dont want to go any lower. But its like, okay, cool. Its more of an inspiration of the fact of he and I know that we can and will get wherever this next step is taking us, but its taken us to get here. One of us has always been able to hold up the other one in a bad time or whatnot and what I be able to get through. But now were both in a situation of, okay, hey, lets let all the bullshit fall off, and now were starting here.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"But doing something silly like stopping at 5 seconds even though all the content was done, but stopping at 5 seconds to go back and watch it again could have yeah, thank you for sharing that. So we know that its what we need to do to make sure because thats a huge gift that youre giving us. Please dont think that were taking it lightly.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. All right.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"But I bet you know who Guma Paul is, though.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Eastern would have to be four. I have a webinar at 230.","metadata":{"fillerID":33,"fillerText":"Yeah","category":"E"}},{"pageContent":"100%. Im actually in the process of doing that personally just because I wanted to take it upon myself to present to him of, hey, lets do this professionally. Its been a while since I was in school. Let me take that opportunity, that effort. And I know where some of my strengths and I know where a lot of my weaknesses were. So I mean, that 1000% would be more than needle moving. I mean, it would be earth shattering. Earth shaking, yes.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"He aint going to say I dont know if hell admit to this, but I dont think either one of us are relationship material on the level of longevity, you know what I mean? We both end up wanting that and feel like that was embreaded into our nature to have that and want that and kind of look for it. And then when we find it like, oh, this might work. Oh yeah, this is working. And then four or five years go down the line. Ive been in a long term relationship my whole life. The past 25 years, Ive had three relationships, four relationships that lasted long term. I havent had a relationship under a year, and usually like three, four years is the average. And now were doing that for the family, for the relationship, as opposed to for us individually moving forward. And it just tends out to turn out the same outcome. So, all right, lets try something different. We keep going down that. We keep getting our stuff in that rabbit hole. Lets stop going down that rabbit hole. Lets leave that rabbit hole alone and come out top on the other side in a different aspect of moving forward as the untraditional way and the way that isnt the norm.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, just like next door Neighbor. Just spelled differently.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats why I dont know. Like I told him, the skys limit first off, but Im a guppy in the water right now, so Im just getting my feet wet, you know what I mean? So Im trying to be a shark, but a dolphin shark, you know, I what mean that kind. Here I am, smile, touch me. And Im here to help and help everyone that is around me, everyone thats not around me, everyone thats around them, you know what I mean? Im trying to not only financially help myself, but even with if Im looking at it as the healthcare part, hey, theres this option and being able to help other friends of friends by teaching them and helping them do that and getting into the business and then being all connected, that we all be profitable and financially stable moving forward.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"The gift that youre giving us, were going to do the due diligence anyway.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"WeRe surviving off of.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Again, no, youre good just on that.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"But like I said, we probably watch it twice. Let me cut you up. Yeah, probably watch it twice, probably watch it tonight and watch it again tomorrow before the consultant conference.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"You got it, Phil. Thank you. Thank you, sir.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Usually you get those other calls back to back because of the information that you requested, because it doesnt get registered to the system yet that the call was already made by somebody else. And then as soon as you say, hey, your colleague already called. Okay, never mind. Thats fine. Yeah, you got the information thats fine. And then get off the line. You stuck by wanting to dive deeper. Yeah, that means a lot. That shows a lot. Yeah.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"All right, so its first name Jeremy. J-E-R-E-M-Y period. Middle name, michael. M-I-C-H-A-E-L. Period. Last name neighbors. N as in Nancy, a b as in boy O-R-S at Gmail.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"You were talking about Mr. Maddox, and youre like, hey, hes way smarter, and blah, blah, blah. I get it. Youre working for him. The reason why hes successful is because he chose you. All right? Its people like you. Its people like Rick. Im not joking. Literally, when you called, I didnt say one word during him and Ricks conversation. I listened the whole time. He and I started talking, and then he picked up with you. I looked him dead in the eye and I was just like, hey, theres something going on there. Lets hear what this guy has to say. And he lit up, too. You cant fake that bill. You cant fake what too genuine. Yeah, you cant fake what you have that youre presenting, the way you admit it. He wouldnt be as successful if he didnt have people like you. So give yourself the pat on the back. I know you dont need it, but just realize that youre doing exactly what needs to be done for his success, and obviously, its your success as well.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Agreed?","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Lets do four.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"All right. Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Honestly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, absolutely. Theres no way in the world we say no.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Its almost a weird way of saying it. Its almost selfish of us helping other people because its never selfish. But if you think of it as what the end goal is, that that gift that were giving of helping is what helps us. So in a sense, it is kind of selfish in that way.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Got you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"But it.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Energy level, you can see where your energy drops because you hate even to say that, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"To forget this in our fucking memoirs.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Ourselves.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"All right, four is fine. Yeah, four is good. Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Okay, whats your name, sir? I apologize, I didnt catch a person.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"You ever hear gym neighbors? You might be too young.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Theres not too much more to and with that, youre helping others. That gratification of helping others and makes that paycheck even more rewarding.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"The skys the limit for you, my brother, and Ill be looking for big things from you.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Us, thats our biggest thing in my opinion is we both love so much, but we allow ourselves to attract people that arent necessarily, they dont deserve.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yeah, absolutely. Let me hear what you have to say, though. Sure, absolutely.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Were bringing the again.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"We got past that. Now we just unloaded everything out of the apartment that I was living in. He lived with me now. So lets get this overhead out the way. We dont need to pay the month because were wasting it. Lets put everything in storage, and then well figure out the next step. And then now the next step, and now this is that next step, and now were on that next step, and then now were having this phone call, and, like absolutely. 1%. Yes.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I grew up in Phoenix.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"It is.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I was thinking about Rick.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Absolutely. It was crazy because it came up on the caller ID, Washington State, because he overheard the conversation with me and Rick. At first it was just I didnt have it on speakerphone, but then I put it on speakerphone and he didnt say nothing. Rick would never have known that Mike was even in the room. So Im talking to Rick, and then I got off the phone. Rick and hes like, oh, I like that. And then not even 30 seconds later, maybe a minute and a half, but you called, and then I was like, this might be Rick calling back. I forgot something. You know what I mean? And then you answered and I said I looked at him. I was like, Its not Rick. And you said the name. And hes like he looked at me, hes like, whats going on there? You know what I mean? Thats what it is. Thats what we need. We need to hear these things. We need to talk to these people. We need to talk to you guys. We need to know what else is out there as opposed to what we see right in front of us, you know what I mean?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Unless you want to do one thats earlier, but its up to you.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. More than can express. You know what I mean? Ive teared up twice. Hes teared up. Hes been crying this whole time. Like wiping his eyes, blowing his nose. Thats absolutely thank you. Absolutely. I cant thank you enough. Absolutely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"He was Gomer Powell in the Andy Griffith Show. And his last name and I never knew who he was or obviously his name or whatever or not, but his name is Jim Neighbors. Obviously, I had to look it up because Im like, who the heck is this Jim Neighbor? They would keep talking to me about when I go into banks or older women or whatever not. And I guess he could sing. I only knew him as the actor, you know what I mean? And Andy Griffin, lets go.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Everything happens for a reason.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Up in a unique way. You dont have to do the same rigor remote that Joe Blow is doing. Nine to five where theyre miserable, thats never interested me at all. But having financial freedom, time freedom, and rocking at that high vibrational level that you had in your voice, that Rick had in your voice when its very hard to project that through the phone. Jeremy and I have both been in sales. Thats very difficult. And you guys both hit it 100%. I could hang my hat on that if my job is making me that damn happy.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"We kind of talked into it. Im just now starting my so if we were to do it right now, were looking probably in between 510 grand. But that is also kind of tied up in not being able to really invest it. Its more like, hey, this is what.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. The email you send him is it going to have your last name on there too, Phil.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"You have over here in tears, man. But just realize on that, thank you from the bottom of my heart. But also, you wont be forgetting. You wont be forgotten. I mean, you got two people here that know the right thing, will always do the right thing, even if it puts them even in a worse situation of whatever, man. But this conversation has been great.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}}]