[{"pageContent":"Those six, but its like I can get a placement in a matter of a couple of hours, right. So it behooves us not to work on all ten because one might take me 10 hours to fulfill and get paid 20 grand. The other one might take me 2 hours to fulfill and get paid 20 grand. The other one might take me 30 hours and it doesnt happen. So all things being equal okay, so I spent $50,000 and made 40 grand. Was it worth it? Sure. Its just a matter of getting more job orders. And thats kind of our bottleneck with the business is getting more trusted because theres a big level of trust there that we have to because there are some people, weve even put a lawyer on retainer for those that we make a placement for, and then they dont pay their fee. And so we just pay our guy like 20% of the placement fee to then go after the company. Of course, we dont do business with them again, but that happens probably 5% of the time.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"We probably need to expand the team but that wouldnt be an issue. We know how to do that. Weve done it with our other companies and we have systems in place to expand the team pretty rapidly and its kind of a fail safe model. Just a matter of getting the leads I think would be the bottleneck.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Interesting. The other six, are you guys pretty much working for free, I guess, for.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, thats why Im entertaining other options.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right, sounds good. Cool. And look forward to seeing your email and well talk soon.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"So what does that sales cycle typically look like? Lead comes in and then is the sale or the close like a contract signed or what is that?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Im just thinking of the cuff here.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, yeah, needasall.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure. There has to have that human element but right. Putting in a system that I dont think I necessarily have the time to do cold outreach. I dont know. I can make the time to do cold outreach if there was appointments that were set on my calendar, sure. But I think gone are my to give business. Ten years ago I was doing cold calling and there is a certain success threshold to that. But I think the leads that were getting, if theres a method to put executives or HR managers on my calendar and I can jump on the phone and sell them over the phone that way kind of similar to how you guys got me on the phone call, Id be open to that. But in terms of doing cold outbound, I dont know, maybe I can put a team in place to do cold outbound but I dont know if thats worthwhile venture at this point. But I dont know.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yeah, our current model is well, we kind of drink our own koolaid. If you look at me online, I run Dev Co, SEO Co, recruiters co, and so we generate leads organically through search. Thats how weve generated a vast majority of our clients over the years. And we have a handful, but wed like to grow and we know that theres methods out there like cold email marketing and then put them into some sort of drip campaign with multi channel stuff. We havent implemented those things as of yet, but were looking into it and maybe putting some sort of automation. And thats kind of what triggered me to inquire about some AI technology to automate some of those processes because Im pretty deep in the trenches with the processes right now that we have in place. So wed have to bring on some more recruiters if we wanted to go get more business. But were kind of heading that direction based upon my workload and what we want to do with the business, but right now we probably generate three to four pretty solid leads a month, which is not huge, but maybe one of those will have like four hires in the next year. So that like $100,000 worth of business for us and generated relationships with businesses over the years that come to us with three or four placements a year. So we have a handful of those, and I can fulfill on all of those. Not to say that were stagnant, but were kind of like anywhere from 900,000 to 1.2 million a year with just myself and like two other people. But were looking for ways to scale up.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, let me open that up real quick.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im on MST.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Anywhere from six to eight placements per month. So it ranges anywhere from 75 to 120,000 a month. Interesting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Interesting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So after 30 days, thats when you guys get paid out and then the 90 day mark is kind of like the guarantee, so to speak, that you guys have in place. Interesting. Okay. Yeah. Im thinking kind of on our end right. And kind of like how we typically kind of structure our different offers and things like that because I think it could be a fit. But for the most part, a lot of what we do and structure out is typically selling different packages that are ultimately like upfront fees and use kind of like that kind of business model. Thats typically what weve done. Obviously yours is a bit different.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"10:00 or 11:00 is fine. Just put it in. I mean, Im very efficient with my time and Im not going to waste yours. Sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, whatever. Need USA ll yeah, got you.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. We dont know what it looks like in terms of getting more business. I dont know if we can automate that process to a point until we can jump on a call with clients. I dont know.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"In order to get those leads, weve allocated time and resources to have hundreds of blog posts so that actually people find us online. So theres time and money invested into getting organic, more solid leads. But I dont know, we can scale up significantly with cold outbound and were entertaining that and looking into that option.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I was watching a YouTube video and thats where it came up. But our business is recruiting, so were looking to find more clients for our recruiting business. We know how to find the candidates and we know how to build relationships, but just a matter of that outreach to build a relationship, which is with clients that are hiring in the marketplace. Were looking to build that end of our business.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. Anywhere from like 15,000 to 25,000 replacement.","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}},{"pageContent":"That in.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"That case study and sometimes tomorrow that youre available. Im pretty booked for the next 2 hours, but like I said, Im interested in learning more. And so maybe in that email you could put a few times and I can select them or let you know.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. I have to jump on the call. Theyre messaging me.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"We think like a cold email marketing and scraping say like indeed listings and whose ever those are posted by, we could message them and say, hey, I see that youre hiring a software engineer in Portland, Oregon. We can definitely help out with that. I dont know what that looks like but I dont know.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I havent seen it come in yet. Let me check my promotions folder real quick.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, there wasnt much detail, but I curious to know what kind of platform youre using.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Id like to learn more. Itd be intriguing to me, but for sure I dont want to be late to this call.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"A 03:00 and Im a minute late.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah. I dont know if this industry if theres a model for paid traffic. Maybe there is paid traffic. Our clients are not on Facebook or not doing searches on Google AdWords. Theyre doing searches and finding us through our blog posts and stuff.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right, okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thanks. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Theyll pay on the 29th day, on the 32nd day, whatever. Right. We dont really have many qualms. Its very unlikely that theyll pay as soon as but hey, its a net 30, so were fine with it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I think time allocation, I mean, sure I can get online and figure out how to do that, but when take home is like $400,000 myself, its kind of like, well, do we want to dive into this and go through the learning curve? Yeah, like I said, were looking to grow, but we havent had the time nor I guess the complete know how to do it. So I think to answer your question, I think its a little bit of both.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]