[{"pageContent":"Okay, Im looking at the wrong email. Im going to my business email address. So let me go to my personal I typed Air AI and nothing pops up.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Okay, I got it. Really? I guess my next question is, do you have any packages and pricing in place right now?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, and you said its 525.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"What town?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"And do the marketing.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. I thought that it was an AI program. I wasnt aware I was reaching out to say, hey, I need an executive consultant to help me do what Im trying to do.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Transparency. I have not earned any funds. I started this two weeks ago. Ive had the building since 2021. I have a profit that I had planned to do. Im being transparent. A third of the building was going to be for fiber optics training, and a third of the building was going to be for the incubator program. I was looking at 20 people trying to set within a 3500 square foot space. Unfortunately, I went to the Chamber of Commerce, I went to the city about starting the fiber optic, and someone within the powers that be decided that they were going to start the program behind my back. And then I just said, hey, okay, so what am I going to do? I have a 10,000 square foot building. I said, okay, well, then maybe I should just donate, focus all of my attention on the incubator program, be able to help as many people as I can and look at it as, okay, fiber optics. Somebody else can do it. Okay, theyre doing it, no big deal. Lets focus on this program. The funds I have not nonprofit has been in place since 2021. And its for veterans. Its for a hodgepodge of different things. Its for people with PTSD, its for people with autism. Its for people various things. So I really wanted to dedicate something to have a company thats totally dedicated to this and not be a part of all this other stuff. If the nonprofit can be a part and can be a resource to be able to help, to provide some free services for, say, veterans that are going to be a part of this, then great, fine. But I dedicate thats why I just started this particular one and said, okay, what I really need to do is to be dedicated to this, have something specifically dedicated to entrepreneurship for business startups and entrepreneurship. This is what I want. Thats why the company is so new, because I determined that, hey, this is what I really need to focus on for this particular one. So there are no funds, to be honest with you, there are no funds. We havent received any funds because I started it the 17 March, maybe.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"A business credit score?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay, lets shoot for twelve tomorrow.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Tomorrow I would say 08:00 A.m. Would be the best, but Im in New Jersey traveling to Maryland on tomorrow is a two hour, or you say 60 minutes.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Well, I have five companies and one nonprofit, and my very last company that I started is a launch pad to help entrepreneurs, startups as well as entrepreneurs to develop their business and become successful. So one of the things I wanted to do was to look at AI and put some requirements out there and seek assistance on building the company and the information that I need to be successful.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, with the business, my first business I started with rental property that I have, along with my consulting business, thats around $228,000 a year.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im not registering.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Well, currently Im not putting anything basically into this business because I am working on completing the actual physical building. Again, as I said, lunchpad will be leasing from the Realty Company to provide the resources, the services that it needs. So right now, my concentration is on putting the air conditioning in. I have a 10,000 square foot building thats completely gutted. So now Im going back into Ive had a new roof put on. Im getting the ceiling sprayed with insulation. Its going to be the industrial look with the lights and all and ordering the cubicles and things like that. So right now, Im not putting any money into the lunch pad until the building is complete and the furniture and everything is in. Then Ill be able to but all of that, again, is going to be under Realty Company. All of that is going to be a part of the Realty Company. Launchpad is just going to go in and provide the services, and they will pay the Realty company for occupying the space.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, right now I have two other buildings and everybody is consistently coming to me saying, hey, do you have space? Do you have space? Do you have rental space? So I do plan theres a radio show that its a small town. Theres a radio show thats done. But theres also I plan to put a large sign on the building when they really kind of started really making tracks on completing the building to have something saying, coming soon, Office Space Incubator. Go to this website to be able to look at it. Everybody knows the building there. Everybody knows that somethings going in there. So word of mouth is something thats going to play an important part. But what I want to do is to have neighboring communities as well. 30 miles away in all four.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, well if I dont receive the email I just wanted to have you already sent the email? I can confirm that Ive received the email.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"But definitely thats why I need to get a packet together, because what you want is to be able to present people or have a packet available to say, hey, but I want them to have something professional that they look at, that they see, that they go ahead and fill out the application. I do not want people I dont want to have the building ready. And now I start taking applications. I want to start taking the application at least two months prior to when I anticipate that the building will be open. But I just dont want to keep saying, well, no, its not going to be open now. Its not going to be open now. I dont want to do that. I really and truly dont want to do that. But, yeah, the plan would be to have a sign or something or have flyers in certain places to say that application are available online for them to be able to go grab the application and be able to complete it or complete it online. And its automatically submitted to me for me to review, for my team to be able to review to determine good candidates.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Youre with who?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Im not showing and what would it be? It would be air.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont at the time.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Is it with a person or its a video that I can view the video?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"See, and tell me your name again.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"No, but now will I be video chatting or just speaking with someone?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I can start applications with people that want to be a part of the program in advance. I could do that. Those people that have asked and inquired, I could say, hey, could you fill out this application? Fill out this application and present it to me. Hold on 1 second for me, please.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im sorry. Go ahead.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"But what is it that youre doing? What is it that youre providing? After knowing my company, knowing what Im trying to do, what is it that your company is going to do? Is your company going to recommend to me, this is the best way for you to advertise for your clients, this is the best way to market, what is it that you provide?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"All right, thank you so much. Now let me ask you a question. The 443-73-6867, is that in the number directly to you?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes, its Greenwood, Mississippi.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, great. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"The video I thought you said the video was 60 minutes or the phone call is 60 minutes.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Okay. Im sorry. I had a brain freeze for a second. I was thinking a doctor, and I was like, Wait a minute. Yes, I really tried it yet. I have not tried it yet, to be honest with you. I did register for it. Yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"And you said twelve or 24 months. Correct?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Well, I anticipate if I have 50 offices, thats 25,000 per month. I own the office building, so the launch pad will lease from the realty company who owns the building. Theyll rent the space, and Im looking for grants. Im looking for other programs to be able to support it. But $25,000 would be my goal. I know I wont fill up all 50 spaces the first month, but the goal is to fill up all of those spaces and be able to provide the training and support that they need. So $25,000 a month for that particular perfect.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"The pay tax was 81. No, it was 72. And there was another score that had 135.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, it is.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I probably will run something in the newspaper. Say, for instance, I had thought about the month of May, running something saying, hey, in the month of July coming soon. This is coming up possibly in the month of July, August, but I dont want to put anything out there until I have more solid date. As to when the worst thing Id rather say its going to open in October and it opens in September than say its going to open in September and its delayed by a month.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Of course.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Or no, no, I am not running any ads.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"That is where Im from. Im a military person, so Ive been all over the world.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, so the video could be more than 90 minutes. Its basically what youre saying.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, thats what I would do. I would be making notes of it. And if something I need to rewind be able to rewind be able to go through it. And to be honest, Ill be looking at it to say, okay, what else can I use this for? Can I use this methodology gaining and learning for any of the other businesses that I have?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I love it, absolutely. Because I bought the building in August of July 2021. So the whole process of getting the building new roof, those were the main things securing the structure, making sure the structure very sound structure still beams throughout the building. The studs were still hit metal studs, but they needed to be replaced. So its not a new thought. Its something that Ive been planning to do for some time, but doing so many things. So when you ask, what can I do, having someone that I could just dedicate it other than myself, because I have an aviation company, I also have a company that I do the business. My primary money comes from my consulting with the military. So I have to still do that job right now. So working through the whole process of it all, working through. So I have no funds dedicated to that particular effort. So I need to do that as well. Its not a nonprofit, but I need to be able to gain resources, earn resources, and be able to seek funding and grants to be able and thats what Ive been dedicated to doing today and last week and the week before. Theres so many grants that are out there for women, for startup businesses out there to be able to have those resources, and they would go directly into that account to be able to support it. So I have $0 in my account at this point in time to be able to pay for any services. The services would have to be paid out of another business if I were to do that.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Okay. What I will do. So youre going to send an email. When I receive the email, Ill reply back with my launchpad email address as well.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Do you know what number or what area code the incoming call will be? I have so many spam calls that I receive that I know I receive 30 a day, so I dont recognize the number especially. But if you just give me that.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"And that way youll have that email address and probably most of the correspondence from that address.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure, no problem. No, I will answer regardless, but I dont want to be on another call while hes trying to call me. I dont want to be answering a spam call while hes trying to reach me. Thats all. But just ask if they do not reach me the first to give it two minutes and call back. Thats all I can ask. Thats the most I can ask for.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"You too. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"That I can put into the launch pad.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"But I still have over $50,000 worth of credit that I could use. Im primarily using three or four credit cards that Im using. Like I say, the credit utilization is up more than 30%.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Your personal personal is low, because to be honest with you, Ive used credit cards in order to help fund and get things operating. So Im over my 30% of credit utilization. Thats why my credit score is low. Its in the low 600. But its only because of credit utilization.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"No? If Im going to involved, Im going to do it all the way. And we do what? Make sure I take advantage of the best for the resource. It would be for a person to say theyre going to be involved and you dont take the time to listening and be able to get everything you need to get out of it. That would give me opportunity to make notes. Can I rewind?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"What is the amount where youre starting to start to work with your car?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I do not. That is one of the things that I want to start structuring now while theyre doing that, have all the documentation, have the proper stuff to be able to present to potential members of the launch pad. So thats what I need to do. Thats one of the things that Im trying and maybe Im reaching out to the wrong media that I need in order to do that, but thats what Im looking for to do. What do I need to have in place? What do I need to the proper documentation? nondisclosures the NDAs and all those things I need to have in place for them to sign the agreements they need to sign, provide them all the resources that were going to provide to them, the whole nine yard.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay, but Ill have a link as well as to well, no, hes just going to call me. Okay, that sounds great. Ill be looking for the call at twelve and I just dont want to receive. I got a call last night from Loan Depot for business loans at 930 last night because I have a 703 number. So many the numbers that come through at 703 are spam calls. So I was just curious as to what area code thats my only reason for asking that question, to ensure that.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay. And is the 500 for the whole program or is that monthly?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay, super. Thank you so much.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Hold on, let me check real quick.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im sorry.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Im having problems with the contractors. Thats my issue. Im having problems with certified contractors because the building is so large they have to be certified through the state for certain as commercial instead of I have tons of people that are certified residentially to do certain things, but they can only go over to 7000 sqft. This building is 10,000. So Im running into issues or people that have agreed to do it. Oh, Ive got too much on my plate already. I cant do it. So Ive been running for the last six months into issues with completing it. Thats why Im being very vague because Im being very honest. Im very transparent. One thing about me, you always know what you get with me because Im going to be very honest with you.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"An employee?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Give me your phone number. If I dont receive it within a certain period of time, then I can reach out to you because it would behoove me not to ensure I have the email. What is your number?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, I need to learn more exactly what you do, to be honest with you, to be able to determine how and if you think into what Im trying to do.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Well, right now I am on the East Coast. The business is located on the central time zone, but Im eastern right now. Thats where most of my work is done.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Oh, wow. My dream employee would be like a virtual assistant. That person would be my go to person that I could say, this is on my to do list. This is on our to do list. I need you to contact this person. I need you to contact that person or look this up, research this, generate this form, whatever.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"So which is 60 minutes, the phone call or the video?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}}]