[{"pageContent":"Yeah, more people that are actually looking to talk to me about solar. Like, they saw it somewhere, some guy knocked on their door and pissed them off.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Mostly for marketing and rewriting stuff that I wrote, and I used it to rewrite a screenplay Ive been working on.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Its a tough industry because 15 people, you buy a new house and then 15 people knock on your door, from water treatment to solar to pest control to you name it. So Im trying to get those people to actually like, look, I just want to talk to a normal, reasonable person that will give me a proposal. Let me think about it, make an adult decision and either buy the solar or not.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Still could help people. So you sell home for years, you get into management, then you go build houses for years, then you get out on your own and you build your own custom houses, and then market gets whacked, and then you come back into the corporate world. So its been a whole back and forth between sales, building management, running your own building company, you name it. Okay.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Give us some thought. Yeah, think about the two think about solar and the real estate and then we can definitely reconvene. Yeah.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And I think thats probably a two to five year process.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"The freedom and the residual type income. New homes has been my whole career. So when youre in new homes, it pays extremely well, but its nothing residual. Its not like insurance, its not like financial planning. So when I got the offer to come work with solar, the big interest for me was, all right, yeah, the income is great as an individual, but long term, if I put a team together, Ill still always be out selling solar. But I can rely more on, like, hey, I get hit by a truck, cant work for six months. I still got a team solar that is bringing in 50, 60,000 a month or better for me.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I had looked at that and then Ive been using Chat GPT and pretty happy with that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, yeah. When Im having to reach out to you, like if I called you up like this and said, hey, Alex, have you considered solar for your home? Like, yeah, you and 15 other.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay. I just want to make sure were on the same page. If I answer it, I want to be answering the right question long term. See, I can put a team together. So long term, my goal is do this, get successful as an individual, which should be Im just getting started, so it should be in the first six months to a year. And as Im developing that, I can be bringing people onto my team, duplicating myself to where, all right, I can bring on as many people as I can physically manage and then teach my team how to manage their own people. Ultimately, Id like to be making $100,000 a month or better.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, thats the name I go by. My first name is Jesse, but I actually go by Jerrell. So thats why I answered Jerrell. Everything asked for a first name form, and I always have to say Jesse, but I wish it said, what do you go by?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, Im just trying to automate my system and doing things a little bit, and I sell solar, so thats the main objective is Im trying to get people to pick up the phone and actually call me or text me. Thats the hardest part about when youre selling object that people dont necessarily have to have. Its more of like, all right, that would be nice, maybe.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thatd be good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont think so.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Long term or short term?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Exactly. More phone calls or more texts or emails, just ever how they want to reach out. Im more comfortable generally just shooting an email and people send me, hey, heres a link, and I can do that. Someone could send me their email, cell phone number, I could send them a link, they could upload their Power bill, I could get them a proposal in 24 to 48 hours, send it to them, they could look at it like an adult, make the decision on their own.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Shit, just over 25 years and Im still licensed.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Jesse probably tomorrow.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yes, sir.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"All right. Thanks, Alex. See you later. Ill talk to you later.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im in the eastern.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I would have to say 80 plus percent of it is just in the new home building world. Meaning? Okay, so land development not so much, but literally it would be like, all right, youre a person who wants to get into home building. Heres the potential of what you can make doing it. I dont know how to turn that into a course and monetize it, thats the easy part. Yeah. I dont mean to cut you off, but I literally have to get ready for another thing. And I got two golden retrievers. I got to walk. Youre welcome to call me back. I know were in the middle of this and it was going pretty well, but I literally have to get ready for another appointment.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, it would definitely interest me. Obviously I want to know what it would entail and obviously the time and money investment to get there. But yeah, it could even be something that would be applicable to solar. Because if you got me four leads a day that were interested in solar, each one should yield if I close one out of the four and Im referring back to solar, it could apply to anything. I would make about the same. Yeah, that would be the kind of long term goal. Hey, if you got me four solar appointments a day, on average, the lowest Ive had is 5000. The highest has been about ten between the Solar Commission. So if you average it out, just say its seven. If I talk to four people a day, had a 25% closing rate, close one, thats $7,000 a day. Yeah. I just need to get the only difference.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hey, how are you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, I guess the difference for me is Im not like your typical agent, or I was not like your typical agent where Mr. And Mr. Remax or Century 21 or Exp. I was in the world where wed buy land, build a model home, advertise it, then people would come out wanting to buy a home. And then either I would be selling it or managing someone to sell it or building it myself, depending on what point in my career youre talking about. So, yeah, there was a way to create a residual thing to real estate that would be awesome. How?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I guess so many emails that may be in spam, and I havent really thoroughly gone through my spam. I just got to go through there looking for specifics.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Jesse it was kind of the whole career of teaching people. You just never really got any type of residual from it. So if you were a good salesperson, they pair you up with a newbie you spend six months training a newbie, then the newbie goes off and sells and you dont really make a dime off of it. So, yeah, Id love to be in a situation where, again, Im not like.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, if I was interested in name the thing. If I was interested in a new Tesla or if I was interested in a new pair of shoes, and I knew there was a resource that I could actually speak to someone without being like super high pressure sales, especially in a notoriously high pressure sales industry like solar, that would be my goal. Its like, look, I can talk to this guy, I can send him my power bill, he can give me a free proposal. I either like it or I dont. Im not going to beat someone over the head trying to convince them to buy solar. Its something you either want to buy or you dont.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, yeah. So what do you guys do? Create funds and then they lead to me to actually buy the program? Is that what youre talking about?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Normally about 80,000 plus.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im just trying to be realistic because so far Ive been going at it for a couple of months and I got a bunch of proposals out and a couple of deals working. So based on that, if it takes me that long and I have a background in real estate and been around it forever, and everybody I know is somehow related to home building in some way. So if Ive been able to do this, Im probably not the normal person. Yeah, probably if I bring somebody on, theyre going to call their friends and family, then theyre going to get rejected, then they probably want to quit.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]