[{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, Ive made considerable amounts of income off of consulting, but never 100 grand. Best Ive done is I consulted with a building company and it was an eight week gig and it was 20,000 a week, 100 grand a month. It sounds a little too good to be true.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Probably for a week, the lowest Ive done is five grand, and then the high was the 20 grand. But on average, its probably around five to eight grand a week.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I did not.","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}},{"pageContent":"Well, because on the pay per click, you got the ads constantly in the customers face. And there are no companies that do that will tell that they have exclusive leads. But you cant control what the customer is doing. And if theres multiple ads in their face and your ads are written halfway to each customer, youre going to click on them. And so you get people that are thinking about it. People cant afford it, want to just get more information and all of that dilutes your conversion rate.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Correct? Yes.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Ive been a consultant since 2003 in multiple businesses. Thats one of my venues that I work within. But I dont have a coaching business. Interesting engagement. Solve a specific problem within their business or help them launch product. Interesting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, I would not be opposed to that. No, I havent thought about that.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I have multiple businesses, but I contact you specifically about real estate, commercial real estate, and then my other business own sign company and a T shirt company.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I would more than likely be the person on the phone doing it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, pay per click, pay per view and things of that nature had a lower conversion rate. What I used to do when I had the peak of my residential real estate business is I would run 400, 500 websites at any given time that were long tail specifically to an area, geographic area, and they would generate organic leads. Those leads closed at 80, at 90%, whereas pay per click, pay per view 3%.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, it would. The land development deals are different because you work on those for two and three years and then when you get paid, theyre large chunks of money.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Theyre over a multi year project, so it will affect one years money, but then two years or three years, theres no income off of that particular project. Takes a while to put these big projects together.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Making a sale is not hard if you know the process of making a sale and how to take care of people. But most people dont understand that, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Land development.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"All right, talk to you then. Thanks.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, if theres somebody effective, obviously anybody would take that opportunity. Like my other business is I have effective manager so I dont have to actually go there.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Whenever youre selling dollars, you got to.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Oh, yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Honestly, have not.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Im good, how are you doing?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, I do, but Im unfortunately going to have to go because you caught me off guard and Ive got a 1230 appointment. But we could circle back later today or Monday if you want.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"230 Central, cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Whereas my websites would generate customers that were specifically looking at that neighborhood for home, and the information that was provided to them was genuine information about that particular neighborhood. Like, I had videos driving through the neighborhood, videos of the house available, specific information so they can make a more informed buying decision. So by the time they contacted me, theyre ready to go look at a house.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, Im dividing it out for you per week, but normally they engage me for a period of time to solve a problem or launch product or something of that nature. So theres an agreement thats 13 weeks or twelve weeks or ten weeks or whatever, and then they just pay along the contract. I Invoic them weekly.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Not a coach, but Im a paid consultant. Ive been a paid consultant since 2000.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"ItS effort in, profit out. So if its most profitable thing Im doing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So you have a meeting here, meeting there, planning and zoning meeting, meeting with the city manager, that kind of stuff. And it might not be 40 hours over three years that you could go.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ill be free in 2 hours.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Keep in mind, its not like youre working 40 hours a week doing that together plan. You submit the plan, and you have to go through all the government bureaucracy.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Possibly. What is that going to cost me?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, I mean, just the worlds changed. Salespeople are not what they used to be, especially corporate salespeople. They get back to the customer in two weeks or a month or six months later on a product launch. And these people get paid to work from home, supposedly handle sales. They dont follow up, they dont follow through, they dont get customers the information they need to make a buying decision. There is no more sales training per se. Most of the great sales trainers have passed away and younger generations, they dont understand the art of sales or customer service.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Its been case to case.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I dont currently promote my consulting services. Like I said, thats organic people, from my experience, certain areas, and I have a lot of repeat customers. But if I was to go about it, then obviously I would use social media and I certainly use LinkedIn in a different way that I currently use it to generate that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That talent, not when I was young, but it seems to be a problem these days.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]