[{"pageContent":"No, Im waiting on the disability to come in. Ive been denied the first time, and I got denied from LNI the first time, and now I have got the lawyers going in again so that I can the second time, usually because I got three doctors saying cant, so they have to at some point in time. So Ill get just about a year of back pay and everything, and then Ill have money here pretty soon to pay everything off. You know what I mean?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"This is he.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right. Thanks, man. All right, man.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Aubrey.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"We can do that because I just need to learn, have somebody help me learn how to build a better landing page and a better dont even know what the name of it is right now. After they subscribe what to do then, you know what I mean? I know that Im supposed to send them an email, but I dont have any references. I dont have nothing but what to say, you know what I mean?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, it was affiliate marketing, where I have four funnels, right? And they have the get rich doing what Im doing, trying to get business with get in there and get your business going and all that stuff. Its for money. And Im like, okay, well, I dont want to do that. I wanted to go with because of the time period at the time I wanted to do, it was getting ready to do for New Years and Christmas and all that stuff. And people want to do their New Years resolutions with weight loss and stuff. Thats what I wanted to do. I didnt get to do that. They put in the get rich, take in, follow us, well get you money. Im like, no, I didnt want to do that. And by the time I figured it out, I was like, oh, man. And they even said that they was going to give me a free vacation, four day vacation. Im like, I never got that. I never got my coach. I never got my training. And I asked them, can I get my money back? And it was before the 30 days. Before 30 days, I was like, no, Im done. And theyre like, no, that was the last I heard of them. Now, Ive been a year. I have 30 subscribers, but cant do nothing with them.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah. Really. I really do. Thank you very much for thank you. You got glad I made that call.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hello? Yes, hello. Hi.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Bye. Yes. Bye.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Well, because I need a little help. I got into this system with the easiest system ever that was put out and everything, and I was like, okay, it looks good. It sounds pretty good. Its got everything I need, except for one or two things, of which I could take care of that. But I figured I can get my own funnel, I get my own traffic and stuff like that, which I can. I can do that. But the only problem is they gave me the system and then disappeared. So I dont know how I have this stuff. I have an AWeber account. I have a ClickBank account and all this stuff, and Im actually trying to get with those two instead of this one system that I have. They told me that they set up my landing page. They told me they set up everything. Whenever they come in, I have to do the right now, Im flustered. I got too many things going. What is it? The very next thing, once they get in, then you email them the reply, and they didnt set none of it up. I went in there to look at it and see what was going on. And my landing pages, it wasnt there. And I was wondering, after it had been like, three weeks, nothing. And Im like, Wait a minute, that just doesnt make any sense. So I went in there. I somewhat went in because I had not done it. They were supposed to give me a coach, you know what I mean? They didnt. They told me I spent $1,800. And I was like, I figured she was going to get a coach. Well, no, they told me there was another $150. I just spent everything that I had saved up. And I told them that. I says, I had no money. I says, what do you youre not going to teach me? Youre not going to tell me anything about how to build this or how to build that. They sent me a quick five minute or two minute freaking thing on how to do it. And Im like and that was it. The guy, he was high. He was obviously high. He was talking, like, 500 miles an hour and just angry. And then that was the end of it. I was like, whoa. I had to watch it five times just to catch what he said. Thats not good.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Actually, no. Ive been running around trying to take care of business today. I havent been able to sit down in front of my computer like, business since Monday and stuff like that. You know what Im saying?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Or what kind of business are you.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah. Somebody call, and then Id answer it and hang up, and then I call back. Yeah, Ive been trying to play.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im doing okay. Im trying to get a hold of you guys forever.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. As long as I get some direction to go, I can figure it out, you know what I mean? But I was never given a way to go, what to do, you know what I mean?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, that sounds good. I really appreciate it, man. I really do. Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Paying bills and all that. Good stuff, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. Like I said, I learned really quick, so its going to help. As long as I have some kind of information on what to do now, thatll be enough. I got to get a certain steps going. Once I get those steps going, then I know what to do next, you know what I mean? Because itll flow, but I just got to get there for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im trying to get them I got 30 subscribers to do where they teach you how to do what Im doing, which is making money off getting other people to get rich and all that stuff. I just dont want to do it no more. But its to do that, get them to subscribe to one of the four funnels to one of the four things. And actually, I want to change it from what it is to something totally different.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"The reason why I started all this is because I worked and worked and worked all my life. And now I run into a situation where I cant the doctor said, no, Ive got carpal tunnel in my hands, and Im trying waiting on a surgery. And all I could do is punch a button and do a couple of things and use a mouse. You know what I mean? And so I started. This is the only income I got right now. Im frustrated really bad, and I just dont know what to do. They wont let me have my money back. I could go do something else, but I cant because its just like I made a bad decision. I really do think so. I really want to do this. I really feel that if somebody just give me a chance to show me what to do, I could do it. I learned really fast, you know what I mean? Somebodys got to show me. Thats all I need.","metadata":{"fillerID":39,"fillerText":"Yeah","category":"F"}}]