[{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah. Whats my first move?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"WhatS the name of the playlist?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, what it is, is but I thought it was, like a different thing that I looked and it said that people already had to have a business going, products going. I think its zero to 10,000 because Im just looking because really, this AI thing just rolled out. Like, its a lot of people knew about AI. Seen that your publishing thing was, like, from 2020 or 2021. Like, when it was blowing up, Im like, Hold on. But its like the last week or two last week, week and a half, they just rolled out. Like, you see all this advertising on AI. So Im like, okay, this is the thing. Im talking about big stuff. Like, theyre writing books for you. I think they took AI. Made like a big verse on NASAs New York state of mind. New York state of Mind was on his first album, the Nas Ill Manic album. Yeah. Theyre sort of using singers and all those voices. So Im like, yeah, this is something that if people dont learn in the next probably, like, two years, its either you learn how to use AI or AI is just going to use you. So I dont even know any ideas on any products on what to sell. I dont even know the first thing to start. Thats what Im saying.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And I hear that bus fair, right? Yeah, Im not going to have any bus fair until probably tomorrow.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats pretty much what it is.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Man, its sporadic right now. It was because I worked only last year, 2022. I worked like the first two weeks of January and then I was kind of sick. But I had like $10,000 in savings plus the income taxes. So I was able to survive last year in the first two months of this year, january and February, I survived March, April. Last two months, though, its been downhill. I had to turn in my WiFi mount tower, you know what I mean? I dont know, man, thats just what it is. Im on zero right now to these temp services. Get with me for the next couple. I mean, what I got one check coming tomorrow because its a place called Ford that pays you on Wednesdays instead of Thursdays or Fridays. Most people get paid on Fridays, but they pay you on Wednesday. But this check is only a four hour check because I messed around and felt the Dexter utility test. So Im like, oh man, Ive been trying to get it together since last week, but seems like theyre like theyre not no no openings and and the jobs I gotta get, got to be on the bus line.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay. Yeah, man. Yes, sir, definitely. Ill definitely binge this and then probably give you a call, man. Im probably going to be busy for the next like two days, but I dont know what youre doing on Friday. Im pretty sure youre making this money, so youre probably going to chill for the weekend. So I dont know. Probably Friday. Yeah, Friday. If that doesnt work, then I know not I dont call on Saturday, but Ill probably try to call on a Sunday a little later in the day. Not later in the day, but like one, two, because I dont know how these ten working. Theyre up and down. It depends on the season. Yeah, something to really look into, though. But thatd be a good pitch, too, for people. That because theres a lot of people working for temps right now, man. Its like youre working to get hired in, but when youre hired in, remember, theyre still making a little bit profit for, what, 90 days to a year? Because theyre not even paying you the portion. Theyre paying attempt, so you know what I mean? Even when they were paying people $15, the temp was getting, like even some years ago, man, the temp was getting like, $15 as well. You know what I mean? So youre working a job where youre supposed to be starting off 25, 30, and youre only starting off, like, 1517, so that might be a little good pitch. Im not trying to tell you how to do your thing, but yeah, man, its a lot of people, man, youll come across people doing temps, and youre like, man. And sometimes being a temp, man, when you get hired in, you dont even want to work the job that long.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Do this in the beginning? Im saying, can you use thats what I was going to say, can you just use your phone in the beginning?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, thanks.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Do you spell capital?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah. What was your full name again?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Yeah. Where Im currently at. Im currently on zero because Im bouncing temp service to temp service. Im in Michigan, and we bounce temp service to temp service. Primarily, if youre not temp service, 10, 15, 20 temp service, you go there and then they send you to big employees or whatever. Like, theyll send you to somewhere that makes car parts. Theyre getting a piece of what youre making, whatever youre getting. Like, if Im getting 1617, $18 an hour Im getting that, but Im supposed to be getting more. But theyre getting that other cut right? For starting off. If Im getting 18, Im supposed to be getting 22 or $23 an hour, but theyre getting that until I get hired in. Then the wages go up a little bit, but then sometimes like probationary periods and all that because, you know, hired in certain things, they cant just do anything to you. Temporary worker, they can do anything to you, put you anywhere and all that. So we go through so most people where Im at, theyre going through like four or five different tip agencies and then some temp agencies, they want you to have worked like six months already. So for me, after you count bus fare and then you got to buy steel toe boots or slip proof shoes and you got to pay for the company badge out your first check. And then you got other stuff coming up. Its kind of bad right now, man. Really? Settled for less for a while. Yeah, thats what Im looking at now. I probably got to settle for less for like a couple of weeks by working somewhere that I know Im better at, that I worked like twelve years ago.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, let me see real quick. Yeah. So its Captain with a K, correct.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"All right, cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Now.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}}]