[{"pageContent":"Of course. Because its nothing but thats. Intellectual property, what Im giving up.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Youre talking about from the franchise franchise side?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, tomorrow. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, send me some stuff so I can start looking at it, because Im actually at work now, and I got a customer thats walking through the door that I need to take. Hey, how are you doing? So, yes, send it to me in the email, and if you could just do a follow up call and well.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"How much would that be?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"You see what Im saying? So thats why and then you still got to do your build out on the building. You still got to get all the inventory. So youre going to spend a lot of money outside of franchising just to make the building and business go.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"But I would have to invest 3000.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, theres no particular time.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right. And you have to pick the right franchisees because its a marriage, its a partnership. So you want to get people who are going to actually be able to sustain the business. Because if they cant sustain and they fail, that FDD that I told you about earlier, the franchise disclosure document, if they fail, that goes on my record, on my FTD. So when the next franchisee comes in and they looking at my FTD and they see that its been a failed business, itll make it kind of hard for them to want to choose me. So thats why its very important. Like you said, you get the right people and you got to give them all you have because you want them to succeed. More so than even myself.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, weve been in business six years, so we finally just franchise. So we got our FDD maybe two weeks ago. So now we can really start Soliciting to get people to franchise. So thats kind of the space Im in now, really? Not just selling sneakers, Im selling franchises, too.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, Ive already started it. Ive been in business six years, so I have a brick and mortar sneaker store. So what I do is buy, sell, trade, high price sneakers, all prices. Its not just high price, its all price sneakers.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"We already have. Weve been approved a bunch of steps you have to go through in order to become a franchise. But one of the last things that you need is your FDD, which is your franchise. Its like a franchise summary. Its called the editor. But anyhow, once you have the FDD, which is through the federal government, then the franchise company can start Soliciting along with myself. Thats how that works. Okay. You have to hire a franchise company to actually create the paperwork so that you can become an official franchise. And once again, like I said, once you get this final paperwork, which is your FBD, then now you can start Soliciting. So thats the space in there now. So Im wondering, how would that help? How would your program help me either as far as selling sneakers, which Im on Instagram, and weve got almost 20,000 followers, and how would that help me. You know what Im saying?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Hey, Jackson, how are you doing? How can I help you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"No, theyve had more success.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, there is nobody because you know why? Nobody is franchise. Nobody is becoming the franchise or people are franchisees, but theyre not the franchise or and thats the gap where you just dont see people talking about how you become a franchise or how you even franchise your business. How do you get people to buy into your philosophy? Its so much in depth with that you could get into. So if its a lane for it, I just have to figure out how to create the lane. And then before you know it, youre on Ted Talks talking about 500 locations and how you did it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"When you say high ticket, what do you mean?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"AI.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, maybe I dont know how to.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, because you got to think it cost me 50,000 the franchise.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I would have not just made more. What would happen is it would have been a mistake. Six years of mistakes that Ive made. So the mistakes that you make, that hurts you more than money you lose, but it helps you too, because thats the context. Thats what you see coaching. The mistakes that I made and the mistakes that you shouldnt make, the money you can make over and over and over, its the mistakes that hurt you. So I made way more mistakes. Things that I would have known six years ago, I would have never did.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, absolutely not. Absolutely not. So youre absolutely right about that. Its very difficult to be honest with you. Its not easy running that type of business and people think that you can just do it, but its really not that easy. So to me there is an avenue, there is a lane for teaching, which is what we plan on doing at some point. But just understanding the franchise industry, thats a whole nother lane. And franchising is 25,000 and up. So thats a high ticket. Technically a high ticket because now Im not just selling sneakers, Im selling franchises and doing my research. One of the things I realized, and this is what the franchise company told me, your first franchisee is going to come from someone who comes to the store, someone who admires or someone who lives in the state of Georgia, which is where I live. So one of those three, Im guaranteed to get my franchise fee, which like I said, is 25,000. And then they still have to build it out. So technically if its 3000 or better, if Im selling franchises through your company, thats 25,000 that I get up front. You see what Im saying? As long as Im selling, Im not just selling. The company that I hire is also Soliciting also. So its a combination of them and myself. But its really hard selling franchises because for one whos the target art, you dont even know whos the target market. Its got to be somebody who can afford it and its got to be someone who has the money liquid. Because remember, youre in a buy sell trade business. So not only do you have to have liquid cash to pay for your franchise fee, but you also have to have liquid cash to purchase what youre going to need for the store to run.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Dude, 25K almost sounds like cheap for that. That sounds so valuable.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Oh, yeah, but how does that work, though? How does that work?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, Im at work now, so I dont have a chance to look at it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"It varies. These last few months have slowed down, but on a good month we can do 30, 40. On a slow month it might be 510. So it just depends on the month. Like I said, these last few months have been a little slower, so we slowed down tremendously.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So thats easy work. I talk about franchising all the time. Im almost feeling like Im starting to become a specialist. And I tell my team, sounds like you are. I tell my team that all the time. Eventually. Because if you look at the landscape of social media, think about what people are selling on social media right now. Theyre selling education.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its a proven model, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Possibly.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Education. Fitness, food, and traveling. And business. Right. But in business, what businesses are they targeting? When you just talk about business, its going to be real estate. Its going to be buying some sort of educational package in business. Right. And then think about it. Theres nobody talking about franchising in that business space. Really? Nobody on social media talking about franchising.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, from the franchise side, how many new franchisees do I want for this year? My goal is its extreme. I have 500 new franchises opening. I want to do that within the next five years. I want 500 locations. So if I had to go through this year, respectfully, it would have to be three locations. Because they tell you, all the experts that are franchiseors, they all say dont open up too many in one year because itll be overwhelming. So you only want to open up between one and maybe like four. So God willing, we can get at least four open this year.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"You dont want to do more. So many at one time. They just always say its better to just scale slow the first year so you can get your feet wet. You can get an understanding of the business if you have too many franchiseors, franchisees at one time, then you spreading yourself then, and you spreading your organization. Because lets say between now and January 2024, 90 locations. 90 locations is good money, but you know how much work I will have to do. So thats why they say dont scale so fast, slow it down. And then as you get into it, youll start picking up the momentum. And thats how Subway has 49,000 locations. But remember, Subways only started off with one, and then eventually they opened the second, the third, I think by the time they got to twelve is when they started to franchise.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"And so are you guiding them once they franchise it? Are you like, kind of coaching them on how to do this the right.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Dang, you got the market kind of cornered in a way.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"At least $5,000 a month.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]