[{"pageContent":"Hi, is Edwin.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"It varies, but lets say between 18 to month in revenue, Ive got about four clients, and I say about meaning lose one, gain one, lose one, gain two, lose one. Ive got a couple of stable ones, but people are people.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right. So you kind of come in and address the system rather than a specific lead generation platform like just coming in and addressing the Facebook ads or anything like that. Its more from a higher level of the systems that support everything around the marketing as well as the marketing itself.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. These guys that make a lot of money selling leads.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"A couple of things. One of the biggest reasons is when you get them too successful, theyve got a certain tolerance level. Theyre kind of like, oh, were good now. I had a tattoo company here in Las Vegas that had eight or ten tattoo artists. They were right on the Strip, but they werent on the Strip. They were off, but very close to the Strip. And so as the town was growing, there was all these new tattoo artists coming into town, and the competition was getting higher. They came to me going, hey, wed like to run some Facebook ads to kind of tap into digital media and get a little bit modern. We could use some more leads. I said, okay, so it took us about six weeks to kind of really nail it down, like, what worked and what didnt work, right? So we finally got in. Hey, were getting leads, and youre driving traffic to our website, and were getting more leads that way, because I saw the Facebook ad, and they wrote down our name. I was like, great. Fuck. Okay. Awesome. Weeks later, I got a phone call like, hey, guys, we got to stop the ads. Im like, what the fuck? I was like, Called me winning? He goes, oh, yeah. No, weve got so many leads now, and our Facebook page has grown, and our SEO has grown because weve gotten so many good reviews from all the people you drove. We dont need you guys anymore.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, if I was making forty K a month, Im going to tell you I only need ten K to live. What I would do with the other 30K, other than pay taxes, is I want to get into real estate investing. So now if Im funneling 20 to month into investments, that means every year Im putting a quarter million dollars away.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"It could be, theoretically, yes, of course it sounds valuable. Id have to get more into the weeds of just like, okay, how does that work exactly? But yes, of course, I mean, more appointments, higher closing rates, all that is of high value, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. But people come to me and they go, hey, Id like to use TikTok and yeah, me too. Lets figure it out together. Whereas if I can have partners like you or whoever, that can help accelerate that because I dont make just money on my services. I also help them build and manage teams. I dont do everything for them as the fractional CMO. I dont build the website or build the funnel. My job is to go find people and go, hey, Im going to help you assemble a team almost like a general manager of a sports team. I dont coach the team. I build the team and then I manage. Do you see the difference? Like, Im not on the field telling the quarterback play to call. My job is to find the quarterback, to find the players, negotiate those contracts and go, okay, coach, heres the team I bought for you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"My goal is to get somebody whos really big and they like me and they keep me, and then I dont need to have to keep getting clients. But heres my idea. Would I stop the ads? Probably not, because now I could just sell my leads to another agency.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Just one lump sum or monthly?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yes, every deal is a little bit different, but usually its a retainer. So that can go anywhere from 1500 a month to 10,000 a month depending on how many hours Im working and how many people I have to manage. So if its like a dental practice with three clinics, its going to be much more money because I have more people to manage and it requires more of my time depending on the laws of what can be paid or not because there are certain things you cant earn commission or splits on. So then Ill usually take a percentage of the sale in addition to that, which is my incentive because they now see, okay, Edwin is married to the brand. Hes not just providing a service, wiping his hands, going, well I did what I could do and I guess youre fucked. Right? Well if I get 5% on the back end, I can make a lot of money there and thats where I make my money. And theyre like, okay, so youre married to the brand, youre married to the outcome. We like that because youre in it to win it, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. Yeah, 90 minutes. 2 hours. 2 hours. Even if its 2 hours, thats not a lot of time for me to spend to watch a video. So I dont have TV and I watch a lot of videos.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I do.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Not at all.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Like just like a one time deposit.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"So there is a point that it would get too much for me personally. Theres only so many people I can service right myself. But the brands that I work for can service a lot of people, right? So lets say the bookkeeping company, I could bring on 50 to 100 clients in the next year. Theyd be totally fine. The Med tech company, if we figured out how to direct to consumer, we could bring on thousands or tens of thousands of patients into via various practices orthopedic practices. So if I ran a campaign that said, hey, contact your local orthopedist and your local rehab facility to see if they use this technology and ask them if they do, I could generate thousands of leads for these guys. So although Im capped personally, theres only so many companies I can help in a day. The companies that Im helping kind of in a pyramid of a hierarchy of system. I may only get one more client, but that client then needs 5000 clients or 2000 clients and I go, right, guess what? The way I got you is the way I can get you to get people right. Were getting different people. Thats all right.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Im just being real, whether we work together or not. Im just like my philosophy is you just speak your truth. You got to be you. Im not trying to win everybody over because some people dont resonate with who I am or what I say. And some people go, Fuck, yeah, thats the guy I want to hang out with. And I find that if youre just honest with who you are, then youll find the right people in your life.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, because heres the whole that most agencies dont do. They do one or two things really well, right. They run ads really well. But then theres another problem. The salespeople dont really do shit with the leads they get. So like, I thought you were going to boom my business while I gave you all the leads, but then now theres a disconnect where maybe they dont have a CRM or the salespeople dont want to follow up on the leads or the front office is really bad at handling people. Right. There can be a number of things wrong with a company other than we just dont have enough appointments and leads.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Capital wise, probably somewhere between five to ten K monthly, probably another 2500 to five K a month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I could probably take on six to eight right now. Now not everybody lasts forever. So they may use me for a half a year, a year and then go, hey, you know what, weve gotten sales now to a level where we can hire our own CMO or were going to post a director of marketing or were just going to have an agency take over because we now know what you do. You told us all the secrets off, so we dont need you anymore. So typically Ill sign a six year or a six month to a twelve month contract.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, totally.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Right? So you come in and make sure that they kind of shift their perspective on that and actually address those things and not leave them unaddressed and start burning through an agency every 90 days.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats what its about. Do I leave this place a better place because I existed?","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"No, thats fine.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So it buys the time. Im 59 years old. I dont want to have to do what my dad did, which is work until he was 86. My dad literally worked the day before he died because he had to.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Edwin Dearborn.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"My dad made a lot of money. Yeah, my dad made a lot of money in his lifetime. But my dad was very bad with money. Very bad. He could make a lot of it. But when it came to how he invested and what he did with his money, very wasteful, very not wise. So I saw that example, and I was like, okay, thats definitely not I have to break that generational curse not only for me, but I want to break that generational curse for my kids so that I dont pass that on to them, that I leave a legacy for them. And an example of working till youre 86 is awesome. Like, I want to work till Im 86. I dont want to have to work when Im 86. Theres a big difference of loving to work and having to. So with that time bought, I get to spend more time with my kids, and I get to spend more time doing things with my church, my community, giving back, and of course, having fun, going out to the shooting range, having my motorcycle, and doing some long trips or traveling to Ireland, you know what I mean? Also, I want to be able to be able to do some fun things too.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I have my email. You can email me the link. Yes, the zoom link, whatever.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Putting a quarter million dollars away for about ten years and your real estate is growing. Its piece out bitches.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"A couple of things. So I work as a fractional CMO Chief Marketing Officer for a number of brands where I help generate leads for them. So Im interested in how to generate more leads, not only for myself, but using modern methods for my clients. Like, Ive got a bookkeeping client, I work with a med tech company and a couple of others that everybodys looking for. How do we drive more appointments?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right. How we scheduled without you getting that data is kind of interesting, but yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That, and when I pay off my credit card in a couple of months, itll be at 823.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I think about this all the time. Theres a day I die and theres going to be a handful of people that are going to say something at my funeral. What are they going to say? I had a Lambo and some hot chicks.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah. And I love bigger problems. Id like to have some really massive problems.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Look at my calendar.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Its a weird phenomenon where they dont have the grant cardone mind of like, fuck it, lets just keep ten X.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, we see that all the time.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, it is. Ive also had you also get that with doctors where they can only see so many patients, particularly, like a dentist, right? And if the guys selling if hes selling high end dentistry and hes making 2030 $40 a pop, and you got him one more of those a week, and hes making an extra 100 to month, its very easy for them to call me and go, you know what? Edwin paying you the $2,500 a month. We just dont need to do that anymore, right? And you try to reason with them, and you try to use logic, but theres something within certain people where they cant tolerate too much success.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Exactly. And I believe that probably the greatest problem. And weve got so many bad examples in America, starting with the President and Congress. And Im not even talking about Republican or Democrat. Im talking both side of aisles. The way we manage money as a country is disgusting. Financial illiteracy is a major factor in this country of why it doesnt do well. I think it is incumbent upon me as an American, as a father, to really break myself away from societal norms and develop a family legacy to go, the dearborns arent going to be poor anymore. The dearborns are not going to be stupid with money anymore. The dearborns are going to be an example of what one should do in terms of work ethic and how to make and save money so that they can do greater things for society and their family. And most people think of those terms, unfortunately. They think, Im going to get a Lambo and some hot chicks, right? Nothing wrong with a Lambo, nothing wrong with hot chicks. But if thats it, thats it, right? Youre not going to be happy, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ewindearborn at me. M e.com you can send over. We could reschedule for later on and do the call after I watch the case study if you want.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I dont know. I mentioned grant cardone I just handed over to some guy whos already making money. You had $2 million in the bank earning 9% to 12%.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its clear I dont necessarily agree with it. To me, its like, I dont know, Ive never had anybody make me pay for an appointment.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, not married and I dont have a partner. I mean, I have clients that I have partners with, but not like a partner. You know what I mean?","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"785.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Ill probably have it watched in the next 24 to 48 hours.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, Im always up into a great conversation that may lead to a profitable outcome.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I was.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Good, how are you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, because number one, I want more clients. I have clients right now. So Id like to tap into how do I tap into the power of TikTok better? I mean, Ive already got a VA that Im doing some things with and well see how that comes out. But I got targeted by one of your ads probably because Im googling various things that would make me someone to target.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, totally. Okay, cool.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yes. Got it. So two things. Number one, I like volunteering. I like being involved in humanitarian projects. So that when youve got cash flow, you buy time. Right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Why dont you just hire more tattoo artists? Hes like, no, bro, were good. Were making enough money now.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Whatever made the most sense at that point, because obviously I want to make more money. Right. Id have to sit down and just go, okay, hey, first of all, Id like to have that problem. I cant get more clients, but we keep getting you leads. So, Edwin, heres a model we think that might fit your profile and the way you want to live, because you can always look, I could always find marketing agencies or other fractional CMOS going, hey, if I brought you a really big client, would you take them? Sure. Right, okay. Would you put me on the back end of the deal and give me a percentage in perpetuity on the back end? Absolutely. If you brought me a hot lead that was paying me every month a bunch of money, yes, I pay. Okay, good. Right now I dont have to do the rowing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I dont think I need to know how the call will go. I think you obviously have a professional service that can deliver something very valuable to businesses. Right. For me, its just a matter of Ill watch the video because I am interested. Otherwise I wouldnt have continued this conversation. Right, so you said its an hour long, right?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Beautiful.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Oh, good.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Or, Edwin worked his ass off and did some great things for the community, and look at all the people that he helped.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"It would have to be 05:00 P.m.. 05:00 P.m..","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}}]