[{"pageContent":"Okay. Yeah.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay. Ill just slow it down and watch pull. Two and a half hours.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Youve probably seen those ads, like campaign, like those misotellioma ads, billboards. Those are all mainly like, mass torque.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, we want to scale up by a lot more. I mean, this is just where were at.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"We usually have whats called were central. We usually have whats called Big Picture Friday meetings, where we just invite whoever we talk to them. We find, like, amazing. Fridays are usually a great day that works for us. If Friday works, we usually meet at 930 for those meetings. But again, my core team thats what Im talking about. Like, my core team, if theres someone who has something great to offer, we usually invite them to come on Friday to introduce what they could help us out with, if anything, and introduce us a cool concept. If anything, Fridays is ideal, but I could be open minded.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Currently, were averaging anywhere from 20 to right now. Okay.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Okay, cool. Yeah, if you could communicate, that would be great.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Yeah, we do both. It depends on the client that were working with. We do retainers. We also do if a lead comes in, we direct transfer type of a lead. They give us specific orders to focus on, so we just got to make sure it matches, and they give us, like, marketing project.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"If we could get to that point, Ill be really happy.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. Yeah. I dont even know who ryan ODonnell is, but okay, cool. Thats awesome.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Okay, cool. Awesome.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"We get anywhere from 30 to 40 solid appointments that youre looking at. Out of that, 20 of them are really good that we sent for approvals.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, usually most of the time, we only get those appointments if they match everything that were looking for. My job is just really just to verify it, and then if everythings good, then I just explain to them, and if everything makes sense, then we just continue on with this. Sometimes they end up getting not interested all of a sudden, which I understand youre talking about like 80% to 90% of them end up getting closed by the time it comes to us on that case, okay, 40 could go up way higher. And the people that Im talking to, if I was to talk to people and theyre all just 100% quality, thats like ideal in my head.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"We constantly reach out to people DM them. Honestly, we cold call. We email a lot of people in our events. We have people take surveys all the time. We ask them if they have any referrals, if they have any loved ones that havent taken our survey form, the service is free. This is something that they could qualify for. But the reason why law firms want us to get involved with the project is because an average settlement could go anywhere from four to seven figures if qualified. I mean, these are like whats called Mass Tort projects. Are you familiar with that?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"At maddox and all them.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Do you, Caleb Maddox and, like, Russell Brunson in them, or just so Im aware, or is this like, something yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I want to increase the nurturing all the time. Thats why Im like, theyre good, but they could be way better. If the nurturing was done correctly, then we could get a huge result.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I just saw your ad, and I responded to it, and I scheduled a meeting for Friday, I believe, 09:00, Friday night.","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}},{"pageContent":"We just started doing business as medical claim center. Thats our company since 2020, but we used to do business as something else.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, the company has been there since 2013. I got really involved with that specific. Im the operations officer. Its my dads company. Weve been doing this company since 2013.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Sahil? Sahil. Yes. Sahil. Saw.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yes. Thank you so much, Jackson. You have a great day as well.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Are you talking about or are you talking about Legion?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, we could always polish up our company as well. I know if we could get more polished up, we could get more brand recognition. Thats always there.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, cool. Perfect. Awesome. Good.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay. All right, cool.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Like product liability.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Were working on some amazing projects with law firms and we want to get more involved with these projects and we want to see how we could just continue to scale up, maybe increase our clientele as well and increase our projects, but keep focusing on the legal aid aspect of it. Thats all. I mean, I really honestly submitted the form because Im a huge fan of Caleb and Russell and them. Theyre up to great things, but we want to continue to scale up. Im sure you guys have great things. Software.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, Ive only seen him on the internet. Thats pretty cool.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"This is like yours and Calebs operation going mainly. Is this what it is?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Just honestly, there are sometimes we just end up getting a lot of lead rejects, so we had to focus on just replacing a lot of them and sometimes just repeating orders and invoices and things like that. Were not doing it accordingly. Timely basis. So you want to change that up a little bit, if possible.","metadata":{"fillerID":39,"fillerText":"Yeah","category":"F"}},{"pageContent":"Would I be able to get my team on that call just so I could have them ask any questions that they have?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Thats ideal.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. And then the meeting. Are you talking about for this Friday? Is that what technically correct?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah. Is that were expecting in that call? I dont know what that call was scheduled for. Is that for something else?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Is it going to be like a Zoom call or is it going to.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Getting cant control that all the time. Leads not getting what Im saying? Sometimes we dont get responses, which is why we cant control that at all times. But, I mean, it could become quality. Sometimes its not quality, but we want to increase our market so that we could get more quality at the end of the day, obviously.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, cool. Yeah. Thats awesome. Yeah. Those are the type of people I want to work with.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Yeah, we do. We have some appointment setters again, we have them. They could always get sharpened up. Honestly, it feels like bare minimum when I compare it to a lot of the other people that Im talking to a lot of times. But we could always scale that up.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, so then I would have to get them on a conference then. Right. In that case, well, if you could make it Zoom, thatll be because then I could just invite them and then they could just show up directly into that link if possible, because then theyll just work out great. Because my core team is we have members in Canada, and then there is a member in India, and we have some members over here. So we always just end up meeting on Zoom or Google if one of those work. Thatll be ideal. Just so we could just hop on that link.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Okay, cool. Awesome. Nice. Yeah, hes great.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"It could easily get to 100K. Im sure you understand Legion. And it could just go up if you just handle certain things correctly.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"It fluctuates. Sometimes its, like, ten, sometimes its 20. Right now were averaging that past two months.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, Im just saying we just want to increase more automation work as well so that its easier for us. Were kind of working on that where its like where emails just naturally get sent. But I feel like were doing a lot of labor work right now which could easily just get turned into AI, which is why Im like just need to get the right tools in place.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, cool. Absolutely. Get to know you guys more and learn more about this operation and see if it could benefit us with medical claim center. Thats our company, by the way, and if not, medical claim center, if any other operations we can start. Yeah, thats where Im focused on right now. Medical claim center. But Im just curious to just learn.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Youre Ryan, by the way. Is that your name? Ryan? Im so sorry, I kind of like blink when you called me earlier.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"I completely agree. Caleb is amazing. Im sure his team is great. And based off what youre telling me about the Dean Gray asiozi person, the one who worked with Dean Ryan? Yeah. That sounds awesome. The fact worked with him. Cool.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Right. The 09:00 a.m thing. I should just ignore that thing.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, kind of. Sometimes they dont show up, and then.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Its a little bit higher than 50%. Most of the time, they show up somewhere like 70, 75%. Yeah, because terrible. Theyre just constantly grinding, and then you get, like, leads.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its like 50 high, like some 50 something. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, I have his book. Millionaire Success Habits. Hes cool.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Maybe make sure marketing is going nice, making sure our social media posts are increasing their quality value, getting the right teammates on board, things like that. We have a decent I mean, we wanted to scale up our quality and everything.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Jackson. Im so sorry. Jackson. Sorry about that.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"That one video with, like, grand cardone. Ive seen a lot of his videos, actually, growing up. I used to geek out on his videos. He was cool. I mean, him fastball routine. I think he just stopped posting, I think, completely. I dont know if he did a complete different project or something, but he just went, like, mia at one point, right? I dont know, dude.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I just verify it mainly. Once its fully youre talking about a really good lead, then I just talk to them. Right now, Im supposed to be calling, but, I mean, I decided to continue this call with you because I was just fascinated by that. I was just like a Caleb ad. So I just obviously take the time to talk to you, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"How are you doing? Hey, hows it going? I just was looking into you guys.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"It could go anywhere from $50 to, like, $5,000. Depends on the project type.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Correct? Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, Ill make sure my dads there. Hes also a realtor as well, so his time could get busy. But Ill make sure if you just let me know in advance, Ill just ask him and double check it scheduled, man.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Our services available nationwide. We want to generate more leads. We want to serve as much as possible. I just want to get more leads at the end of the day so we could service as much as possible.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, Im not too familiar with I know Caleb Maddoxs video, but thats about it. And I know Russell Brown. I just saw that ad, and we wanted to dive more into AI. And I reach out because her company generates leads, and we want to try getting everything automated and see if we can scale up through that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"930 CST, if you could check that first. Thats available. 09:30 a.m CST. I booked it for nine for this call because I was like, I wanted to see because I just saw Kayla. Im like, anyone hes working with should be amazing. I just happened to book it from that time. But if you have 930 A M CST available, thats like, when we usually have these meetings.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]