[{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"All right. All right.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Its hard to answer. I havent really we havent sat down with our financial advisor yet to discuss that and put that out there and answer that right now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"My main thing is Im just trying to find a side business. Im a teacher, so Im looking at a site. I didnt know how I can utilize AI to do that, so Im just, like I said, doing research and determine what I can do as a side business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Give me a call back at two, maybe 130 and well see if we can spend about 30 minutes or so talking about it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"02:00. Itd be 05:00 for you. Im in Phoenix.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Oh, yeah, potentially. Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Go in a couple of years.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Well, I mean, as low as $5,000 a month is enough for us to start something and then building up to what you just said there, that would be amazing. And then wed be able to leverage that and actually save or put our money in tangible assets that would create a family wealth that we need. Right. My fathers on hospice, so the nurses came, so I need to go spend time with them.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Appreciate it. Thanks. Bye.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I have Roth IRA. So right now we make so much money that I cant put more money into Roth IRA. Right now, Roth IRAs are useless to us. Now theres other investment things whether thats a whole life policy. Well, we dont have the money to go into a whole life policy where we can utilize the cash value to invest in properties because Id rather be doing something tangibles than dealing with the stock market. Id rather have something that gains compound interest in a whole life policy as well as I can borrow from that whole life policy. And whether take a loan from that to pay off boys college or fix our home, invest another property, whatever it might be, but we just dont have the money to do that. So I need second stream of money so we can create those investment streams right. Versus borrowing from the bank. And right now its not really easy to borrow from the bank.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"To be honest, I really have any idea what that would look like.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Correct?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"We have two, and one more on his way.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"All right, well, maybe give me a call around. Youre in Oklahoma.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im almost 50. So I have ten years to utilize and leverage money so my wife can retire and I retire. And we have to have an income stream, whether thats property or something that allows us to not work into our seventy s. The retirement age is only going to increase. Our government is not going to be able to pay out the Social Security, and its already increased. So its probably going to increase the 70 by the time Im able to retire. So I dont want to depend on the government. Id rather be able to make appropriate investments so we control that, not the government.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, that means Im probably working into my seventy s, and I dont want to do that.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Absolutely. Bye.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I havent checked.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"You said you sent an email to me. Can I review that? I dont know what you provide. I understand that you guys sounds like a consulting or education thing using the AI. I dont know what you guys provide, and I assuming theres a cost of this, so Im just trying to what you guys provide?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Well, thats the thing, I dont have a business. So I came across it and I was looking at it, and then its like later on I was like, oh, wait, I dont have anything attached to this that I can use.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I havent.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, its just more continue to utilize that money for family as well as additional investments, whether that means property, whether that means just necessities. My wife and I both work. We have good paying jobs, but its still with our boys education and whatnot all of our money is going to that and we cant save. So it also comes down to retirement.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, thats it. We are pretty strapped, so we make too much that we cant deduct things nor invest into basic investment plans. And so Im looking at different ways that I can do that. And based on our income level, we dont have the money to continue to invest in those things. So Im trying to see if I can leverage your money a different way.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Its just me doing more information search afterwards. Like, oh, crap, Im not ready to do I mean, I dont know what to utilize with this just yet.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Nothing comes to mind, to be honest with you.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Im probably a waste call.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yeah, again, Im so new, I really dont know. I dont know because Id like to affiliate marketing how I use that. Im still in the research mode process works.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"I see BJ.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Im just searching right now what business that might be. So I have no clue what niche Im looking at.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]