[{"pageContent":"Yeah. Ive even seen seven and eight year olds being online telling people that theyre available to date.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"And so the it just opened a whole lot of, like, questions for me as to our kids really being protected in their communities, in their homes, whatever. Parents are doing the best that they can with what they know. Right. As I got to asking questions in my community, can someone do something? Can someone bring awareness about this or whatever? Nobody wanted to do anything, so thats where it started for me as to making a business out of it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im good, thanks. How are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay. Thank you. Bye bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, it started out being I had some health problems, health issues when I was a kid. I got really sick when I was like two, and it was requested that I have a surgery to correct something with my bladder, and so they went in and fixed it. But by the age of 14, basically, that surgery had failed. And so I had been living in this condition from the age of 14 to the age of 50 something. And I had been in and out of doctors offices, in emergency rooms or whatnot, and no doctor would even tell me what was going on with me until last year when I went to a new doctor and they did this scan and test on me and they told me what had happened. And then I had to go in and literally have a whole thing of pee drained out of me. So this last year was like the first year Ive actually been healthy in so many years. So I have not really been able to hold a job over these last so many years other than doing volunteer work and such. But then five years ago, I actually became a nonprofit, but then no one really wanted to help me with this, so its just been me. So theres been a lot of different angles to it, but income wise, thats why its not up and going like it should be, because all these things that Im needing to really get it up and going and whatever, it takes people and it takes money, and Im doing the best I can with what I got. And I have a message to share, right. But I am smart enough to know Im just not going to go out there and share my message without having someone really work with me into getting it executed to being what its supposed to be. Right? And I hire a coach to help me do that. Like $5,000. Ive been talking to a lady that runs part of a John Natural program and I talked to her for ten years, and yet she still hasnt even worked with me trying to get me into that program. Ive had my challenges, for sure, but Im not stopping. Im not slowing down. Im doing a little bit each day to getting me there.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Ive been trying to get it together for 20 years.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, I live in Austin, Texas, and kids are literally being exploited online and getting lowered into situations where theyre being sexually assaulted.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"All right? Thank you so much.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Nobody was doing anything about it. I found some land that Im working toward finding a way to get the funds for everything. And I basically want to do retreats for mothers and daughters and have do the coaching online and in person and doing different things, different times of the year maybe its like doing it on self esteem. Some other subjects, like during the summer months and during the winter we do courses on courses that people arent teaching the kids anymore. They give them like a hand up and having these things in toolbox when they are ready to go out and get a job. Theyll have a lot more education than expected. Creative, creative output, how would you say that? More, more creativity and all the record building to become as great citizens of our world today.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, its a coaching business and I wanted to coach daughters and mothers on personal development and keeping their bond together, et cetera, and just keeping the teenager or the young girl educated enough to standing strong for herself through her school years and not falling for all this social media nonsense thats going on.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"How are you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"That child is going through these things and she may or may not be telling her family anything of what shes going through or dealing with or whatever. Right. And the family knows somethings going on, but they dont know exactly what. And that can cause these total blowouts of families and stuff. A lot of times it just doesnt even get addressed or whatever. The parents are like, oh, well, youre 17 or 18, youre out the door.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Just you I was just interested in knowing more about it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I can check. Hold on.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"So Im just trying to help families not have to deal with that or how to do life a different, better way.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Right. Wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Right, yeah.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"What was the first one?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Right. Well, without having a job, I had to go into being on the government aid program, disability and stuff. They just really just want to down you and knock you down to which youre almost nothing for them to say that they can support you. I had to live on that. And some of these places that they have you live, theyre not like the best by any means. I am thankful that I had a roof over my head, but at the same time, like, the last place I lived in had sex trafficking and human trafficking going on.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"But I had some situations happen to myself in my school years or whatever, and I never knew that it could happen to other people. And so as I got older I dont like to say that Im old or anything, but when I was going to school, we didnt have computers to this magnitude of cell phones and all that. And so this is a whole new field for a lot of people that dont understand whats going on. But as Im myself trying to get older, growing up, getting older and stuff, about ten years ago, I got my first smartphone and somebody suggested to me to put an app on my phone and theyre like, oh yeah, its a lot of fun. You can go on this app and see a lot of things and meet a lot of new people and whatever. And I didnt really think anything of it. I just put the app on my phone and kind of started looking around and it was pretty fun at first because I could see like, the state of Florida, disney World and the London Bridge, and then I can stuff all over the country, all over the world, basically. But then I started seeing all these kids on this app too. And not only were kids on this app, but they were just offered. Offered is not the correct word, but the app basically was where people can go and meet people online and talk to strangers. These kids were going online and talking with people that they dont even know who they are, and sometimes they were in their homes and sometimes they were at school, but there were so many different times in those conversations that kids were telling the people where they lived. Older teenagers were telling them how many people about their personal lives, which they had no business sharing to begin with, sort of like grooming kind of stuff. And so one time I found this girl on this app and she lived 40 minutes from where I live, and by clicking on her profile, I was able to click on the link and it basically told me the locations where she was at. And I found the school where she was going to. I quickly just Googled the school and found a phone number. And I called the school to tell the principal, hey, one of your students is talking inappropriately to two men in a classroom right now. And so in a conversation in the hallway, he says to the girl, hey, someone called the school about you. Maybe you shouldnt be on that app. So she stayed off of it for like two days, but then she went right back onto it. So when I called the school back to say, hey, look, shes back on this app or whatever, they basically said to me, well, they talked to the parents before about her Internet usage. Were just not going to get involved this time.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"And so I want to get out in front of all that and teach them about Internet safety and stuff like that. Keeping them educated on the positive road.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]