[{"pageContent":"Yeah, and I got a message scheduling a call for Wednesday at 05:00 p.m.. But I didnt respond to it yet, so so all good. And I think I got I got another call from someone I didnt recognize yesterday. Its from California, though. This is from Indiana, so I dont know if it was the same, but anyway, I dont have a lot of time right now, but the message that I got said it would only take about four minutes. Is that right?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Ive been living cash in hand for 13 years, so I dont have a W two form 1099. I havent paid taxes in nine years because I dont owe anything. Ive been making basically under 12,000 a year.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Okay. All right, that sounds great. Yeah. And just if I were to get started with you guys, what am I going to need to cough up?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I have no idea what my credit score is. Ive lived without a credit card, bank account, debit card, or PayPal account for ten years. Ive been completely off grid on this Christine island in the Gulf of Thailand, and I have no clue what my credit score is.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, it was just a YouTube ad that I responded to. It just seemed interesting. And Im definitely looking for I said, we dont have much time, and if I answer your question fully, Ill be the one that holds the mic for 30 minutes. But I was recently deported from my home of nine years in Copenhagen, Thailand. Beautiful magical island on the east coast of Thailand. And yeah, the deportation, its a long story to go into. I wont bore you with all that. I did nothing wrong. But I had a long standing issue with immigration for nine years, and I tried to take them to civil court about it, to criminal court. When they didnt answer the civil court case through the chief of time, immigration and the judge on the civil court case as criminals for not, they just refused to answer because I incriminated their officers and they didnt want to lose face. So then opened a third case in administrative court, and they just didnt answer any of them because it incriminated their officers and made them look bad. And they would have to the Farang foreigners in Thai, its like the Farang are there to give the kingdom money, not the kingdom give them money. So they didnt want to be held accountable for their mistakes and wrongdoings. During my last entry into the kingdom and after the criminal court case, they went looking for me. They were like, whos this guy trying to sue our chief? We want to talk to this guy. Eventually they found me. Im not sure how I heard that. I was grasped out that somebody ratted me out. But anyway, I spent ten days in three different prisons, three days in the Copenang prison, eight days in the Balput prison in the neighboring island of Kosamui, and then luckily, only 5 hours in the IDC, the immigration detention center in Bangkok, and then was deported and got a lifelong black stamp. Im never allowed to return to my home of nine years. Luckily, I crashed, landed here wearing my flip flops and the clothes on my back that Ive been wearing in three different detention centers over the past ten days and arrived in the dead of Texas winter. And luckily my family took me in and theyve been really wonderful. But essentially I arrived here homeless, jobless, transportationless, and penniless. And its time for me to start a new life and to make a new life for myself. And I want to set up multiple streams of income, but I got to start somewhere, and Ive been looking at a lot of different things right now, so Im just shopping around for opportunities at the moment.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, for the past nine years on Copenang, I did what I called Jedi training. And I just called it that because Jedi is a nickname that I was given while I was on Copenang. And Ive never found another four letter word that so accurately encapsulates really kind of what Im all about. So the Jedi training is I start with children as early as age three, and my oldest Pedawan right now is 19, and Ive been working with him for twelve years. Yeah, its basically the Jedi training encapsulates metaphysical teachings with geography, with geology, with astronomy, with astrology, with Taoist philosophy, with martial arts training. Ive been a martial artist my whole life. Ive gotten high rank in eight disciplines over the course of 38 years. Now I basically work with children, but its a very unique niche. But in Copenhagen it was very extremely popular and I mean, nobody Ive never met another person on planet Earth who makes a living the way I have. And what Ive created is completely unique. So when it comes to coaching business, its kind of like more oriented towards children or adults. I expanded to do adult Jedi training workshops three days, five days, seven days and twelve days. Because a lot of the parents, the kids, would come home and show them what they learned and theyd come back to me for next class and be like, can you teach me how to do that? Because I cant do what my three year old just showed me. When you ask about coaching, thats not the only thing that I do, but when it comes to coaching, thats kind of what Ive done. I can do a lot of things. A lot of things. So Im just here now. Ive only been here for just over three and a half months today and just trying to get my feet again and just would prefer to do what I love and do what motivates me to get out of bed in the morning and all of that. Thats kind of the best answer to your question I can give you.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. I was about to say Im still possibly open, but if its thirty k just to invest and get started. I know it takes money to make money, but thats completely impossible right now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I dont think its probably not so bad, but if I havent done anything in the system for ten years, I dont know I dont know how that works.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay. No, I mean, thats fine. I do have probably more than four minutes. Im just with my family and theyre about to barbecue.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thats right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I wasnt expecting this, but if its not too much time its fine.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Great rest of your day. Okay. All right. You too. Thanks so much.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Still interested if you want to send me stuff, Im still interested in checking it out and hope it brings eternal.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, now thats completely out of my ballpark right now.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Oh, its good, Tony. How are you doing?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]