[{"pageContent":"I havent looked at my emails yet.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, its not published yet. Im publishing it now.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Basically. Thats where Im at at the moment. I mean, the book isnt published yet, but its in the process, and I dont have a website set up yet for that business. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"All right, buddy.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I just saw a quick commercial, and I know that its going to be the wave of the future, so I want to get in on it as quickly as possible.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, but Ive got money allocated towards it. Looking at the returns that you guys are delivering, its great. What is the pricing model?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Ive got a couple of businesses. So I have a junk hauling business in Las Vegas, and I also have a coaching business that Im going to be starting for sales.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And I want to start putting together videos that go into neuro linguistic programming and different techniques.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"28 resorts and about ten developers here.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Its a brand new business.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Its an extremely expensive business. The big retailers like Marriott, theyre probably spending about $1,400 per tour per guest. But what theyre gaining off of that on average, Marriott, Id say theyre probably at a $3,000 volume per guest. So youre taking the actual sale and dividing it by the number of guests, and thats giving you a volume per guest. Basically, its two to three times what theyre spending in marketing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It sounds great. Okay, so youre sending over the video as well?","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Well, definitely huge social media campaigns. I mean, thats the way everybodys growing businesses today. And of course, Google.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I have a process in place. Basically right now Im going to contract with developers so companies like Marriott, Hilton, Wyndham, and provide my services. Thats where Im going to be promoting the book a lot, amazon.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Its worldwide.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So those are going to be nice potential corporate contracts. However, I want to also hit the consumer base, people that arent even in the industry.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, it gets really hot in the summers. It gets up to 115.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Okay, perfect.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, actually our presentation is face to face, and we actually pioneered something here in Las Vegas that no developer has ever done since because theyre afraid of it. We actually videotaped our presentations and went through 120 point questionnaire on every single presentation on two presentations a month with agents. I mean, Im a sales manager now. Ive been a sales manager for twelve years. But it really gets into where the client was sold and the dominant buying motive and what the objectional challenges were and how they were covered using the process. So its down to a science, and once you get it, its not complex at all. And theres the element of the it factor where its something that you cant teach, its personality, its developing rapport with your guests and really getting into them emotionally.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So right now, its just basically youre qualifying where Im at and what I want to do with it. I mean, the ultimate goal, of course, is to be over a quarter of a million dollars a month in revenue.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sure. Now, looking at the AI tools that you guys offer, you dont have any type of a pricing model?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right, where are you located?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Its a brand new business and I dont have those stats. My personal closing percentage is a combination between frontline and in house is 44%.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I havent seen your pricing list yet.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I mean, I just want to grow the business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Of course Id like to have knowledge is power. So Ive got to look at the video and like you said, jot down notes and figure out whats going to appeal to my program most.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Is it from Christian, the AI guy?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I havent received it.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Course.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Sure. I mean, thatll come later.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Sure. Tuesday Im available after 02:00.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay, I got the case study and the link.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Did it come from Matthew? Iglesius.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Our industry standard is three times, three presentations is when people make a purchase.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I actually like being the star of the show. I started self producing a reality TV show based on timeshare called Big Fish Vegas. We got a magazine cover a couple of years ago, but the pandemic kind of put a halt to that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Its an intangible sale. I mean, youre selling air, basically, and its all based on emotion, and its based on Im a big fan of Tony Robbins. Ive got five certifications in Neuro Linguistic Programming, hypnotherapy, and psychotherapy. But I dont practice as a profession. I utilize it to influence the subconscious mind and get sales.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, yeah, I mean, you develop emotional desire and then they justify with logic. Its an industry thats riddled with a lot of challenges. Over the last 35, 40 years, the industry has gotten a pretty bad rap, and its definitely an additional challenge to the sale. However, it can be overcome. Basically. I dont just want to market to the Timeshare industry, though, because these are tools that can be used in car sales and insurance sales. Its relationship selling. Its based on emotion. And everyone buys off of emotion off of the midbrain and then justifies with the cerebral cortex. But its keeping them in that midbrain. Its keeping them in that childhood mentality where theyre sold.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Technically, I havent started that portion of it yet. I wrote a book that Im getting published right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I had kind of an interesting thing happen. Ive been in the timeshare business 19 years at the top 2% of every developer Ive ever worked for, and Ive created a lot of their structural campaigns for sales strategy and coaching. And its an industry where theres going to be some changes here pretty quickly, and I wanted to branch out and provide my services to the masses. Its nice making a six figure income, but its not enough. I want more.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im well. How are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"50,000.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yeah, I used to live in Steamboat Springs.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. Did you want to get something? I want to make sure Im getting the right one because Ive looked at a lot of different AI companies right now.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I was 18 years old and right out of high school, and I saw an ad in the newspaper that make 70 to 150,000 a year in 2003.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Originally they had called it a tour guide, and I didnt know anything about the industry. I mean, Id use timeshare with my parents, but didnt know anything about the industry. And the first three months I actually fell on my face. I didnt sell much at all. And it wasnt until I took it seriously, got my real estate license and then my brokerage license, and really looked at the I mean, Ive done every training course you could imagine from Zig Ziggler to Brian Tracy, all these different old school guys, and of Tony Robbins and a lot of neuro linguistic programming training. So it was a summer job that turned into a 19 year adventure, what I always say.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im exploring a couple of different options with this.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Ive skied too, but I like snowboarding better.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"The AI technology, I mean, does it provide all the updates, or am I going to have to hire a software engineer to change things every couple of months?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay, awesome. Thank you, Rick.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im going to watch it right when we get off the phone.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Whats similar to skateboarding and surfing? So I grew up in California and did a lot of that as a kid, which made it a little easier to become attuned on the mountain.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"14 years.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Sure. Well, its not published yet, but its 90 pages for your 90 minutes.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No other people could use it, but it is geared towards the timeshare business. I mean, it goes through the standard 15 steps of the sale in that business. It goes into closing on portions of the sales process. The book is only 90 pages. Its called 90 Pages for your 90 Minutes.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay. Yeah, thats where Im at too. So Im just looking at a few different options. Good morning. Its just going to be a matter of ROI, and its going to be a matter of actually, the ease of use as well because Im not a computer programmer or anything like that. You know what I mean? Sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"You just sent me an email.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I was born in San Diego, but I grew up in Inland on ranch of Cucumonga and then Malibu too.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay, so 303-619-6606, correct.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im just waiting for it to load.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"ThatS on an individual basis presenting a product thats not this new product. So Im really in the dark when it comes to that right now.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"And, Rick, whats the best phone number for you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I havent. Not yet.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Las Vegas, Nevada.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Of course.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Well, many salespeople can use a lot of the techniques. I mean, basically, its going to be based around the timeshare industry, because thats what I know, and its a huge industry. I mean, they do $11 billion a year in revenue. Its the 9th largest business in the US.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Can send it to me while were still on the phone. I just want to confirm that I get it because I dont want to be unprepared.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"740.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I mean, looking at it, Ive looked very briefly as well at Otis. Do you know anything about them?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"All right, you, too. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I snowboarded a little bit.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]