[{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, actually, my company is called Idea Man collective business consultants and strategists. And basically what I do is I get entrepreneurs and people that business. I get them fundable. I show them how to get the business fundable. And I also do some of the deals, partner with some of them, do some of the deals. Like, I teach them how to buy real estate. I teach them how to buy real estate using credit cards. Thats kind of what Im known for. I actually bought ten houses using credit cards.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Youre talking about what I do. Thats what I do. I get people fundable and by showing them what they have to do. LLC corporation. Thats your bid.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, we can talk.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. Yeah.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, but I had a business model, but I didnt actually go after doing the business because I wound up getting sick. I was in the hospital at one point. I owned 101 houses here in Las Vegas. Like I said, I bought houses using a credit card. I had a really high FICO score, 840. And American Express gave me invitation to a black card, and I pulled a $250,000 cash advance. And they got some houses and got them sold in 40 days and gave them their money, and I pocketed $400,000 cash.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"I want to do something like start off making about 100 grand a month. I know. I did it before. And thats the thing. I made 100 grand a month for six months. Sure, I know what that feels like. But the thing I just have to ask some health challenges. Thats why Im kind of just getting back into it. I have some health challenges. I had COVID three times, and I had a heart surgery.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"About $1,000. My sister passed away last year, and they didnt have a funeral. They couldnt have a sense of gan. And I was the one who had to pay for it because all of our parents have passed away. But shes my older sister, she was like 80 years old. So everybody looked at me, you got money. Okay. In my family, Im like the rich uncle. I just pay $15,000 for his funeral stuff.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Thank you. I got that and it began to report it. I figured out a strategy. I only use that card to pay my rent because I was telling, everything you do, you want to use on the credit card and pay the credit card off with a debit card.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, this is the thing. No, like I said what I was doing because I did pretty well when I bought stock before I had to cash out something to pay my bills off. But Im looking at some stock things that I know about that can make money. And thats the thing. I got a couple of friends that we actually got, a little group, and we do some stuff. Right now were looking to buy. Were going to buy some Tesla stock because it dropped. Tesla right now is at 200 or something. So thats now the time to buy. Why its low? Id say in a couple of weeks. Like I said, I should be back in pocket because once I get some business credit card, Im good to go. So I know how to get high limits on credit cards because I actually show people how to do it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, normally, word of mouth, but this is the thing. A lot of law firms I have a contract with a lot of law firms, and I do my service for them, but I do it for them wholesale, and then they charge the big. But, like, for example, the law firm does the stuff. They charge the client 15,000, and they pay me wholesale price. They pay me, like, 5500, $600. And they still making money. I did the work.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Think about five. I just got back into it, so Im just not getting clients right now. Im getting a lot of Hispanic clients, and I somewhat speak Spanish. And basically they want businesses, and I get their business congruent to refundable.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hey, my pleasure also.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, Ill be 72 years old the 25th of this month.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Just before you can answer that, I.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"What? Over 20 plus years.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"I dont look my age. I used to go to the gym every day, and like I said, I was a DEA agent. I got injured, and then I got out of that, and I was a bodyguard for a guy named Larry Flint. And then when I started getting into business, I went to law school. I have a law degree, and I also have an MBA in finance, and I got a doctorate in the, obviously.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, it does sound good. Okay, I appreciate that. Yes.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"They kept me in bed so long, my legs atrophy. I had no feeling in my feet and in my calves. Im just not getting feeling. I think you called me before. I was actually in the middle of having a physical therapy session.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"What was it? Its like 603. One was 603, one was 596, one was 580. And like I said, I know what to do to raise my FICO. So Im actually doing it right now considering I didnt have a FICO score because it had been over seven years and I didnt use my FICO score, and I had no FICO score. So what I did was I went and got a secured card from Navy Federal because I think I was having a Marine Corps, and I got a secured credit card for $1,000.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats the thing where Im at now. At the most, Id say in three weeks, my credit score should be in the 7th. It should be in the mid 7th. So I was just looking at it. I know that Im doing all the right things because like I said, I do this for people, but its different when youre doing it for yourself.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I have 1000, but I actually set it aside because the group that Im dealing with, the group, were going to take $1,000, and were going to buy some Tesla stock because the price is going down. So that was the purpose, and I committed to it. And I was like, I have other money coming in. Like I said, I just have to wait for it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its okay. Like I said, Im working on it right now. I just saw the day that it would make up. Ill just tell you a quick story. I was married to somebody in 2006. The marriage lasted for all the eight weeks, okay? And when the person left, because the market went down, they had some of my credit cards, and they made a large bill. It took me two years to pay it off. Okay. And so my credit score dropped from 840 to the four. Now Im back on the way up now. I checked on it today, and probably by in the next two weeks, I think in the next two weeks, I should be back in the 700 because.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes. Okay. Yes.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"But if you want, we can continue the conversation and probably maybe in about two or three weeks, because like I said, I should be up there. But what I do is Im going to go out and Ive already solved by getting business credit and stuff like that. I have some sources. Thats what I do. I get business credit by getting them, like I said, their business. And thats what Im doing now. My LLC, because I had another company, so I started another company, idea man is the company Im starting. Im going to put it under LLC. Im also going to have a trustee that controls it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right, take care. God bless. Bye.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yeah, I already gave my word. See, thats the thing. And I got to keep my word. If Im going to do it, I do it. Got you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}}]