[{"pageContent":"Yeah. Hold on, maybe I can get you let me take you off a speaker. Is that any better?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I invent it. Its probably been around for about 15 years. It started in Europe. Were in business nine years already, so every year its becoming more and more popular. However, its not the type of thing that you put a sign outside your business and people are going to walk by and walk in. Its not the type of business guys are going to go and tell all their friends about. We have a 100% customer satisfaction rate, but our problem is get clients. If I get them to fill out a form on our website or to call, Im able to close the deal. But the turnover, getting them is really the tough one.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, no, weve never been able to get the leads up to that point yet.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Trying to get right? Its been years, but thats not my my strong point. My strong point is is taking care of the clients and and writing the business and doing that. So my challenge has been finding finding a source that can work on getting those clients to me so that I can accommodate them.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, I got it.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I would just tell you off the bat, its so skeptical. I feel like Ive heard these pitches a thousand times. So at the risk of being cynical.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Just getting a client. Like, guys that we get, they do their research, they find us on the web, they call us, they come in for a consult, and I book them, but Im only getting a call or a month. Its crazy. Obviously we can be doing a lot more clients than were doing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I have no idea what youre hearing. Ive got no banging going on over here.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah. So Ill be honest with you. Ive dealt with so many companies before. A lot of you guys are like, oh, yeah, great. Yeah, this is a cool business. Well, we got it. They have no idea what theyre doing. They have no idea what my business is, and they do absolutely nothing. So straight up, dont waste my time. And I dont want to waste your time. If you can get me leads, Ill talk if you cant. And I understand this is not your typical business. I dont want to waste the time.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"I just took you off a speaker. I dont know what that was.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"I believe so. Yeah. I certainly believe so.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im great. How are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"It says Tylernarducci.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, but like I said, Im not looking to do that. Thank you very much, though.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont know. Its all about the drive and the conversions. I mean, if I could get them in, I could be doing that next month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"We should comfortably be at 30 a month.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hi. Whos this?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, good.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No, but I got to be honest, Im not looking to invest in anything right now. Ive got my own business. So if you guys are looking for an investment to go forward with what youre selling, I would not be a candidate.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Lets see. Hold on. You requested this info now maybe thats not you. Hold on.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right now were doing probably about 8000 a month.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure. So I have my own business. Its a hair replication business. So what it is is its called scalp micropigmentation. So its for men and women, but mainly for men who are losing their hair, and its quickly overtaking transplants. Its a procedure where we put micro dots of pigment into the scalp to replicate hair follicles. So for guys who are willing to shave their head or who are already shaving their head, were able to give the appearance of a full head of shaved hair. For guys who have hair thats thinning, we put these microducts of pigment in the scalp and it gives the appearance of more hair than they have.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right. Its nondimensional. So its non surgical, its permanent, its natural, and its a fraction of the cost of transplants. 90% of clients that we do have already had transplants that theyre not happy with, and were also able to correct the transplant scars that they already have.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Let me check. From Tyler.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, lets just see.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Id say number one. I love what I do. I love what I do. Im good at it, but Im nowhere near the capacity that I want my.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}}]