[{"pageContent":"Yeah, I am. 500k arr. When we are an AI platform that handles basically if youre a restaurant or any kind of home service or anyone that gets too many calls while youre working, basically our AI takes care of all of your answers, the call for you, it can book appointments, it can drive food orders, it can do a ton of other stuff. So thats the other company, and were driving leads into that company through TikTok and LinkedIn and Meta for Johns Power washing company to sign up and use our AI personal assistant to be able to handle their customers when theyre on a job.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ive been working in this industry for almost 20 years and so this business has kind of been something more passive where people come to me for consulting or through references and I need to funnel thing. So its been around technically for I guess three or four years. But I havent really doubled down on focusing on acquiring clients because they kind of just come naturally.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Let me see. I dont have anything.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hi.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Fly flat.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"So I built out this new business model that were trying, which is essentially building a micro agency internally there and utilizing the platforms for distribution.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All Right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Were not even booking appointments for the agency because they just come in on their own, so were not doing sales calls or anything like that.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I See.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"More than I should.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, not an issue.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes and no. I mean, we kind of just get referrals as they come through, and then well activate them if its a good enough potential client. I do have people in place that can take appointments and convert clients and things like that. We just havent been doing it. So its there. We would just need to activate it. The Inside TV portion functions in exactly the same way, so I think theres probably opportunity to use it for that as well.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, got it.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Yeah, exactly.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Just take it. Okay, cool. Nice.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Doing.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right, you too.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. All right. Yeah.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay. All right.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, I would say good Call is probably taking off the fastest. Ive driven around 25,000 active users in the past ten months and so thats taking off the fastest, but looking to drive higher value prospects into that company. So small, medium businesses that are I dont know where youre located, but like a Gold Gym type of client or like a permanent sandwich, I dont know where you were, but smaller businesses with like, ten to 20 locations looking to drive higher. There the platform serve, and its super cheap. Thats been growing really fast. And then fly flat is as well. But this is the first time that were focused on paid media because everything that has been booked through Fly Flat has been word of mouth through C execs, sharing with one another. Nice. So those two are probably the heaviest in terms of how quickly theyre growing. And then Inside TV is definitely a priority because we do have a goal for this year and we want to pick up the potential to get to that goal.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im happy for you to reach out next week, and we can schedule within a 48 hours window, but Im not going to be able to do that in the next 48 hours.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, that would be good. Im available more so in the evening. Those two days. Im not available next week. Friday.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"My wifes from here.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I think 2 hours is a little long. I might not get to the whole thing, but Ill take a look at it. Im more kind of interested in I saw that the AI and automated appointment and sales booking, thats kind of more what I was interested in because all four companies need that service. Okay. So thats what I was more kind of interested in.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Oh, okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, fly and then flat. Flat.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay, great.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"It doesnt mean were going to throw all the money in the world up.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So I have a couple of different businesses. Lets see. Im interested in this in a few different ways. One business is called Fly Flat. And are you familiar with the points guy?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Far as yeah, were running paid media ads for brands and creating custom content.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Youre targeting like self starters and smaller.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I mean were an entertainment network on producing shows for Apple TV. Its not an individual salary. We have multimillion dollar budgets just on individual TV shows that we produce.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, sounds good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Not able to do either of those. I have housework being done on my house all day tomorrow and Saturday time with the kids, so I wouldnt have to be in your 48 hours window.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay. All right.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay. All right.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, I think wed be interested in that. I think Im more interested in applying it to Insight TV because its more relevant there because theres more dollars there to grow.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay, that sounds good.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay. All right.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, I have a toddler and a wife, so I work oh, my goodness.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, were not quite there yet on the appointment and lead capture section. Its more about like, for example, we have a massive hair salon client that uses us and they will book appointments that way. But its a lot less like lead qualification, more just kind of transactional appointments or like, what are your hours? Or can you send me order food? Or its more on everyday usage rather than full on lead qualification and appointment.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"For a solution to some stuff, which.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thats not applicable to us because were a fully VC backed funded company.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im from San Francisco originally, but I actually live in Pittsburgh, PA.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, Id be interested in chatting with them.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Youre going to be honest. I dont know. Ive heard of it, but I know.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"By the way, this is rolled out of Google.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont think Im quite there yet, but looking in the one to 2 million range for me personally per year, probably. But really I get a decent portion of the fly flat revenue as well as the agency revenue, and then I have significant stock in the Good Call company, so I have impact across all of that. But really, I think Fly Flat is really easy to drive. Theres a lot of interest there. People want those discounted last minute flights. Its just a matter of nailing down the comms to be able to drive some of these higher net worth travelers in quicker and more efficiently. Yeah. And then I think, good call the AI. Company will. Scale will reach its AR anyways. But if I can do it quicker, then thats better.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I know.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, I have virtual assistants. I have one of the heads of sales for Econ, for Twitter. I have another digital salesperson. So theres like a place for that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I mean, its more of like a knife to have, whereas those three are more important because theres more revenue potential there and theres More and Theres Investors Involved and Things Like that.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Thats how that was built. Im the global director of Digital for that company.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I have some employees that I catch up with and things like that but its more like word of mouth. People need help with things that they know that I can do.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"The company is entirely just from the Netherlands.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, we have some that weve made. We just havent launched them. We havent done any of that. We have a landing page and all that stuff built. We have automations and go high level and all that stuff created. We just havent activated it because there just hasnt been a need to. And I think were interested in doing it to see how that goes and seeing if we can turn it into a normal, functioning business, because right now its all just word of mouth and people coming in, and then we decide if we want to take the project or not.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. All right.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"That just a glow in the dark agency email.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, just a couple of minutes. Yeah, I dont have anything.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. So I. Try and get a good batch of work done in the morning and then take a break during the day and then work again at night. Okay. Yeah, but a text with some availability or something like that on Monday anytime, would be perfect.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"All right, cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"About anywhere from ten to 30K MRR, just depending on what I have going on in addition to everything else Im.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay. All right, great.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So its kind of running on its own without any growth tactics, but were staying at that. Anywhere from ten to 30K recurring revenue per month and not really looking to grow it in the past, but now were saying, okay, well, maybe if we put something into it, can we get to Month consistently? Right. And we accommodate that. With Inside TV, we are actively pushing meetings, so we are really focused on growing that specifically to 1.2 million per year. Thats the goal. And its a very almost identical service offering for the most part, plus the TV side of it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. Yeah. Okay. All right, that makes sense.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"And really just look at Inside TV as the same as the agency. Theres really no difference. Its just that with Glow in the Dark, I am running that solely by myself, so there is no kind of leftover capital to kind of put back into it, whereas Inside TV, I have capital to play with and we have got it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, all right.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I work until probably like mid, like 12:00. Take some time. And then I usually work at night.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"So the points guy is basically its a pretty massive reference around hacking travel points and being able to book incredible stays and flights and whatever. So what Flyflight does is books first and business class travel, mainly international and mainly more last minute travel at up to 73% off normal first and business class fares. So thats one. And so what were doing there is we are running paid media driving leads both through standard lead forms and Facebook, kind of like what you guys are doing, but also through ManyChat and through our website. And then we have a sales team similar to what youre doing, following up and booking and all that. So thats one. The other is Glow in the Dark, which is a standard kind of digital ad agency running paid media and ad creative for ecommerce. And then the other is Insight TV, which is a TV network based out of Amsterdam. And we produce shows for BBC, Hulu and kind of other platforms. And then also we have our own channels as well. And we are not only selling to brands, driving content, sponsorship and product placement, but also running custom paid media content and custom kind of digital creative content, kind of like you would see on a BuzzFeed or Vice. So those are the three things that I think.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"More staff. All right, fair enough.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Let me check. Do you remember what email I put in your lead form?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No one that would need to be included in the meeting.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"In terms of financial commitments? I mean, Id have to work with my team to agree that we think this would be a good fit for. I mean, I have budgets that I can work with, but I need to make sure that the broader team is aligned.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Whether organic content. Difference is those ads are funneling through the inside TV channels. So its the same BuzzFeed advice or got it.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, not directly. That business, like that exact company hasnt been right, but thats been my career background. So basically Ive been funneling for the past three or four years any kind of holding or freelance stuff into that just as it comes through naturally. Okay, great. Done a ton of lead gen on it, so havent pushed a whole lot there. I do have a team that activate in that way. I just havent had the time to really focus on it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Theres social Media manager.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"That would be this kind of stuff.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Course.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, I dont think so.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. All right.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, I do have a fourth.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thanks a lot. Appreciate it. You bet. Bye.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"ItS been around a few years just kind of running.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I was curious to know what you guys were doing.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, theyre all different. So for Fly Flat, that company is wide open and fully scalable. So I just started all the growth activations there to drive more customers in digitally. We just finished setting up all the Go high level marketing automations and many chat bots and all that kind of stuff to kind of drive more qualified leads. Those ad campaigns are starting now, so thats completely scalable. And the idea there is this company does around two to 3 million a year in revenue currently and were looking to scale that up, skys the limit really. Its a really easy sell because discounted last minute flights are pretty easy to sell. Its just more of the trust factor in driving more quality leads coming through the TV network. We have a target of 1.2 million Arr in this year. So really thats us selling through custom content and digital ad campaigns to brands and then also distributing that through our TV network. For that one we need to drive as many appointments. Our sales team there is having a little bit of a tough time pushing that through quickly so the extra help is needed and then the agency thats more of like a passion project kind of thing. So I think it would be great to get it up to 100K MRR. That would be the goal, I think but any kind of increase from where we are now is nice. And then for the fourth one good call. We are looking to be at 1.5 arr by end of year and were about a third of the way there.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Kind of yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I start at 05:00 a.m.. Do you okay. Yeah.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Oh, good. Hows it going?","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}}]