[{"pageContent":"Yes. Sorry, I didnt say that yet.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Okay, so, yeah, its basically a Go High level SaaS thing and just rolling the dice and seeing how it goes, if I can get some clients in the door. But I have the thing established, Im building out content right now. Thats kind of why Im not taking other steps. I want to have some content established just on YouTube and stuff, just a handful of videos. And Im actually working on that today just so when Im running ads and people land, they see that somethings there.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yes. And the only thing I just dont want to do that thing where youre bouncing around like youre starting to lock in, getting some ads, some leads from some ads, and I just at least want to hold the course for a while and kind of not shift gears into something that Im not as aware of. But Im definitely wide open because of course, I want to progress. When you say the $3,000 ticket, I guess when I look at acquiring a client, Im usually hoping for about a year, so I consider it around a $3,000 ticket, especially if they do an annual and they get a little break. But are you saying just a one time upfront, not a retainer, but just like a one time upfront fee?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, Im white labeling the go high level platform.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, Im looking forward to it. Thanks. What was your name again?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"So I just kind of at least want to at least get my content established, and that way thats kind of rolling and you know how it is you get the data after you do the action.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, its a whole all in one suite with the tools, with the auto text, and you can build funnels and take payments, calendars, put a course on there, all kind of stuff.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I literally just start pretty much dropped, like, last week. I have one friend thats been on for the previous month, but shes just kind of helping me figure out the bugs and the user side of it. Like shes actually a paying client, but just kind of helping me. So that way I didnt just start it cold. And so now Im actually ready to take on and just like I said, creating YouTube videos and all that stuff today, actually.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And Ill be reselling that under my own brand.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Its possible. Annual. I mean, I was thinking annual, and since theres other people out here obviously doing the same thing, Im going to build a lot of value into my offer and probably do a lot of hands on stuff in the early stages, stuff that doesnt scale. And so that way, when I start to outsource, I have a good grip on what I need to outsource, and I dont need to go huge with it, but I want to get it cranking, for sure.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thanks, bro. You too. Take care.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I got super busy and wasnt able to follow up. You know how the game goes. So whats the deal? What are the tools all about?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yo. Who did?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, sure. I know that might have been a long way to answer, but to totally answer your question, as of right now, I dont have the funds on me just to pull out and invest in more stuff. So thats why Im working towards the business credit and just doing the organic content thing for the moment. And I mean, I work and so I reserve a little bit of money for the business, but I dont have another big chunk of funds.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So thats the stage Im in right now. So yeah, and Im definitely always interested in the AI stuff, whats going down.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hey, whats going on? Sorry, it took me a second to think about that. Whats going on? Yeah, doing good. Just on the grind. Thanks for the call.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Its like, right at 600. Thats funny. Im right in the middle of all of this. I just got my LLC. I talked to the bank today about opening the business credit account and business account and getting acquiring business credit, business credit, so I can do what I need to do, get some funding. So Im on that path as well. And thats why I feel like content is free and its organic, and thats like something I have to do it anyway. Theres no way around that I have to do that anyway. So thats pretty much the stage Im in this week. Thats like, my main objective is getting some and as Im doing that, Ill be building my offer and figuring it out. So the plan is the software is kind of like the gateway offer, and then the core offer would be the upsell with marketing services, high ticket marketing services, but just really define what thats going to be. Obviously, I dont want to get in over my head. Thats the plan. So there is a little bit more on the back end of that $300, because that gets some access and a little bit of coaching here and there. And Ill be building out theres support teams I can add.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"What Im working on right now, my main focus. Are you familiar with Go high level?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im kind of in that stage, so I dont want to just switch Pivot before I even got started, even if maybe I am on the wrong path. I mean, I have a good at least feeling about building a solid foundation, and I know a decent amount of marketing. Im obviously not a baller, otherwise Id already be balling. Are you talking about positioning? It more like a coaching offer or like a consulting offer. What would you say?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"The sweet spot would be between three and 500. I have one user whos a good friend of mine, so Im charging her 97. But theres some plugins that Ill be implementing with plugging in Facebook ads and stuff like that. Thatll be a real valuable upsell. But for now, Im just trying to get my content build out. So that way as Im building out my content, my offer kind of develops itself is the way Im looking at it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]