[{"pageContent":"Good afternoon.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"For you accounting.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. We were introducing more services that would actually help them more effectively, which required in return that they have to pay more and they didnt want to, but then they would have to go somewhere else, and then they pay way more than what they paid us now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure, no problem. How about it?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"We make it fluctuate between three to five per month.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Just marketing and lead generation.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Definitely need that. A lot of work in that area. And I am willing to delegate half to anyone that can do that. Like, if you guys can do that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, Im on the bookkeeping side because Ive actually done research on AI and accounting a few years ago. Actually have some of the books that Ive read on it and how effective it was going to be. So, I mean, now that its becoming more popular and more understood, then that means that were able to perform our businesses, our business more effectively. I hope that makes sense.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, hi Matthew. Im fine. Thanks for asking. And yourself?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, so I want to go into a new industry. So the cannabis industry is actually an open market pretty much for accountants in the cannabis industry. And I actually was able to participate to compete for a government contract for the city of La. And so that gave me an idea to actually reach out to other government entities in referencing to offering the services that we have. So literally what they were looking for was every service that they were looking for. True asset actually offers that. And so we want to go into a newer market. So I want to get all brand new clients, all from the cannabis industry.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And a lot of our clients are still affected by the pandemic, so they were no longer able to pay us. So it was by default. They pretty much had to sever times with us as well because they couldnt pay us anymore.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Okay. So as far as booking, like, people go on my website, and then they could book an appointment in terms of closing the meeting and getting a client, I get 90% of them.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Most of them, yes.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes. Definitely the CEO.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"That makes sense.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Matthew calling.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Oh, God. Its really low. Oh goodness. I wasnt lying when I said it was low. Yes. I actually got a business partner last year who going through some personal things and put myself and other people that we were doing business with in the red. And Im just now getting out of it.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats what I was going through.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Its all a package. Its a package and its value based. Im not a billable accountant. Im not a billable business consultant. I am billable, but Im not an hourly billable business consultant. That was old school. I dont charge. I charge based off of value. So I have packages that are available, and so they will pay me accordingly. And Im very good at what I am. Im not a CPA. I am a CPA candidate because Ive actually met the educational requirements as well as the experience. However, I am studying to be an enroll agent, which is to me is a better route, especially going into the cannabis industry. And a lot of the main issues that a lot of cannabis dispensaries are facing are tax issues because they have a cash based business, they have a accounting method now, as opposed to accrual, which for good reason. It makes more sense for them to do that now. Because of that, they run into a lot of issues with the IRS now because I know how to do what I do, my services, I would be and I know that I have a lot to offer.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats my main source of income. I pull my all into this business.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes, I do.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. So I was raised by single mother and so the odds were pretty much against me to even be successful, to even actually be alive at this age. You cant do this, you cant do that. Tell me I cant. And watch me do it. Say it again. Say it again. And now Im going to see how youre going to look once I achieve it. I mean, I remember my son at twelve, right? I was in my second year of college when I got pregnant with him. Right. And I was getting, well, how are you going to take care of that baby and go to school? I was working full time. I was going to school full time. Okay. And I graduated with a degree in accounting and financial management with my toddler on my hip. Okay. He was diagnosed with autism at three and then at four he had lymphatic malformation, which means that the blood vessel is filled with fluid. Right. And it was on his neck. So he had six procedures on his neck, and the first four were all within a 17 month period. Okay, so he also on top of that, he needs to have speech therapy, occupational therapy, and Aba therapy, and because he needed all of those services. And at one point, I was working a job, but my son couldnt get the help that he needed because I was working, and they dont offer those services outside of business hours. So fortunately for me, I fired from my last job, and then I started my company. I have to figure out how to get my son the help that he needed and generated income. So I dont think but the first few years were very dry. I was raising him off of $1,000 a month. A month less than that. I managed to make it. They have to be God because there was no other way. But I made it right. When Im being asked, why do I want to reach that pinnacle of success? Is because I deserve it. I didnt give up even when I wanted to, even though it seemed easier, even when Im mentally exhausted, Im not going to give up because no ones going to tell me what I cant do to show you better than I could tell you.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"That would piss me off. If were having a meeting and Im giving you this very good useful information and then youre unable to utilize it because youre distracted.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Actually, I was doing everything myself. Went on a social media, actually meeting people in person as well. And that is kind of slow, slower pace. So thats why I didnt do my company wasnt as big as I wanted to be, where how anybody would want it to be. So I did end up partnering with some company and they were going to help me with my marketing, but they havent done anything on their end so far and that sucks. I definitely need a lot of help in that area.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"If we could do that, then we could work out a plan for that to happen. You know what I mean?","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Thank you. Likewise.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Mainly thats the main job of the CEO anyway. You just want to make sure everything, your business is being ran smoothly. And if theres anything, any problems that you need to fix as a CEO, you need to fix it. If I cant fix the problem myself, I am definitely not above delegating those tasks to the senior managers.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Oh, God. Its so frustrating.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Very blind about what were talking about.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"That sounds like that would be very helpful for me.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, for sure.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Yeah. Thats a numbers game. Yes. Now, with tax preparation, they come to you, so you pretty much dont have to work that hard to close it now when youre dealing with someone with bookkeeping, its a little different. I also have a telemarketing background as well, so its a number game, numbers game. So I will believe out of 100 leads, youll probably get a call for maybe 30 to 40. Not of those 30 to 40. Probably get a good 1520 people, right. Probably more than that. Because again, its an open market and its new. So if you tell them about what the biggest issue is in the industry right. And then you could tell them how youre going to fill that void and avoid that. If you could tell them how you could take any preventative measures that can result in a profit for them yeah, you could close like that. That part wouldnt be hard.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yes, exactly right.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thats a good question. I never thought about it because I love what I do as a consultant. I never set a goal of when I felt like I would stop.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"And they know that they owe and they still want a refund, and they want a unicorn.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, you got people, right?","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Yes, we are.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, not at all. Thats why I made sure that it was at eleven so I could give you my undivided attention.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I was tired of that. I had been doing taxes for ten years, and I got to a point where I just got tired of it. I am a business consultant. I am not a magician. Okay. You knew that you made a certain amount last year. You did not pay, or you went exempt for the whole year and didnt have any. You know what I mean? You claimed more dependence, I mean, more exemptions that you add more than you actually qualify for, and then you made less this year than you did last year. So you owe.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, we could write this down. Thatll be a legal contract. Thatll be a legal contract if I get my 1st 500,001st class tickets on me. So Ill pay for your plane tickets, Ill pay for your food, Ill pay for your room, everything.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yeah, I dont know how to run ads. Im not good at all with social media. Its just like Ill just put up a post, Ill get a couple of leads from there, but in terms of actually running an ad, I have no idea. I would love to learn more about it, but it also takes away from me working on my firm and what I was taught as a business owner is its always best to work on your firm and not in your firm. Lead generation and marketing, its the bread and butter of your business because its literally how youre going to draw clients that want to pay you, if thats not your strong point. And you dont really have the funding or capital, really to actually pay anyone. You got to learn and do it yourself. But the problem was with that, the way that I am, the way my brain works is like, that part of my brain does not want to work. For some reason, Im willing to pay an agency to assist me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Actually, I really want to hit eight figures. Really?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. And being told that you cant reach that level of success, its impossible. Like, my father was a drug addict, both of my parents were on drugs. And my father, as a result of his drug addiction, spent the first 30 years of my life in and out of prison.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I just got into the car and the Bluetooth picked up the phone. Hold on.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thats what I never thought about.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I would definitely love for that to happen. You were definitely going to celebrate. And I gave you a nice gift, too.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, I know as a business consultant that would piss me off. If I was in the middle of a meeting or a conference and someones looking away or Im asking some very sensitive questions and then their friend is in the background, they just walk past them. Im a parent myself and I understand every now and then I have a child bother you, but if its an ongoing thing, or if the dog is barking and you knocked over your drink by the computer thats happened to me before. I mean, not to me, but to a client. Were in a meeting.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Thats what I want my ultimate goal to whereas I feel like thats my sin number to retire, but for my company to make on a monthly basis, that would be great. If we could do 1 million or $2 million a month, thatd be great.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, 10,000. And we had a really good year before the pandemic. A year or two before the pandemic hit, we were making 10,000 a month. And now we have to revamp some of our clients that couldnt pay us anymore. And then we have to fire some.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"And I want a refund, and I want it today. Thats what I deal with. Or people that dont work, and they want me to prepare their taxes, and they want a refund, you know what I mean?","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"All right. Bye.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Okay, well, Ill take that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. Yes.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"And I know that that takes time. It doesnt happen overnight, and Im willing to do the work, but I just need a very dedicated team to make that happen.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"All right. Have a good weekend.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"When I get them.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"You have my personal email, so yes.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay. And then that way I can watch it as many times as I like, correct?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"If you guys can do that or 2 million a month, goodness, then that would make me very happy. But how will we go there sitting as I revamped and I just barely got myself out of a hole? How can we do that?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Actually, neither, because I have some appointment set up for tomorrow. I have an appointment tomorrow. Monday?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So basically we actually do bookkeeping for our company, for small businesses. So we actually reconcile their books. We set up accounts. Sometimes we do clean up, depending on what their situation is. We pretty much do everything. We also do entity information. So if anyone wants to start a company, we pretty much do the same thing legal Zoom does. And we also help companies become certified to compete for government contracts on a city, state, and federal level.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Like I said, thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I do have a spouse. Well, were very serious. Were engaged. But right now hes not going to be a part of the business, right? Yeah, he aspires to be, but Im like, I dont know just yet. Sir, you havent been through boot camp yet. But you know what? We could say no for right now because hes not a part of the business as of right now.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. So I was on Instagram and we saw your ad for AI Air, and I was just interested in seeing what you guys have to offer right now. Im currently a one woman show. Ive had my consulting firm for six years, and were an administrative management company and we offer services such as accounting, entity formation and so forth.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. So then how much will it be monthly to hire you guys? Hire your team?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Typically, I havent finished the pricing just yet, just because I want to figure out all of the main issues that theyre having besides the tax issues. I know its also licensing. I know its also as far as setting up a business, theres really not a lot of business consultants. They usually hire like, HR consultants, or they have someone on their AR team and HR managers to actually help with that. But the problem is theres always a compliance issue, and its something that an HR manager wouldnt be able to handle.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"That would be.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I know you have so much interesting things to say. I felt like I couldnt stop you, but its fine. Yeah, its Brent. Yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I was standing on top of the world because I want to inspire people, especially women, that feel I know that a lot of women who are parents of children with autism is so alone. They feel isolated. They feel ashamed for their thoughts and their feelings no matter what they be. And they just feel like they cant go on any and there are a lot more that were in the same situation that I was in and sometimes feel like theres no hope. But I just want to put the message out there that there is hope. I want to put the message out there that there is hope and you can do this. Its not easy, but it can be done. You know what I mean? I want to put I just want to inspire people, you know what I mean? I want to help. I feel like thats what I was destined to do. And if that story gets out there, Id be amazed if I change one life that make me happy.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, Im in William Hills, California, like 30 minutes outside of La.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"You want to know the truth?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And then wonderful.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yes, exactly.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes. Thats okay. It happens all the time. Its pronounced like B-R-E-N-T print.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Because especially around this time, with tax seasoning over, and a lot of my clients prepare small business tax returns as well as individual tax returns.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. I can hear you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thank you. I should do a piss off one day. I should remember my name is Brink Gray.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"No, because Im going to show up.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, so Im 40, okay. And Im from La. South central La. Growing up born will kind of do that to you, first off, and grew up during a time where it was just really rough. That was one of those things. And I dont know why, I dont know where it came from, but Ive always imagined myself being very successful. Always knew I would be in business, but I was never really sure exactly what Ill be doing in business. But I always knew I would be in business. I always saw myself having this big beautiful house. It didnt have to be a mansion, but it was something that was cute and it was cozy and it was spacious. I have to have two stories growing up for it, right? And then Ive been on both sides. Ive lived in really bad rough neighborhoods and then Ive lived in really nice neighborhoods where Im now in Woodland Hills. Just being on both sides, you know what I mean? I just know that I was destined for success. Ive been around successful people. Right now, my numbers dont really look like it, but I know what it takes. Ive studied rich people. Ive studied rich people. Ive spoken with people that are very successful. They all say the same thing. And whats funny is a lot of people who arent successful or they have the desire to reach a certain level of success when they speak with these same people, they think that they think its bullshit. Its really literally all about your mind frame your mindset and how you see yourself. And you have to show up for yourself and always be willing to bet on yourself because no ones going to bet on you the way that you are. I learned a long time ago, I learned in college actually, if you want your company to be a Fortune 500 company, you need to start treating it as its a Fortune 500 company right now. A lot of people dont know about true asset, but I treat it as if everybody knows about true asset because if you dont, youre going to slack off and then youre going to be unmotivated. Youll get into a situation where companies suck just like every people have ups and downs, businesses have ups and downs. And thats where my comes from. I want too much to do nothing about it. And these last couple of years, not just due to the pandemic, but just because it happens.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And what do I expect to make from those appointments?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"It was like 630.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"If I got hired. Then I asked me, at what point do I see myself being the CEO? Like, where I can act solely as a CEO instead of like the secretary, the accountant, the CEO, the marketing director? That is a good question. I have not thought about that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, definitely. Thats the goal.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, no. As far as the financial go, it wouldnt ever be intertwined my preference. I dont want to do that.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, basically overseeing the day to day operations, making sure that everything we meet the quota, taking care of all of the compliances, making sure that everything is done. Just basically seeing overall day to day operations.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Even if you give me to look, this is what I could do for you. If you could get me to my 1st 500,000 month, Im getting you first class tickets to Hawaii.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right now we are at $5,000. We just actually had to revamp the company. The type of clients that we want, we couldnt keep the clients that we had. Were currently going through a revamp.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]