[{"pageContent":"Ive got a separate business that Im still running, kind of put on the back burner while I was launching this. And Ive got 30 years of experience in insurance and securities as a financial advisor. So the way Ive done that is I wanted to get out of the producing business and so I split deals with other people. So in the work that were doing with these business owners, I let them know that, yeah, we can do your insurance, we can do securities, we can do retirement stuff, we can do long term care and all that. I just do a high level, lets call it a prescription and then somebody else fulfills it and then I just split the deal with them. So 60 40 split or something. And then those people keep up with all the rules and regulations and the paperwork and all that stuff. And then I get paid by whichever the insurance company is once a deal gets closed. And some of these could be multimillion dollar deals that would be also the similar kind of model, getting paid at the back end, nothing up front, no plan fees. And thats sort of our competitive edge. So if we compare ourselves to financial planners, theres two things that we do that they cant. Number one, they want people to have money up front. We find the money so that we can find the business on a quarter of a million bucks. They cant do that. They dont know how to do that. Then at the back end weve got leverage where we can use corporate loans to multiply the amount of money going into retirement plans. So if we find them a quarter of a million dollars and we can 20 X that with a corporate loan, then we put a $5 million retirement plan together for them tax free and then do a business exit with that. I dont have to do any of the work. Im basically just doing the client acquisition, connecting them to people that know how to do this stuff because they dont even know the stuff exists.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, basically Ive got various lead systems that have been given to me by the partners that I have, and some of them are kind of all over the place. Ive got 1000 leads here and several thousand that Im working through on LinkedIn and then some in my Go high level database. So I was looking for if I was going to go and push a particular product line, like maybe a debt restructure or something like that, what would be the most efficient way to do that? And I was just trying to find out what the AI would bring to maybe sort out that process a little bit.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right? That definitely makes sense. Okay, got you. And have you ever kind of thought about selling your knowledge on showing people how to do this?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I work with small business owners to help them find money for their business. So I run webinars to attract people to my business. And then once I meet with them, we basically go through and find out where in their business theres opportunities for me to bring in third party providers that deliver various forms of money to them. And then my third party providers pay me so the clients dont pay me. So my model is a little different from most consultants. And so I was just taking a look at whether I should market any sort of individual type products or would I just stick with Webinar marketing. Got you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Im doing okay, thanks.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Basically just trying to figure out whether its something I need to look into for the future, but something else came up and I had to take my attention away from it. Ill probably get back to it sometime late next week.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I just briefly had a look at it and then I got caught up doing something else and then being able to get back to it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay. Yeah. Most of the stuff that Im trying to get done is basically just the handling of bringing the prospect into my CRM. But theres tools with go I level that can do that and then basically building all the automation in that for my webinars. And I do my plan 1000 webinars a year, so I do four a day. But they are small. They may be ten people per webinar. So thats what my focus is. Its just kind of getting those webinars filled with the right kinds of people that can appreciate what were doing and constantly adding new products and new providers that can have different skill sets. And then Im kind of like a traffic cop directing the clients to the right people. Thats basically my role.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hello. This is Aldo.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right? 100%. Okay, well, Ill have that. Well be in touch, although all right, thank you. Cheers.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, Im not the expert. I have 30 different companies that are experts at what they do. And these are rare skills, right? So they can find money that people that swear that theyve negotiated every single penny out of something. And these guys come in with audit skills and find five, six figure monies in some businesses. And theres just a different set of information available that big businesses have that allow them to pay zero taxes, for example, that needs to be brought to small businesses that dont even know that thats even possible. So were just basically because some of these businesses are so successful, they can float these customers through a free feasibility study and then work with them. Theyre not replacing anybody. Theyre not disrupting any business. Theyre basically just bringing the intelligence. Theyre not doing any forms, theyre not doing any compliance. Theyre basically just coming in and saying, if you had this information and your tax guy knew this and put this in there, youd get an additional $150,000. Do you want that for $9,000? Thats basically what it comes down to. So its a pennies to the dollar exchange. And then Ive added some other twist in there too, to be able to generate automatic referrals. So mostly Im just basically taking a look and see what AI is available and see how you guys work and see whether its a fit for me some way down the line.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]