[{"pageContent":"Taking care of old people. Thats it. Taking care of old people in their homes. A lot of old people here. So its just a matter of a lot of competition, a lot of excuse my language a lot of shit labor here in the South Florida area. So we offer a higher quality service with people that no offense, that speak proper English, that can conduct business with the elders and do what they need to do to take care of them. These are people at their end of their lives. And what we do is we actually go in there and help them. We have an agency to do that. They pay a little bit more with us because they speak English. Theyre a little bit more intelligent than the average person. So youre getting a higher quality person than a lot of these agencies provide. So with a lot of competition out there, I dont know what your service? Can I try to reach the people that have the money, so its not where the government subsidizes us or nothing. So its very important Im able to reach those people with money, good amount of money. And we are in an area that quite a few wealthy people live, and theres a lot of people who dont have any money. So I dont even want to communicate with those people, the people that have money, but they just cant afford to have the service. You see what Im saying? They need it, but they just cant afford it. So yeah. They got to go with the person that doesnt understand English or whatever and theyre getting a very low quality service. God bless me. Nothing we can do about that. But I want to target the person with big bucks. You get my drift? Now what were offering yes.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, I would like to take it to between 51 hundred K a month to start out with and then grow it from there. We offer a very good service and I really dont see why we cant do this, but I need to target the people that have the money. This is not your average Joe thats a coach for picking his nose. Im offering a very high quality service and the people that work for me, they demand big bucks too. You know what Im saying? So this is our goal. I like to go beyond that. One hundred k a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I heard a beep. I could tell the sound youre somewhere. I dont think youre in the United States.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Eagleinktoner@aol.com, yes.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I guess all right. Hey, listen, I have a home health care service taking care of seniors. Its here locally. Its not national or anything. I dont know what you guys offer there. What do you offer?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Right now theres just a couple of us. I dont get into my private business or anything. I want to see what you got to offer. I havent even heard what you offer. Im not going to get into all that stuff. We just have a business right now, a good business model with a lot of competition. With a lot of crappy competition. Thats the key. A lot of crappy competition.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I havent even looked. Im tired from working all day.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Why dont you send me some information, well go from there, and Ill give you a call back. All right? Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I dont know who you are. I heard a beep, and I know youre out of the country, so were not going to go there.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"814 this morning.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I dont get excited. I dont believe anybody. I dont believe you. I dont believe the guy next door. When it happens, it happens.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Send me some materials. Let me check you out first. Theres too much stuff youre asking me at the beginning. I dont even know what you offer. I dont even know what its all about. You send me a good explanation. You send me to a website. You send me to a website. Let me see what you offer, and Ill take it from there. I want to check you out first. Okay. That youre on the up and up. Youre not some kind of scammer that advertised on Facebook wanting peoples credit score this, that, and the other. I dont know who you are.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}}]