[{"pageContent":"Yeah. So as far as health, youre doing the Obamacare stuff?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"The way things are going in Florida now, youre lucky youre not going to get shot.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yeah, just now, though, I got two messages and then you called, right? I have not.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Going to have an insurance business. Im an independent contractor here in Florida. Well, Im actually in Florida now, but my license is registered in Florida. And then I have some friends that Im going to bring on board, some other prospects that are thinking about getting their license to sell Health, Life and annuities. So right now its not really off the ground yet, but I have my license and moving forward with that probably within the next couple of weeks here, then I just got appointed with seven carriers as of yesterday. Okay. Yeah, thats basically that in a nutshell.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Its hard, man, but yeah, if you could kind of stick it out and again, some of the more lucrative people are making good money are doing life insurance a lot.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"First name, middle name, last name, in between first and middle.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, with my license being 215, I havent came across anything as far as that. Maybe in other states they do by county, but State of Florida is all Florida. And then I reached out and got information on a couple of other states, and then all I have to do is apply and pay for that fee to have the license in that state. So maybe another states would be different.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And very honestly, what theyre doing now is gotten to the point to where youre just lucky if you get a hold of somebody whos willing to talk to you. And the other thing is trying to be the right guy, do the right thing. Their attitude is, Why should I talk to you when Ive got 20 other people calling me? What can you do for me that they cant?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay. I did hear that somebody I was talking to did say something like that before. I think ethos. They asked me the same thing, and I was like, I havent came across that, but I havent sold anything to find out either. But why would they sell me that license? Part of that license?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"You take care of yourself. You too. Thank you. Bye.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Give me 1 second. Im traveling.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I have not checked it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Give me 1 second.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"You dont need that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. And thats when the price skyrocketed. I mean, realistically, I ran a small brokerage. I had five people. I was getting 25% commission from the companies that we worked with, and my guys were getting 18. I was getting 7% of theirs.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, got it. Because I know that there are a couple of the companies that do something different. Here in Colorado, before Obamacare came about, we had eleven companies that we could deal with.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Things have changed so much, but I think that doing what youre doing, theyre going to be some tough days. But man, if you stick with it, I think youre going to find a lot of rewards. Again, the biggest issue for me, my heart wasnt in it, and I think in our structure, and it was the company, the brokerage that I was working for, I was 1099 independent. So they basically had something set up where you could use their dialer. They wouldnt charge you for using their dialer. But unfortunately, most of the time when the leads were kind of put into it, they had some top tier personnel that had first crack at every one of those leads. By the time you got to them.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Absolutely. And then this is your phone number, like a direct line.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. On top of the 25, I was getting whatever they sold. I got 7% of theirs.","metadata":{"fillerID":7,"fillerText":"Yah totally","category":"A"}},{"pageContent":"Yeah. One of the things it wasnt much. One of the things that I learned kind of getting into the Obamacare stuff and the way things worked is I found that the majority of people that I had for residual were changing almost every three years, changing health insurance companies. So your residual tended to just not be there. But when I started doing focusing on life insurance, and especially the universal life index, universal Life, I mean, it made all the difference in the world.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its something that if you find a really good niche in there, man, I think youll do well. Its just that find that niche. Yeah. As far as talking to people in small businesses, thats the other thing is having a relationship in small businesses and that type of thing. Or if you can get into a company, that what a friend of mine did. He actually started selling for one company, and that company provided him with all the leads he needed without anybody competing with him. However, he didnt have the diversity to offer different things. He just promoted UnitedHealthcare, thats all. He promoted United healthcare.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And so the way things worked with prices and everything else, I mean, a family of four was getting decent health insurance for like, $650, and now I think its like $1,600, if not more. But the main thing was that with that, even a broker working for a brokerage, even getting 18%, they were advanced the nine months. Of course, they could make three, four sales a week and be making two grand a week. Right. Yeah. It is so different. And thats the reason why I left was because the commission structure changed so much.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"And when Obamacare came out, we lost all but three.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yeah, I think as you kind of get into it and get people working for you and everything else, I think youll probably run into some of the same issues that Annuities I did. Some of that I didnt get into it as much. I actually had a company from Atlanta, Georgia, call me to get me involved and I was on the way out at that time, my head just wasnt in it anymore. The other thing is having to buy your own leads.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right? Absolutely. I appreciate the time.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im pretty good. And yourself?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. It sounds like they changed their style. So yeah. I was licensed in 27 different states, and at the time when we started, everything was face to face. Now, of course, its zoom and you.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Youre right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]