[{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Miyashta. The I is silent. My husband is Japanese.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, kathleen with a K. Okay, Kathleen.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Hello? Hello.","metadata":{"fillerID":33,"fillerText":"Yeah","category":"E"}},{"pageContent":"Awesome.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Its Kate Miyashita@gmail.com.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"All right, well, thank you so much. I appreciate your call, Rick.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Over the phone.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yes, Im good. And who am I speaking with? Im sorry.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"The last time I checked, I have not received it. And I was actually going to reach out to Phil Cohen by email, but Ive just been bombarded with inquiries on our business. But I was actually wanting to reach out to Phil Cohen to ask some questions as well in regards to the software. And Ill be honest with you, I dont have those questions in front of me because I did have them written down. But, yeah, there are questions that I actually have before signing on with Air AI.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You can call me Kate.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"The thing is that just to kind of give you a little bit of background of myself, is for the past decade, Im 46. For the past decade, Ive been managing my familys affairs. Im a trustee, and Ive been doing this, doing business for them since I was like 15. And with everything that Ive learned, my mom has run a private care home out of our own residence. That this is my first year of actually taking over and managing. I apologize if you hear my daughter in the background.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay. Yeah, Ive been receiving, I think, calendar emails for appointments like zoom calls, but never an official email from Air AI with communication. Yes, the registered email. Im sorry, go ahead.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Im located on Oahu. Hawaii.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, great. Well, thank you so much, Ricky. Have a great weekend.","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}},{"pageContent":"Thank you. All right. You take care of yourself, Kate.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Wow, okay.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"My name is Kathleen with a K. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Wow. Okay. Ive just come back after being away for 15 years. Weve lived in California. Both my husband and I have worked in the healthcare field. We work with Kaiser Permanency. We pretty much just quit our jobs. Downsize. We live literally out of our suitcase. Were pretty savvy digitally. Ill say that we have used Chat GPT and it has worked well for us. And I see a potential with working with air AI. I just needed to digest the information and just to kind of sit with maybe what other questions that I had before. I actually pay a fee of $30,000 with what I was quoted and usually with a software company. Im used to having a demo before I make that commitment and I just didnt feel like I was quite there yet, although everything sounded great. Like I mentioned, I do have questions and questions in regards to for one that I can remember is if we are able to assist our clients with funding our high ticket item, is that something that our business is able to do for ourselves? If we have a project, its one.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"But this is the first year that Ive actually taken over. But with the first year alone, weve grown this business with an income of over half a million. Thats the kind of money my mom has never done before with working her private care home. The thing is that Ive been asked to take over her business, but with running a private care home, my mom was the person that not only operates it, but she was doing the direct care, she was doing the paperwork. So its just a one man person to take care of five elderly people.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Got it. I can honestly say that making 4 million a month is possible. And I can see that already here just on the island alone. Yes.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"All right, bye.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"There was supposed to be a follow up, but I never received that email. The gentleman, Matt, had informed me that he would actually email me after our conversation, but I never received it. But in the interim, Ive come up with the questions and things like that, that I was going to follow up with Phil Cohen, because after my initial phone call with him, he wanted to circle back and see how it worked out.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Aloha, Ill enjoy the island for you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, wow. Okay.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yes. And I know that its a new company, and Ill be honest with you, Ive done my due diligence in trying to find who is Air AI, whos owned by Air AI, because Ive never heard of this company before. And so, to be honest with you, to drop $30,000, it sounds fantastic. I personally dont have a problem with it, but Id like to see what Im purchasing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes. And so I felt that with my experience growing up and seeing her do this, I felt that I could give value to those who are interested in opening up their own because theres such a need. On the island alone, we have people, like, just applying by the hundreds in terms of because its the lowest hanging fruit, but its a profitable business, and theres a need for these private homes to be here to help with that need. And we felt that we can give value to those people who are interested in opening them only because theres that need. And so weve scaled to now not only profiting in our second month, but to a point where we are able to increase our rates, add on more staff, and just be able to repeat the process with someone else who is interested. And we have so many people that are knocking on our doors that we have zero advertising. This is just word of mouth and this is just the culture here on the island. And weve already been asked by other people who are in different states and were just me and my husband, we would love to scale. We just need someone smarter than us to actually be able to help us with this process.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Got it. Okay. So Ive already gone through the process of watching the videos and then speaking with, I believe his name was Matt, a gentleman by the name of Matt. Does that ring a bell? And then Ive actually informed him that Id like to see a little bit more of how the software works, but I never received an email in regards to any video that showed that process or a demo.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"At this point, yes. After watching those videos, I have questions written down, and thats actually in my office, and Im away from my office right now, but I do have follow up questions and I can email them to you or we can schedule another conversation in regards to those questions. Or if you want to direct me to someone that would be able to answer those questions, I would appreciate that.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Miyashta.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Got it.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"All right. Bye bye.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}}]