[{"pageContent":"Ideally, right now, Im in this weird place because Im trying to get my funnel kind of making sense. And together I have my kind of irresistible offer where I do complimentary hotel bookings. So I want to get that fully operational and running to just bring in income because its just like a foolproof passive income way and then really beef up my higher ticket offerings. But right now, its just not all together. And I dont have a pipeline because Im not really running ad.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Whos speaking?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, just because of my niche, not everyone has the price point to spend at least $500 a night on a hotel. So thats not like for the custom one. I would say thats the most rigorous kind of vetting process because the amount of time that Im investing, I wouldnt really do it for anything less than at least a premium booking. But the downsell is that even if theyre not there yet, they can get VIP perks and all the perks of booking through a travel advisor, through my kind of complimentary concierge service, which gets them all the perks and they dont have to invest in paying me, but they have to put together everything else on their own. But Ill just do the booking for them.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, eastern. Yeah, you can call me in 30 minutes.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Its a concierge membership service.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, my name is actually Fadleen.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. So theres a couple of ways. I do charge fees, like your regular service provider, I can do custom trip planning and that has a planning fee agreement. So I do charge fees, but also just like I receive commissions off of the bookings as well. And then on the concierge side, its like a subscription or membership style business model.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I thought I was supposed to get like a freebie, but then I never got it and then someone told me I have to schedule a call.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yeah, its F as in Frank E-D-L-I-N as in November.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. And ideally right now, what I want is to launch my complimentary hotel booking offer because its so juicy and literally its one of those things like, why not, why would it use it? But I dont know how to put it together properly.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure. So I own a luxury travel agency and Im launching a concierge membership service. So Im trying to figure out how to efficiently get things off the ground.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"For large group travel. So lets say youre having a destination wedding and you need an advisor to help you manage the bookings for the guests that are coming to the wedding. Because hotels actually dont do that when you have a destination wedding. I charge two grand. Starting to put together like large group travel.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So it starts at 550 for two people up to seven days. And thats done for you? Everything. Flights, hotels, restaurants. I put together an entire proposal once we kind of revise it, go back and forth and its approved. I do all the booking and that also includes support during your trip as well if you run into anything. So it starts at 550, but it can go more than that, depending on if theres additional people longer than a week.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, cool. Thanks.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah. I would say it could range between two to five k, depending on the size of the wedding, where it is, how much on the ground support they need, how many people are going, if they need me to secure, just manage the bookings, then its around two k. Thats including vetting the property and making sure everythings up to their standards. If they also want me to add ground transportation or support transportation and for the guests as they arrive and secure activities and things like that as well, then it goes up.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So Ive been an advisor for almost a year now, but Im just recently I have a host agency as an advisor and I was just kind of working through them and just kind of taking payments, but not really through my own business. But I just recently launched my own business so I can scale it and make it like an actual my job.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Ideally just with the travel portion of the business, not even including the concierge, I could ideally see it looking like between 15 and month.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. And I just want to give you a quick warning. I only have about five minutes. I have a call at 02:00. But basically it starts from whether they find me, however they find me. So whether its through my site, whether its through my Advisor profile, through my host agency, or, like, on social media, they click on my site. I have a ton of call to actions. Ideally, they schedule a quick consultation with me, which is about 15 to 30 minutes. I get to know them, see if were a good fit. And then they can either go three ways. If theyre not in my price offering, I offer a complimentary hotel booking, which is them just telling me where theyre staying, what the dates are, and I book it for them. And thats just like straight commission. Or they can go down the destination consultation route where they give me kind of like their travel profile, how they like to travel, the types of places they like to stay. And for about 175 to 200, I kind of put together a deck for them, giving them suggestions, my contacts. Its not a full Itinerary, but its enough to kind of get them going. If they cant commit to the full investment of a custom Itinerary planning, the Itinerary planning, then we go further in depth. Once theyve paid so they have their consultation, I send over my planning fee agreement and my terms and conditions. Once thats signed, they get an invoice. They pay the fee depending on the details that theyve given me. And then once theyve paid, we start the kind of trip planning process and that I have all automated currently from initial contact, like form filling out through the end, through ActiveCampaign currently. Okay. Yeah. I put together a proposal. We go back and forth. They approve it right in the system that I use, and that also gets their credit card information because the storage in there is PCI compliant. I do all the bookings, they get all the confirmations, and then they receive automated emails closer to their date. And then at the end they receive an email asking how it went for feedback. And then thats pretty much what that looks like at the moment. And then for the weddings and like the larger group travel, its a little bit more in depth.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I have to jump right now, but can we continue this call later? Im available at later 100%.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]