[{"pageContent":"Yeah, most definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, I am interested, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, my mom, she would help me out for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, Ive been researching it for a minute. Its all over social media. Ive seen stuff on YouTube about it, and Ive seen the numbers. So that was one niche that Ive seen. But yeah, I know theres a market for it, for sure. What Im trying to tap into no.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, for sure.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Probably my mom or maybe even both. Well see.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"All I have to do is have a conversation and Im sure I could get a decent amount. It just depends. Its a numbers thing for me.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, for sure, man. Trying to get out of the system.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So for me, Im looking to start a marketing agency. Digital marketing agency, anything. Im trying to figure the niche out, but yeah, I know that AI is the future and its really like changing the game. So Im trying to get into it now before it starts getting more and more advanced. But really? Yeah, Im just trying to start a business that I know will be profitable. Thats my main mission.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, yeah, that could be done, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Central Time.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So really, I guess, like, for comfort firms or whoever is asking for service, Id say we have people who can check on the networks and system because thats what Ive been learning about. I guess Id have to have a team for this. Of course. Yeah. People who know what theyre doing. But Id say something along the lines of network security. That could be an area we could market. What else? Identity. And what is it called? Threat management.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. So right now its sitting at about, what is it? 580. So Im trying to get it better loans. I got some stuff I just got to clean my credit up. I really dont even have too much on it, but always. Yeah, I dont ask my parents for too much, so everything I do, I try to do it on myself. Im learning to ask my parents for help sometimes.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Because I got a lot of ideas. I love that with this AI, its changing the game. It really is. Even all sectors, like real estate, anything. Its crazy.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah. So right now I dont personally have the money, but I could definitely talk to my parents about it, but I dont have money saved right now for the business. But thats what Im trying to do. I have resources, for sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Its theme, but you can call me Anthony. Thats my middle name.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I just graduated. Its been, like Id say, the past two years. Ive been moving back from Texas and St. Louis. Now I think Im finally settled in Dallas. So I havent had stable income because Ive been moving back and forth. I get money here and there, but I want some stable income and my own business so that Im thriving on my own. Thats what Ive always wanted to do. And I guess the money is not the problem. Im sure my parents will help me with this, but its just that Ive been focused on school, getting my degree, and finally, now thats coming to an end, I can focus on doing what I want now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I think lets talk about it more because Im curious to what the plan would be, what were aiming to do, and then Ill have a better conversation with my parents and theyll help me fund this, Im sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, most definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, yeah. Im new to this, so I feel like talking to people who are already successful in doing what I want to do or what Im trying to do would be best. You dont have to make mistakes because they probably made the mistakes already and learned.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im trying to think because we went over a lot.","metadata":{"fillerID":16,"fillerText":"Ok gotcha","category":"B"}},{"pageContent":"Yeah, thank you for calling me. For sure. Thanks, brother.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, I can do that.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"For sure. Yeah, go ahead.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, it will.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, yes, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, great combo. Have a good one, brother.","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}},{"pageContent":"I just got my degree in cybersecurity.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Looks like at the moment right now? I guess itd be around like 26,000. Yeah, thats going up for sure now. Im hopefully going to get a job here soon in cybersecurity. Okay.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. Yeah, that sounds great.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Thank you. Thank you so much. But yeah, thats what I want. My own cybersecurity firm probably doing consulting and stuff like that. So I think thats my main drive behind it. And yeah, I know its going to be needed for sure in the future with all these hackers and stuff like that. Yeah, thats my main drive behind it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right, bye.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"So right now, literally just chilling at my parents crib, I dont have to pay rent, Im just on my computer, do a little bit of coding here and there. Okay, yeah. Right now, thats me for the summer. I dont really have any commitments right now.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thats why I was like, I saw your ad and I mean the ad for area, and I was like, this is like you got to jump in on things before everybody gets on and buy the Hype, sell the news.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"So right now, no high ticket. Id say. Really? I feel like it starts with outreach, right. Getting that business set up where people can see what our goals are and what we do. So I guess it starts from there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello? Fiend hello, whos this?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Ten k. Ive always said this, anytime anyone asks me that question, ten k would do, like, a lot for me. Just to start, if we could hit ten k a month, that do a lot for me. What would that do for you, man? Im still living with my parents now, but I live a different lifestyle that Ive been wanting to live. Ive been researching different ways to have my own Internet money. Thats what separates the 1% from everybody else. They find ways to make money without having to work a job, which is what Ive been obsessed with, if Im going to be frank. Ive been obsessed with that, learning different ways. Ive just been researching, and when I have money, Im going to expand it. Thats really what Ive been wanting to do. Thats my drive. Thats my goal.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, okay. Its going good. How about yourself?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, yes, most definitely, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, yeah, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Theres more that I have in mind, but wed have to plan it out.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, for sure?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"07:00 P.m. Tomorrow? Tomorrow Wednesday. Yeah, that should be a good time.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So the only experience I have was when I was doing like I had a little door. I tried to use Facebook, the Pixel, I use that. And then what else? We can use TikTok. That works too. TikTok for sure. Something that Ive seen has success. So I think combining all of those different social media and getting our name out there would be the best for our okay, perfect.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, no, that sounds good. That sounds good. Im always ready to learn what Im here for.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, you said it would begin probably as a marketing agency and then I guess as we develop, we can turn it into cybersecurity consulting for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}}]