[{"pageContent":"You mean personally or business wise?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Well, I appreciate your time. Right, man.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So Im a DJ and I specialize in wedding entertainment. So my goal would have been to see if I can get more brides to book us for their weddings or wedding coordinators to get in contact with us to book us. So thats what Im looking at right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, whos this?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh yeah, honestly I forgot all about that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Last time I checked it was 705. Okay.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Well, our process right now is DJ profession is pretty word of mouth. Like youll do a gig and then people will get in contact with you and theyll be like, oh, I saw you did this for my friend or my cousin, can you do something for us? That kind of thing. So theres that. And then the second way has been through Facebook ads. Ive been watching tutorials on how to set those up and how to find a targeted audience and thats actually helped. I know Im probably not doing it at the best efficiency since Im not like a marketing expert or anything, but yeah, Id say aside from word of mouth, its been Facebook ads and trying to use social media to drive traffic to our website for sure.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Not yet, since my business hasnt been weve only been in business for two years now, so were just starting to pick up steam. So theres a lot of things that Im still learning. Okay, yeah, we have a website, but its mostly just for getting people to book with us and for us to tell them more about what we do and where were located and all that kind of stuff.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. Okay. Id say thats like a good month.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I mean, the number that Im looking at right now, goal wise, is Id say for any business, youd want to at least get 10,000. For a small business, at least 10,000 a month. Right. So thats what we would like in terms of the revenue wed like to be having monthly.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Opposed to doing? No. Okay.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Man? To be honest with you, were still trying to make sure we have just that. Right now we have a business credit account with our bank. So we have about, Id say at the moment we have like two. No, not even two. We already use that. We have about 1000 in terms of just like credit availability, so we dont have a ton right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, because both me and my business partner, we kind of do it as something outside of work. So were just working on building the business until we can both jump into it full time. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Total income. Well, lets see, my paycheck was about 60. If I had to round it, Id say 60,000 pretax.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"You, too.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Man, it really varies, but Id say on average, we would probably get about, Id say 2500 a month just starting out. Yeah.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Yeah, but Ill tell you what, I got to get going, unfortunately.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, Ill say tomorrow at noon or tomorrow afternoon sometime.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Up to you. Yeah, I mean, I actually got to go. Sorry.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Really? Its just the traffic of potential bookers. We only get people interested in our business, like a few people each week. So its not like we have huge rush of people saying, oh, can we book you for this, that and the other. I mean, were getting towards that point. But yeah, in this business is pretty much just how many people know who you are and how many people have an event coming up where they need your services.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"If we continue growing, thatd be great. I mean, theres only so much we can do as two DJs. MCs but, yeah, ultimately wed like to expand, get some people to work alongside us in the future and totally expand.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I dont think I did. I remember looking, but I could have overlooked it to be honest with you.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Lets see. Tell you what, can we call tomorrow? Because Im actually out right now, is that cool?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Its been growing lately, so Id say well have at least three for sure. At least three, okay.","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}},{"pageContent":"Oh, Im doing okay.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]