[{"pageContent":"So its all on the DMs. And then again, I was just talking to well, shes my girlfriend, my partner, but Im about adding many chats so that as soon as and Im going to record a VSL here, so its a lot more automated, right, so that when they send it in, its like, hey, give me your email. And then now we can send them the VSL and then from the VSL, and then they can start having that conversation with the messengers.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im maybe a little bit more old school that way. That its like a lot of people think that this shit is hard when its like, man, youre literally sending fucking messages. Its not that hard. Its people that just I dont know, maybe just getting the right people. But no, I have to answer your specific question. I have not tried any kind of.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. So thats why I was just kind of wondering, what do you guys offer? But Im going to be very honest. Im just so jaded with paying people. Im fucking done with putting money out for appointment setters and then they dont deliver and then this, and then they dont deliver. So its like its not a matter of spending the money. Im just fucking sick of spending money and people not delivering on what they promise. So even when it comes to the appointment setters and all the stuff, its just like, man, Im just going to fucking build in house because Im sick of paying people top dollar for them not to deliver. Right? So and its unfortunate. Like, Ive talked to a lot of people. Its just like, you know, kind of you you spend money, you learn a little bit. But I think just sooner or later I dont know. I dont know if its just the fucking industry and its just really hard to find people that deliver a lot of in what they say. So theres just always some issue and it just seems to be all around and its kind of challenging. And I know Im not the only one that goes through this. Im really kind of seeing again, we have a pretty small team right now. Like its me, my girlfriend, we have about three other people that do a lot of our kind of back end systems tech and all that stuff. So Im just kind of seeing how this AI tools and how we could kind of put it in and implement it. Because Im sure Ive been playing all the way around with Chat, GPT and stuff like that, but I know okay.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Now granted, Im still on the time.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"On these calls, even when I was saying even on the past, I think month and a half. Thats why I want to really start outsourcing the closing. I feel like Im drained and I dont even have time for anything else. By the time of a day when Im having fucking six, seven, eight calls, its hard to fucking turn that freaking video recording and start fucking recording things. Or like doing just from kind of like executive perspective. Its like I cant fucking do anything else.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yeah, I dont think it did actually.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, I met him in Vegas 2019. I actually just texted him but I dont know if he changed his number.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Pretty much I have a mentorship program where I help people just pretty much understand everything to do with credit, personal credit, business credit. And it gets into a lot of corporate structures and H corporations and mainly I work with business owners, mainly real estate investors and ecommerce people that just everyones always looking for more money. Pretty much.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That was the business. What is 1.1.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Consultants with how many people did you guys scale to 44 million a month?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Im getting to know you 100%, even. Just the questions. Yeah, like 100%. Youre building rapport. Youre kind of interested. I get what youre saying. Im leaning in with just talking to you. Right.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I get it. But is it five grand? Is it ten grand? Is it 20 grand? Is it 50 grand? Give me a ballpark.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah. And then theyre DMing and then theyre booking the appointments.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, we broke it down. I need literally about eight appointment setters. And it depends how optimized fucking closers are. I know people, I have a friend, I know this guy that is doing 1.6 million a month, and they only have two appointment setters, but theyre very two closers. Theyre very vetted. By the time they jump on the call, right. Like, they are qualified. They can pull up the credit card and fucking pay. And then theres another buddy of mine that literally hes literally my competition. He does the same thing that I do, very similar. And when he surpassed the 10 million, the million dollar a month, he had ten closers. Right. So I think it just really comes down to how optimized things are on the back end.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Are there charges to the AI software or thats like no.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Miami. Are you guys what? Scottsdale, arizona or something or what?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Gina. Gina.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. So thats kind of what I want to know.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats a two hour training. He couldnt fucking thats like fucking Sam Oven shit. The fucking two hour trainings of fucking Sam Ovens. Its like mad. Come on. You can fucking especially Sam ovens. I think hes fucking great, but hes fucking boring as hell to listen to.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"I think it would be effective. Like, I wouldnt be doing it though, right? Like, its not you know what I mean? Its like for me to just start sitting on the fucking phone and almost calling. Im taking the appointment, so Im fucking closing. I can out. But right now, to be honest, Id rather automate it when it comes to VSL to come to everything. Would it be effective? Yes, probably it would be effective. But its also training kind of exactly what youre doing. Because again, Im the one that does all the closing. Kind of like the questions that youre asking and everything like that. Its also like training someone to fucking go and do that and be effective at it. Right. And I know this for a fact. Its just like a big problem that a lot of people have. And its just finding quality people on people that are like and at the same time, its also our leadership and making sure that were getting the right people. Thats just the bottom line well pour into them. But then its like, man, if I hire an appointment setter and theyre sending fucking two messages in one week, its like, dude, and I used to work on gas, so Im like, in twelve years, I never fucking missed a day. Its like, these motherfuckers can be taking a shit and freaking messaging and youre telling me that he just cant fucking message. You know what I mean?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"If this would be beneficial and its fine, we can jump on a call. So whats the actual offer? I know youre not supposed to say. I know the whole process. I do sales, weve studied this two step closing, fucking tons of time. I know the whole process. And I know youre probably not supposed to say it, but its fine. Do you guys have one package, like one offer? What is it exactly? Because when it comes to and again, weve built a shit ton of SOPs and optimizing and everything like that, I do understand that doing the AI would probably be a little bit different, which would just be kind of adding everything to our systems. When it comes to again, Gina is the one, gina right here beside me. Shes the one that has dealt with a lot of the kind of SOPs and the training and all that stuff, but I just kind of just really want to know what the offer is, how much is it and all that jazz.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. No, theyre not calling.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Whats that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I got hundreds of thousands of dollars in credit.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Good, how are you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I need to see everything in written.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I was wondering what it was all about. Yeah, I know. Ive seen Caleb. This is Calebs company, right?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Talk to you soon. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"To be honest.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, just booking linking link. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Do you have a calendar or how.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Id say about probably, say kind of four times five. Id say probably anywhere from like 70 to 70. 80.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Hold on a second. Monday two would probably work, too.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Like I say, Im in sales and I do the shit also. Its been great.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"HeS been doing a lot of podcasts and stuff like that. So Im sure a lot of that also counts. Right.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Theres just not and I know that weve talked about it here with my partner. Like, I just told her, from the time that they book to the time that they show, like, the call is done, theyre not getting emails, theyre not getting case studies, theyre not getting testimonials, theyre not getting like an influx of like, hey, go watch this video.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And thats like going by the KPIs that we kind of had with closing and no shows and things are not, like, super fully optimized.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Man, it fucking varies, to be honest. Well have fucking six digit month and then it freaking goes to freaking 2030 and then it goes back up. Obviously Im still doing everything organic, which honestly, weve done fairly good to do organic. And again, we launched the offer last year. We surpassed the seven digits and we kind of built. But Im just really looking to we even tried Facebook ads. We had an agency, were optimizing all that stuff. We hired someone to help us do a lot of the strategy, which is fucking great, and Im just waiting to launch it, but at the same time, I dont want it to happen the same thing that happened last time. Kind of like, you guys have your systems and people calling right away. And I think we just need someone kind of calling and we need someone to follow up right away. So theres no money being left in the table. So thats kind of where were at.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Come in. Im bringing up my better half over here. Honestly. Okay? So Im just going to give her whats better half name my better half. Shes literally the fucking back end 80% of my business, and shes my better half on a relationship way too.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Shit, a month? Yeah. Fuck. Id have to look, Id say probably.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Correct. So there is no nurturing in between. I know, thats why, right? Like, one, thats why. And then I dont know if you know this other guy, he talks about the seven hour rule, just giving them making them consume a lot of my content before they jump on a call so that theyre already one. Right. So thats kind of where were at.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Or Mosie.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"100%. I agree with that. Anyway, I dont feel like I burned my the audience that I have. It is kind of burnt. Right. I might be getting like, people that are following me here and there. And its mainly instagram. Ill get about four or five appointments a week just from YouTube, from one video that I have that has done great. So I only have like eight videos up. But again, its definitely not at this point, I got to pour some money into the ads and make sure that thats kind of working on that end to be able to scale to where I want, thats for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Daniel, Im just going to give you okay, give me, like, 30 seconds. Im going to give her anyway, its his company. Theyve been scaling companies out. They scale their company up to like 4 million a month, right? So theyve been using AI, and theyve been using AI before. Chad GPT. Theyve been like way fucking before. Because Ive been watching them, I started getting I dont know, Id seen their ads, and theyre utilizing pretty much AI to book appointments to do all this stuff. So I just kind of give him a little overview of the whole business. I told him that we need about 700 appointments to be able to cross the million dollar a month, like the whole fluctuation and everything like that. And the appointment setters and the closers. And pretty much give him the whole now he just said to me, and Im going to get you to repeat that theyre using AI tools to dial. Im actually going to let you take the lead here because Im pretty much just getting to the point. Im like, what is it that they offer and how are they actually utilizing AI to be able to do all this stuff, right? Even their fucking message, their text messages kind of annoyed me quite a bit. But Im like, this is probably super effective. Im not going to lie. Im like, stop because I know the freaking thing will stop sending you messages because I figured it was AI. But go ahead, Daniel. Im going to let you kind of take the lead here when you started talking about the ads. So pretty much that while doing organic, you guys are not going to be able to get to where you want, which is fucking seven digits a month or 700 appointments. Its just not going to happen. So. Yeah, Daniel, go ahead.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And then one of the things they just need to get better at fucking qualifying right now, even if theyre not super qualified. I did have a kind of unfunding offer where they could get funded. But the problem is that theres a 90 day recourse and we sent a few people and then I had some people go through the full mentorship and then they just stopped paying. And its like, now I have to fucking pay this company back some, like, 30% of what the actual thing is. But still, its kind of not optimal.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Because I have some question how it works. Once the lead comes in, this AI platform will dial it by itself and then it says like an intro message or how does it work?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"My credit score is 790.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I was trying to get my son to do the fucking Apex for kids, and he never did it. I still have a fucking video message that Caleb sent my son. It was funny.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I dont invest. I invest zero in cash.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay. Is this automated too?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, because as you probably know, I think theres like a 400 to 500 increase in closing when they get reached between five to 10 minutes of them actually opting in.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And then what was the second part that you were talking about? Yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, we will.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So I have an offer where I pretty much teach people how to do it themselves. So its a mentorship. I pretty much launched it last year, took it seven digits and we paid for some stuff. Just kind of coaches and everything. We were kind of optimizing the systems when it comes to sales and everything like that. Im still closing 100% of the sales right now. Just kind of looking for a closer and weve been kind of doing appointment setters and everything like that, but the appointment setters, I dont know, they go in and out all the time so thats kind of where were at. Were pretty much trying to scale but we dont have a shit ton of appointments to even put a full time closer. But Im just being very limited right now on the Im still taking the calls and I just cant just even today I take it to record videos and do things for marketing on the business itself. So obviously were kind of looking to see I know theres a lot of AI tools that are when theyre set up correctly, they can be very beneficial. So Im just kind of really wondering and I know part of the reason why I havent really seen the study, the case study, but I know Caleb was in this way before talking chad GPT kind of blew up kind of thing, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So just things like that, again, thats going to work.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Or Dina Gina? Like Georgina, but I like Gina.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"My goal has been the seven digits a month for fucking the past year, but I think thats pretty steep unless we freaking hire more. Like, I literally know exactly what itll take to get seven digits a month. We need 700 booked appointments per month in order to surpass the million dollars a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, thank you very much, Daniel. Much appreciate it, brother.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Daniel, if I can hire someone like you on my fucking company, Id be more than happy if you guys get me fucking people just like you. Im like, youll make my life a hell of a lot easier.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Okay. Yeah, were using the same. Im actually going to be white labeling. Im creating a credit OS, which is pretty much thats another thing that we just add into the business just to have just a recurring thing. Right, perfect.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Like kind of what youre doing. No.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"He spent $140,000 on ads and plus.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right, that sounds really interesting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So right now, our main process is Instagram and YouTube. Im actually recording a lot of YouTube videos right now, which is what I was doing. Im just fucking having trouble with the tech here, but pretty much its outreach and then I do nightly posts. So every single night from 11:00 P.m. To 07:00 A.m., I post testimonials, I post results and stuff like that. I keep getting an influx of thats been working great for me. Literally. Thats how were booking right now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Probably afternoon.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Its honestly in the past month fucking being super bad, but, like, average like 25% to 30%.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Gina, gina. Gina. Thats why? Because she always says that Im on easy sell. Shes like, youll fucking say yes. To everything.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"No, not at all. Okay. Well be showing up. Dont worry, bro. Im the one that takes the sales. I dont hate theres nothing that I hate more. Fucking sitting in there and freaking. So I understand. I hate that more than anything because its that fucking empty. Dont worry. Im very respectful that way.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I also want to get this clear. Is this going to be like and again, like I said to you, Im very hesitant with everything. And believe me, I met Caleb. Hes a great kid. Ive loved what hes done. And what Mattis is that right? What was he done? So Ive been a big fan for years, but my question was, okay, so say we move forward, right? Are we going to have to then on top of that, hire fucking appointment setters and train all these people and do all this stuff? Or is that included in the offer?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"No, its fine. Again, Im not afraid to invest because I got a pretty high ticket offer too. I got a 50 and a $75,000 offer, and Im looking to make it $100,000. But it needs to make sense for people. And the more that I can again, as you do more things in business, things like that, especially with AI, this is where youre riding the wave pretty much. Right? So the earlier that we can adapt it, the better that it is.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"What do you guys use for a CRM to do all this, like automation?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Hey. Shes the Leila to my Alex, if you know what I mean.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, so repeat that again.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Soto. Sotosoposotoi was not going to answer, Daniel. Im not going to lie. He just took 45 minutes of my recording video time, but thats okay. Hopefully it was worth it.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I literally just posted it because we just applied for the seven digit award that this one guy has not through click funnels. Im going after the freaking Two Comics lawbacks award. I havent even received the Frickin because I just havent run that many funnels, to be honest. I dont even know how they do it. I got to figure that out.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, were here. Just give me a second.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Our show rate right now? Fuck. I think it was like show rate is like a freaking 60% more or less. I should know those numbers a little bit. But right now, honestly, what were doing is even doing like, a lot of the I dont know, Im sure youre familiar, like, a lot of the homework videos. Im just kind of optimizing that on this week. So they watch like five, six theres like eight videos on a page with testimonials and things like that. And were doing also that for the funding offer. So I also do funding for people, but thats specifically people that have really good credit, and we just help them get 0% credit cards. So I get them anywhere from 100 to 200 and $250,000 for their business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Tomorrow. Were not doing just on Monday. Okay, on Monday.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"That would be my next question.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yes. So what Im wondering here is literally, what is the AI? What do you guys got? I understand youre asking questions, but I literally just want to know what is your guysoffer and what do you guys offer?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}}]