[{"pageContent":"Ive been through about eight surgeries, and so Im hoping one more to go.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Have you ever heard of Agency Box?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"No, not on the marketing.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I have it in the plumbing, electrical.","metadata":{"fillerID":47,"fillerText":"Mhmm","category":"G"}},{"pageContent":"I really dont have I hadnt set a goal yet. Im 64 years old, Im ready to retire, but weve got a business here of our own. We do plumbing, electrical, heating and air, and one of my sons is running that business for us, and so were still involved with that to some degree, but mostly him. And I just wanted to eventually turn it completely over to him and me do something else.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Central Time.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Because I told you I was involved in something already today and you understood. So youre going to give me a little quick rundown. Well, man, this is not a quick rundown. You tied up some of my time, but I couldnt do it. Now I cant get done what I want to get done.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"May be where I made the contact because I was interested. I used to preach and I was interested in trying to get into something, a speaking gig, and Im not sure if thats what brought me to you or not.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im sitting on my ass out here in a wheelchair and cant go anywhere and my help has run off and left me.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Let me ask you a question. Are you just selling this or is this something youre doing yourself?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Not really. Like I say, I actually have kind of went out and bought me a laptop because I hadnt been on I mean, Ive had several jobs where everything Ive done has pretty much been management type work. I had just left a job from a company called Debold Banking Business. Debold is a very large banking business. It deals with setting up the bank, the ATMs, the vaults, the security cameras and everything. And I was a site coordinator for overseeing that being done. And so during that time, I never shut down my own business. I kept someone working and kept someone keeping my own business going. But for a while Ive just kind of dropped the marketing thing. I mean, I paid a dump $6,000 into it, so I cant just drop it, but Ive got to get back at it. I havent been active on it right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont know. 60 maybe.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, yeah, it frees me up from having to be stuck here at home, and we wanted to get out and travel some, and I wanted to be able to work from anywhere.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, thats about what it takes us to operate here now. And so Im working off of that, figuring out just a minimum goal at the point, and if I can reach that, well, Ill set another goal.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats kind of what Im okay. Thats kind of it, yeah.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I was just looking at a lot of different things. Ive been bedridden for a year and a half from a motorcycle accident, and so Ive been reaching out to or just doing some research on a lot of different things that I might could do from anywhere I live. If I want to move somewhere else or go on vacation.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"The program that Im with has every bit of that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Like I say, I probably went into it a little bit quick. My wife put me in the doghouse because I got into it. But anyhow, honestly, you listen to somebodys spiel and next thing you know, youre talked into something that, you know what? Really werent sure thats what you want to do anyway, and thats where Im at.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Im really not sure because Im not sure what I was going to be involved in. An appointment to market a particular just with one customer. Im not sure what Im going to have to be doing.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Thats right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, well thats the company that were with that Im with, agency Box.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"HavenT had a wallet in my pocket since for the last year and a half. I dont even have a I mean, Im just like, kid, go to the store and I have to ask Mama for the money.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Simply because Ive got my son running the business, but we still deal with the payroll, and so my wife has to be around to help with that. So I guess, yeah, we are still kind of kept here a little bit, but as far as what Im doing for the business is just basically Im the brains of it because its been my business for 30, almost 40 years.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, is this what youre going to be dealing with is mostly marketing?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Thats true.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, okay, I understand.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, no, Im out here with my sons trying to do some yard work. Cool. Anyhow not a good time right now.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I would probably be doing it on my own.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I know. Shes going to be almost right around 700. Im not sure what mine is.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im not sure. Im involved with another company in trying to start up marketing business.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So theyve got $6,000 of my money, and I cant even get a damn T shirt. You know what Im saying?","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Well, you kind of caught me a bad time, man.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Ill have to see. Ill have to look over what youre sending me and then Ill go from there.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, thats fine.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I think we no, not really.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I think I could do that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I understand what it means. It means someone who cant qualify and then I can work with them and get them qualified.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Is this something youre going to send me, or is it something were going to talk about?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, yeah. Ive been down, like, I say, a year and a half well, since November of 21.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Were not going to have much, and I dont know, Im not even going to throw a number at you. But like I say, weve just gotten involved with another company. Mine and her both are very interested in that. And again, thats dealing with the airbnb and other kind different area properties that you invest a certain amount and the company invests a certain amount with you. You know what Im saying? So its kind of a partnership thing, but thats where were going right now. Im really not going to be interested in doing anything else right now.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"I really dont want to. No?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Im not standing right beside her. Im out in the yard, shes in the house, and Im in a wheelchair, so I cant just run in there.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"And I think its something box. I cant think of the first name of it. Something box, though. And then we just invested $1,000 into another company that were very excited about thats going to be dealing with airbnb and some other trading, but they trade for you. So its more of a smart persons trade with some high end investments. Its not taking any much of a chance at all on, but anyhow, thats where we are right now. And like I say, Ive just been looking at a lot of different things.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"At this point, I would say possibly three.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I really dont know. Were getting ready to refinance two houses and pull some money out of both of those, and so Im really not sure. Im not the one been going in and talking to my banker. My wife has, and shes not standing here with me right now, so thats the best I can tell you.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Like I told you at the very beginning of the call, this really wasnt a very good time. And Im sorry, Im not trying to be rude or anything, it just thats the way it is. I mean, were doing something else, and I couldnt tell you off the top of my head. I heck, I dont even know how many miles my car has got on it, you know what Im saying? I dont keep up with stuff like that.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Well, anyhow, go ahead.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Anyhow, it is a good company, a well known company. I cant think of the name of it right now. I know its something box, but like I say, my head is kind of fuzzy, and Im just not thinking about it right now.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I dont know.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I know it would be like I said, Ive got other things going on. I just want to see what youve got to offer and then take it from there.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Its almost 03:00. Its 258.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"It would probably be my thing only.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Were in Mississippi.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im sorry.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"I can appreciate that and I really do. But if youve sent me something and are you going to send me something else for me to look at, give me time to do that and then lets talk again.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"If something comes up and I cant well, no, Im not going to be paying $100, right. Im not one to cancel the appointments, but if it happened, some things are out of my control.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"She wasnt interested in getting into other marketing business with me, so I dont think shed be interested in this. We did find something we were both interested in, and thats where weve been kind of decided to focus our time and our attention on. And we are going to do that. Were wanting to get ourselves, first off, where were bringing in about three grand a month and then work it up from there.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I dont.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, then do this for me. Do this for me. Send me what you can send me and cancel the appointment.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"I would like to be doing about between 6000 a month.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I dont.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Not online, no.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Man, youre asking me a whole lot of questions that I have to say no to. I dont know. I dont have a clue. I can honestly say this. I have gone from this is not a very good time right now to you keeping me on the phone for 30 minutes and I dont know what else to tell you.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I dont know right now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"That sounds about right, yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Not really. Okay, because like I told you, Im new to the marketing thing. In fact, Im not even there yet.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, I cant answer for her on whether she would be there or not. Got you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Probably not.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, listen, youre a very good salesman and youre very persistent. I told you at the very beginning this was not a good time for me. My boys have walked off and gone back in the house, and Im sitting outside in 80 deg weather not getting anything done. And so just send me what you can send me, and you can put down. I can set my own schedule with whats available if I decide to do that, but Im pretty much done for today.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"No, not really. Like I say, its kind of new to me. Its one of these things where you get involved with it, and then the next thing you know, theyre supposed to send you a T shirt. Well, hell, I aint even got the T shirt yet.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Its very possible.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Most of the time somebody asks me what kind of vehicle you drive? And I say, I dont know, lets go look and see.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I doubt it.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Or Im hoping to be back up and walking by, I hope by September, at least. Wow, youre strong.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, I just told you I wanted to cancel the appointment.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"06:00 P.m.. 06:00 P.m.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"If youre going to do that, then lets just say it like this. Why dont we look at weve got three grand to put into the business and then send me what youve got to send me, and I can take it from there?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]