[{"pageContent":"But I have investment. Investment? I have savings. And thats what I was planning to move on for the next 50 years.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, I dont. I got LinkedIn, I guess. I got like one 8000 hundred people on that, but thats it. I dont even know the password. I probably shouldnt figure that out.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Oh, no, Im sorry, I misunderstood. You called from a five five nine number, but anyway, sorry, go ahead.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yeah, I dont want to go to an office.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Sorry, Billy. Yeah, you texted me on my Google voice or somebody did and it had my number on it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Lets get this 105 pages unformatted and its good, I think. My moms a law professor. She said its very good.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I do not know.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Awesome.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"This is Billy. Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, that would be okay. That would be exactly what I make in a law firm for a lot less like bullshit.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yeah, I want to be on the beach. Yeah, totally. If I ever could wear a Speedo in public, that would be the dream. No, just kidding. But yeah, COVID was an awful thing, but it sort of opened my eyes as to what life could be like a little bit without the death, obviously.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Well, essentially its just a factor of what my billing rate would be if I was practicing law, so cool. The idea would be if you do the math on $800 an hour of counsel at a big fancy firm before I went in the house, and I deal captured it ebay and you do the math, it kind of breaks down to about that number, but its all dependent. That was variable. Some months, Id have much bigger months. And the bonus was always like 200 grand if I had to put on a napkin. Thats what Id say. Essentially, its replacing a billable rate.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Yeah, because thats a stupid thing for me to do with almost a million bucks, but I really should do something better with it. But I was kind of not sure. So its not invested. Its just like a liquid account. Two liquid accounts.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. I got ten minutes.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Sure, yeah.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Like around early afternoon would be great, but Im flexible.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, but I need to think it through. This hang on, though. I was thinking be doing one deal at the firm. So yeah, Im around 100,000. If somebody told me it was like a used car thing, it had to be like 999. Thats fine. But yeah, itd be like around 100 grand.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, I did like, a lot of tech, M and A and DC, so essentially it could be deal structuring. But to be honest, my passion is for artificial intelligence. Ive been super into it since it popped in December. And my wife, I even helped her, she had eight emergency surgeries for an abdominal issue, and I literally drafted a prompt that became essentially Harvard Medical School, her pocket. It was really helpful. And then I started. My passion is essentially like prompt design and prompt engineering, but really anything like tech business. And then to narrow cast it, I would say tech transactions, investor optics, that kind of thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, well, so Im like a longtime corporate lawyer and I worked for AAA and Ebay and before that, White In Case, which is a big fancy New York firm. And I dont know, I was looking to get into non legal consulting. Im sort of like semi retired, but Im too young. Well, basically Ill tell you the real story. Basically introduced me to this guy, like a social contact. The guy paid me $10,000 for like a morning work to do, revise his AI prompt for syntax. Basically when you say something kind of help somebody dial in what you mean? But with a prompt it can sort of create blind spots and so anyway, somebody paid me like a bunch of money to basically work from like get on a call and chat with them and it buys them 6 hours.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, thats great. And the big questions I would have would be around scaling. So that would be wonderful because 50 doesnt sound like enough. Its got to be more. So how do I get there?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Before the call? Correct? No, I cant do both in one day. Let me do the video tomorrow and then can you book me for Tuesday? Is that all right?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, absolutely I did.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"You too. Like when.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Thats great. And then this is embarrassing, but I just bought that domain name. Did I give you just my regular Outlook, just so theres no fucking it up? I think I did it right.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Okay. Yeah. Thats exactly why.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"In the marina area.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Im in California. North California.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I mean, I dont have it in, basically, to be honest. I have it sort of like a Merrill Lynch accounts that are not invested.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Can you put in the notes that I wrote an ebook on topics? Yeah, I just fucking finished it and then I dont know where to put it up.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"C-O-U-N-S-E-L. Counsel? Like legal counsel?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, okay. Yeah, absolutely. I mean, I need help, like setting up an email, so Ill probably have to listen.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Put in here for my company?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I just didnt catch what that metric is. North of three grand per hour.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"I didnt your first name, sir?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Lets do a QPM.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, its Billy at Apexcouncil. A-I-P-E xCouncil IO okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"HR. Dealing with people that arent clients is the worst. And its not that I dont like people theyre like, but honestly, people try to tell you this stuff, come back.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Either I do what I was doing, but lighten up the legal work, business counseling. But really my passion is sort of anything business and AI tooling.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"700, depending.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, I got just me and watching a whole lot of YouTube.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"I dont know. It should be okay. Thats like my wifes department, to be honest.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"For a project costing for a month? I dont know, like effective rate. To get 50, it has to be like 75 grand. I mean, I dont I dont Im not sure I would do something that would be like a month long engagement probably. It would probably be per hour would be 1000. I was thinking of putting up online, like 2000 an hour just to see just on the theory that people buy things that are expensive without asking as much.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, well, yeah, for a while, actually. Just my wifes health thing is why I sort of, like, paused. We could make more money. Thats not a bad thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, that would be like for a full day probably. But yeah, 100 grand probably for a 30 day engagement at least. Okay, let me think it through though. That would be like a deal. Thatd be like doing one deal, right?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hey, good man. How did you get a local number?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I can do that kind of anywhere, right. But at the same time, I dont want to do this for free, and neither do you pay me for that. If you arent in artificial intelligence, thats like, what I want. Ill do all that, but I can do that anywhere if Im going to do my own thing. Artificial intelligence oriented.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, lets see. I would say nothing less than, like, 50 grand pre tax would be anything lower than that would be pretty would be like a step down, probably from a firm. I think.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ive been doing nothing for a while. I was thinking about starting to go to the gym.","metadata":{"fillerID":44,"fillerText":"Yah totally","category":"G"}},{"pageContent":"We can pick this up tomorrow though, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, this is good. Ill definitely do that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Outside my 401K.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"HR?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Awesome.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah, its Wdentino@outlook.com, as in William. And the other one is like a legit. I mean, its like a cloudflare domain, but if I get emails on it, I wont know if I dont.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, exactly. If you asked me what it would be, and I was like, well, my rate at the firm was 860 an hour, and I was like, I dont know, all day. Hes like, might be two, like, ten grand. Hes like, done. Literally. Yeah.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I like it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, cool. Yeah, man, I lived in Marina for a long time and whatever.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Are you credit card?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, this will be huge.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"No, go ahead.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im in the middle of park area. Like Silicon Valley? Like South Bay?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]