[{"pageContent":"Oh, no way. Awesome.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Because when because when I mentioned that term for people who are either A, entrepreneur or B, tech savvy, open innovation is not a concept that theyre going to really readily have in their minds. So being able to connect the dots between a platform where people can come and work together to earn an income, contributing ideas and whatever, to solving challenges for businesses, its its kind of like its its kind of a drawn out explanation. You know, Im trying to make it more concise and user friendly to the mind, I guess, if that makes sense, to where its not sounding like its too complex or above their own capabilities.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im actually in the Ventura County area, but its close to Los Angeles.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, so basically what our company offers is the opportunity to crowdsource innovative business solutions, right? Its an open platform for people to come solve business challenges and receive a financial reward for their contributions. And so we also help people with the intellectual property side as well to be able to maintain the proprietorship over a certain percentage of the technology or ideas that come into existence. So Im really just trying to see how to integrate AI features into the whole business model because I already can see this is going to be a snowball effect. Its going to take off really fast, and a lot of people that dont integrate will obviously be left behind. And so Im trying to make sure I stay ahead of that curve, or at least with that curve. Yeah, actually, I have a webinar right now, actually at 1230 as well. Pacific Standard Time to learn a little bit more about this as well. Like I said, Im trying to see more or less if theres anything that you guys do as far as anything on the back end side of businesses or is it just more or less like data crunching and stuff like that?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, the students are potential interns that Im trying to bring on board into my company. The target audience is just the general public who are creative thinkers that want to solve problems, basically. Because, again, right, its not just any one problem that were solving. It could be new coffee problems, new car problems, new whatever problems of any industry. Thats kind of where I would like to take it. But as of right now, I would like to focus on the technology industry. Realistically, my user base would be just between the ages. I would say between 20 and 35. College students, university students, things of that nature, because obviously theyre kind of more, I guess, ambitious. They kind of have the same trend thats going on right now with the entrepreneurial mindset and things of that nature. So I kind of feel that they would be a little bit more easier to reach with the message. So thats kind of more or less where I would be at with building the platform for the solvers.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. Those price points apply to the businesses that I would like to do partnerships with. The solvers or the users of the website would be completely free. So thats kind of where that comes in. So the users dont have to subscribe or create a membership for nothing. I mean, they have to create an account, but its not fee based or subscription based, so its free for the users.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, thats exactly the key. Yeah. And a lot of people dont realize that you could talk your ear off to somebody that agrees all day long, but if they dont have the authority or the finances to make that decision, then its kind of an effort that can go elsewhere.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay. Now, would it matter on which end of the spectrum that falls? On whether it be, lets say, the solvers, what well call them solvers, and then the partnerships with the companies? Right. Would that be in terms of new business clients or new users?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay. And then did you come up with those prices or are those prices you have to do because of your partnership?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, thats based on due diligence and other market research.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, it is.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"And what are the price points?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Kind of pretty much yeah. We are able to connect other like minded individuals to companies who need new ways of thinking.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Marketing, okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"How much do you sell those? Are you the one thats going to be selling them? Yeah. Youre the one thats going to be offering the price point and collecting the money, right? Like youre the one selling these products?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"How do you get paid?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Awesome. Thank you so much for your help and your time. I appreciate it so much.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Absolutely. And just remind me of your name again. Name?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Kimberly. Kimberly, okay. I remember that. Ill save that in the phone. If for whatever reason Im not finished with that webinar, then I will definitely reach out to you as soon as thats finished.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im actually doing pretty awesome today. Thank you for asking. Good. Yeah, I just want to thank you first off for returning my call. Yeah. When I received the text, I wasnt really too sure who that was. I just gave the number a call. I seen your guyssponsored ad, I think it was on Instagram, I believe. And what really just caught my interest about it was the AI aspect. Right. I know a lot of people are kind of leaning into that whole ordeal as well as myself because I too have an open innovation and technology company. And so I was really just trying to learn a little bit more about what you guys do, the type of services or things that are kind of offered and what is to be looked forward to working with Air AI.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, awesome. Bye bye.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right, of course.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Those are the solvers, the people that actually use the platform, and then the businesses. Obviously, Im not going to try to market to multibillion dollar organizations because they have a lot more resources than I can even probably offer at this moment. So my thing would be targeting smaller companies with the general revenue of what? Lets say 500 to 2 million annually, just because I feel that that would be a little bit more realistic, in a sense, to provide value to them with information or knowledge or things that they wouldnt have at their immediate disposal.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats impressive.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I do have time.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello? Yes.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"The businesses are the okay, so basically, our initial revenue generates from the memberships of the companies that want to partner with us in order to have access to our Platform and post their challenges on our platform so we can host their challenges and then the users relinquish a percentage of their financial rewards for being able to utilize the platform.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, absolutely. And I know these type of ventures, in any business relations, youre only as strong as your team. So I definitely look forward to learning a little bit more about you guys and getting information and like I said, remaining in contact and moving things forward.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"The other businesses. Yes.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, see, thats kind of the thing. Ive only basically reached out through the colleges to be able to try to tap into the student base that they have. Right. But I havent actually yet really launched any formal ad campaign. I have a couple things with the Google Ad, I think a little thing that I have with them. But I havent actually used anything to really promote myself yet because Im kind of in a dilemma. And this is kind of the chicken and the egg thing, right, where its like usually as an right. It is. Especially with the service, in a sense, with the type of service I would like to offer only because I cant offer a company, hey, look, we got a network of individuals that would like to solve your problems, but without the larger network to be able to solve those problems. And we cant say, hey, well partner with businesses to solve problems if we dont have businesses partnered with. You know what I mean? So its kind of like I want to build the user base first so people get interest in actually wanting to become part of the innovating process. But Im trying to think of how to leverage the psychology behind it because obviously peoples interests are self governed. Right. We can only kind of persuade them as much as we can utilize the resources to. But the thing is, for me, is really just getting people aware, the brand awareness, just getting our brand out there, and then being able to explain as to why this is something thats valuable. I mean, I have all this stuff up on the website and stuff, but Im trying to condense it into marketing material. Im not trying to create a whole pamphlet or a booklet on what we do and how we go about it. I wanted to create something real short, real capturing, and just draw the attention of the people who I look to eventually become users and solvers on my platform.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. No, of course Ive studied the marketing and advertising.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Nice.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. Before we move forward, I would like to ask a question about the software. Is this proprietary or it is. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay, perfect.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay, thats fine. Okay, perfect.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Hi, Kimberly. How are you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I want to say its an hour long, but it didnt really specify, but I would just assume anyway. Would you like to make contact again today or would you like to schedule another time?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And do you know how much what those price points are?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No way.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"And well, see, the thing is, we just incorporated last year, right? And Ive actually just partnered with the I dont know if youre familiar, but theres a college program called Handshake for students to seek employers and things of that nature, right. And so we partnered with them to provide internships to the local colleges and I think to UCLA and USC right now in California. And so, long story short, though, were kind of building the whole foundation of the team, basically, right. We have a website already built, but its not really too high end with the necessary features that I would like to have on it. Right now, Im looking in, trying to either integrate AI with my platform, which Ive already talked to a couple of people about, but the thing is that really what Im really focused on is being able to provide a platform to our user base, to be able to crowdsource innovative business solutions, which is basically what my company is about.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, absolutely.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yes. I think the biggest struggle just to kind of give you this is kind of a real crucial point, actually, matter of fact, just to note, because I was actually talking to somebody the other day about these new business cards that I just got in, right, and hes like, oh, yeah, let me check them out. So I give it to him, and hes like, I dont get it. What do you do? Im like, well, it says it right there. And the thing is, what Ive noticed as a struggle for the collective consciousness is understanding what open innovation is and what it does. That is a new term. Its not new in the sense, but its new to consumers. And so that, I think, is a real focal point in really gaining the clientele that I wish to acquire. Maybe if you could just kind of make a mental note of that, I guess, moving forward, because thats really where Im struggling with as well.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Your industry, right? Yeah. Because we dont know what we want until we see it. Yeah. Okay.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]