[{"pageContent":"Right. That is the key.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Thats not really my thing. My problem is that my all you could do list is 20 deep, right. So narrowing that down to the core things that it is right. And then structuring a program around those core things. See, I cant work with 20 people or 100 people the way I work with these five. Even though my mind follows a system, I havent correlated that into a structured process that I can apply a million times.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"You said the words good job. Those are good words.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Now, thats growth and travel money. When you get to think thats a plateau, right? Thats 50,000 a month as a plateau. And I think after that, they come in increments of maybe 50 that are plateaus to climb and aspire to get to the half a million market. And at that point, youre trying to figure out, how can we get three quarters of a million and then from there to a million, right. I cant even see that in terms of thinking about goals and processes. I was explaining to people that the higher you go, the different the land, the more difficult the landscape. So from where I am, all I see is hills. But as I climb the first hill, then Ill be able to see more of the landscape and make better decisions. But from where I am, its just this is Valley territory right here, right? There you go.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"What I told you was that Im licensed in over 40 states.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"You might make my eyes water. Math excites me, man. You might make my eyes water. I might say it wake up.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"For the most part, yes. Okay, so that is both blessing and curse. It is what it is.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thats pretty straightforward.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Im sure the 5 million, $4 million a month guy, he might be meeting with some $100,000 clients, but the majority of that time is not spent thats right. Hand to hand combat.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im a math guy, so I do math real fast.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, so thats central time.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay? Matthew Im fine. How are you, sir?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I do. Im actually in the process of addressing my business credit and working on it right now. So Im in the six S. Okay. But in about 30 days or so, I should be at about 700. I probably need to add one or two trade lines to that to make that a functioning credit model. So Im probably about 45 to 60 days away from having a credit I need to acquire business funding. I could probably get some little things now, but Im not messing with it because those things it might help me in terms of immediate cash flow, but it hinders me in terms of adding things adding things to my overall credit usage that I dont need yet, and waiting down with extra inquiries and things like that while Im trying to get it done. So Im waiting until Im a sure thing, and then I want to take enough capital to be able to do what I need to do. So for that next, after, like in about 30 to 60 days, therell be 30 to 60 days following that, my credit score will go down because my used credit or my available credit versus the use is going to be pretty high.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No matter how good the ingredients are? Of course. Obviously, if you cook it with garbage, youre going to end up with garbage. But more often than not, if you took it with lesser materials, with a superior process, youll get a superior product.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So a part of that is for me to show people how things that they think are not related are related. Right. So youre thinking that the conversation that you had at home and how the order of your household is not related to how your business works. Because when you leave your house, you close that door and then you open up your business door. But the problem is that so often you brought from your house, your house stuff into your business, and the practices look different, but theyre the same. They look different because they have different things in the process. Like I said, mika and cake. So it looks different because instead of using flour, I use brown sugar, whatever. But the ingredients is not the issue, its the process that matters. Does that make sense?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I apologize for that, but Im looking and Im a few minutes off of an appointment that I should make. Can we schedule a time for me to look at essentially what would be the presentation? Im thinking can we schedule a time for me to do that, like early in the morning?","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"This is way more conversation that you would have with a person who did not make a sale today. Thats crazy. You asked me the question. Im giving you there right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, I dont have a question about it, no.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"At minimum, I need to figure out how to see 50 to 150 grand is kind of like a number, because 50 grand takes at least over half a million for the year. Right. And so 50 grand is kind of like that minimum standard number where people can look at that and say, well, thats significant. 20k is a good month. Right. But in terms of consistent production, in terms of consistent income generation, I dont think thats a strong enough answer. Right. So when you say fifty K, you can also say in excess of $10,000 a week, right. So those numbers become inspiring and attainable, and thatll be your fallback number. So even when youre at $100,000 a month, youre able to say, weve scaled to $100,000 a month, but I can remember, were just trying to scale to ten grand. I did that, I can show you how to get there, right? I did that, I could show you how to get there. But when you add, like, $7,000, how does that equate? Thats like somebody can have a job 7000 a month. I can go to work with somebody, and they will pay me to do some autonomous job that I just walk in every day, solve the same problems every day, go home and have dinner, come back and solve the same problems again tomorrow.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats to drive income.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its business related, but I guess in essence, youre right. But not for the same not general purposes. Not just me saying, Im going to be a marriage counselor today, and Im going to be a relationship counselor tomorrow, and Im going to be a business counselor next day. They talk to me about the business theyre in, and my job is really just to help them answer why questions to get to the core of the problem. Thats my biggest tool. Why? Some guys, they had AI, who was the answer? Right? Okay, Id be the why. Right. What is going on? Thats not my question. My question is, why is that going on? Well, because its snowing outside. But why is it snowing? Thats the way I deal with it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Marketing is money. So thats the thing too, because if I had more money, I could market. Even if I was just doing face to face clients, I could put more face to face clients in not just throwing money at it. But I mean, obviously, if you get saved by more people, more people get to identify with you, an imprint. And the people who have the need maybe connect if youre in the right direction, if youre in the right area.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So thats why Im at right.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Thats what that plan looks like from there. And Ive seen people develop that. Ive seen people scale that and develop that into a full scale coaching business. So that was probably what was in the back of our mind in terms of driving that direction, teaching people the game, teaching people how to honestly oppose the game or how to be successful, how to win and what precludes you from winning and kind of like taking away some of the lies that people tell you. We have a license to print money. No, we do not have a license to print money. Its a process, and some people get lucky and circumvent the process. So some people get lucky, and they got four friends at their old job. They roll over four, one K, a half a million, 2 million, 3 million. And that sets their business off. Thats great, and it happens, but thats luck. The way this thing has to work is the way it for sure works, is you invest in funding yourself. Its like you walking on the red carpet. You throw the it out in front, you walk up a few feet, go to carpet out in front. You walk up a few feet, go to carpet out front, you walk up a few feet. You throw the carpet out. The next time, after youve done this for a while and somebody picks up the carpet and they start moving the carpet ahead of you, you got to catch up, because what youve thrown on in front of you is now coming to meet you.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ill be more than happy to do that for you. Youre sending me an email?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"But I got to pick one, and that has been my problem, just like today. Thats been my problem my whole life, and Im 58 years old, so its really a challenge. Theres no set. I dont want to say its a character flaw, but its definitely a challenge. That thing about people saying, you ever heard that phrase, jack of all trade is master of none? Heres the whole phrase, though, just so you know. Jack of all trade is master of none. But still, thats better than mastering one, right? My problem is that I got a bunch of cars on the table and I do a little bit in each one. And so it doesnt allow me to have enough depth of experience. Well, not experience, but enough depth of success for one of them to be my overall success model. One of them to say, you know what I mean? He did $20 million in sales, or he did $20 million to help people raise whatever.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"That is literally super impressive. Just to give you an idea on how impressive that is, to me, my numbers look like this. If I put 50 leads in the pipeline, Ill probably contact about 60%, of which I think is pretty good. I know 60%. Ill probably have another 40% of those people who become appointments, I will close on the people that show up, which probably is like another out of that 40%, Ill probably get probably 70% of them actually show, and Ill close 50% of those. So what that means is that what that boils down to is I said 50. Thats like a 10% close ratio, right? So when you say we had a 90% show ratio, obviously, if I learn how to have a 90% show ratio off a list that I bought or generated, my God, life looks crazy right there. Because that means out of 50, 45 people showed up, right? If I talk to 45 people, I dont care who they are, I dont care what they I dont care if I talk to 45 people, Im going to close half of them joints. I dont care. I dont care how intelligent they are, okay? What their educational level is. Im going to hear it. Ill adjust. Ill close half of them door. Ill do that. Thats probably the most impressive thing anybody said to me. And you get these calls, and many times you pass by asking, right? Some guy told me the other day that they do some magnificent work and its a great process. But then he said this in the midst of his presentation. He said, we get about 800 calls. We have about 800 calls come in every month, and out of those, we close 40, right? And so Im saying, Wait, if I break those numbers back, for me, thats not worth me giving you ten grand, right? I understood intrinsically, in his mind, hes saying, well, 40 represents for me ten grand. Thats 400 grand. And the people who I talk to have larger tickets, so maybe thats worth it for them. Do you know what Im saying? But for me, on a basic level, if you can only close, if youre only closing 5% of the people that you are going in your business, how can. I expect you to do better than that in mind. And I dont have the privilege of the ticket at the ticket level that you have. Does that make sense?","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"I am.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"So its kind of all related to their business, but I dig deeper into their business to find out what the issue is thats really hampering their business. And its often not rooted in the business. Its often rooted so often in personal stuff that has them not been able to grab the phone, not being able to take the call, not be able to be straightforward, not be able to address the issue. You know what I mean?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Basically, I do two things well, more than two, but in the financial services arena, Im essentially an insurance salesman, so I get paid by commission versus insurance, health insurance. However, I do provide some services in terms of coaching. And really, I guess, to be honest, its kind of like an overstatement. I have maybe five clients that pay me and three of them are financial service professionals. Two of them are ministers, and they pay me like $100 a month. And its nice, but I talked to them probably each of them probably once a week, maybe a half hour, 45 minutes, sometimes an hour. And so they call me coach. Thats kind of like a thing that people but I dont have enough real clients to say Im a coach. Do you know what Im saying? I have no structure. What I have the ability to do is to help people kind of understand relatively complex issues in a very simple way.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ill be able to bring that back into line. Ill be able to bring that back into line and away we go. Right. Thats what it looks like right now on that thing.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Illinois.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"From seven to ten. Usually when Im talking to people about business. Before that Im usually talking to people, but were talking about prayer. So now if you guys want to come and pray with me early, thats fine. But seven to ten Im available to set an appointment in the morning and then I dont know what the rest of the day looks like. What does it look like?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I got you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Likewise. You too, man. Thank you so much.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"That is my perspective. Now, the problem for me is that how do I need a coach, right, to tell me? How do I formulate that process that goes on in my head and put that down on paper so that I could give it to you in a book and you can read it and get it?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"ThatS a big scope.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Tell me this. Do you guys specifically focus on marketing for financial service professionals or are you kind of like a marketing agency in general and you handle all those types of clients?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Can you imagine the amount of people I can help at a half a million a month? I cant even imagine how many people I can help at that kind of scale. Thats crazy.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Oh, cool. How are you looking at 230 tomorrow?","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"So let me ask you this. That would be something that you share with me, but lets talk about because I have enough shiny objects in my life right now. And Im not calling you a shiny object, but what I do want to do is say, talk to me about, and Im not understanding this, I will probably be the person that you talk to that has a greatest clarity and understanding about the question Im about to ask you. Okay? In terms of you dont have to justify it as much. And things like that. So in terms of really being able to take advantage of some of your core services, what kind of price grouping are we talking about? Are we talking about ongoing situation? Are we talking about a one time set up for a system that is built out that I then continue to fuel? Are we talking about an ongoing relationship or we do something on a monthly basis? That kind of thing?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I dont have a problem building offers. You could tell me. You could say, Well, Ken, I want to sell the AI business, and they can do these five things. And so in my mind, let me ask you this. If all this could do for you is give you clarity and direction in what youre doing right now and make you more focused, what would that be worth to you? If all this could do for you is so I can go through like five things like that. Right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"The marketing is something thats not happening. Now, as far as the coaching area, the biggest thing thats missing for me is the structure of what would be the product. So the structure of how I can design, develop a product. See, thats what Im saying. Im not worthy. Im not ready. Right. Because I have to be able to put a product in place that is right.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I do have a business partner that I could include.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"That was it?","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Last month, I did $7,000. The month before that, I did four. The month before that, I did five. This month, right. Now, today is the 11th. 12th? Today is the 12th. I think Ive only made like $1,500 so far.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"The impact is surrounded business and things that we think are often unrelated are very related.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Have an amazing day.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Okay. So a part of my philosophy is the connectivity of issues. So you ever heard anybody say how you do anything is how you do everything, correct?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Wow, I have taken up a ton of your time, man.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"You would have called me up and say, ken, listen, Im having trouble matriculating it to my new population because of diversity issues, et cetera, et cetera, then I say stop, lets back it up, explain whats happening, explain your experience, and then lets interpret that and lets find a solution, right? So Im good at doing that, right? Im just not really a coach yet. Interesting. Im best in front of people. So like, Im best you can call me, you can call me, you can call me at 03:00 in the morning because I can I need you in Cali to do a speech on pick a subject. I need 30 minutes on pretty, whatever it is. I can come and give you 30 minutes on that of effective information. So because Im so varied on the information and the stuff that I cover, it keeps me from actually moving forward. I had the same problem my clients have. So I tried to teach my clients something that I have difficulty doing myself. I try to teach my clients how to narrowcast instead of broadcast, right? But because so many people call me from different areas and its just little stuff, people are not calling me, offering me $5,000 to speak anywhere, but people are calling me all the time. And Ive been used to giving them the information for free because basically what I do is I sell insurance, or before I was selling real estate, or before I was doing mortgage, all the same area, same deal of money. And so this other information I was given out was just basically for free to help people. So somebody said, well look, Ill pay you to help me and I can only pay you this much. And I said okay. So then they told a couple of friends and so I got a few insurance clients, financial services professionals, who call me and say, well look, this is whats going on. How do I clear up my business? And Im a ministry, so I have a few pastors, a couple of pastors, somebody to point me in the right direction, right? Thats it, really. So to turn that into a business, to turn that in reality into a business would be amazing. Like if I could do this full time. But I have literally no idea to how to get from where I am to there. And I dont know if Im ready to undertake that journey. I may not be the guy, I may not be your client as of yet. Maybe I might be a year from now or six months from now, but I would imagine I had to have a few more lives in the water and a little bit more focus on.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It would be just me.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Anytime I have a number less than $5,000, Im in the negative. So between paying my mortgage payments, car payments, keeping them on my licenses, and insurances and things that I have as regular credit, I need five grand to be zero, which is kind of a stroke.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yeah, thats good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, I have a spouse, but she is very disconnected from the business.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Tomorrow my joint starts a little early. My first appointment is at eight, so that might be a little early for you guys. But Friday Im free until ten.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im in a cash poor situation. I know what things I need to do as far as that, but I really got to buckle down and structure. I got to narrow cash down to a thing, the more specific I can be. And even though theres other stuff thats in my head, I have to learn how to partition that stuff and just pick one of these horses to ride level to the sunset. And once I do that, Ill be able to bring the rest of the horses along with me.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, lets get at it. Lets do that.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Thats why Im working so hard on this credit thing, because I need room to breathe, to be able to invest in me and my business. Right now, Im working from behind the eight ball. Like, Im working from check to check. Like I had a job working for somebody else. You get a check, in, you go, okay, wait. Okay. I got to apply that to that. I got to cover my insurance with that because you cant be in the insurance business and dont have insurance. Thats crazy, right? I got to cover this, got to cover the mortgage. So by the time I get to covering all those things and I end up at the end of the month, Im at a zero sum game, and Im starting over for the next month that cant continue. Im too old, and Im just too old, tired. So thats why the credit thing is such a big focus for me in terms of how I work that out and make sure I execute that properly. So when I go and get money, Im not going to get $2,500. Im going to get $20,000 so that I can my business properly and do the things that I need to do. Now that hadnt considered being a specific investment in specifically coaching, because I just dont have that down yet. Thats really just talking about what I can do in terms of elevating the insurance business and then maybe doing more, becoming more of a trainer, a teacher in that range, in that realm of the insurance industry.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Im not going to lie to you. Of all the things that you said we were talking, thats probably the most fun thing you said the whole time. It was just casual, brought the biggest smile to my face the whole time we were talking, because I get what everything you said has been logical, rational, and followed a regular sales path. You brought me back on track. You narrowed it down, you crystallized the information. You did a great job. Right. But what you just said to me is what impact is. All the other stuff you said, I aint going to lie.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Short time, but Ill make sure I get it done.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"If I talk to a million people, I can apply this. Itll happen a million times. If I talk to ten people, if you put me on the phone with ten people in a row, Ill follow that same mental process ten times. But I have a structured into a way where it needs to be in a process so that I can make an offer. It needs to be a process where I can say, this is our so and so framework. And following these stages is how you get to your desired end. I see conclusions when Im talking to people and I drive them toward those conclusions. Well, how do I put that on paper? I dont know how to do it. And I know it can be because there are a lot of people who are way better than this, than me, that are making money at it, but I just havent figured it out. You know what I mean? Thats like a little blockage in my own way. So I dont know how to answer that question.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, I mean, that ten to thats like, first level. Thats like the first level. I think, at minimum, at the ten level, you are breathing regularly. Right. You still havent made any significant strides at 20. Now you begin to be able to say, okay, well, now I got at least five grand to make sure I can cover my expenses for next month, and I can invest in my business this month and not put anything at risk.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So that doesnt feel inspirational to me.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Right, correct. At a minimum level, do you heard kind of where I am because Im a ground zero. So at a minimum level, what type of investment do you think that I would need? Of course, that would be tailored after we come up with exactly what services Im going to do, Im going to need right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"The thing is at hand, like people being afraid of using the phone. Well, the people on the other side of the phone dont know you. So are you afraid of every stranger in the world? Whats the issue? What is the core issue here that has to misposition? Maybe its not being afraid of the people on the other side of the phone saying no. Maybe its being afraid of what happens if they say yes. If they say yes, they eliminate a whole nother list of excuses, right? By saying no. By saying no, they give me a break kind of, right? Because I cant proceed past that point. Now its not them. Now its not me. Its them. Thats the kind of thing that people do with me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"That is literally the only number.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]