[{"pageContent":"Yeah. I dont want to get customers that are not interested in the music and film industry, or theyre not an artist, or theyre not looking to learn about how to get started. I dont need an 80 year old grandmother, that kind of thing. The demographics would need to be spot on. It doesnt matter where theyre located at.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, for sure.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Yeah, I was probably you. I dont remember. What can I help you with?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im not in front of it right now, and I cant remember. Can you tell me a little bit more about it?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Well, yeah, youd be talking to me, but I will have a team. It all depends when I get this ramped up. COVID really messed up a lot of things. You know what I mean?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I have no idea at this time. You caught me in the middle of something, so let me just send over that information, Ill look at your website, Ill focus on getting some questions, if I have any, and we can go from there.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I mean, 1020 30. I dont have a number because I didnt expect to call, so I wasnt prepared there. Im just getting started when it comes to this new business model. When I had the studio open, it was a physical studio, so they would come in and recording. We did film. We had other services that we provided. Now we want to provide those virtually, if that makes sense.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its just like a gym membership. You go to the gym and you pay $10 a month and you can work out, but you cant go into certain areas because youre not a Gold member. Okay, so same kind of concept. When the studio actually is being the physical building is built, you wont need to its hard to explain without sitting down for hours to explain everything to you.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right, Im driving right now, so I apologize.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yeah, whos this?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Ive ran Facebook ads yeah, it all depends. I dont know what you provide, so I dont know where to go from there. I could run ads for sure, but I would want those ads to be successful.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So for a basic membership, its going to get you a conference at the end of the year, music and film conference to go to with tons of speakers. Its going to give you access to a community board, which is going to be youre going to be able to network with several different other musicians, producers, filmmakers, whatever youre in. If youre a singer, if youre a filmmaker, model, whatever, actor. Okay. So theres different parts of it. So we will give you if you need voice lessons, we provide extra classes. Just like if you go to a gym, you can take a Zumba class and its extra. Right. So things like that. We havent put everything in place as far as what all you get yet. So this is still in the works, like I was saying.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Good. Who are you with?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, I have several different companies, but the one I was probably inquiring about was my music and film studio.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, I dont think there is any specific goal. I think the more money, the better.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Let me just use my trucking company. I think Gross was 470.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, hold on a second. Sorry, I was in the middle something. No, I mean, when shit happens, basically you have to readjust and readjusting. My business, I had to focus on more of my other businesses. Its not something I wanted to do because those were those were doing pretty good without me being there. Thats kind of where I was at there.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I dont know. Just going out and doing the grind.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Ive been in business for 20 years. This is something that when COVID hit when COVID hit, it basically shut our studio down. So thats kind of where Im at. I have a different model that I want to implement, like a membership studio facility with getting all your resources in one location. Thats kind of the basics of what were looking to do. So how would you be able to scale my business?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I wouldnt have them do it. This is my baby. I started with this and Im going to grow this and Im going to see it through. And thats the thing. As far as partners go, it would be the day to day operations and getting everything functionable. My background is marketing as well. So doing that and getting a foundation, which is the website and everything functionable, is the most important thing right now because I cant market it without it being functionable. So thats where Im at.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"It probably would after I check out your website and learn more about what you guys do so I can be educated. Sure. It wouldnt be today, but you can send me over your information when youre thinking about that call and go from there.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, thats fine.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right, thank.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"ItS almost close to 700.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, thats fine.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, I started focusing on my other businesses, you know.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"You mean if someone signed up or if an investor or something came to me?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Lot of things, well, it shut down my studio. That was pretty much messed up everything.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"I have enough liquid capital. Im looking for the right people to grow it. You know what I mean?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I got my calendar, but like I said, if you could send me an email Im not going to do anything until I learn more about your company and stuff.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, no, because obviously I started looking into AI. I built a website with AI, and Im looking to grow it even more. The only avenue I would have would be social media marketing, YouTube, things like that. I havent reached out to a company or anything, so youre the first person thats called about it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, so being a part of an organization, they would get it all depends on the package. Like I said, this is in the new stage, so I didnt expect all these questions about it because I havent rolled everything out yet. So every package, meaning every membership level, three levels will be based upon certain prices and certain access. So once I get doing it, virtually, then I will open up the location again.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Id say three.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, because thats my passion. Music and film is my passion. Im a musician, so thats where Im at there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. So I think getting ramping up and getting customers to buy into the membership would be the thing that I would like to do. Hang on 1 second.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"It sounds great. I would need to look at everything and see maybe you can send me an email with your contact information and your website and so I could check it out a little further.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]