[{"pageContent":"So I have a training and coaching company for Realtors, and we have a couple sort of higher dollar things that we offer with coaching and some membership options that are a little lower dollar. But were just exploring different ways that we could utilize AI to try and optimize some of our marketing or outreach.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Is it? Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Gosh, if we could get to month, that would be amazing. We just started within the last year and have been kind of building what we want and shifting it. The real estate market has changed a lot. I think at this point, we just really want to grow. Right now we have a number of clients that were at about ten K a month, which is not a lot. Right. So were looking to ramp it up. Our biggest struggle, though, is to get outside of just cold calling, reaching out to realtors and others, and just find the right pathways to sort of create something that will help us better automate our outreach and our conversion.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Oh, gosh. Thats not a concern for us. Were not concerned about capital.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So we are at about $10,000 a month.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont know. I have not looked.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Hey.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"This is Lorna Taylor.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure. So we offer one on one coaching for Realtors to help accelerate their success in real estate. And those packages, its a monthly subscription as well, monthly coaching fee, anywhere from five ninety nine dollars to one thousand dollars a month. And then we have a couple of other things, but one of the main ones is a subscription, a training subscription package that is only $20 a month, that offers training every week, opportunities to connect with our coaches, things like that. So its more self directed, but we of course have live training every week that they can tap into. They can do that for $20 a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]