[{"pageContent":"No, Im not a coach. No, I can be a coach, but first I have to the only thing what Im trying to do right now is just Im just starting off, so its like, just content and all of that and trying to get leads into my phone to turn into buyers. Thats it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Energic.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Whatever I can. My goal is to be a six to seven figure earner per month, if I can. Per month? Yeah, but thats what I want. I want to make enough right now, just for starters, like about 5000, 10,000 per month to stay home with my kids and then scale my business as long as I know the tools and how to use it. Thats what Im looking at.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, I cannot. So I wanted to know, how much is this whole program? Because if I cant afford it, Im just going to tell you. Thank you so much, but I dont want to waste your time. And I have to make ready to go to work.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Do a loan or whatever.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"What do you mean, pricing?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"So I had a bad experience. He took my money and he just left. So I was skeptical. So I stayed off for a couple of years and then I went back on. And I keep trying and trying and trying, but I dont get that quick. Maybe because last year I was being consistent every day, but we had a family emergency, so I stopped for a little while and then I went back. And I know that when you do content and when you engage, you have to be consistent all the time. You have to be always out there on social media, posting especially. You have to be posting good content and good value, because I just got off a ruck shop and I learned a lot from that. But to become a student is $7,000, and I really want that. Thats my dream.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its water. Its really good. Kangan Water.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, yeah, definitely. Right now Im working on pushing up my credit score again because I just went back to work. But things do happen in life. Of course.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, so in our business, we have water products. We have traveling, we have all these that when people go into the funnel and they go into the presentation, they can see which one they want to promote. That is to their advantage for financially what they can afford. Okay, but I just was interested in this because its hard for me to get leads to turn into buyers. Thats really hard for me right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Affiliate marketing.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, I just do, like, FB ads, and I just run ads here and there, Google Ads. But a lot of people look at the offer, but they just dont buy. Theres a lot of skeptical people.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, for the machine.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"We have a company we promote energic?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, you too. Okay, God bless. Bye.","metadata":{"fillerID":16,"fillerText":"Ok gotcha","category":"B"}},{"pageContent":"How much I pay for FB ads.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"No, Im currently working because I cant afford it. Im not building anything right now. Is this about for coaches and things like that? Because if it is, then its not for me. And I just wanted to find out what is this about? I think this is for people who have their own business.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Really low right now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"The first process is to put their name in the email. Okay. And then they go into video and the video explains the offers. Like, its water machines, maybe like about $4,000. Financially they can do.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"We promote five streams of income.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Ive been working forever, so its been an issue forever because I was an entrepreneur back then. I mean, not back then, maybe like about they had funnels and everything. So it was like about ten years ago, and I had people that would go to me and Im not talking about leads, Im talking about the person that got me in a coach.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, we have a website built in, and people go in. We have a recorded video already explaining the products, and we have five streams of income. But a lot of people, they do purchase the water machine because theres a lot of benefits.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Julie yeah, you know what? I just went through this with my event and I had someone call me to schedule a call, and it was the same thing. They wanted to run my credit score. My credit score was 700. It dropped. I told them Im going to be honest because last year I had two surgeries, so I had to stay home. And I work for a nonprofit organization, so I didnt have any income coming in, so my credit score went down. And Im trying to build it up right now, but they were trying to help me out a lot, like, financially, to take the program and pay monthly whatever back.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Oh, Im sorry. I told somebody else because the phone keep calling me. Im good. But I was kind of interested, like, what is this all about?","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}}]