[{"pageContent":"Jake. This was what I was going to apologize for. Its my daughters birthday today. Shes calling me. Let me take this. Just hold on 1 second. Give me hold on 1 second.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, no, it wasnt on your Facebook feed. Thats why I asked.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Whats your website again? Im trying to find that and then we can go into that.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, thats why I chose this vertical, is because of the network I have to get clients. Then theres also doing trade shows and having a booth and getting in front of the people and getting in front of lawyers and getting in front of doctors, and getting in front of automotive and the people that you want to sell the leads to. When I was in the payday loan business and would go to my annual conferences, there was always lead generation companies. There selling leads and talking to people and talking to the owners. So, I mean, its one step at a time of how I would grow the business, but before I do anything, I got to prove concept.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I mean, of course Im always open to making more money. But the way that I look at it, I have two different clients right now that are willing to pay me $500 per lead, and they want to buy ten to 15 leads per week. If Im selling them five to $7,500 worth of quality leads on a weekly basis, I can see why he drives the Lamborghini now. What its going to cost me to do Facebook ads and Google search and TikTok ads and so on and so forth, to get the necessary leads, to get the ten or 15 paying clients per week? It might cost me half of that. But still, if Im making $2500 to $3,500 a week in profit per client, it doesnt take many clients to rack up the bill there. But if you have a better solution for me, Im listening on a Saturday.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im kind of in the position that Im trying to start something. My daughter actually turns twelve today and my sons 14, and I screwed up and I sold my sons pawn shop when I opened it, he was just born and I said it was for him. He wanted to go to college and do everything else and just decided wanted to work in the family business. And then when my daughter was born, I foolishly enough sold it. And so Im trying to create now a business for my family that I could carry on since my payday loan chain didnt last. I had 44 stores and theres zero left now. And with technology and marketing and advertising and that in my back pocket and me watching this gentleman go from bankruptcy to Lamborghinis, I really like the lead generation business and some of the things that are associated with that.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Thats correct. Yes. Im relying on a third party to do that for me right now.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"20% or something.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Hes going to be calling me? Is that what I hear?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"So youre saying my paying customer, not the customers I send to my customers? Correct.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"But go ahead, tell me your game plan. Im listening.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"To be honest with you, Im just getting started. I had one of my tenants become very successful doing so, and I wanted to follow suit.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Im open to listen. The only thing thats going to happen, though whats your name again? Im sorry, I didnt catch your name in the beginning. I apologize.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"How do I get a hold of you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay. And youre going to text me your information?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No, Im good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I appreciate it. And if we do move forward, shake, my business partner, is kind of against bringing religion into business and gets very offended by it. But I feel blessed that we had the opportunity as well, especially on a holy weekend like this, my daughters 12th birthday. So I hope this is as magical as you make it sound, but Im willing to give it the time and effort to listen, thats for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, at noon on Monday, I could.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Currently I just brought on a partner, 49% partner. Thats my capital guy, and I cant speak for him of what he would put into the success of this right now, but he was a much bigger player than I ever was. And his brother, who is now kind of retired off crypto and everything, hes $100 million player. If all the stars aligned, Im sure I would have capital.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You mean my ultimate client, who Im selling my leads to or how Im getting clients for law firms and things like that?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"What do you mean by that?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Whats that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I charge a CPA. Are you familiar with that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Not a lot. I mean, when I ran ads, I ran them selling my franchises and I just ran them in local newspapers and in cranes, things like that. I did a lot of ad spend when I had my pawn shop, but not nearly what I plan to do with this industry.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Go ahead and share it with me.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Ran ads, correct. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I havent put the pen and the paper to that idea yet, just for the simple fact that I have these referral sources that will get me to my goals without discussing that with someone else. But, I mean, if I was to say so, I would want, what, 840.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Are you there, Jake?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Ross and Zach Lipson.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"No, I dont know that guy either.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I think Ill listen to it tonight.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And my email, and then do you know the consultants name that Ill be meeting with?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Right now its low. I only make about $150,000 a year, but I used to make $100,000 a month, and thats where Im trying to get back to.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"When I was young, probably your age, I started out actually in college. I did different things. Golf training device that I manufactured and marketed and sold around the world. And I did some aftermarket Urethane bumper business where Id sell the body shops. Then I got into the restaurant business and basically had a nightclub with a pub. And then I was in telecommunications for a little bit and was a top producer in that, doing my own form of advertising. Did some timeshare experience, which was a nightmare, but kind of paid the bills at the time. And then my real success came in the late 90s when I got into the payday loan industry and I went from bankruptcy to worth a lot of money as well in a short period of time, building out a chain of 44 stores using a franchise model. Then that got blown up by our governor. I got in the pond business. I built that up within a couple of years and sold it to Hardcore Pond, if youre familiar with that. And then I got into the cannabis industry.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Cost per acquisition.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Probably 30%.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay. All right. Sorry.","metadata":{"fillerID":39,"fillerText":"Yeah","category":"F"}},{"pageContent":"Lead generation.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Good, how are you? Who am I speaking with?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, sounds interesting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Where are you located in Florida?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"The three 10 number.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"I thought you called from a three 10 number.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Joes is my favorite place or one of my favorite places.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im trying to get his LinkedIn profile, too. I just cant find it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, that sounds interesting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I would assume that youll be in the loop if I decided to move forward with you.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No. One for four. Hold on.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im just kind of diving in head first, learning the skills. Ive been an entrepreneur all my life and had different businesses and marketing and that type of stuff. But as far as the modern day lead generation that Im jumping into now, with all the Facebook and TikTok ads and Google pay per clicks and all those type of things, Im kind of green when it comes to that kind of technology. But Im relying on outsourcing to put the pieces together. And I was introduced to the what is it? Chat GPT recently, and then I saw you guys, and Im partnering with somebody a lot smarter than I am to kind of put the pieces together. But Im doing the due diligence and the research to get all the tools in place that we need to be able to put the project together. I mean, I dont know, maybe in your experience, youll tell me. Hey, Phil, youre late to the game. When this lead generation stuff, everybody in the world is doing it, plus their brothers and their cousins. So good luck finding clients. I dont know.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Again, I watched a guy go from bankruptcy to driving Lamborghinis and building a three and a half million dollars house that rented my beautiful house from me. And thats basically how he did it. He put his money where his mouth is, and he did his advertising for however he did it, and then he just charged a higher price per acquisition or per client. And thats kind of how Im pitching my services right now to my clients, is that, hey, pay me $500 and Ill bring you a paying client.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, okay. No, I dont know that guy. Im sorry, I dont no worries.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay. So what did you do before you did this?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"And whats your last name, Jake?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Sounds fine. It sounds good, Jake.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, Ive got two, three strong referral networks. Once I can prove my concept. Ive got my first three clients set up right now ready to buy my leads. Once I prove concept to those three guys that just happen to be personal friends of mine, then Ive got another network, good friend of mine that has 30 more clients that he can refer me to. And then I have an old CPA of mine that focuses on the industry that Im going to start with that has about another 150 clients that he can refer me to. And at 150 clients, Ive got a $10 million a year business, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Nothing.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Potentially I would have to see, but potentially, yes, it could.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"LinkedIn page and I was going to go into the consultants as well.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Michigan.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"I mean, I think thats what Im working on with everything that Im trying to put together with this lead generation business is exactly that. So I dont know the answer to your question, clearly, but I would say yes, I do.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You know who Ross and Zach Lipson are?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Jay, I was trying to find your website.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hold on. Start over.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"The Virgin Airline guy?","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"All right, take care.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. Their company is getting ready to go public, and those two kids will probably be billionaires soon. And their father is a good friend of mine, and hes got probably one of the coolest houses in the metro Detroit area on a lake with a pool, indoor pool, outdoor pool. And then he puts a golf tea on the top of his house. In between his outdoor pool and the lake, theres a green, like a putting green. And every time he has a fundraiser at his house, you go up for $100, and hes got $10,000 sitting there. And for $100, if you can get a hole in one, you get ten grand. And if you can land it on the green, you get $100. And thats how their kids, Zach and Ross Lipson, got their start. So, I mean, I have access to capital if Ive got the right plan.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah, shes just calling me today. Shes getting ready to go to dinner with her grandparents. Her mom and I are divorced now after the brutal take in the payday loan industry.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Probably noon.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, Ive heard of him.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"720 or something like that, I think.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I dont know, maybe 100 grand I would be willing to do.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Spell that for me. D h hold on.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Happy Easter. All right. Thank you.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"You?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}}]