[{"pageContent":"Well, thats true. But I also in Kirby, I used to have a meeting every morning at 09:00 and we get out of the meeting at ten. I did it for twelve years. But again, 09:00 a.m to ten. Id have a meeting every single day for new people. And then we would get out in the field by eleven and we would be out until like midnight. You do that for twelve years and trust me man, youre going to find shortcuts that are going to still get you the same results.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"What is it you guys use AI for? Can you make AI set, like water leads?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, right now, currently I have five finance companies that I deal with, and then with Solar I have like 120, but theyre dwindling every day because of the economy and shit. So I understand what youre saying. I guess what Im interested in is generating people who are interested or at least looking at water filtration because theyve been beat down on doors and they just havent let anybody in because they havent met the person yet that they like or they dont want to buy from a door to door. But if there was like an AI that could schedule that appointment and make that call, the initial call to set up to get you in the door, thats what I was thinking that you guys maybe had to offer.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I remember watching videos of him like seven, eight years ago.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. So the best times to catch me are Wednesday afternoon. I do like family stuff, home school stuff with the kids, like ballet, piano, church on Wednesdays, so Im off. And Sundays other than that, man, Im really grinding for my customers, my people, and Im not too available unless its early in the morning, but I dont like to get up early. Theres a lot of entrepreneurs that talk about, oh, get up at 330, get up at 530. Well if I want to be the sharpest the 8 hours, Im going to be in the field with some people or 10 hours I got to get my beauty sleep.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I was very passionate. I mean, Im in door to door sales, so you cant make it if youre not passionate about what youre doing, for sure, because you have to transfer that sense of emotion over to a customer in their home and get them to spend $10,000. And then if youre selling solar, you got to be able to sell $30 to $50,000 ticket items. Thats a big ticket item to me. I mean, obviously youre talking about real estate and stuff like that, and Im assuming you can get ten leads for people in that regard and stuff like that. I mean, what caught my eye, man, is number one, the person on the Facebook little video was a kid I remember watching like ten years ago. He was real short, and his dad and him used to do videos and now hes like setting himself apart. Hes branching out.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, exactly.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"You know the 10,000 hours rule, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"When I started a business twelve years ago and I was trying to open up a yahoo, it just gives you like for that email. It just gave me options and I picked ymail.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So a little bit about what I do, man, I go door to door, I sell water filtration and solar.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. So I went into the water industry because in Florida we have a water problem, but also they have American made products that I can sell. So Ive been doing that for about six years now. And I train individual people and I have spoken at events like, Kirby has had me go to seminars where theres 500 people and you speak to them and stuff. So Ive done all that. Ive done things like that, not for money, but for the opportunity to have somebody sitting in that chair that was like me when I was 20 years old and thought, oh my God, Im going to be selling vacuum cleaners or Im going to be selling water systems door to door. But to give them hope and to see the light that a person can come from nothing but have hard work, determination, and the right people around them, that gives them the right information. And the sky is the limit. Its what you want to do with it. So, yeah, I agree. Kill it, for sure. But I now have a family. I have four girls, one on the way, hopefully a boy, my wife, home, schools. Yeah. And now I just go out for sport because theres a good margin to make. And I go out and I just try to kill it by myself with maybe one or two guys that can shadow or watch and train. But like I said, yes, definitely. Send me an email. Im on my way to an appointment right now. Im about to pull up. Send me that email and Ill look at that stuff. It was late night, obviously I was scrolling through. I saw Caleb Maddox. I was interested because I saw the guy. I remember seeing the guy, the kid a while ago. And the AI thing intrigued me because I know AI is the future, thats for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Really?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, thats correct.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont think it is.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, thats who it is, caleb Maddox.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I would say that Im a little bit of both.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"But that is also something that were sorry, go ahead.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"No, Im in my thirty s now. By all means. I train people every day. I dont do curvy anymore because they sold out to the chinese, and I didnt want to be a part of the Chinese.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I havent looked, man.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Ive done 30,000 hours door to door.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"15 years. 35. Ive been doing it since I was 20.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I look forward, brother. Ill talk to you then. Okay?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, as a factory distributor, I was top 20 in the world in 20, 16, 17. In my 20s, like early 23, 24, I was like number eleven in the world as a factory distributor, buying and selling. I buy them from the factory of Kirby and then I would have sales reps go out in vans and knock doors and sell. But I also ran a van. I also sold personals. I used to sell anywhere from as vacuum cleaners that are $2,000. You sell anywhere from $30 to $100 a month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You got it, brother. It should be in your email. I appreciate you, man.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"You could really my wife, she writes and authors and publishes childrens books and weve been talking about that. Its kind of funny that you say that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, like I said, I start my day now unless I have meetings and stuff normally like tomorrow is Friday. Ill be starting my day at like 1030. So lets do 11:00 and then I drive for an hour so Ill have that time to talk.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I was in the top 20 in the world for Kirby Vacuums. Like door to door.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]