[{"pageContent":"Well, some people have said, oh, I dont need the doctor.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And I live up in the mountains, so the views are astronomical.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Natural healing.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Were talking about creating retreats on this. Were talking about what this time around, I am documenting out the wazoo because when I did it the last time, I just did my own pictures and my own videos, but I had no backup saying, this is the starting point. This is what happened. So this is why I just spent a couple of $100 getting all the basic stuff done. So then its undeniable. This is where my starting point is.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Nine could work.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Good, how about you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. Actually, lets try this. Theres a big festival that Im doing with the kids this weekend, so Im trying to figure this one out. Monday.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, yeah, thats minimum. Well, you got to figure once this is completed and with all the documentation thats like Guinness Book World Records type thing. Theres no surgery involved.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And restart the challenge. So I actually just did the 360 imaging and the biometric feedback type, so it checked my muscle mass, my water fat, and all that stuff.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So Im starting with an herbal dry fast. Okay. So first the pre launch is youre drinking like two gallons of water a day with a mix of ketones and baking soda because you want to make sure you get hydrated. Right. And then you go into an herbal dry fast. So basically your whole body is going to get rewired on a cellular level, which is why its such a painful process. My first time doing it, I thought I was going to meet Jesus. I mean, were talking body charlie horses and muscle spasms throughout the entire body. And when I spoke to my doctor about it, hes like, well, thats because youre detoxing all the crap you spent putting into your system your entire life. Wow. It really reminded me of the story about the butterfly. I mean, from the caterpillar to the butterfly, thats more excruciating than childbirth. A lot of people dont know that, but they spent a lot of time struggling to get out of that cocoon.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"And then Im doing daily videos, and Im working on releasing 111 pounds in 30 days.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Keep getting more clients referral, social media. I figure once this is done, thats going to be like national news type situations.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ive been taking it one step at a time.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Especially with the before and after documentation, because then its undeniable, and Im slowing the process down because its definitely possible to do 50 pounds in a week. Right. But how realistic and how duplicatable is that? So my first week, Im going to go for another 50, which, by the way, to reach my optimum weight, is 111 pounds.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Honestly, I have no idea how much Id need.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right. Thats why I said word of mouth is going to be the biggest hit.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Because in the process is also doing 10 miles a day walking, so theres a lot of time to talk.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, Im going to be starting something.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I found a natural doctor whos been a doctor more than Ive been alive. Hes 80, can pass for 45. I mean, this guy is gorgeous.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"And it hurts. My kids were scared when I did that.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Right. Well, thats when I saw the ad and Im like, oh, thats perfect timing. Im starting to get nervous with the phone listening to me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I want to make it a turnkey to where I physically dont need to be involved unless its extremely high ticket. I want to have an automated program along with group support and hire coaches that have completed it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right. Well, when I did it the last time, I ended up coaching some people along the way. They were just following right after my footsteps to the point I was getting so many contacts that I couldnt keep up program. Then Ill have the before and after Ill be able to create a digital program of the process, the document beginning through the end and then thats when Ill start getting the membership and then Ill start doing like well, maintenance is another huge part, so the maintenance afterwards is intermediate fasting and its low insulin ketonic diet. And thats just the way of life for eating. You get to eat dinner at night and as long as it fits into that program, you can have anything you want. So were talking no flour, no sugar, no carbonate, no refined, no processed ever. Thats why I said this isnt a program for the traditional people that think the grocery store has healthy food in it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, going to be on the dock. Theres a fishing festival to start the season.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"With you, that would be great.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Weight release coaching.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I started with Herbal Dry Fasting, and I released over 50 pounds in one.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"45, maybe.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Are you guys still in Florida?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats how long its been.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"09:00 A.m. Is maybe I would not be able to do a full hour because I do have a 930.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Thats amazing. Right?","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Exactly. And thats why I said possibility of definitely waivers. But psychological evaluations, are they competent? Crazy is one thing, stupid is another.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Its a no brainer to me. So Ive actually been putting a lot of prep into doing this. Its just pulling the final trigger.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And I love fish. Im sorry.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Right? Yeah, I totally agree. Thats why I said my first completing the challenge because I dont want to have all the distractions of everybody wanting to talk to me along the way.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Help people get healthy? When I did the 50 pounds, it was actually closer to 70. Okay. So in the first 18 hours, I released 21.8 pounds.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, definitely. Ive been watching Caleb since he was like ten. I got the kids program for my kids.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Other Washington state.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Full transformation, and there is so much backlash on my end. You know how thats not safe? Thats unhealthy. Okay, so I can go with a traditional doctor whos overweight and smoking and just wants to give me pills.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Possibly, yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Again, that would be cut short, and my daughter has an appointment after school.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"For some reason they went to Florida. Anyway, I dont matter.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Oh, I definitely have that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"All right, sounds good. Thank you.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"But when I did the challenge before, I got myself off of 20 meds, quit smoking and havent gotten back to any of the garbage.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, two questions. First, should I meet with them before I start doing the program, or should I meet them?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Thank you so much. And, yeah, I look forward to talking.","metadata":{"fillerID":19,"fillerText":"Yah umm","category":"C"}},{"pageContent":"Yeah, I was going to say when you confirm with me, make sure its by phone or text. I dont always check my email.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Reception.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Mineral Lake.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Well, I was thinking lockdown time was when it happened.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. And whats available on Saturday?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay. What times were available tomorrow?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah. I mean, we could pencil in, and I can see about us starting later. And I could do the 930.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"High sixes.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right. So sometimes you get to hydrate in the process to make sure you dont go whats the opposite of ketosis? So you dont go into a dangerous level, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its definitely going to come down to, well, initially when it comes to sharing the videos and stuff, it is going to start with the word of mouth in the process and then if it gets too much to handle, then Ill just hand over my Facebook account or something to someone else to answer everybody.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Six figures, easy.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So in the process, its checking your ketos, your blood sugar, your blood pressure and pulse and all that fun jazz.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im blogging along the way. I got videos of me taking the test and doing initial consultations, and I still get to figure out whos going to be putting all the videos and making them look pretty. But my job is I just got myself one of those camera holders at the stabilizers.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right. And thats why theres all the tests that get done beforehand. There is a doctor involved in the process.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"This is going to be the kind of thing that springs like wildfire once its completed.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Its definitely doable. It does hurt. And you just got to understand the difference in the types of pain. But thats why theres going to be the step by step process and also a process on how to find the right doctor.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. So you start with the Megahydration, and then you go into the dry fast, and then you go into an herbal dry fast. It clears out your entire system is an understatement. And then when you hydrate in, that process is based on what your bodys going through because of how much is coming out of your system. When I say coming out, Im talking to solid waste.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"First is just accomplishing the challenge on my own.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Did he stop doing all the kids stuff or is he still doing that on the side?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Saturday? I think you said 930 might work.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Not yet. Once I release the first 50 in the week, then Ill start getting some clients along the way. But theyre not going to be cheap clients, so the initial ones are going to be more like investors.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Sometimes I feel like, oh, thats an understatement.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, thats another story.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. And then also having a pro team on the back end when people want to duplicate it. Theres a talk on if were going to have psychological evaluations required to start only because in this process, so far, there are some people that have gone just straight stupid. Well, you got to figure if youre not monitoring everything and not taking responsibility for your bodys going through it can get dangerous.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, no, its basically taking it one step at a time. I mean, I got the techie equipment I need kind of just shooting from the hip when it comes to the recording of videos and putting stuff together with the herbs. Thats another partnership with another company thats developing. Yeah. And that company is already the elite of the elite. And its not an MLM type situation, its a private person.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]