[{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Good, how are you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, Ive got a couple of minutes. Sure. Not too long, but a couple.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, it is.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Ill be honest because this is our second call on it. Im really just trying to understand what the cost would be for your solution and all that stuff before I start talking to anybody else. And whats a typical cost for acquisition agency clients? Thats the type of conversation Im looking to have.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. No, I gave you a call back, and I never got a calendar invite or anything for the time we agreed on, so I didnt know what happened.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Sure, Im not, but I guess my couple of questions right. And I know we had talked through all a bunch. Does this work? If I went to do, like, agency client acquisition, would this work or no, no, it would. Okay.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I think you asked me about what Id be comfortable if it was guaranteed. Yeah, we went through all that stuff. Yeah.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, thats good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Do you remember we spoke the other night?","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Hi.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I would have some time on Monday. Yeah, Monday I have time. I dont have my exact work calendar in front of me, but probably later in the afternoon. Eastern Standard time.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Like 02:00 P.m or Eastern Standard Time. Could you do 230? Youre on an internet phone or something and its breaking up. What were you going to say? Still not coming through. How about now? Hello?","metadata":{"fillerID":32,"fillerText":"Ummm yah","category":"E"}},{"pageContent":"Great. Okay, no worries. So can we get that? I guess let me get to the next step then.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I spoke to you and said, I just sold off my clients from a plastic surgery SEO company and now looking at doing something else.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I think it all depends. It depends on a lot of stats. Right. Whats the cost per acquisition? Whats? A lot of stuff like that. But five to ten k if it was the right thing.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah. I went through Ive got like an eight four credit score, so Im in good shape there.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]