[{"pageContent":"So Ive just been kind of holding back to do the right program.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So I want to through the education, and itll forever be in the process of being educated. I mean, I still have things that I want to get, but.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont. Im still in the process of figuring all of that stuff out.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I was just curious what you guys have to offer. It just looks very different on yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right. Well, I get my teaching certs in June, so I can do Ive just been getting the rest of my education.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So I would have to check and see.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"And Ive just kind of hit the tip of the iceberg. I havent really hired people and expanded more and utilized more of the tools that I have in the business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Probably not at this time. Okay. Yeah. But I really appreciate you calling and letting me know. I was really curious on your guysapproach to things.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Kind of interesting. So you guys are kind of acting like the bank.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I think its like 820 or something.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. Yeah, my I do alternative medicine consulting. Basically I do healing and energy work and so basically I dont know what Im looking for to help me establish or get more clientele, I guess. I want to do most of my business remotely from home and it is energy work, if you will, but its a form of consulting. I need a website and I need a way to schedule appointments and things like that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No. I dont know. Id have to think about it. Id have to think about it. I could probably do a couple of million a year.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Pricing for what?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Because I want to make sure 100% that what I have to offer is not only effective, but that its life changing for people. And so Ive been doing a lot of it already. However, I have just really been getting more education.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Um I dont know. I just Ive just had a lot of stuff going. My daughter had a transplant, and its just been one thing after another, and I havent really been able to sit down and expand more.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Probably about 15 years.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Um, I dont know, a few years.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I dont know that Im really interested in that at this time. Yeah, I dont know that I resonate with all of that. I havent decided how Im going to expand. Im going to expand several different ways, curious what people have to offer. And some people are like, oh, funnel, click this and this and that. Theres so much of it now and I havent decided what avenue to take in marketing my empire, my enterprise. Its not going to be just a class that Im offering. And so the so yeah, so yeah, but I actually need to get going right now because Im getting my daughter breakfast. Do you want some milk, babe? Yeah. Okay.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"What was different? I dont know. I just have built myself up over the years. Its been a process. So every year I do better and better.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hi.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, lets see, somewhere between 35 and 68,000 a year.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Good, how are you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And if it is, I could call you guys and inquire more.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"But I dont have any idea what you guys do. I would have to know what you guys offer, how you guys do your marketing, what do you guys have as a business plan for somebody like myself to come in and what is AI? Because thats why I filled in the information, is because I wanted to see what it is that you guys offer thats different than everyone else in the marketing field.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah. But it takes time to establish a name for yourself. Ive done some gutsy moves, and I have taken some risks that were smart, that werent financially burdening or damaging. And things have just really worked out for me, just been really lucky. And Ive worked hard, and I had the right people supporting me. And every year, things have done better and better.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, yeah, I think what I do is priceless and life changing and transformational and life savings. But however, when you say that, I dont have any idea what that means. I dont know what that means. Is that just for my services in general?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No. Okay. Its just not where you guys are coming from is just not where Im at right now. Yeah, well, Im not looking for somebody to act as a bank so that I can do a big schooling. I could do that. Or some sort of online education, which people love, and its trending right now. I think its great. But thats not my focus right at this moment.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Probably in about a year, yes. Okay. Probably not right now because Im in the process of moving, and then I want to get settled in and establish my studio. And then once I get settled in and organized, then yes.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Its just this.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Thank you so much. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, I havent really established that yet. Ive just been doing a lot of stuff privately, so I havent sort of stepped out of the cocoon yet. Because once you begin this and you sort of release a program, kind of a big deal.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I like most of my family. I do. Im pretty close with them. For the most part.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I havent checked. I have to look and see. Its been kind of busy for me.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"On a personal level, it just I guess what does it do for me? I dont know. Probably just secures my future, I guess.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}}]