[{"pageContent":"Guys get talking about? She said it will cost well, she asked me how much would I be shes a manager. She asked me how much would I be willing to pay to start scaling the business. And I asked her in terms of when she said this month. So then I clarified, well, lets think of more so May as being the beginning. She said it has to be done prior to the at the closing of the deal, for the most part prior to scaling. And I said between 2200 and 2500 is what Ill have to actually pay if thats the case, because I still live a regular life. I got to pay bills as well at the beginning of the month, but just more so what Id be able to spend at that point.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes, sir.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"I was talking to.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"The first call, as far as I told her that basically I was speaking about credit and I told her just about securing funding. I was telling her that, hey, I know someone that I could put that through the business the way its set up, its incorporated by another business that I ran, but also have someone as a beneficiary of the business that could potentially be put on the business through Happy Hours, through Non Music, if that makes any sense. So Happy Hours is incorporated by Non Music Group.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, it literally just dropped. I guess it rang back and you picked up.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Hello? Can you hear me?","metadata":{"fillerID":33,"fillerText":"Yeah","category":"E"}},{"pageContent":"Okay? Thanks, man. Have a good one.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, sounds good.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I was just on the line with someone. I dont know exactly who I was on the line with.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hi.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Man Im very bad with names. Im sorry. On the phone.","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}},{"pageContent":"Okay. And let me ask okay, I think I blocked the number. I dont know if this is your numbers, but I thought it was spam. 1 second. Let me go back to it. Im sorry. I get so many text messages.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Correct. So the backstory on how I got where Im at started off as independent artist. I was just more so into writing. I was writing before I did anything as far as recording, but before I was writing, I was actually performing. I learned how to play music. I know how to read music. So essentially, Im a musician. Outside of being a musician, I have a passion for music. So all of that put together led me into the music industry. When I got into the studio, the first thing that I was trying to figure out, what needs to be done is, okay, so what is being recorded? What are you doing? So thats whenever I got introduced to the engineer, when the engineer said, hey, the package deal for this, Im like, hold on. Package? You mean package? Im thinking Im just paying for hours to record. So he said, no, you can pay $45 an hour and get your Beats off of YouTube. And I was telling him, I dont want something that people have access to. I wanted to be more so, like, individual, creative, something thats to my standard as far as where Im at, emotionally, mentally, all that type of stuff. Sounds that I like. I dont necessarily want to just go find something that someone just put up on the Internet hoping to get rich quick off of. So he was like, So you want me to sit here and really get serious? I was like, yeah. So hes like, the package includes the actual Beats itself, your own exclusive rights. Ill record it, Ill send it off to get it mastered, and Ill provide publishing for you either to your own company or to my company. And I have my attorneys draft up a contract where you retain all the rights, but I still get my publishing, my producers cut. So when he started talking like that, Im like, so how much does all of that cost? Feels like for five, Ill do it for 650. And immediately Im thinking, to record five songs, it doesnt cost me 650. If I went on YouTube, but I realized what he was providing for me. So Im like, if I can sit here and learn how to do all this type of stuff myself, then Id practically be able to sit here and manage myself. So I started teaching myself how to produce, record, and engineer. Then I started providing those services for everyone else, like, hey, if you want to record, I can provide a package where I can sit here and do these things for you. That started off in the music industry. Now the music group was preceding everything. Eventually it got to the point where I was like, hey, I need to be able to package everything up as actual brand, as an identity. And I was like, hey, I need a website. I dont have electronic press kit. I dont have my publishing numbers. I dont have the copyright, I dont have the legalities of everything. So Im like, hey, thats a package in itself right there. So its like Im thinking moving along, Im just thinking about say again?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"If it was a little deeper in a month, it might be a little bit more.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Sometimes itll have the wrong number. If its, like, a new business number and its not registered within Google registry or something like that, it will automatically be spam. Sometimes I think this is on the wrong phone. 602-87-8727. I dont know if thats you all VoIP.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"The time that random journey. Yeah. Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]