[{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right. And Im happy with either one. My partner, Mitch, hes a CMO at a publicly traded company who is also an agency. They do a lot of private equity roll ups. Hes an inside guy, and we may do an acquisition a couple of years from now, or I might just keep my cash cow. I love the work, so sometimes I dont want to switch treadmills, start something from scratch. Yeah. I dont know yet, but its going to be one of the two.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hi.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So 60 advisors in the next nine months at $1,500 a month. So its like a run rate, and thats our quarterly goal, and were probably going to get there, but its still pretty early to tell. I think annually we might get somewhere between one and 3 million, but its hard to tell, man. Its still so new. But thats the goal, and everything points to that being feasible, but well see.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thatd be probably three to five years from now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Thats right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, were moving really quickly. I mean, like I said, the advisor funnel, we book calls for $14.13. We got an 86% lead to schedule ratio or conversion.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"On the advisor side or the investor side, by the way? Yeah. For this conversation, its all investor side. If theyre disqualified, we dont follow up, because what makes them qualified is investable assets. And thats not like, a fudge point. Right. Like, they have it or they dont.","metadata":{"fillerID":7,"fillerText":"Yah totally","category":"A"}},{"pageContent":"Can you just tell me a little bit about what you guys use for the lead to pickup rate? Is it a local presence dialing system? Is it something else? Because thats the primary purpose of the call for me. I just want to make sure Im barking down the right tree.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Is this a coaching program that you guys are offering?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Well, we have only started doing it the last couple of days, so we will, but we dont have any numbers on it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, approximately. But now thats deadline on the advisor, on the investor side, we get about somewhere between 15 and 20% opt in to the lead magnet and a 30% schedule with our marketing automation. So 30% of the leads that opt in become appointments.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, weve got two processes in place to get customers at will. We do our own acquisition for advisors. We use an ad to sales call funnel, and we use a similar system for our investors, which we connect to our advisors, facebook ads to lead magnets to a calendar and then the advisor sales call.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, outbound dialing, yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Oh, cool. Hey, not far at all.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Im happy to answer that. May I ask you a question first?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, we dont know yet. From a standing start, we got to about 15 clients in five weeks. Theres Churn and Agency, so weve already lost two or three, as you might, and I tell everybody, hey, its a new program. I made no guarantees. The results are good, but for some people it doesnt make sense. So revenue is growing, but then it stalls. But it hasnt even been two months yet, so its really impossible to say.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Got it. So, financials, when I started this four years ago, I was bankrupt. I did six figures in the first year, got to a quarter million in the second year, and did about a quarter million the next three years in revenue. All that went to zero when I fired the attorneys and from.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"We got one superstar on the phones, but thats kind of the purpose of this call.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Im looking at the Rockies right now. Im in downtown in Rhino district.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Absolutely. My partner Mitch is on sales. Tom is on investor sales. And, yeah, the goal is just to get enough traction to meet payroll and have time to get me out of the role and move on to the next stuff.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, at this point, like total capital on hand, I dont think Id be comfortable sharing it just yet.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I sell to the advisors. I do not sell to the investors.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, Ill tell you the thing that caused the response for me. I work in direct response and I run an agency, so its always interesting when Im responding myself. So we do outbound calls for the leads that we generate on behalf of our clients. And we use go high level right now, but were looking for obviously the best I think the phrase in your ad was lead to pickup rate. Right. We use one area code. Weve tried a couple of tools for local presidents, dialing that were pretty difficult to get set up. But at the end of the day, I guess Im relatively tool agnostic as long as we can get them on the phone, which is the first step in setting an appointment. Thats our service, we provide. So thats why I reached out.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its happening hour by hour right now. So, yes, we cant move fast enough.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, eventually, long story short, it was just too much. The model doesnt scale either, because with advisors, we work with annuities specifically, and millions and millions and millions of people need those. But with attorneys, all the sub niches made it such that, well, you can only really make as much money as your clients can make on some level. So, yeah, bankruptcy cases were capped at $3,500, but for the right annuity commission, our advisors might make $70,000. Well, we can do one 10th of 70,000 and make about twice as much or maybe ten times as much as one 10th of 3500. And that was just one sub niche, and each one was a different business and just didnt scale. It was too much work, not enough money. And then the attorneys were assholes on top of that. Im out. Pardon my French.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"How are you, Rick? How are you, man?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So Ive been a freelance marketer for four years, the last two years full time generating leads for attorneys, which I wouldnt really wish upon many people. Its bad, man. Its worse than it sounds, actually. So I did fine. I made a good living, relatively, but I just got tired of attorneys. I work with advisors now, and the program is brand new, but we schedule advisor appointments for about $14.0.13. Weve got like an 86% schedule rate from lead to schedule and an 83% show up rate, about a 20% close rate. And thats just in the last six weeks. So were off to the races on that side. And then we generate appointments for the advisors automatically with our marketing automation. And right now we generate I dont know, the price per lead is relatively low and the price per appointment I think is still in testing too, but we get about a 30% lead to appointment rate. Its pretty good. And we expect, when we set outbound calling on top of that, and probably another 15% to 20%. So its all very new, but Im not new to the business, and were getting pretty good results and we just want to do better.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"The missing piece for us right now is getting the rest of that 70% without dialing.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thanks, Rick.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im sorry. My girlfriend is pulling up. Im sorry. One moment. Im sorry. This is not on my schedule, but it is important, so I apologize if youll ask me that question again.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, that seems appropriate to me.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So again, Ill just be candid. I feel like Im being really clear. The only thing Im calling about that I have identified a need for currently is I just need to fix the one thing for our outbound dials. And I have things I could be doing, Im sure, but for this conversation. Thats the reason I called. So how do we get there?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, I hope to do it sooner, but yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"To get it for you. All right, man.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Rick. So I work as much as I can on total candor, radical candor. So if its all right with you, the reason I booked this call was to figure out if you guys could solve my problem. This call has turned into figuring out if I can afford your solution. Id like to answer my question first, if thats all right. So how do we do that?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"So if its all right, man, again, Im sorry, remind me your name.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"And again, Ill be totally candid with you, its probably a great offer for somebody. I have already spent four years doing all the Video courses and God knows how many, probably 50 to 70 grand courses at this point. I already kind of know what to do. And if Im wrong about that, itd be surprising to me. The only thing thats really on my mind right now is how to increase this one thing, which is the pickup rate for our outbound dials.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. And just to be clear, thats not really your specialty, but youll someone that can talk about that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"The thing is so I work in direct response, and eventually your headline testing and your image testing and your offers, they dont have unless you can actually get results for the client. And so I think the key piece for me is how do we get our investors on the phone to schedule with the advisors? Thats one of the missing pieces. And we know stuff like, okay, call in the first 60 seconds, you have an 800% increase in answer time or answer rates, and then a 400% increase in total closes. That data is out there. The gap is if we call from a seven 20 all across the country. Answer rate is probably not going to be very high. Seven 20 area code is what I mean. I dont know if answer your question. Thats what Im thinking.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So that was four or five months ago. I lived on a line of credit to get this thing up and running, and that line of credit is almost gone. Im all in. And weve done. Our stripe account in the first month, I think, was at 29,000, 30,000. Now, considering you probably know a portion of that, a good portion of that is ad spend. So thats not necessarily profit, thats revenue we run ads through. So thats kind of where were at. And Im always candid with that stuff. So now you know.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im building it to keep which is the best way to build it to sell.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Its hard to say. Right. But if we can get appointment rates from 30% where they are now, to 50%, then lets just call it 60. Then Id imagine the advisors would be twice as satisfied for the same dollar and therefore twice likely to stick around for the same dollar. But this is kind of guessing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]