[{"pageContent":"Well, I am a Naturopathic doctor and I took a year off, which turned into two because I wanted to contribute in a different way. I wasnt satisfied. So now Im getting ready to go back and I am planning to do something very different. Its energy medicine and its a type of medicine that heals with sound. You put people in a room sitting or lying, and this enhanced energy heals the body and it also heals mental issues as well without having to manipulate or do anything as the individual doctor. Four sessions of this for an hour heals any kind of condition.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sorry, what did you start? Im sorry to keep asking you what you just said. Let me see if I can do anything about the volume. 1 second. Well, it was up. Say something. Let me see how I can hear you now.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"It could be 500,000 or more.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Perfect people to over a million dollars. So what is it that I know youre trying to give me an overview. Just let me ask a question since I paused you here. What exactly is it that you do and is it any kind of business?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Listen, I went to bed this morning at eight, so I havent even opened my computer yet.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"All right, go ahead.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Carol? Its a little clearer. Yes, go ahead.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes, that sounds good. And send me your details so if I need to reach out to you, I can do that easily without going through a lot of layers.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Homeopathy.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"How can listed some Im sorry, I let me see if I can get out. Glad I didnt get into the shower yet.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"One moment. Alex. Oh, alex with air.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"All right, its a very good question because really I have gone through so much setbacks. Let me put it as setbacks. For example, where I am, which is out in Oregon, in Portland, Oregon. And I came from New York many years ago to come out here to study naturopathic medicine. This place is not the place for me to thrive. And I stayed too long. So now Im in a really low in terms of income. I would like to have enough income so that I can be an investor, help other people fund their business or their dreams, because its just too difficult. Something, I guess, what youre doing. Thats why it appeals to me. Otherwise its like coming out of a hole before you even get to level playing field.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Because Ive been doing energy medicine all along. Youve heard of homeopathy?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No. That is true. That is true.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"You too. Thank you. Bye.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Im willing to start at 5000 a month, because Im not even making that right now. So it doesnt have to be meteoric, but it has to be brisk. Thats why this time Im looking for working with people that know what theyre doing. Because I was never trained in business, but I have a good sense of it. And so lets say I know something. A sense like I know something is good or will go far if I understand what it is and who is doing it. Thats also very important. The people that I want to work with.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I think its a little over. Somewhere between upper 500 and into 600.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im about to go back, in fact, like, Im calling you. I just did another thing where I joined up with them. Its a business thats kind of done for you, affiliated marketing. So Im starting in a different area that will help me to create funds because thats what I need to do. I need to have funds. Yeah. So its a kind of a wonderful opportunity, actually. But that is the intent.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, Im not working right now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"4 hours? 4 hours. You can do it a session of 1 hour sessions, or you can do all 4 hours, which is the recommended way. Its an extended treatment, but thats the only thing you will need to do.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, I did. Look at that. Late last night.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. So its distilling the essence of a plant or some other material, including metals, and you combine them. And then this is a drop medicine. You put four drops under your tongue. It varies as a person evolves, get better. And then that is what the essence of the plant goes directly into the cell. So thats the key. It goes inside the cell. Its intracellular because when you take, for example, herbs that may be tinctures or maybe its put on your skin or wherever, it takes a long time. Its a slow process. This is going directly inside the cell and healing it from the inside. Ive done that. Thats like one of the main chief modalities I use. There is also counseling, there is regular herbal use. Such a wide variety of things you can use you can use sunshine, water, air, application of infrared pulsations. So its very wide. Yes. Even tapping is one of the things that is used as well. And that is an energetic because youre tapping on the acupuncture points that are used in acupuncture to stimulate the nervous system of the particular organ that you want to help or correct.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]