[{"pageContent":"No, I dont do it full time. I work in security. Ive been doing security for 13 years.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I got your number. Ill give you a call back. Im going to do a little research.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. And thats what Im thinking. Itll go hand in hand with the ministry. Well, I can have my ministry with it, but its biblical consulting and life coaching. Thats what I would say on that. And that way it would balance out. Okay. What Im going to do, Im going to go over a few things. Hi, how are you? Feel? A little better because I had a shoe on that was not feeling right for me.","metadata":{"fillerID":34,"fillerText":"Uh-huh","category":"E"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. I know.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Bye.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Can you hear me?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Always well here. Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So this is the deal. Okay. Im starting. Okay. Im an ordained minister. Okay. Ive had offers where theres streaming. I want to say Roku. Im not really familiar with how well the reputation is for this particular company, where they do streaming for you, where you be on so many different platforms through Roku, and so many people are able to see your show. And what Im starting is a small scale. Its a talk show podcast. I shall say that Im starting, and Im just deciding if I want to do just strictly audio podcast or if I want to do visual. Im just trying to see which way would be the least expensive for me right now, because I do have a few things on my plate, but I dont want to keep procrastinating with it. I want to know if you all are able to help me with that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"One year.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Well, the thing is, I havent got to that point yet, because actually what Im doing is I just want to first start getting the message out okay. Im sorry. I just got a text from one of the kids. Okay. Because Im wondering Im like, what are you talking about? This is my son texting me at the same time, and Im trying to multitask heres. Whats going on? Its okay.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"No, not really. And I probably do that already and just that Im not certified in it. So how long does it take to do life coach?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Actually, Im talking somebody leaving out the building. Sorry, what? I said someone was leaving out the building. Im at work right now.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Right, right. All right. You have a good one.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Whats happening here? Yeah, I dont want to focus so much on sales and everything. I think, right now, unless its just selling the recorded audio, thats all I want to deal with right now. Not so much as doing T shirts and all that stuff, because I dont want to overwhelm myself. I just want to first start off and stick with the niche of just getting a message out and having audio recordings and having that available for sale so that he can purchase that. So that could generate me an income also.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"And give me your full name again.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Someone was leaving. Actually, I was just giving him a little salutation on the way out. Okay. But Im thinking here, Im thinking about what you said and what you all can provide. And so what are the fees for what you all can provide?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"So Im going to put on here. Okay. Have a good one. Bye, me.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"How are you, Kimberly?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Hold on. Hold on here. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, Laine. Have a good one. All right. And this is AI.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay. Air AI. Okay. Maybe I should start off because you know what else I looked at too, and I was looking up, like, business to start. It was consulting company.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Thank you so much. I appreciate all your time.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yeah, thats what Im thinking. Maybe we can do the pay for subscription and we could do a sale, I guess. Audio recording. Audio.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, have a good one. What kind of consulting? Well, thats what is consulting for life coaching. Thats the thing in Houston. I know. That was, like, one of the things to start. That was, like, the easiest business to start, the least expensive. So Im like, okay, yeah, if you.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]