[{"pageContent":"So Im a distributor for a product called Congan Water from an AGIC. I dont know if youre familiar with that at all.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"This summer will be four years.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No. Well, yeah, its the hardest part is getting people to work with you. I coach people all day long, but thats why I just moved. I just put all my money and my energy towards affiliate marketing piece because.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im figuring it out as I go, and Im also looking at entertaining other more full time jobs while I do this on the side.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"100%. Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Hey, whats up?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"No, I havent looked in a while. I mean, to be really frank with you, Im at this point in my entrepreneurial journey and I do sales for a living, so I know exactly where youre going with all this. Im just in a position where basically my credit score used to be impeccable. I had zero debt and I was like doing great. And now Im in this position where Im dusting myself off, taking a deep breath and going, whats next? So Im confident youre probably going to quote me something thats in the $5,000 range at least to work with you guys. And Im just not in a position to do that. So we can keep in touch. I know you dont want the dreaded, think about it, I get that all the fucking time, but Im just being really honest. Im just not in a place to plunk down a whole bunch of money right now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"So when it comes to the affiliate offer yeah, thats typically book a meeting from a meeting, and were having multiple calls to educate them about the product and then were on a closing conversation.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Short term or long term?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Thats really my biggest focus I found in coaching. Although I sold some high ticket coaching. Thats not scalable either. Its like time for money, basically, and youre constantly searching for prospects. Im more focused on putting my energy and resources into building and developing a team and then they can go off and duplicate my efforts.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, I just filled that out. Youre just like me. Youre on the on the case.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, of course. Like I said I did, I pulled myself out of the coaching game about, I dont know, its been probably four or five months. I just took all that stuff off my website and just focused primarily on this affiliate offer. So Im not opposed to coaching, but its just it takes away from where I really want to focus. It was just the affiliate offer.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Lets do three.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"This is why I set my short term goal as 10,000 a month. Im not considering tell you, like, hey, man, I want to make pie in the sky. Awesome. But I want to be also realistic with what I can achieve in a reasonable amount of time, of course.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"And I love that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sounds cool. Yeah?","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"It depends on the day, but typically I have people that are inbound leads, so Im calling inbound leads like you as quickly to when I receive them as possible. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, because the machine that I assist people to invest in is $5,000. So typically the sales cycle on a $5,000 product is 60 to 90 days. So youre always filling that reservoir, your pipeline, getting new people in the pipe. And I dont have strong duplication in my organization, so if I dont sell a machine, theres no income.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thats, like, my first benchmark. And then scale from there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"The product could be $50 and its still the issue.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Few hundred dollars.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"10,000 consistently.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Id love to be at more like 25 to 50,000 range a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"A.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Perhaps? Obviously, weve been talking now for what, 15, almost 16 minutes, and I saw your ad on Facebook while I was shaving about half an hour ago. So obviously Id have to get some more intel and understand the value proposition, but I have some resources that I could tap into.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its a Congan water. You ever heard of an AGIC out of Japan?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I do it all. Im not always closing on the first call, but typically, especially for coaching. Yeah, I knew for coaching, if I dont close them on the first call, theres slim to none chance theyre going to buy from me.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"The company is if youve never heard of it, this could be life changing for you. The company is Enagic. The product is a medical grade water ionizer out of Japan. So for the direct selling space, the compensation plan is insane. I mean, you could make one sale and make two grand, and then if that person goes off and sells units as well, you make two grand on each of those sales as well.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Theres a lot of people making big money with this, and I know that AI is changing the game. A lot of us are marketing online, so its always about who has the most influence, who has the most eyeballs on their stuff, and thats who makes the most sales, thats who makes the most money.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Pacific.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Oh, yeah, for sure. Thats always the issue, isnt it, man.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"What do you really want to be at debt wise?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"In terms of the coaching process?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, sure. Well, I boiled it down to I made it really simple. It was a three coaching package and it was primarily focused on subconscious reprogramming with overall health and wellness knowledge. So the three sessions was I think my last pricing was $1,500, basically 3 hours. Its more like three to 5 hours of coaching, but I put probably 25 hours into what Im going to say to the client notes and all that protocols and all that stuff. So I stopped doing it because it was just not typical of most coaches, I would imagine, as you spend 80% of your time, if not more, creating content and getting people into your pipeline. And the coaching, I mean, I know I could do that all day long, but its like just getting the people in there to do the coaching with you. Right, like qualified people that are going to take it seriously and actually commit to it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, I dont want to go back to a job at all. I mean, Ive worked really hard on my entrepreneurial journey. I know. Its my first time amber do anything like this. To be really frank, I had my head full of steam, and I was like, Im going to figure this thing out. And I pulled out basically all my savings and I started living off of it and just going full bore and running webinars and making content, getting on phone calls, and Ive done. Okay. But its not enough, and its been a struggle, for sure.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Because I still got to drive. I got to get in the car.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Will you send me a calendar invite?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"If its a good fit.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Like right now I got to run in a couple of minutes to meet a prospect at lunch.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay, cool, because I got to wrap up, man. I got to go.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No. Thats why Im at a crossroads where my wife is like, okay, enough, go get a job.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I mean, probably pretty typical. Like what, 20%, 30% somewhere in there? Maybe higher.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, for sure.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Gosh. Yeah, Id probably double my prices three to five somewhere in there.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah, its all over the place. Last year wasnt very good but when I had a regular job I made 85 to 95,000. This year Im on pace to probably do about that with my current direct sales opportunity. My ultimate goal, Id like to get into the six figure territory, its just never gotten there.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Because Ive hit that mark a couple of times, but then, like this last month, I got to be honest or fair. Ive been traveling and moving during April, so my sales have been negligent, but Ive had a few $10,000 months, and then I have a month where its like zero or 1000 or 500. And its like I know thats the nature of affiliate marketing and sales in general, but it would be really nice to have a bit more consistency in my income.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Lets see, tomorrow I could do, like what time did you say afternoon wise?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"You can text me that number.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thats me.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, brother. Good talking to you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And I have to watch a two hour video prior to this meeting.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So it was based primarily upon understanding subconscious mind. So we would do a detailed intake form, and I would take that intake and I would analyze it from the standpoint of what sort of subconscious imprints is this client dealing with? Where are they lacking and where are they stopping themselves from taking action in life and perhaps living in a bit of stress, overwhelm, and anxiety? So working to isolate and understand that from their standpoint and then educating them about how their subconscious mind works and how that plays into their overall health and wellness. Because if their health is off, then thats also going to affect their autonomic stress response. And then Id be giving them basic guidelines on what I see in terms of where theyre stuck and how to best open them up to understand the stories and narratives that theyre living out, and then giving them as we depart. Giving them practical advice on detoxification, proper hydration, nutrition, exercise, and guidelines on how to maintain all the things that we talked about in the coaching process.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Very little. I ran some Facebook ads a year or so ago and didnt really garner any sort of results, so I stopped.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"What was your name again?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Love the hustle.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Posting content on social media, and either they are inbound leads or outbound leads.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I would love if I had somebody like you like a setter. Right. I get on the phone and its like its already basically been done. I like making the content. I like making content. I like doing webinars. I like crafting emails. I like putting together stuff I dont love the building my list and following up with people and constantly being in their inbox and then trying to get them on a phone call and understanding their pain points. Right, okay. Its just the endless follow up and a bit of feeling like youre chasing people gets to be fairly redundant. But I know thats part of the game. Im sure youre aware of that too.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"What I would do is I would have a detailed intake and then we would schedule an initial call, and I would schedule each call a week apart. So we would do three sessions. So three weeks, three consecutive weeks. And each session would be anywhere from like an hour to two to 3 hours, depending on the client and what sort of conversations we got into and what I felt was appropriate. So like I said, it was about three weeks of coaching. My price point was $1,500. I gave them every program Ive ever created. I gave them for free. Future programs, I give them for free. They can always email me or text me for ongoing support. So it was a three week coaching package at the long end. It was like 9 hours of coaching. Six to 9 hours of coaching. Somewhere in there.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Alex, just so you know, I got about six or seven more minutes. I got to run to an appointment.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I have a ton of knowledge when it comes to overall health and wellness mindset. I mean, I was doing health and mindset coaching for a while. Yeah, I can send you all kinds of stuff about me, but I found that when I would start to diversify and have coaching as well as this and a little bit of that, that I just had no focus around my offerings. And my primary focus is the affiliate marketing for the machine I described.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Dude, I get it. I did insurance sales. Yeah, I get it. I totally get it. You want to strike while the emotion is high. I totally get it. So, yeah, I do like you. I try to call as soon as possible and do like a discovery call like youre doing for me right now. What are your goals? I mean, Im dealing with people in their health and wellness, so Im trying to get to their pain points and then offer a solution. So I do outbound calls based on people that ask for information or Im doing follow up, Im doing reach outs. Im working on my CRM. Who do I need to follow up today? And Im just trying to build relationships, man. Thats my whole day.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thanks for that. Have a good day. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I mean, as long as its in my calendar, Ill be there.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}}]