[{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Well, at the present time, its being honest, bro, Im coming from a homeless position and I lost everything. My daughter has been struggling for a year now and once I lost my house, it just kind of went downward, got robbed, all in the process. So its been a bounce back. And then this bounce back is paycheck to paycheck. Just trying to keep the bills paid and keep things going and knowing that my company is what I want to really invest in and make it work for me and to be in the best position so I can use it to lean it, give it to my daughter when she grows up into it, because shes being taught at the same time. So yeah bro, its not a pretty picture, but again, this type of information and this type of phone call encouraged me to know whats the next curve for what I can do with the information, what positive I can get from it. Its one of those situations where Im grateful for the opportunity to even just know these different avenues and different aspects to push forward. I build on it every day. Just lost a major deal with the client who was trying to steal my idea and my products from my ingredients. They wanted to make an investment, but that was one of the cross platform deals and they wouldnt sign a nondisclosure agreement. So that was something that I was looking forward to. But I had to protect my business because I didnt want nobody to take advantage of me. So I got quite a few things. Thats a tug of war type process, but yeah man, thats where I have too much to be able to contribute when it comes is when Im able to jump on it 100%, man.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Give you something.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Thearo yes, hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Probably at the bottom of the pool just to be honest. Its not something that in past that I focus heavily on to start making the changes to develop that to where it is at my advantage. Im in the curve of that. But every individual is in their own precarious way living their life. Some have ups and some have downs. In my turn this is kind of reason why I was looking for AI and looking at some of the simplicity to what it is that I can do hands on. But yeah, to answer that question and keep it simple no, its probably 500, something like that. Okay, no worries man. Capital is the old school saying make a dollar out of $15. You got to know your skills. You got to also know how to market yourself and know your value of your products and be able to know how to keep that folding over into the business so it can keep moving and keep growing. So like I say, the first five years for any company is always that struggle of survival.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, its a timing thing, man. You all know when things arrive, you got to jump on it. So being in wellness for, I would say, 15 years, learning that AI has made it so much easier. And to be inaccurate with your business, developing it, making it grow, expanding it, especially being a one man soldier for quite some time and needing to have the different avenues available that AI tools provide, makes it a no brainer, 100% man.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, sir. I appreciate you.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}}]