[{"pageContent":"Yeah, but look, dont text it to me. Just send it in an email so I can look at it on a regular computer, not on my little iPhone.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, so tell me about that.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"But thats got nothing to do with what you guys do. Right. So Im trying to figure out how that plays in. Right.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"So there are people that go, who in the fuck is this guy? Right? And it doesnt take somebody very long to figure out, particularly since if you go to our, lets say Youtubefederalconstruction, and then click on videos, theres over 100 video interviews with people who have been through the workshop. Because at the end of every live workshop that we did for ten years, we would do a three to five minute interview with them. Right? Hey, how did you even hear about us? Whats your biggest takeaway? What caused you to actually click on our stuff call and figure out how to get into the workshop? Whats your biggest takeaway? And then some of the guys at $5,000.01 of the options was, you can come back to the workshop at no additional cost. Well even take you out to dinner. Right? So well bribe you to come back.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Whos calling this number?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Well, he has actually.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So let me ask you this, Douglas. Whats the ultimate goal here? Do we want to scale this? Because I have full conviction in the offer. I know that is something that we can easily, easily scale. But is that the objective here? Is that what we want to do?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. Im assuming this is leading you to you do SEO?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Wow. 2020 was a great year for him. He almost made a million bucks.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Okay, now you can watch Denniss after Workshop interview. Right? And then underneath the red link there, it says here are his Federal Contracts Awards since he came to the Workshop. Right click that link. Can you see what website it takes you to?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay, so theres two different things. My son runs the consulting business and the training business, and he used it. Are you familiar with Go high level?","metadata":{"fillerID":33,"fillerText":"Yeah","category":"E"}},{"pageContent":"All right, so lets just try something real quick before you take off. Lets see. All right, so Im going to take that last text and the one that came from the 602, you said thatll come directly to you, right?","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Yeah. Listen, I got a text from 602-878-7207. Tell me about that.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay. So if there was one guy in the world that knew that system in and out better how to use it better than the people that wrote the program, its my son and his international team of technical guys. Right.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So hes taken the Go high level and then constantly tells them, you need to fix this or you need to change this, and so forth. And now one of their partners is Frank Kern. Hes on my sons private messaging deal because when his team has been doing things frank Kern couldnt figure out how to do.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Now, if you click on the proof thing where you go to gceperts.com proof. This is really kind of interesting. You go down the page and lets take the first interview after Workshop interview. Dennis with AMG. Right? You happen to see that@gcxpers.com proof?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right, so that came in, I clicked the link. It says heres, AI tools to give you an unfair advantage scale. High ticket business. Okay. I do federal construction contracts.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im going to type from Doug Wrightmeyer. Tell me when that comes through.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. So he runs this high level group and he was introduced to it by Frank Kern. Frank Kern started a school site, if youre familiar with Skool, and in the school site, over the first couple of months that he got that up and running, there was about 100 people in that. And my son figured out the two guys in that group that were really pretty sharp. He brought them on and said, look, were going to have our own private group on Go high level and were going to take it to a whole new level. Since then, theyve gotten in because Frank Kern saw that stuff that they would post there that he was like in one of his messages. Holy fuck, guys, how did you do that? Right, right. They run some Facebook ads, but they got their cost per lead down to, I think its a dollar a lead. Right. So its negative.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So these are all short. I think the longest one is ten minutes. The first one is like but these are actual federal contracts that people that graduated from the workshop either called me and said, hey, how do I get this contract? We walked through it, we split the profits. Because somebody had asked me in 2018, hey, how do I really know you did over 1000 federal contracts? And I was thinking, yeah, right. Theres no way proving that. Right. So I said, okay, Im just going to hire Dog to follow me around for a couple of years. And Ill just take profits that are one to two weeks that make over $100,000 profit. And Ill get people to see, this is exactly what fucking Doug does. Right? Without any SEO.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Dollars. What email address would it have come from?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"No, I dont.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im not sure that he has an offer. If you go to Gcexperts.com.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Spend 30 hours in the workshop with me, and Ill show you. Right.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Okay, so you may not know this because youre young, but when you turn 65 right now, the governments going to make you go on Medicare. And when you turn 70, the governments going to make you retire. Now, what making you retire means is that you have to sign up. You have to start taking Social Security. If you have your 401 or IRA by the time youre 72, you have to start withdrawing money from that or you get penalties on that. And so at age 70, because they force you to retire. I quit running businesses, and what I do is just private consulting where the cash goes into a nonprofit organization so I dont have to pay any tax on it, but I get to control how that money is spent in a nonprofit manner to make the world better. Right. I already made my millions, so I dont need to worry about money or income. But I do want to be these passions that I have to solve certain things in society.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All done. Virtual.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Thats a $5,000 ticket.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Douglaswitmeyer? Yes.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, take care. You too. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Text me back. Lets make it Wednesday. I got perfect monday and Tuesday. But text me back your first and last name and your email address, okay?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Three days.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"And he runs that business. Him and his wife run the GC Experts business, and they operate that business on the money that comes in from the workshop tickets and the membership program. Right. So in the membership program, they get if they need me, they can pick up the phone and call me if theyre a member. Right. But they have to call Sean first and give him the opportunity to solve it. And if he thinks it needs to be elevated to me, then Ill take it over. Right. He actually has that as an LLC, pays his taxes, has everything that you need to have to operate a business of consulting. Thats what GC experts is. But I dont own any part of it. I dont get any revenue from it. Im not interested in that. I built it from 2010 to 2020, and now I do what I really like, which is this number that you called from. Is that a cell phone?","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Theyre already doing between 51 hundred K a month. But what you dont understand is its not something where you want to do a million dollars a month. And heres why. When somebody spends three days and they learn everything A to Z, heres how to find, bid complete do federal contracts. Thats one thing to know how to do it, its another thing to actually do it. And so part of the $5,000 ticket and the membership program is that you get support. And you can only support so many people coming into that program. And so if you try and bring too many people into the program, your support lags. Plus, there are a lot of government contracts available. Theyre spending a billion dollars a month in construction services. However, that doesnt mean theres an infinite amount of any specific type of like, for example, lets take roofing. So the government owns and maintains more than a million roofs. So if youre replacing a roof every 20 years, youre replacing 50,000 roofs a year, right? Well, no one contractor can do 50,000 roofs. But if you had 50,000 contractors, roofing contractors, all that knew how to do federal roofing, then youd have a lot of competition. Does that make sense?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"What does Air AI do?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Well, theyve been through 30 hours of training with me in the workshop, and I cover everything. Heres. How I find them? Heres how I build my network with government people. Heres how I bid them. Heres how I get them done. We put the cash in the bank, and then we go to get another one. Right. So Ive done up to $100 million a year just doing federal contracts over a 43 year career. The guys in the Mastermind Group, they built construction companies, and now theyre looking to expand into the federal market because the government pays real good, theres less competition, the profit margins are higher. Those reasons.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It just says, we teach contractors. Right? You want to know if it really works? Click here. You click on that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So here, Ill share something with you. Hang on a second.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"But thats not something I market. Its where people that have been through my workshop, they understand federal contracting. They reach out and go, how do I get in your Mastermind Group? And then we go do federal contracts together. Right, right. So Im trying to figure out, okay, exactly what do you guys do and whats the value of it? How would it apply? Right, right.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Are you doing a rent split with them?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"No, I dont do any SEO. I just do more federal contracts than anybody on the planet. Ive got them going right now from Pennsylvania and many places in between. But when you put in federal construction expert in Google I see one ad. It says, Federal Construction Contract to Security Clearance. Then its our LinkedIn group, then its my personal LinkedIn file, then its our Facebook group, then its our website, and then its my blog site. Right. So Im what number? 1234 and five, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right. Okay, so tell me this. You said support is an issue, right? And thats why you dont want to.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Whats the point of basically training someone just to go 50 50 with them? Why even offer that? Why not just do it yourself and get 100%? Are they the ones doing the legwork?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"He only does that with GC Experts, and then he and the marketing team are reaching out and making deals with other companies, saying, look, we will take over and do all your marketing for 50% of the revenue and well track all that. Its all done transparently, but we control it. Well show you how were doing ours and were generating 50 to 100,000 a month. We could generate a lot more. Were not interested because thats a very exclusive federal contracting. Its only for contractors. But the first company signed up was they were doing staging for realtors. Right. So how do you get more and more realtors to let you do their staging charge? Two or $3,000 to do the set up or the staging for the house. Right. And they had a lot of money invested in it, but it was hard for them to get another job. Get another job. Well, he says, you want to see what we can do? We can keep you loaded. But heres how that works. Right? And so hes got about 60 different vertical markets that theyre looking at over time to say, for example, if you painted who your perfect avatar was and you said, okay, what we want is this. You paint who the avatar is, let those guys run your marketing for you and just split your revenues with them, and they will flood you with exactly the people that you need. Just like what theyre doing with GC experts.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, of course. So Im curious though, Douglas, what kind of is that number for you then? Is it helping no more than two people a month. Is it ten people a month? What does that look like?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay, lets dive into a little bit of the back end stuff with the workshop at the moment. How are you getting your customers?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"So in 2010, I started teaching other people how to do what I do from 2010 to 2020 for ten years. A couple of times each year, I would invite construction contractor, Id give a speech at a construction show, invite a subgroup of construction contractors with an interest in federal contracts to come sit in the room for three days, and I show them how I got a billion dollars in federal contracts. I had given a speech in early 2020, and I had people signed up for the workshop when the pandemic hit what he wanted to travel. So we created a virtual event. And because I turned 70 that year, I retired, turned that coaching business over to my son. And then I just work with a small group in my mastermind group where we just do federal contracts. Ive got them going in Hawaii, Missouri, Pennsylvania, Illinois, Wisconsin, Arizona, so forth.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I do.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}}]