[{"pageContent":"Okay, so because every time that I basically would take a break or stop doing repair, I would start everyone off with a deal just to get, I want to say five to ten brand new customers get their results in, lets say in two months or so and use those results to its basically free promo. So I did ten customers, and those ten customers are from the first ten people that may have responded to my ads. And then those people are posting the results, or Im posting the results and sharing them. And thats how I would get more customers. And then I also would raise the price. So if I say Im going to run a sale and my sale is $347, I dont know what it is about the psychology of the number, like the 47 or the 99 that always seems to draw people in when you have those price type of ranges. So I could do 199, I could do 299. But something about that three, 4729-919-9399, those are the prices that I typically try to stay in the range of. So the lowest I would offer is I offered one time, like $147 to start and then the monthly fee. So, I mean, it kind of depends on, lets say today, and we say our demographic that were going to target is, I dont know, lets say we come up with the demographic Im looking for and then were going to target those people. Thats how we would choose the price point. So when I would run certain ads, I would run ads for people who are looking to purchase a home. So if I know anything about purchasing a home, its a stressful time. You need your credit score to go up, blah, blah, blah. You want to do it as fast as possible. So lets say Im going to do a rapid rescore and Im going to help the customer. I would do a smaller fee of 347 or even the four to $500 price range because its not something thats crazy thats going to hurt them, but its also not something that will take from their closing cost, it wont take from their home price. The appraisal could be usually around $500 as well. So we want something thats affordable. So its not necessarily luxury service. Its affordable to help you get on track to where you want to go.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Correct. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"So in my head, that just threw up a red flag. Im not sure. Why does the correlation of credit score have to do with advertising? Because I would not want to finance anything for advertising.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"So my class that I have right now, its ending at twelve. I have a break for 1 hour from twelve to 110.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Give me one. Let me connect you to my car. Im so sorry.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"The way that my mind would kind of work would be I forgot who it was. I worked with somebody before where they had leads and they were like, oh, these are our packages, its a 599, 699 and 1500. And I think I ended up going with the 699 and they gave me like one free month and then I paid for the 699 a month and then the ad spend as well. So I dont know if you guys have packages that are along like those lines or how you do it, but I wouldnt necessarily put a price on it. I would just have to understand how you guys work and operate because like you said you did. Go ahead and email me the case study. So if you could show me like, hey, this person did this and this is their result, then I would know along the lines that would be where I would need to be along the lines of as well, if that kind of makes sense.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Im definitely open to it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hi. Who is this?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes, I have that somewhere. I dont know where that but yes, like I said, I think it was May in 2022, I shut down all of my businesses to sort of just be home with my baby, because it was a lot it was overwhelming.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats honestly very hard, because at this point, Ive never worked a real job. Im about to be 28 years old in June. Ive been living outside in New York City on my own since I was 18 years old. Im currently a stay at home mom with two kids, and Im in school full time. So all of my things that I do, I dont necessarily have to have a business. I dont necessarily have to go back to school or anything like that, but these are things that I want to do. In terms of the credit repair, I started the business when I want to sell. Well, I started credit repair when I was around like, 21, 22, because I had really bad credit and I learned the laws and all of the SDRA and all these different things. And then I just started helping my family get their credit on track. And then for my family, it was like, okay, well, I can actually do this for other people. And then it was like, okay, how do I what are the next steps? So that was sort of like I dont want to say it was a passion. It was just helping people. So, yes, the finances are good. Yes, I can go like one month I did $10,000 off Facebook ad, and thats great, but Im not saying specifically its the vehicle for money or the freedom, because I already have the freedom. Yeah, so I have the freedom, and I have also the passion. But everybody who doesnt like money, right? I have some kids. Im usually home with my kids. So its just like, its a little bit more comfortable when you can just say, hey, were going to pick up. Hey, were going to pick up and go do whatever we want. And Ive kind of been living in that space now for ten years, so I guess at this point increase what I have going on, but kind of make it a little bit more situated. So that way Im not so hands on because like I said, I had to close everything down because it got to the point where I had airbnb. Im in New York, but I have airbnb in Jersey. And Im going and Im doing cleaning. So then I had to get an app that was the people are coming to clean, but then Im getting complaints about the cleaning. So now I went back to cleaning it myself. So its just like, I have to simplify a lot of things to make it easier for me. So Im not hands on.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"At that time? Yeah, it was a lot. It was at least 30 plus. It was a lot to handle by myself. And thats a lot of the reason why I got the virtual assistant. And then the virtual assistant was kind of, like, slacking, and then it just became like, this big. Okay, I have 100 people texting, calling, and emailing, and they want updates, they want this, they want that. So it just was a lot.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"All right, have a good one.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, because this is a science class, so I have the lecture first and then the lab and then its like all day. So its twelve to 110 and then I get out again at four.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Oh, great. How are you?","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So as far as that company specifically, they are actually highly suggested in the thousands of people that are in the move, in the thousands of people that are inside of the credit repair cloud community. I kind of just do word of mouth and just the results that people have displayed that theyre getting like a random company. I wouldnt be too eager to sign up with them because at least for the people that I am in contact with and that Im on a basis of seeing their results and how they operate, its a little bit easier for them to have it in everything sort of in one place.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, so actually, right now, I had a credit repair business. I was doing really good. I had a different Facebook, and then my Facebook got completely taken. So I lost the Facebook ad. I lost the Facebook account completely. That was, I want to say, in 2021, 2022, I had that account. It was up and going, and it was doing good. Like I said, I do have multiple small businesses, so it wasnt like a focal point. I was using upwork to kind of do all of my work for me, so I wasnt really hands on or doing anything. And then when I had a baby, it just was like you spread yourself too thin so you cant do a lot of stuff. So I kind of like I had airbnb and I had a mini med spot. It was just too much. So I closed down everything and I said, okay, let me just kind of focus on the financial aspect of all the things that I was doing. So Im actually about to go take my real estate exam and my life insurance agency exam, but the main focal point will be that just finances basically. So it will be real estate, whether you want to buy multi properties, the life insurance, whether you need to do it for like if youre going to die for your credit, theres policies for it that will pay off your credit when you pass away. So its not going to your spouse or just your family or whatever the case may be. And then the main focal point, which will be all tying back to the credit repair because you have to have good credit to buy a house and everything else as well. So thats just sort of what I want to focus on right now. I know Facebook ads work, so I know that anything thats kind of automating everything for me will be a little bit easier having to find a brand new, like a virtual assistant and a whole team all over again and train them and its just a lot. So Im trying to just simplify anything as much as I can.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So this month, like right now, lets say were going to start ads today. I would say, hey, my Max for me that Im comfortable with because I have seen ads where Im doing $3 ad spend per day and Im getting a lot of leads. It would make sense for me to only do an ad spend of maybe five hundred dollars to one thousand dollars per month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, so I do have good credit. I am in the 700 range. Range. I havent checked it in a while because Im not applying for anything. I dont want to use any sort of financing. So Ill just put that out there. If thats a part of how you guys scale and use credit cards and things like that, I can literally just pay for cash with whatever Im going to be doing. In terms of the ad spend or whatever you guys need to do.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"So right now Im not doing anything youre giving me when Im trying to basically restart everything that I have going on. So I havent been doing anything for this year of 2023 at all.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay. So when I see numbers like that, I get intrigued. Ive seen people that I started a class with turn into millionaires in the matter of a one year or two year span. So I am open to, hey, let me put this money inside of it and lets see where we can go. I just need some sort of like, okay, this is how it works. I know a lot of companies that have the case studies and things like that. They offer that one month or three month, 90 day or whatever money. Back or however I am willing to sign up. Im going to look at this case study. I have a break at around twelve from class and Ill look at it and I just want to see the steps. If you have a game plan or the steps that you said that we should follow to start it up, Im willing to take them. Im willing to be on board for whatever your company is saying. I just need to get this, the steps that I need to do before we sign up, you let me know them, Ill do them, and then we can go from there. So that way everything can just be a smooth process.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, thank you so much for giving me the call.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"So I am actually looking for a new, I guess, virtual assistant service that can kind of do everything. So there was a company that actually does the work for you, and they have a dedicated customer service line, so Im thinking about possibly signing up with them so I dont have to actually sit down and, like I said, spend that hour doing the work myself and just hire the company.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"From.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yes. Other than once the virtual assistant was hired. Correct.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Honestly, when everything became overwhelming because like I said, I had all of the different businesses kind of going at the same time. I was just like, okay, let me just shut everything down. So now as Im thinking like, okay, what was the highest income, that was the easiest, Im going to go back and reopen those. And the MedSpa was too much work because I have to order products, I have to pay for advertising, I have to hire an employee. And I had employees and then some employees werent reliable. And then if I have to go inside and go to the salon, it was just a lot. So now its just like the two that I think I just want to reopen is just the credit repair and the airbnb. And thats why Im looking for someone to kind of handle the ads and everything else to sort of alleviate that. So theres no ad that I have to put up. I dont have to do much work. Im just going to recreate a new website and go ahead and get everything sort of based off of that website and hiring a new virtual assistant or just going with actually not even Im not going to do the virtual assistant, I dont think. I think Im just going to do the company that has everything sort of built into it and its that one monthly fee. And theyll do the letters, theyll do the consultation, and theyll do the customer service line that the customer can call anytime.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So as of right now, its going to be nothing. I am unemployed. Im a stay at home mom. If were going to go off of my husband, hes doing like 100 and I want to say 50.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Um, Im gonna say on a minimum. Let me see. But on a minimum, it was at least ten. At least ten?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"So, like when I told you I was in the car going to class, Im literally going to class right now. Honestly, I would sign up with you. You can just show me the numbers. Thats it. You show me the numbers, you tell me the process. Oh, this is someone in my class right now, and thats how Ill operate in terms of the finances, I am willing to put that extra money in. Im going to look, I see this for what is this 4 million? Is that 4 million? Is that what thats like thats 4 million a month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. When I started Credit Repair, theres actually someone who took the same course as me and used the same software, and she charges $997 for some program that she came out with on how to make a million dollars and how to do this and all these different things. So I dont mind doing that. I was in the life coaching space for a short amount of time, but I felt like it was too hands on, and I never kind of figured out how to automate it in terms of the group sessions and the different exercises and things like that. So Im not sure if thats more along the lines of what youre talking about. Like a high ticket coaching for credit?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. So I definitely did not get it if it was supposed to be to that email.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Honestly, I would be comfortable with one, lets see, for the whole year or you mean monthly or what do we monthly? Honestly, that ten K range is a good range for me. I live in New York City. I walk outside and I spend like $300 a day, literally. Okay. You can do nothing and spend a million dollars a year.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Because Im already at 3 hours used up in my day. And like I said, Im with the kids.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Tell me which email you have on file? Because the main one that I use is just my name at Gmail. And if it was sent there, I did not get anything because I checked that every day.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"So as of right now, I am in like a million different Facebook groups. I used to do webinars on Zoom where I would just record I would do one, live one and then record it, and then I would send out the link and do it like once every week. And people can come and usually what will happen is because Ive done this, even with airbnb, where I would say, hey, Ill teach you how to do an airbnb for free. But then at the end of it, theyre like, okay, well we need more information. And they would end up buying my ebook for Airbnb. So I took that same thought process and put it into the credit and thats how I would get a lot of sign up from that as well. And then the groups and then just word of mouth.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Correct. So everything I need all of the time. I need to be able to just say, hey, all right, I have these 2 hours of class in the morning. The rest of the day, were doing our activities. We do a lot of activities. Just busy, busy, busy. So I just need to be able to focus on what I have going on with the kids and then just a lot.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. Yes. So I have a few small businesses. I am a full time student. Im trying to kind of restart my businesses after having a baby, rebrand everything and just get everything kind of, sort of automated. So Im not sure which. I saw a few ads for, like, Chat GTC and different funnels and things like that. So Im not sure which one specifically it was that you had, but I am definitely interested in getting something kind of on the ball and rolling.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Its the freedom, like you said. But I dont want to change already what I have going on. So if I know every day it takes me 2 hours in class, and then I have 1 hour where Im checking emails, and then 1 hour where Im actually doing the credit repair for my customers. I dont want to take it past working a max of 2 hours or 3 hours a day.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Correct. So it started off with me doing webinars. I was doing the mailing out. I was doing the letter generation. I was doing the auditing, I was doing the phone calls. I was doing everything. And it was just like, okay, this is way too much. Let me see about the assistant. The assistant started to take the calls. The people that signed up, I would then talk to them after their credit report was imported. Once they talked to me, I would tell them, like, hey, these are the rules. Dont sign up for anything new. Dont go use a lot of your credit. Dont do just all the things that they need to know. If you see anything in the mail that comes to you, please portal. After that, it will go back to the virtual assistant to sort of send out emails that were for people that I didnt see anything generated for. So I would do, like, a weekly okay, check in of the progress myself. But everything else went to relying on the virtual assistant.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Honestly, because this wouldnt be my only source of income. Like I said, my husband, he makes really good money. Were comfortable. We have house, half cars, everything is kind of situated. Im not looking for anything thats going to exert too much of my energy because I do have a 14 month old, so that is where I want to put most of my time and energy. Like I said, Im in school, so all my classes are online except for one Saturday class. So thats where Im going literally right now. So other than that, I try to spend as much time with my kids as possible.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay, thank you so much. Actually, Im so sorry. When I answered the phone Im having a surgery, so I thought you were from the people for the surgery. Im like, why are they calling me? Theyre calling me every day, so Im sorry, but theyre calling me every day about the same thing I speak to them about every day, so Im like, okay, no worries. Off. Okay, awesome.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}}]