[{"pageContent":"Okay, good. So, Christina, the big why as far as money is concerned, when you start making some serious money, how is that going to change your life? I know youve got a why for yourself as well, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That was ultimately my idea, but I work with people. Im not paying them. They got excited, so theyre basically just doing whatever because its a great idea.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So I did not finish that because its the production stage yet, but I took screenshots of that page so I could reach out later, is what I did.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Basically, thats all.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay. All right. Got a general idea here. Okay. So again, we usually kind of find out what you want to do. What the big why is for you to get into this.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Illinois.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Right, so that is my part, and I have developers that will be working on product development and everything else. Okay. For whatever the idea is on my end, they can develop that. But to market that, to do marketing, and then to get clients, that is something that I dont have right now.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"No, of course I can do face to face.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Id say two or three months ago.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"When?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Maybe. Yeah, absolutely.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"All right, cool. I got it. All right. So one of the things we always kind of touch on, just let you know, is we tend to go through a process of with you. They would be hypothetical questions as far as getting clients in the whole client process and so on, and what kind of marketing youre going to do yourself to get to the different clients. And Ill touch base on that in just a minute here. But normally we ask those questions to people who own a business and ask them what is their precise process that they have in place now. Well, since youre kind of building this, these would be hypotheticals to you kind of a thing. So as far as, for instance, having a process in place to get customers at will, have you got any ideas on how you would go about, lets say, starting that and going out and just getting a ton of customers at will?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"To shoot for, and then kind of absolutely, yes. When the product is fully developed, because I have another idea for a great thing that ultimately hadnt been done before, and its going to be very good for local businesses in any state. Once that is done, then its going to be how many clients we can get within local businesses onto that platform.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right. So the thing is that we have two projects that are going on. One is a platform for artists and photographers, and its like a CRM platform. Not only CRM, but also for them to advertise themselves, and then we just get small percentage from them. But we have a different project that were doing right now, and its connected to consulting and product development in general. So for the consulting part, its going to be for mid size businesses and entrepreneurs. So I think that that is a good fit.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im not going to buy a Mercedes quite yet. Maybe down the road do it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Id say so, yes. But I get people excited, and then its working out for me that way.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Okay. Is this something thats going to be Windows based, or what kind of operating platform is it going to be on?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay. All right. So lets see. Is there a certain market or vertical that youre going after?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"After the product will be built, after the product will be built, I think that I should take care of that and set income goals, because right now it doesnt make sense because I dont know what the roadblocks will be on the development stage and ultimately just making that happen, things get delayed sometimes.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Whenever you please, whenever you decide.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, great. Okay, cool. Yeah. Pricing. Have you thought about as far as getting Im assuming youre going to be getting, like you say, getting clients to certain businesses and so on.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I did not finish the second step. Right now we are building a product that will require marketing for a digital agency.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Because its state by state base. I think that by supporting local businesses, were bringing more taxes to each state, and then the state has a chance to become better.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And so I didnt want to over promise myself anything.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay, so the software, the product itself, is this going to be the generating tool to get them clients, or are you going to use that tool yourself to generate clients and then sell them a base of clients?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats great.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats right, yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Im doing well, thank you. How are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"To use I have friends in California.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}}]