[{"pageContent":"So I have closed, lets see, two leads out of, I want to say, like 40 or 50.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right. Go to my website.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So Ive switched to this new company and same kind of thing, it takes a few months to get rolling. Obviously, theres a lasting impression from the first people that did stuff, but at this point, were almost 60 days in. The website has been launched for 30 days. Not one phone call. Its all been based off of my own footwork. So basically I told Angies to take the backseat because were done with them. We spent $5,000 in the first quarter, or more, if Im being honest. Almost $7,000 for maybe two leads. So the return on investment was fucking pretty close to zero with those guys.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"730 is perfect.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Straother S-T-R-O-T-H-E rbuilt. Built construction. Strawberbuiltconstruction.com.","metadata":{"fillerID":33,"fillerText":"Yeah","category":"E"}},{"pageContent":"Over a decade.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"This is air. AI.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Literally going to be 30 days. You got 30 days to prove something, or Ive got to go another route.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"No. Im going to go ahead and wait for that email and see if I cant throw a couple of hours on that today.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Good, how about you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, as soon as I learn how to scale mine.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, and I havent ran any real ads. Im working with Yelp right now on their ad side of things. Theyve reached out to me and created that business page with them and got that populated with photos and information and descriptions and BIOS. So now theyre trying to get me to do the I think it was $700 a month ad program to start off and see how it goes. And if it sucks, then obviously done with that because Im not going to hold things out for a quarter to see if theyll vest anymore.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hey.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I would like to make money in every avenue possible.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, no. Holy shit.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Id say, like, easily 100.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So obviously more than just dipping your toe in. They literally took all the profits off my first job by doing that. So theyre able to send leads while your leads are off that youre paying a couple of $100 apiece for.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, basically my budget is whatever, really?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And the biggest problem with that was a lot of those people, I would say 30 of those 50 people werent familiar with the process. They didnt realize when they were just clicking three buttons to figure out how much this said service cost was that they were actually going to have somebody calling them within five minutes. And I would say another good percentage of those people also were really just tire kicking, you know what I mean? And find the cheapest, most bottom dollar guy in town.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"For me. Helps me gain further traction away from that mindset of, like, oh, shit. I had nothing to start this business off with. I started with $0 and worked it into a 25 grand a month deal, which in the first few months, I did a lot of that work myself. So the numbers will be a little bit off on the construction side of things because thats lower margins. But like, that 25 grand, that was literally 20,000 in profit and $5,000 in labor.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Go ahead.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Gives me more time with my family, which is one of the bigger reasons why I did this. Ive been working fucking 60 to 80 hours a week for the last ten years, and life goes by fast, man. I bought a new house six years ago, and it feels like I spent maybe fucking 8 hours a week in my house, just getting me back around the house. More time with the kids, more time with the wife, freeing up that w two mindset where I was on a salary so I knew what I was going to make every single week. So obviously my mindset shift has been something Ive been working on greatly. To take the small things, like just being in business for six months, that doesnt happen. Some people go out of business long before that. And taking each accomplishment and putting it on a pedestal because it is a landmark of growth. I can just say the fact that I havent been employed by anybody for six months and Im still being able to pay my bills, I bought brand new vehicles. Those things are all things that Ive had to kind of sit back and just be thankful those happened and those were able to happen.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Iowa. Definitely a good angle. Never really thought about it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Appreciate it. Thank you.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"And then just the ability to have enough finance, cash flow, whatever you want to call it, to work on business instead of work in business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Getting the business out of the garage into a building, giving myself the capital that I need to grow this business while doing whatever happens with this side of things would be nice while Im in the contemplating phase.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So right now I just went through starting yeah, I started at like, a 720. And with all of the hard pulls trying to secure funding and this and that and the other and buy a new truck, Im down to a 650.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Oh, yeah, easily.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, thats where we should be.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Basically construction and remodeling. So right now, obviously, home building is not nearly what its been in the last even year. It slowed down substantially. So remodeling is really popular right now because its a lot cheaper than buying that new home.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Everything. I made 75 grand last year at my old job, so everything it allows me to reinvest back into this company, open other companies, possibly. Ive been looking into the restoration side of construction and wouldnt hate buying one, buying a franchise and getting that going as far as construction goes, or theyve got kitchen and bath franchises you can buy to start off, and especially with already having the clientele, the leads, those type of things. So definitely marketing and scaling and expansion.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I think three grand.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Another really big thing that Ive seen. You have to do the footwork. You have to be everybody. You have to wear all the hats in the beginning, but after you establish something thats solid and you keep growing upon it, you have to step away and put people in place. That would definitely help me put people on the payroll and allow them to run the business how I would as Im growing the business and scaling the business. Obviously, if this was going on, it would allow me not to have to worry so much about everything all the time.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I think if were saying theyre $50,000 we would generate on a basement finish anywhere from $5,000 a job.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"When your leads are turned off and they turn back on, theres no notification to it. And again, even if the leads are off, nine out of ten times, they have some type of way, whether its an exact match or a market match or something like that, that comes directly to you no matter what. So even if they spent the 500, so we would spend that 500 and find out that those leads that we just spent $500 on were trash and were two weeks a month. So now, under duress, they have job opportunities. So you can click on these job opportunities that cost double the amount of a lead, or 30% more at the lowest.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So Ive got the website. Right. Ive got the lead generation service and the SEO.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Definitely kind of want to be around with them. Vacation. Havent been on a vacation in probably four years or something like that. I want to say, and I cant say thats just because of any other financial thing, because we could have definitely done it, but it was more COVID based. We didnt really like traveling because its not really recommended, and we like to go out of the country when we travel. We didnt want to take kids down to the Caribbean and have some problems far away from home.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Central.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Obviously an honest starting goal because I do construction remodeling, so obviously its a high ticket business. I can do a basement finish, this 50 grand, and I would easily like to do four of those a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. Well, its cost me a lot of money sitting and waiting for something to fucking happen when really everything thats happened has been my own footwork door to door.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Like, as well, man. I mean, they called me and told me, oh, well, do the ads. And right now Im kind of at a crossroads with it. Theyre like, do the Angie ads. You didnt try that. Lets bump your spending up to $1,000 a month. Because I had my spending set at $500 a month just to try them out. And the first month, we spent $3,800.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Say again?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Oh, yeah. Ive got one year old, a three year old, and then I have an eight year old niece that I have custody of that Ive had to take care of for almost eight years. Totally.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I planned on spending in the last six months, I planned on spending $2,500 with Angies, and Im clearly on the road to ten Gs, so its really whatever I can accommodate for, whatever I do. Make good money.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Two or three grand for something like this right off the bat, for a whim, because obviously I come for checking out ways to scale my products as opposed to my knowledge, which turned into a product. So its definitely not I dont know if this will necessarily I mean, it will help put visibility towards my business, but its not going to exactly help get leads for my business, which is the thing thats going to pay for this until it actually turns into this million dollar company every month, or 100,000 or 200,000, whatever it may be.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I do have the Angies, so thats obviously a process. But as far as what youre talking about no. I do have a website that Im working on making highly convertible to accept some type of lead funnel to get these people in just under three clicks to then be entering information and asking for some said service.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Just in the beginning right now. Yeah. Were not really trying to put the once we get our feet on the ground. Ive only been open six months, and right now were doing about 25 grand a month in the very early phases of this, which is great, but obviously Im needing more leads. Im needing more and more and more people to get in front of, talk to. I do very well with closing. So, like I said, the only people that were actually going to close and as me being a new sales guy, because Ive been swinging the hammer for the last decade, the people that are willing and ready to buy, I closed them right there on the spot. No contracts, no nothing, just ready to go. Ill tell you a little bit more about us.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So right now were using an SEO company that created that website, which is supposed to drive leads, and we are using HomeAdvisor, which is supposed to be or Angies List, which is supposed to be driving leads. And the website I just switched because I had somebody for four months that did not work out, literally generated no phone calls, but other SEO companies calling me to ask me to switch.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}}]