[{"pageContent":"Email with your information and everything and then maybe a calendar where we can let me read up on it first. Send me all of these that you tell me Im going to read up on it and then send me like a calendar or something where we can kind of set up another meeting between me and you and we can talk more. But at this time Im going to have an idea as a whole of what you guys do and offer and all of those things. So were on the same page. Awesome.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"That is correct. That is my email, yes.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Not necessary. Not at all. Because I feel like my potential can be greater, but Im not willing to stop my life to develop that full potential because I still want to leave. I dont want to just leave my life as school numbers, work school numbers, you know, I what mean, I still want to enjoy my life outside my vision. So I dont want to spend 12 hours daily for ten years and just work 14 hours a day and study all that and then just not have a life. I want to have a life, but at the same time, I love that my vision.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, yeah. All right, awesome.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Hello? Hey, Jesse? Yeah, who is this? Hey, Jesse.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Jesse I think its like 630.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Does that sound right? No problem. Yeah. Send me that information so I have a night. All right. So I can read up on it or watch the video, and then we go from there. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Alex from who?","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Thats why I say ten grand, thatll be ideal for me.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sky is the limit. I dont really have a goal. Whatever I can, you know what I mean? But I like to get at least ten grand a month, minimum. $10,000 a month. Thats where I envision myself. The minimum, I will settle for $10,000 a month after taxes and everything. Thats money that I bring home after taxes, ten grand. I can probably live comfortably with that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. So why dont we do this? Can you send me an email with your information? We can set up a call because this is a little late and Im at a bar, man, so much rather talk about this during the day, in the morning.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right now? Yeah. Around there. Yeah. Okay. But from this 5000, you got a lot of expenses too. So probably after 5000 only have like $500 left.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, right now, this time of place, Ill probably do five. I feel comfortable with $500 because like I said, think about it. Going from eight employees to two. Thats big. I feel comfortable with 500 right now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"All right, man. You, too. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Just because business is not that great, okay. Before, no problem. It wouldnt be a problem. 15, $2,000 monthly to invest before. But nowadays, just because the economy is not great and I say the economy because I did my research and Im like, I did nothing wrong. I have the same vendors and everything. Nothing has changed. Ratings are the same. Why I go from eight employees to two employees, so Ive got to be the economy. I havent changed the damn thing.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"More focus.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, no, because Im a very ambitious guy. Exactly.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"That I dont know, man. Why dont you send me an email with all the information and I can reply back to you so you know that I got it. I dont really pay attention. I just did it real quick because I like the concept. What I saw in the video that you can do AI can do all of these things for you because I just went online look for software, AI software for very specific things. And if I can get a software and the software can give me answers as a reference point, thats great. Thats what I was looking for, reference point answers. I was looking for sports betting, artificial intelligence. So kind of give me an idea of the predictions.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I dont know, because thats a very broad question. If I have the resources, Ill tell you, Ill give you a pretty good, decent number. But because I dont have the resources, because the economy, I cant quiet. But if I have the resources as much as required or recommended by the pros right.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Not necessary, because I want to live to a certain extender. So Im not comfortable because Im not at that standard that Im looking for. So I educate myself every day. I study every day because that will help me achieve my goal and my vision. Thats why I do that. That will help me achieve what Im looking for. So Im still doing it since I was 20 years old, reading and all of that stuff. Im pretty much self taught. I take the initiative, I read and I learn, and I get involved in the community, the forum, other people I like, and then I learn from them. People that have a lot of experience. So every little thing helps.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I guess we can, but yeah, I have a small computer background and I try to keep up with the technology or whatever is coming up. Okay. Just because Ive been dealing with the computers for a long time. Not anymore, before, because Im doing some other stuff, but its still there. So I utilize that what I learned prior, so I can understand the new technology in the new era, the new things coming up.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont know. I dont really count it. I have a small little business, but because COVID War and everything thats going on around the world, I went from having eight employees to two and myself. Now Im having to go in the field here and there. But for 40 years I maintained and then I just stay home and they manage the company and send my guys. At one point I have twelve employees, so now Ive done size to two. And nothing that I did wrong, like as far as marketing or ratings, everythings the same. The company established. I dont know what went wrong. The only expansion I have is the economy.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}}]