[{"pageContent":"Thats it.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Hello, Dr. Baker.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right. And of course eventually you got to take a look at the numbers and see how many people go through the various stages as far as who would want to put in their name as far as getting more information, the stages and see how that works. Because of course you want to make money at each of the checkpoints to get into the high ticket of points at the end.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I think that probably makes sense because the big thing is you dont want to waste time, but you also go, well, this is a pretty good idea, and I mean, someone else will run with it if I dont, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, number one, Im a dentist, and so I have kind of a bricks and mortar basis that Im coming from, but Im also interested in Ive been looking at generating some ideas on content courses, but Im still kind of working my way through that as far as figuring out just what might be accessible to the populace.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Would this be the call then, with the consultant correct. What was in yeah, Ill probably be pretty Ive got some marketing things Ive got to do for my office this weekend. Im going to be a little tied up to read just to listen to that correct video. Id kind of like to make sure Ive got a chance to take that in stride. Lets not take Monday.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right. Because what happens is they bite down long enough. What happens is the sharp points of the teeth, the cusps wear into the fossils or valley of the teeth. And if they do that and if they clench long enough, which is one of the major ways that people grind, some people will grind back and forth and brux the teeth kind of level. But most people, what they do is they set their jaws and they clench. And as they clench, the cusps grind into the valleys, and they actually create a groove there that once that groove is in place, which can happen as early as like 24 or 25, its very difficult for them to deprogram, to reverse that because the pattern is just worn into the teeth. So as they close down, its just natural for them to go back to that position. And so youve just got to get back to a situation where weve got to break that pattern. And of course, the best way to do it is if you just get people to stop it before it starts.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, not too much. Like I say, Im just kind of like working my way through it. Im just trying to figure out how Im going to go ahead and go through all of the parts. Because obviously I figure its got to have about two or three parts where its like theres a free course section. And then a paid course. And then another paid course. And then something that would actually lead to either a network or somehow of working it into actually appliances, if necessary. Or a network of dentists that could work this way. And so Id just kind of be a marketing but thats kind of what Im thinking at this point.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I mean, in a strange way, what happens as people get into stressful situations in the mid part of their life when theyre in their twenty s and thirty s, they have a tendency to clamp down. Theres some dopamine releases that go along with that, but so they have a tendency to, so called, set their jaw or bear down on their teeth when what they should actually be doing, and which is widely practiced in martial arts, is they actually will keep their teeth apart. Their lips together, but teeth apart and actually do nasal breathing and a range of things actually, if anything, kind of work their lips to a greater extent. Not their teeth. And that has a lot of benefits as far as, first off, not wearing out the teeth. But then also it has some causes of youthful appearance as what happens is as we get older, because we kind of stop expressing as much once we get into our late twenty s and thirty s is we just have a tendency to let the lips or the basically the muscles around the lips this kind of atrophy. And so thats part of what causes most people to look to age a little bit earlier. Also a reason a lot of them develop these creases from around the mouth barrel and that like I say, I mean, its still a work in progress, but theres a lot of moving parts, I guess.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, probably about 70,000.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, just as Im studying right now here in Phoenix, we have the Spear Institute and Frank Spear has been working with Warren Dentistian for quite a few years. And so hes put together quite a bit of research on just how to reverse worn teeth. And what hes found is that what happens is people wear their teeth, the teeth will still erupt afterwards. And so what happens is they grind their teeth down, making them a little bit shorter than they would normally be, but then the teeth erupt a little bit more as they erupt. They actually bring the bone along with them. Im not sure if in looking at people that are in their late 30s or 40s, youve seen some people where they almost look like dennis will usually call them rat teeth, where theyre just kind of like their teeth, but theyre only like about instead of being the normal 11 mm long, theyre like 4 mm. Its just like you look at them, youre like, how did you do that? And what actually happens is they wear them down. They wear the teeth down, but then the teeth erupt and they bring the bone along with it. And thats why to reverse all of those things, like what a cosmetic dentist has to do with a mouth makeover, is they literally have to do ortho and they have to push the teeth back up into the jaws and thereby reversing that situation where the bone then follows the root of the tooth back up. And so then there gets to be the space there, and then that space you fill back in with crowns. Thats kind of how full mouth reconstruction is done.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I mean, its, you know, and thats kind of the problem Ive got is it requires a little bit of nurturing just to get people to kind of sign up for it. But I mean, people who a lot of times it happens within families just as theyre familial patterns that are passed on. A lot of people think theyre genetic, but theyre actually familial patterns. A lot of times it doesnt work very well with the person whos already in it, but younger family members can actually see it. And so its one of those things where youve got to nurture it and then its kind of like when they see it in their own family, they kind of go like, oh, that could happen to me. And so then its just kind of.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Well, I mean, its just a question of understanding the process well enough and then its kind of like, okay, Im sure youve had this situation where youve got a great idea and youre going like, okay, theres a problem. I kind of see a solution for it, and Im kind of like, how do I make money? And it just hasnt right. With the amount of free time Ive got, Im kind of going its like Im trying to run my dental practice, but as you do it every day, youre kind of going like, theres that problem again, and its already too late with this guy, and I can treat. If I work really hard, I can probably convince this guy. But, boy, it would really have been nice if I could just have gotten in there, like, three years earlier and just talked to this guy about what was going on, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure it does.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And thats kind of been the problem as I look forward its just trying to find enough free time to actually move on some of the stuff just. Doesnt allow it.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I dont know, 820 or something.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, if I wanted to tap into something, I probably have about, lets see, probably about 20,000, I guess.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. See what its all about.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"That sounds good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Lifes too short. Theres other things to focus on, so I think I need to do that.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Well, its pretty full up. I think Ill just pass at this point. And I appreciate your call, but I think Ill have to go a different way, or perhaps our paths will cross a lot of your time.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Right. In a strange way its people looking old, they kind of take in habits that make them look older before their time. And I just think theres ways that that could be reversed or at least slowed down.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, lets see. Ill check.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Well, when you get right down to the money, the big payoff is actually it prevents sleep apnea because thats really what causes a huge thing that causes sleep apnea. Everyone thinks like, oh, people are just eating too much. Well, no, whats happening is their airway is closing down. Basically, theyre wearing their teeth down. And so the space that the space of the airway comes through the mouth, plus the fact that because theyre not using their mid face musculature, theyre usually not using their nasal breathing quite so much. Basically what happens is all of their airway comes through the mouth, then the mouth is closed down because theyve ground this pattern in to hold their teeth back rather than bringing them forward. Most snor AIDS work by advancing the lower jar, advancing the mandible to open up the airway. But in this case its kind of locked in a retrusive position and then their tongue falls back and so they get very little air into those lungs. And so basically what happens is while theyre sleeping, they can go seconds without breathing. You take a look at the pictures, its just unbelievable. People will stop breathing for like 50, 60 seconds if they were awake, theres no way they would do that. But at night thats what happens. And then what happens is they become hypoxic while theyre sleeping and consequently their sleep is really bad and consequently their mental functions the next day arent so good. It goes on and on, but it just causes huge problems. It causes immune problems and just goes on.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its tempting for certainly. Like I say, its kind of like, well, it probably makes sense because if they thought that it didnt make sense, they just tell me it makes sense.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ill just take a break at this point, I think.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I think Ill have to hold off on this at this point. I just have other things going on, I think.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Not exactly. No, I dont.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im not sure Im going to get around. Its one of those things. And maybe itll happen, maybe it wont. But if I do, Im going to need some help. And so thats where technology and framework helps to pass at this point. But thank you again for your call, and I think Ill hang up now and move on for sure. Okay. Thank you. Absolutely.","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Well, I guess the way Im thinking about it is just starting off with some pictures of people who are already having problems and just kind of like splashing that across on a YouTube channel. Have you seen this guy? Its just kind of like and Im not sure if YouTube will let me do that, but they have some problems with things that are too shocking initially. But idea because a lot of times if people see things that are its not exactly gore, but its certainly disquieting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, ever since Ive been listening to Spear, which has been about two years now, where all of a sudden Im saying its like and then its kind of funny. Its like once you know what the process is, because they really dont talk about it too much in dental school. And also insurance doesnt like that. And thats the other thing, is that insurance doesnt want to get involved in tooth wear because its so epidemic. What they want is like, tooth decay, which is theyve already got a way to figure out how many people are going to have tooth decay. So they have that all figured out already, but they dont with where I mean, some people say its as high as 40% of the population and probably higher than that, to be real honest. And so the insurance doesnt really want to get involved in that. And thats kind of to some extent, I think thats probably a benefit in that benefit to me anyway, because a lot of people just its a problem that people have that there really isnt a great solution for.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I was just thinking, okay, you get that. And here listen to two minutes of how did this happen? Its kind of strange. A lot of times with that type of thing you look at things that are stressors as far as ADHD or smoking or even sleep deprivation. I mean, a lot of times people are just really working their teeth a lot just because like I say, theres a dopamine release and then if they cant relax at all, youll just see that ramp up. That was kind of my idea. As far as starting out, like I say, Im just kind of like experimenting a little bit. Ive looked at a few different programs as far as to generate some of this stuff. I havent quite done any of the steps yet. I probably just start out with Cold Call and just see or just start out with that YouTube and just see if theres any interest at all.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right, okay, exactly. Even then, its like, okay, Ive got this great idea, but I mean, theres hundreds of great ideas out there. And the question is, is this the time for this to take off? You have to have kind of a kill point on some of these schemes where its like, okay, you come up with your marketing message, youll do a B testing and try to get the best message and see what hits. But then you got to say, are enough people taking it at the early stages for you to move up? Because theres going to be you get a fall off at each of the points until you get high value, high ticket points. And it basically means you got to have a pretty good yield on those early steps that dont cost very much.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its just kind of like not I think my mind is not ready to pursue it at this point, so I think thats kind of where Im at.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hold on just a moment. Let me pull up my schedule.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, Im just thinking basically just people are having a tendency to wear their teeth out a little bit too fast. So theres a variety of methods that I think they could use to keep from just wearing their teeth down quite so fast. Some would be fairly simple. Other ones would be things where theyd have to actually go see a dentist. But a lot of people just have a tendency to clench their teeth and wear them down to such an extent that they program a certain bite in that once thats formed, about the only way theyre going to reverse it is they actually go back through ortho to put the teeth back to where they used to be. Thats kind of the thing Im kind of exploring interesting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I think that makes the most sense.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]