[{"pageContent":"I have plenty of ideas. Now, what can I do to make this a viable thing? So I will actually have an online business and it wont cover the Cats Creative Club, but it does cover a lot of people who struggle with day to day personal, behavioral, lack of good times, lack of good feeling because of things like stress, social awkwardness, fear. Some people, when they really get going well, they start getting scared. They get scared of their clients and they get scared of their bosses. And I dont know if you know anybody thats gone through that, but usually its kind of like the old painting of the silent scream.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I figured 30 minutes. If I did a 15 minutes call, lets say I could get them to something in 15 minutes. I could get them settled down from some kind of an anxiety or stress attack in 15 minutes. And Id probably have to charge them like $30 at least.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So Im not out of ideas or adverse to trying to Id have to do it carefully because I just wont have the ability to do it right. But I could get started or I could keep the momentum going that way, I think.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I think one of the difficulties when you speak about that is I think a lot of people in a lot of businesses make the mistake of just trying to get prospects, whatever its for. And one of the problems with that is that if you look at the actual cost per prospect and then the return and then. The time factors involved, it does not compute and I just will never do that. I would advise anyone against doing that. I would surely not do it myself. And its just like somebody Ive been on a lot of podcasts and theres somebody that said, oh, I could get you a weekly podcast and it would only cost you. Its just like some astronomical amount. Well, I know maybe thats really clever and maybe I could get a lot of people who would call me up or whatever, but usually when Ive done things like that, I really only get the freebies and I dont get clients out of that. So I would not look at that as a real thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Sure, go ahead.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im reluctant is because I have to go and have some more surgery and I know Im having that at the beginning of June and I know that I will not be able to do a lot for the first three weeks after that.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"And then I think thats how I kind of have done that. And Ive done that right now. Among my counseling clients, I have a lot of disabled people and physically disabled, and some of them are emotionally and mentally disabled and a combination thereof. And thats how I look at it with them. One of the things that Im doing right now is Im starting private Facebook Pen Pal Group for disabled people, but where they can post their art, whether its computer generated art or original, where they can write stories and post them. And its going to be anonymous because its called the Creative Cat Pen Pal Group. And theyre all going to have the face of a cat, an avatar, rather than for privacy protection, et cetera.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Actually Im a psychologist and I have a long standing background working with individuals and with companies. When I got my PhD, I wasnt really sure what I wanted to do because if I just did exactly what I want to, Id probably just sit and write. But that really didnt prove to be enough to raise kids and things like that. And I ended up being a single parent with two very young children when I was like 22 years old. So somehow I had to say, okay, well, somebody has to be an adult here and I guess its me. So I decided that I would go ahead and finish up my PhD, which I had a pretty good handle on. Keep writing because that had always been the way Id survived on my own since the age of 16 and I really thought that whatever I could do would evolve. Now that kind of turned out to be true. And I incorporated. No, I didnt incorporate. I registered my company, which is Motivation Dynamics, back in 1985. So now, you know, Im old too and so I, you know, I I just, I had to get going. I didnt really have a choice to say, well, Im not going to do this. I just had to get going. And that seemed to be the practical way to do it. So I just started and I have seen a lot of change. I got into computer stuff pretty early on and I have put together training for people in all kinds of different industries. From the legal profession, I had to teach people to use computers who didnt really want to. Back in the late eighty s, I had law firms that were fighting among themselves because they realized they couldnt keep their firms going if they didnt get on the internet and start using computers and all that. I helped a lot of people who were scared to death in the transition time of the turn of the century when everyone thought that computers would crash and no one would be able to do anything. Which, of course, was quite absurd, which I did counsel people, but I also was able to help them put groups together that actually could work together and make that transition. So Ive been doing this kind of thing with individuals, as I said, and with companies. Ive always had a private psychology practice and obviously I cant put that on the internet because Id have to be licensed and all over the world, which wont work. So this going with this approach of being a mentor and I dont really think of it as coaching exactly, but kind of and its sort of interesting to me because a long time ago I did a lot of work for people in schools, the schools themselves, the faculty and kids. And one of the things I used to do to get kids involved was Id say, theyd say, well, I dont know why I should have to talk to you either. But big thing is we could figure out why someone bought them. And then you might look at it this way, if you were a football player, youd have to talk to the coach. So why dont you think of it that way?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats the question. I dont really know. What would it take? How long would it take? What would it take in terms of just stuff that would have to be in place? Because I can by using my PowerPoint and my zoom, which is okay, but it probably wont get me to exactly where I want to go.","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thats for myself. And Ive also researched the cost per sale for many different kinds of companies. Actually the worst one is real estate. People spend, they dont even count their hours, which is time is money and people will pay up to 35, 40% if you get right down to the bottom line to find one prospect or one client. Thats not reasonable in my mind.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im not doing that badly. I dont have high expense life and I dont have credit card debt or loans or anything.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"One of my mentors says, just keep posting. He said maybe what I could do is kind of use a blog to sort of have like a daily diary kind of thing of my progress.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Because I have every confidence that I could do it and I think I have a pretty good way of establishing rapport with people so I dont have to spend tons of time getting their trust, which is a big thing. And because of some of the things that Ive been posting on, even on my Facebook stuff, I know I am getting people commenting or looking for it or something. And I also have done some podcasting in the past and I have had a lot of people who have responded that way either by interviewing on someone elses podcast or podcasting myself. So I think the visibility factor of just becoming being out there and available is probably the thing Im really missing the most. Thats just from my perspective.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And I am going to go ahead and do my webinar and Im still doing all the things that Im hoping to drive some people to have some kind of spur some interest.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, thats the traffic side.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats right. El ZB t h. Fuller at AOL.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Thats really basically what Ive been looking at, thinking about it in just that way that I might not be running, but Ill be creeping anyway. I can keep something going.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So will it work?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So I think that is one of those things that happens and is discouraging. And then in summer, people go outside. Its kind of like if theyre playing like two year olds where they have a truck and they wish they had the other kids truck, or theyre playing like four year olds where they try to play with the same truck. So as long as they dont speak or anything, they feel like theyre still included. But then fall comes and I want to really be going so that I can keep people from having that terrible stress when they realize they have to go back inside. They dont know how to talk to their family or their fellow workers or what have you.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, the last two years have been really bad because I got and I had to have some surgery on my leg and I havent been able to walk a lot and so I am down from where I was. But I have a pretty good base income and I have some income from property that I own outright, things like that.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, it can be helpful.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, I dont know. It depends on what I wanted to do. I havent been big on advertising, so no, I probably wouldnt be thinking of that so much.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im not so into the price. I dont know exactly how to price it. I do have prices and price points and kind of indications of how I would do it on my website. So someone could have a free 15 minutes call with me. Ive got a couple of free things that they can just download and use, things like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I wouldnt be available tomorrow.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Been clearly defined, I have to find that, and I do have it on my website. And so someone would call me up and say, yes, you got me from this place to that place. Ill start Monday or two weeks from Monday or whatever it be. That would be fine. And I do have that price on my website. Im thinking of things like one guy called me from Alaska, and he thought he was dying, of course, because he was having this major panic attack, and he didnt think that he should get on the plane because he would die on the way home. And I convinced him that he would not die on the way home and that I told him how to get himself under control. I talked to him, I think, about 20 minutes and told him to make an appointment when he got back in town. And then I had a conference call with his primary physician, and then we agreed that this was a panic attack and that he needed to learn how not to have a panic attack and if he started to have a panic attack, how not to continue. And I took a little while, but after a while of that, he could actually make travel arrangements and get on planes and go to a destination and do his thing there and leave and come back. So Id like to see that happen more people. So the only way I could make that happen is Ive got to make this kind of a baby step offer, I guess, and then move forward.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Who lived to be 100 would probably have one of those roomba things now.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Exactly what that would look like is Id like to be creating things as I went along. Id like to be doing some one on one stuff that Im doing now. Id like to have groups that I dealt with. They dont have to be big groups. A group of maybe five to ten people who got some synergy going because they supported and helped each other and became friends to each other. That kind of thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I also thought about hiring one of those kind of like those fiverr people to kind of maintain some of those behind the scenes functions for me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, actually, I am living on my business and my abilities now, so can I do it? Sure I can. Would it be easier if I had it all set up on the Internet and all kind of rolling along with clients coming and going and things like that?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So thats probably more than you ever want to know about me.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, probably maybe it got a lot of ups and downs in it, but I have a solid base, so I would say Id go by the annual of about around 100.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"That doesnt seem like very much, and that isnt where Id want to stay. So what would I envision? I would envision that Id go from this, you call me, Ill help you at the moment, Ill get you to the next place and try to get you to make a commitment to a real, say, five session sort of thing, which I would then probably have to charge you at least $50. I mean, $250 for.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sure, if you could, thatd be great.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, Im sorry, Monday. Im really not going to do anything on Monday.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So thats going to put me kind of out there in midsummer. So Im reluctant to start something now that I cant really focus on.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Actually, I do.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, sure. Im always open to learning about anything that could be useful. I want to know whats going on. Ive already looked a lot into AI just on my own because I was curious about it and Ive been following it. And years and years ago when the big spin off of a company called Controlled Data here in Minneapolis area started by a bunch of people that left IBM. And they had all kinds of things that they were hoping to be able to do with various kinds of learning and learning platforms. And I worked on those projects as a consultant for quite a while. They decided, inevitably, that it was too soon, they werent going to be able to sell it. But of course, it only took another maybe ten years until it was a very viable kind of thing and another ten after that. Heres what we are talking about.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Really count for me, actually. And I agree to you in a way that if you arent willing to put out something, you arent going to get anything back. Of course thats true. But I think I want to put that out carefully because Im not its if, you know, Im Im not going to be coming up with 1000 people gathering and having a kind of a thing like that Tony Robbins just did one of these things and he really wasnt live on it. Did he record that stuff live? Yeah, he sure did, but he had people introducing stuff and then came up with things and then he would speak and move around and he had his usual Tony Robbins kind of microphone and all that sort of thing. Im not going to be that guy.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I could sort of quantify the return there, but I dont know exactly what you think would be most important. So therefore its a little harder to quantify the return on.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"This with other businesses that I have. Im really good at responding back and Im really good at messaging and Im really good at getting people, if I do have their email responding to them and they open it, getting a subject line going or getting them intrigued so that they will open it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So, at any rate, lets see. Id have to check and see what I have on Tuesday, and then I know I have quite a bit of time on Wednesday.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I could imagine casting out a kind of a plan, which I really havent done a complete financial look at that. But if I were to think in those terms and thats what I would do, I would make a budget for this particular business and then decide how much the return would be and then what kind of investment would be wise.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thank you. Thank you. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Are you leaving and youre going to the Glass place? Forgot about that. Okay, bye. So, at any rate excuse me.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, I can see that that would be really good. I dont know that right now Im in that spot, I guess. I think if I were selling something that was very specific and like, well, Ill go back to this because I know quite a bit about that. Lets say I was selling something like I have a friend who sells water purifiers and water purifier and air purifiers. Okay. And she sells them on a multi level kind of plan. I could see her taking AI and moving through her processes, all of which are quite standardized and quite clear as to how they monetize. I could see that working really well. Now, the real fact is she isnt going to do that because first of all, as I said, she sells multilevel, which personally I would never do just because I just wouldnt like it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, Im sure anything would be helpful because I went forward and took some action. Now, refining make it more specific would be really good, Im sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Of course. And I want to have things in place.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Will we have household servant robots doing everything for us? Well, its not that far away or that hard to imagine. And after all, how many people have been using stuff like grammarly to make their writing better? Thats basically AI.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"But anyway, I can see where that would really lend itself to, as you say, having the underpinnings of it managed in such a way that you know exactly what everything was. It was all kind of quantifiable. You could expand and stretch the reach. You could become visible in various ways. Although in her particular company theres a lot of proprietary stuff and they wont allow you to advertise on your own. So that would be but Im sure there could be found a way around some of that. I could imagine she could be selling those water purifiers by the thousands, not by the toosies like shes doing now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Wonderful. Im not going to not do my committed things ever.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"How about around lets see if Ive got anything there. How about 10:00 a.m.?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, I have no idea. If I were to look at that and look at what youre talking about, I would look at okay, how much would I put into particular kinds of things? Because lets say you were going to use like a fiverr person to do a lot of the kind of behind the scenes, just keeping track of things and maybe checking the appointment calendars and all that kind of stuff. Then I could see putting out so much per hour for so many hours and that kind of thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I was in my office, but Ive now meandered my way home.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, its central.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And it would have an impact on their lives.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That webinar thing, and Im not going to schedule too much else on that day.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay, thats okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Think about how quickly this is happening compared to the past. I remember my grandmother saying to me how it was so exciting when they got a real vacuum cleaner that plugged into the wall. Here we are.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I do have all that on my web thing and if I can drive enough people to it, then right, thats a big thing. I think by building some kind of a presence is probably the most crucial thing right now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Um, either in the morning? I dont think I have anything right then. Just let me check th okay. No, the 9th. That should be good.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Of course, learning anything about anything new is always good. And then seeing how it might apply to myself, of course.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"If I could see a video like that, sure, I can look at it. Would I buy it? I dont know.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thatd be fine. I can do that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im still going to be Doctor Lizzy and people will call me up and Ill give them something practical and theyll put it into use today and theyll make their lives better and then they get in trouble again, theyll call me again. Im not going to make a career out of somebodys life. If they want to buy a package of so many sessions for whatever dollars, great, Ill do that. And well work through as much as we can in that period of time that gives them something that theyll go away stronger, happier, freer.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, certainly awesome.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Wednesday. Lets see, I will have open time on Wednesday between eleven and probably 1230.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im not looking at some big splashy thing to be able to become more visible, attract people that would really use that service.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"We have an acquaintance who left Google and is now starting something herself that has to do with AI and machine learning. And we cant discount that as a wave of the future nor ignore it in any way.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It is. I dont have anything elaborate to offer. Im not going to turn into Natalie Ledwell or Sage Levine.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Spend some money. I probably either could spend it or borrow it or a combination thereof. I would probably not like to do a lot of that right now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"760.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"And Ive also found that throwing money at stuff doesnt necessarily get what you want.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"This is not going to work now. Maybe we could revisit that in July or something when I get back on track here.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Not on Monday, no. I have family and family obligations. I cant just ignore them.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I dont think I did.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im in the process of putting my business online and Im going to be doing my first webinar 20 minutes free on Monday the 8th at daylight time, I guess it is. Anyway, I think what Im trying to do is there are a lot of people that really struggle with panic, stress, anxiety, and Ive kind of targeted people who have that basic struggle. But more even than that, Ive targeted men and women 35 to 65 because those are the big age ranges of tremendous change. And when men really start feeling remote and friendless and isolated and they also have a lot of fears, they have panic, they get the sweaty palms, the churning gut, the pounding heart, and for men to talk about that. Now, Ive had a lot of success working with men over the past few years on just exactly these things. And so I have some strategies and some quick, easy to do things, stuff that for instance, on my webinar, I promise that Ill give them at least one thing that they can put into practice for themselves that very day I have no idea what to expect. Ive been doing live streaming to try to create some following. Ive had pretty good luck with Reels. Ive gotten up to like close to 500 persons looking at a reel, which isnt too bad for a lady who doesnt like to show her face. So thats basically where I stand right now. So Im kind of at a point where Im hoping. I dont like the hoping mentality. That doesnt really seem like very good way to look at it. But at this point doing is almost like hoping or hoping is almost like doing because I am trying to put these things, as I said, into active use and make them work.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"That would be a major hold back for me more than as to it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, what Im ultimately getting at there is that over the years Ive set up a lot of businesses and helped them determine what would be a viable and feasible kind of budget and that kind of thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Were saying eleven on Wednesday, right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Life is not in a vacuum with nothing else in it. Doesnt work that way. Im sorry.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Just a moment. Just a moment.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, youre saying that I dont think this is exactly clear to me. I dont quite see that. Are you talking about someone taking AI and just taking whatever and kind of taking over the whole thing so that its all automated? Have to think about it.","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Well, that would be interesting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Because I have all my regular appointments, plus I have that webinar live, and Im not going to record it. I dont think its going to be really live, so I have to allow for that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That was wise. And youre saying I dont like the idea that its not like Im saying, oh, well, maybe Ill have to quit because Im not saying this a little bit differently for a month or two or three. And actually as a psychologist, something Ive always noticed, when summer comes, people feel slightly better, but in the spring is the hardest time for suicide. And I dont know why that should be. Youd think that spring would start making you feel more upbeat. But I think what happens in spring is spring is for all of us who live in northern climbs. Spring is so spotty and sport attic and we cant count on it, we cant trust it. And then it becomes like one more thing and the pile of pickup gets.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, actually, basically I try to live on the least amount and then.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, that would be fine.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Well, I guess Im not quite sure what I would have to commit to in order to do any one of these things. And I see that there would be a lot of different kinds of avenues toward whatever it is.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im sure itd be fascinating.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That sounds fine. Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]