[{"pageContent":"Thats wild.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"License.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"You know that.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Right. So what do you do? What are a couple of the things that you do? I dont know. Say you buy dispensary in Jersey and its run like a shit show, like its not run properly. What do you do? Do you do the marketing? Do you completely change everything?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I created absolutely and patented video on demand, video streaming, and then SMS campaigns and SMS banking, which is the cornerstone of all banking today outside the Federal Reserve.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Her name is Amanda Lee. She looks a lot better than me anyway, regardless. And they dont just have one trainer, right? Im sure everyone says, oh, yeah, I know the head trainer. But they all think theyre the head trainers. Right. Or if they dont think that, they tell you that anyway. But thats 13 million fans that we can send out an email or whatever to.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, theyre all in this game. Theyre all canvas.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello? Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Buy them, soup them up, and then see what happens.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right. It just isnt worth being there. But Vegas is huge and Im just closing on two dispensaries there right now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats wild. I mean, theres so much money and theres so much money in it. Im just trying to think where we can potentially thats what Im thinking about, because what does your outreach look like? Okay, so you buy a property. Break this down for me a little bit. Do you have employees that send out Im assuming you get the database of people who have bought from that dispensary. Are you doing outreach to that database? Are you just doing new organic marketing? What do your methods look like once you buy a place and you fix up the cosmetically when you have the actual guts of it that you need to change? What are your methods that youre implementing?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, all right.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"All right? You bet. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So what are one of your biggest constraints? Like whats keeping you from getting to the number that you want to be hitting every month or every year?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Thats leverage. Yeah. I knew Elon personally when he lived in Beverly Hills. Increased revenue with the crypto Canadian. Then everybodys trading on their cell phone. But I want to have the what is it? BTC Depot ATMs both ways in the cashier, because a lot of people use this, if anythings private or confidential. The methods of purchase through BTC Depot is a whole different story. But they charge a fortune. They charge 20% per trade or per purchase. Yeah. So I made a deal with them. We get half, and I want to start putting these I want to put these BTC ATMs in the fastest dispensaries in the country.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Pardon me?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Sure. Well, let me read this to you, David. My company is Er Hollywood, and Im from California. Ive been there all my life until recently. I used to love California, but not so great anymore. Regardless, heres what I wanted to when we go into my throat is so bad today. When we go into a dispensary that we just bought, there was one in Vegas two years ago that we bought out of receivership for about 10 million, 11 million to be exact, including all the extras, but doesnt include the property, such as the business. Again, that business was not making money or they would not be in receivership. So thats two years ago. Right now, two and a million and a half a month to 2 million. And were doing net 25%. Its fantastic, thats audited. Net. Net. So heres what typically we did there. It didnt take a long time, but it decreased the cost through increased buying power. Hold on a minute. Put this word in your mind, Ecommerce, because thats going to be the next huge stage of marijuana or cannabis going national when the Fed says, okay, now I see that happening before bidens through. Wow. So its not like a really long not a really long time. Man and you were saying, Im sure I read on your thing, ecommerce. So thats when you become incredible assistance, er Hollywood will partner with its associate Dispensaries to get better wholesale pricing. In other words, right now, the standard was because if it retails for $10, youre buying it for five. Well, weve got that down to 250. Huge difference. Then you go to somewhere, any major city, but certainly Las Vegas cost at least 50% more to buy gummies or weed or whatever, because its Vegas, right? Everything costs more there, but we dont pay more to the manufacturer. So the potential profit from full service operation is probably close to 45%. Well, theyre doing it in Florida. Not us, but another company. But then again, say, for example, you were True Leave or whoever, and before the pandemic, you had about 30 dispensaries in Florida because you have one of those big licenses like, I dont know, ten or 15 licenses issued in the whole state, but each one of those licenses almost has unlimited expansion throughout Florida. But they went ahead and bought another, built another hundred during three years of COVID And almost all of them, probably 80 of the hundred, are shops doing 3 million a year and spending 4 million to operate. So theyre just open for better times.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Sort of, but I can only do maybe three a year. Four. Thats everything. Now. Some of the projects are unbelievably exciting, like New Jersey wholesale pots, like 3600 a pound. California 600.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And I would say this, even if you cant help this business, I wouldnt know a ton about AI, because once Elon right, waves everybody off it or dont get any further, thats the time to go much faster. Exactly. Hes warning everybody, dont take this AI too far. Could blow up the world, blah, blah, blah. So all hes trying to do is slow down everybody else while he speeds up.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It was RBA. West coast bank in California. I was the CEO. Have you noticed that now? You can get a credit card or a debit card that you can turn off when youre not using it and turn it back on when you are.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Good, how are you doing?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Like, do you hire marketing agencies that you trust to market properly for these new dispensaries or do you have a marketing sector of your company that does it properly?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"In some capacity.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"And do you think that your marketing is do you think that there could be tweaks done with your marketing or do you think that thats not a constraint, its just a matter of fine tuning some things that youre doing? Whats keeping you from hitting what you want to be hitting.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Oh, no, let me give that you wont think of it in a couple of days.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Well, listen.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Damn, thats crazy. Anyway, go ahead.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Heres one for you, man. Know how to figure what location I should be choosing for my next dispensary that you can do. You survey the city. You survey the city, and youll know where the most action is. Okay, Ill talk to you soon.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"We had operations in Los Angeles, but we closed all the theft and whatnot. And were in New Jersey, huge license where the cultivation can be as large as 400,000 sqft, like 10 miles.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. You know, theres more than one convention theres more than one convention in Vegas every day. Isnt that unbelievable? Wow. We got to be on top.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Do you outsource that information or do you do it yourself?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Damn.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yeah, thats right. Like I said, youll think of all the things probably between now and Monday.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im in Scottsdale. Im in Arizona.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I run a cannabis business.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, well, real simply, just press, I dont know, star 69, and its locked. Go back, press star 67, and its unlocked. I used to go and take maybe I take maybe eight or ten executives to dinner at some place, santa Monica, Beverly Hills. And then when it came time to pay the bill, which would be like, sometimes with drinking 7000, $8,000. And so I give them the card, right? And theyre like, oh, Mr. Diva City, do you have another card? Its not working. It works perfectly. I just used it. Try it against the guys. Who goes back, tries again, doesnt work. Comes back to me. Now hes almost in tears, right? Its so embarrassing that hes serving me, and my card is no good. So I say, Get the manager over here right away. At that point, I press start 69 on my phone, right? The manager goes and does the bill. No problem. So then he starts to get mad at the waiter, right? Then everybody at the table starts laughing their ass off. But fuck, we invented this 30 years ago. Its only popular now. Discover, as an example, used it in numerous others. Wow, thats great.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah, I expect to have a super showroom in Las Vegas and also hooked up to Coinbase or whatever. And all the markets are up on the wall and huge screens, whether its crypto markets, Coin markets, the Forex, Dow, whatever, have it all available. No wasted space because itll also be licensed for cannabis. I see companies coming in from all over wanting to show their wares so we can put them on one of those remote TV channels, but we can also do a huge, excellent tape. And youll bring in some key people. My daughter, for example, shes got 13 million fans on Instagram, or used to be. Now shes in Manhattan. But she used to be the head trainer for the Kardashians and Jenners.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You dont want any of these little shitters. You want some stores that are doing at least 2 million a month and preferably more, because people come in, theyre at the store. Theyre at the store. Its boring as fuck. So they decide to buy some bitcoin. Well, theyre also buying the marijuana. You got to have a reason to come, right? Theres got to be a major reason other than the marijuana to come to my shop. Maybe I want to start, like, doing electricity bills or whatever, or water bills. So they bring it just because they got to come, and when theyre there, theyll think of buying something.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"More or less. Buy and sell dispensaries would be more correct. Everybodys been so blind on this. Nobody spending real time on does that location have 60 or 70,000 cars every day? If it doesnt meet the qualifications, that only be one. You have to have the ability to do a drive through. Theres a bunch of things that literally double your sales. And you got all these bohex out there who are sitting doing six, 7 million a year when they could be doing 20.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]