[{"pageContent":"It just messed everything up.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Whos calling?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"All right, thank you. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right. But I purchased my program, and with the last job that I had, everything kept changing, it seemed like every few weeks. So I didnt get into anything else because we were forever ramping up the fraud or programming and testing or changing the way we did, how to sign people up, or adding a new program or phasing something out and something else in as different initiatives came through so that people could receive some money during the pandemic. And that was all very tiring.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Sort of like add, do this for a while and that for a while and this for a while. And of course if it doesnt just gel and come together at the snap of a finger, its like, oh, well, this would be good. And I have a lot of interest and Ive done a lot of things, but I was stay at home wife, so I didnt get paid for most of it. So mostly impostor syndrome. Or who would listen to you? Why would they listen to me? But I have a degree, a bachelors degree in psychology, and Ive been headline speaker. Ive set up conferences. Ive headed womens groups from people from like 15 to 90. Ive been more or less like the church secretary, but my husband was a minister, so I had a lot of responsibility but no credit. So I did a lot of things.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ive been afraid to look at it, actually.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Im an older lady.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"All right. I just wanted to lay it out straight and not waste your time.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"You got the Marketing marketing agency.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Oh, my goodness. My husband died in 2014. Thats when it all came to an end. I was married 34 years.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes. My husband is not a happy person, and so he got a lot of credit cards in my name. And then I found out later, and they didnt want to talk to him. They wanted to yell at me, but I wasnt working at the time. And then later when I started working, all I could do is try to pay back. I just say, look, you didnt even talk to me, you just gave to him. It was just a whole lot holding this. Well, I can see where I would have to do this in the future, but I do have a line on how to get my credit score improved from two different companies. Love that in my group of things that I started but didnt finish or have access to. So just check back with me in about three or four months and itll be.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Its not really health food, a health and wellness business course, but unfortunately I havent made any money really at any of it. I have spent money. I have things in place, but I am not organized yet.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"All right. I sure will. Thank you.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"It wasnt my resume.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, fortunately for me, I have a lot of blocks, pebbles, whatever in place, but none of it is organized at this point. I have access to Great Cordone University. I have Billy Jean information.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I got a job and did customer service just above minimum wage, but thats what I was doing. And then I got another job working for state of Oklahoma with unemployment, helping people with their compensation and helping them sign up and figuring out why they didnt get whatever they thought they were supposed to get and for the different programs, particularly during the pandemic. And that was contract.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, they finally decided that Im me, but everythings been undone.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"No, not currently.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, I can do that. You can put me on the list and check back with me in about three or four months.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right now, I feel like Ive gotten some Tony Robbins level coaching, life and business. Thank you.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, hello.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Marketing agency for Billy Jean. And I got the Grant Cordone University.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I do want to tell you one thing.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, how kind of did you say? A bit scattered, very scattered. I have general ideas, but Ive not put anything concretely together.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Well, it sounds very cool. Very cool.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Its like start over time. I was doing well, and I helped everybody until I didnt have anything to help them with. And then, of course, I had to change my resume and my mindset, and that was the big thing. I thought everybody else had a problem. I just didnt know how to do what I needed to do, and I couldnt figure out for the longest. And also I found out someone had mistyped into my information saying that I had tried to get unemployment compensation in 19 six. That made no sense whatsoever. Kept saying, we dont know if were you. And I realized I was getting defraud treatment and I was going.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}}]