[{"pageContent":"Well, monthly revenue, Im in the low five figures, like 10,000 a month right now. And Im just building that up as well because COVID kind of knocked me out of the park. But its about ten a month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I feel like it could be better. It could be better. I think that Im settling when I say that, and I think I could really kind of boost it up a little bit more.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I would say just trying to think because I dont have my books in front of me of that roughly, profit is about Im sorry, Im trying to find stuff.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"No, I dont.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"For you in terms of profit per month? Id like to probably not do 95, but I would like to have more than that. Probably double or triple. Not the 9500, but double or triple the average.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I am the only me, because I cant afford to hire anybody else. Sometimes a friend may help, and Ill just give them a free session because thats right now what I can do for them.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"You know what? I looked at VRS, too, because you can get a virtual assistant. So Ive been looking at that to help with call intakes information and things like that. Those arent that expensive.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Theres a dream in your head, but you dont want to make it a reality.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Oh, Im fine, how are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Probably clear up some all the darn debt and stuff I have. But getting there and to your point, like financing and stuff like that, the reason Im in a catch 22 is because I have tried to secure capital before. And because of being in this Catch 22, Im just not able to do it. So Ive gone different routes, and Im not somebody that commercial lenders, even private lenders, want to take a chance on right now. And Im okay with that. Im like, okay, you know, where there is, there where theres a will, theres a way, and Ill just figure it out. Im just one of those people. Ill figure it out on my own. If theres tools out there that I can use that will help me, then I will research those tools and get things done. So thats kind of why I clicked on the thing. Im like, okay, this sounds like a tool. AI is really big. I just saw this very scary piece on 60 Minutes about AI, but how can I make it work for me? And thats the Gods honest truth, why I clicked on the ad just to see whats out there and how can I use it to my benefit? Just knowing where I am, just knowing where I am and just really just not trying to waste your time to sell anything that I know right now, Im not in a space to do.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I start my day off checking the email for the business. I see whats in the queue in terms of people that I have to get to. I make sure that I prioritize, because if somebodys inquiring those are the first things that I do, I get those people out of the way, set that up, and try to get those calls done as soon as humanly possible. Because if people are in different time zones, then I work with my clients. Then at the middle of the day, I have another set time where I go back through things. If I didnt get in touch with somebody, I try to get back in touch with them and set people up. I review my calendar to make sure thats on point and make sure that my money is coming in. And then I just set up for the next set of workouts because I have to make sure that Im looking over my clients workouts, making sure that theyre on point, checking to see where they are in terms of progress and then having to make tweaks in those programs to make sure that were getting them, gearing them up to the next level so that they can be successful in their tools. Then the end of the day, Im making sure that I go over all my receipts, making sure that Ive got all my people accounted for, making sure clients have what they need, doing follow up, end of the day, follow up and setting up for the next day, looking at the next day schedule to make sure that I have everything in line. Its a long process. I get up early and go to bed late every day.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I mean, it is what it is.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Probably be up to a month. It would be nice to look at, like, 35, 40 a month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Of the 13 five? Id say roughly after expenses, and I keep my expenses low because Im online.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"If I could take it all? If it was all profit. Okay, now have to go higher than that.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I do, like I said, wellness coaching. And Im also a fitness trainer, so I do stuff online with my clients.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, hold on a second. Yeah, I got it.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thats fair. I would just say right now, like I said, Im just okay. I dont know that I could be in a place to be catapulting like what you guys are saying. Thats all. I just was curious about how AI can help me. You know what I mean? And thats kind of where I am right now, to be frank and honest, because I wouldnt want to waste your time.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"And that would be like, I just need somebody to help me with the admin and stuff just to make sure that people dont get backed up in the wheel or something like that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I do not. That is a dream in my head right now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"We are about 15 to 20 a month.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Hold on a second. Ill see. Im just trying to power my system up.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"16 hours in a day.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, doing my fitness stuff and my packages, I do ten packs of coaching and five packs of coaching right now. I mean, not coaching, fitness training. And my five packs are probably a little low. Theyre like 525. And then my ten packs of 1 hour training is 1000 for ten sessions with me. So thats what Im doing there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, that makes sense. A lot of the clients that you have been getting or if all have been from social media is what Im hearing.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thats a good question. I have no idea. Im gonna just, you know, Im just gonna say Im just crap shooting it. I mean, I should just say infinite, but, you know, it sounds like youre looking for a specific number, but really, nobody wants to make just a specific number. I want to make as much as humanly possible, and I honestly dont know what that looks like, to be very frank and honest. Like I said, Im building. Im doing pretty good, but I know I can do better, and I just have to figure out how to do better to increase those numbers to something that Im satisfied with.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, my God. A bad month would be just trash. Probably like 3500 or something would be probably a bad month.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I would like to do a high ticket coaching mostly with my wellness coaching. Im kind of pretty good with the fitness packages, but Im looking to branch more into the wellness coaching and I want to either do commensurate packages or higher ticket packaging because I want to do a one to many. Approach with the wellness coaching. And I want to do it where you kind of have people that have similar goals so youre not all over the place. So thats where I would want to do a high ticket item there.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. Estimated profit, I would say, is about 9500 if Im guessing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. My income is in the six figures. In a low, very low six figure. Okay. Like I said, even though thats there, theres a lot that goes out of that to keep me going. I have to pay fees for certification recertification. I have to pay continuing education fees. I have to buy my own insurances. I have to buy my own health. I have to buy my liability insurance. I have personal stuff that I have. So even though that may sound impressive, spend the money I have to spend its like, okay, yeah, whatever. But you know what? Im going to end this call because Im not going to waste you guys time. But I want to thank you for taking the time to talk to me, and I just feel like I would just be a waste of your time. But thank you for giving me a call. Okay. Bye.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"All this admin work.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, my God. I dont want to tell you. I have long days. Sometimes the largest amount of hours. Sometimes I can do 16 hours in a day.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Id be opening because I actually am not going to lie. I shop a few coaches like you guys just to see which one would shake out for me and work the best. So it sounds like something thats interesting. I dont know. Right now, like I said, on my coaching side, I am just starting that business, but on my fitness side, thats an established business. So Im like branching out as a coach now. Ive got some things in places, and Im just trying to get that started up because, like I said, the fitness side is fine. The coaching side is just starting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I got a good credit score, but I can tell you right now, I do have a lot of personal debt I do have to get under control. So I dont know that I can even get access to capital right now. So, I mean, Im just going to be frank and honest with you. I do have a good credit score, but because of some of my debt, its not going to be happening anytime soon. Thats why Im kind of like, whats out there? What can I use to my advantage on my own to help with things? And then how can I just do as much as I can on my own? Im just honest right now. I cant do anything beyond where I am right now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Consultations, right, Im sorry, go ahead.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, thats five days, because when we get to the weekend, I really knock it down. No, I really knock it down. Im like, look, I guess Im so tired after five days that when I get to the 6th day, I only will do a half a days work. And I do take Sundays off because I have to give that to God.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Do I feel confident in doing that? I dont think that is anything that I cant do, but its a large undertaking that I would have to learn, and I would just be open to learning it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And its just a video that you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Id say about 13 five.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay. All right. Any help can hurt, of course.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Whats that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I mean, it would be, but Im going to be honest with you, I feel like I would be wasting their time and I dont want to because they have high end people that they work with and I dont feel like Im there yet. Its a good idea, but Im not going to waste nobodys time like that. I really am not.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, Im always interested in hearing different perspectives.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"A week? Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Not after you get used to it. It becomes normal. Thats sad. But it does become normal. Its sad, but it becomes normal.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"All this admin work and crazy stuff, and focus on my passion, which is helping people meet their goals and stuff. But I will keep my hands in my money. Im not going to let that go, because you can. But its not a good idea. Then you go broke.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, it does.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont have one.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"You.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"I couldnt even answer that. I honestly dont know because I got other things that are going on personally that kind of make things a little harder. But I dont know. Like I said, besides trying to work for myself and do other things, the other reason I dont have a personal life is I got other things, other family stuff going on too. And I got to try to divide myself up with all of that and trying to deal with that and deal with this. I dont want to waste anybodys time if I cant be consistent. And thats one of the things I know when youre working with these kind of people, you got to be completely consistent. I know sometimes that is not the case with me. So I just have to be real honest. Im not going to waste nobodys time like that.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"They havent ever.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Well, Ive done a course online and Im doing some coaching online and I just went over 60 Minutes piece on AI. Kind of scary, Im not going to lie. And I was thinking like, well, if you kind of understand it a little bit more, it might be more helpful than it is scary. And then you guys were talking about how you are able to leverage AI to make your business more profitable. So everybody wants to do that. So Im like, well, rather than be afraid of it, see what you can learn about it and see how it can be used as a tool instead of something for me to be scared of.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"My credit score is in the 700. In the top 700.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Its an okay month. Its not good. Its not bad. Its okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I just believe you dont get something for nothing. Thats how Im kind of wired. You dont get something for nothing.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I can always watch and title on. But like I said, Im just like I dont know. So, I mean, why dont I just watch the video and see what I think? That would be a place where I can start and feel comfortable.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Ill give you the abridged version. Went to the doctor. I had a weight problem. He said I should work out. And I came home that day and I started working out. I havent stopped since. And that was many moons ago. And I liked it. And my mother said, you should get paid since you like it so much. So I got all my certifications, and I like it. I just love it. And I like teaching. I like training because now Im multi certified and I have my Masters in Exercise science. I like helping people now. Ive been in medically based fitness for about almost ten years now and what I do really makes a difference because I work with a physical therapy place too, that offer services to and I get clients out of there too. And they tell me that, oh my gosh, you really helped me so much. I dont think I would be able to move if you hadnt shown me all this stuff. And then your body gets tired and so you got to start transitioning. And thats when I found the wellness.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Its just curious about what the information is since AI is jumping out so fast.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Why do you think that? Well, it just kind of is what it is right now because I got a lot of balls in here, too, and Im like if I look at that and its kind of like halfway decent. Yeah. Is it okay for where I am now? Yeah, its okay for where I am now. But can I do better? Yeah. How can I do better? And I have to do better within the scope of what I know I can handle financially. Im in a Catch 22, and Im trying to get out of it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"And then just through the pandemic doing studying and also doing a lot of personal growth stuff, Im like you really could kind of combine these two things and make a living out of it. So I started getting into the wellness piece, into the coaching part and I like that too. So just helping people and helping people achieve their goals is something thats important and to me and its rewarding.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, to talk and to find out about the services. And then out of those you can get that many, but out of those youre probably going to get about half that actually go forward and do it. So youre talking about five to ten actual people that convert over because everybody can talk. But when the rubber hits the road and its a headspace thing, its like you got to be ready to do this because I dont have time. I really just dont have time. If youre just not really interested.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"When I was I would say, like, probably, like, last, like, a year and a half ago because COVID was still kind of funky. People were just like and you get to summertime, and even though COVID was bad, people were going kind of crazy. They were going outside, and nobody wanted to be bothered with me online because they had gone nuts staying in. And its like, no, Im going outside. I dont care if I do get covered. I get it, though.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]