[{"pageContent":"Yeah. And my current financial situation is not good, so Im not going to be borrowing money anytime soon. But yeah, thats where Im at.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Just do noon on Tuesday.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"You know what, I think it was like I filled it out because I thought it was like, from AI for marketing, for coaching. So Im a coach, but Im more like a therapist. I dont have the traditional licensing and stuff. I do a lot of alternative stuff. So I was just curious because somebody was a mentor of mine was saying that AI could be really helpful for some aspects of my business. So it just happened to pop up at the right time. So I just checked into it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I just need to look at my calendar. Im driving right now, but Im pretty sure I dont have a client right now. At noon.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So my work is more of, like, therapy based, so I do energy, psychology, and hypnotherapy now, but Im not in the high ticket arena at all. I mean, Im kind of trying to figure out how I could maybe step into that a little bit more or even just step up my business now. But, yeah, Im not a high ticket coach at all. In fact, I didnt even realize I guess I just didnt read that part that that was more of what you do.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, Im not even sure I hear people say that Im not pricing my stuff high enough for what I do and my clients get a lot of really good benefit out of it. But right now most of my clients are all word of mouth. Theres people that have come to me because Ive helped other people. But I know if I was just thats where I thought the AI thing could come in. If I was advertising or marketing to a broader scale of people, then if I started off charging higher, they wouldnt know any different. Right. So its the word of mouth ones where their friend told them, oh, I pay this much. Thats what I worried about, jumping my price up way too much.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Probably email is better. Either one. Im just driving right now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Oh, yeah. I didnt even get a chance to look at that email yet. I did. I was I did sign up for that.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, I dont right now. So my main source of income is my therapy business, which coaching, but I see maybe one or two clients a day, which is okay. If I was charging more, itd probably be better, but that feels like a comfortable amount of clients. But I would need to double that if I was wanting the income.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I feel like Im confusing myself. Noon on Tuesday, hes going to call my cell phone.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay. Yeah, I have my offices in Scottsdale, actually.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, probably. I was married to I am currently still married to an alcoholic. That totally affected my financial situation, so yeah, Im not sorry to hear that, but thats changing. Very soon it will be changing.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"I charge I have a couple of different types of clients. I see couples and I charge about 250, then individual clients at 135. But what I guess Im hoping is Ive been wanting to do some kind of course or sort of like what I do for people in their first few sessions, but I guess a way to market it, but also sell a course of some kind. But its not technically a course. Itd be more like a therapy process that they would do. And I thought that I might be able to scale. But I guess where Im at is Im just kind of all over the place and Im not really sure what I need to focus on to scale my business more. I mean, I love working individually with people. I love working more in a therapeutic way. But yeah, who doesnt want more income, right. And work in a smart way to create that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Not very much. Im probably 3000 right now, which is very tight. But like I said, its just part time and I havent known how to jump that up. And again, I think the most frustrating thing for me right now is that I dont feel like I have control over how much Im bringing in. Like Id love to be able to just turn on a faucet when I need some more clients, you know what I mean? Like be able to do a marketing thing that would bring people in. But right now its kind of like Im at their mercy. When someone sends me a referral, then I have a new client. But I like marketing, I just havent had time to figure out how to do it in a way thats going to be effective for my particular business.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I havent referred yeah, those are my initials. I dont usually put my name in those things. My name is Shonda and then Im in Arizona.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im just outside of Phoenix.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"You know what, I need to look. I was in the midst of a whole bunch of stuff yesterday.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Its going okay.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, lets do Tuesday. Let me look and see if I can look at my phone real quick. Hold on just a second.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I have a little, but what is needed for that?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah. Do you guys sell like, a program for that or is that where is the.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I dont know. I guess a big number for me at this point. Im sure youre used to hearing a lot higher numbers, but for right now, 10,000 a month would be amazing. But I mean, Id love to go higher eventually, but that would be just like a huge thing for me because right now I kind of work sort of on a part time level. And as far as my hours right now because Im taking care of two kids and homeschooling and also caretaking, my grandfather and all this. So thats another reason why I was trying to figure out another scale, a way to scale a business thats not necessarily working per hour.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thanks, bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I am. Ive run some Facebook ads, but I dont know what Im doing and its not been effective really at all. So Ive just recently been kind of looking into doing some courses on affiliate marketing and stuff for some extra money coming in, but also as a way to learn how to do this more effectively in this world of online marketing for my personal business and maybe other businesses. Just however I can get cash flow coming in. Right, yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, sounds good. And then if I need to change, I would just text your cell phone number and change.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. And then I dont need to give my credit card or anything, do I?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"For a course or for working one on one.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Wow, thats awesome.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Its hard for me to look at my calendar while Im driving, so Ill just have to look at it after this call.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay. And if I need to change that, do I have time to change that? Because Tuesday might actually be better because I dont know if I have enough time to watch that thing you sent me and look at the case study.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Sorry about that. I switched it over to my Bluetooth on my card. It didnt work.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Awesome. Yeah. Thank you very much. I appreciate it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, probably. What is the cost for that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Can you hear me?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Sure. Yeah. I just kind of like to know what your business is and how you help people.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I did, thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I love that idea. I love that idea.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I can look at my email and check.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Probably noon would work.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, I do.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}}]