[{"pageContent":"Im not looking for ultimate goals. Im looking for information. That was the whole purpose of me. I was looking at what you had going on, so Im trying to learn the information of whats going on. So like you said did I get an email? No, I didnt get an email because I need something to read to move forward.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, like I said, Im bringing in six figures with all these businesses that I have. So its only a certain percentage of people in America that even make six figures. So technically, its already high ticket. If you go down to the numbers in the schematic, six figures is already high ticket. In America, the average person makes $25 to $37,000 a year.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"The slow months, honestly, are only when the sun is not out.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Its fine. How are you doing?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"That may include platform placements, videos, commercials, ads, write ups, videography photography. About to say our digital marketing company is more based out of the entertainment industry.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Let me check. Im driving, so I havent paid attention.","metadata":{"fillerID":34,"fillerText":"Uh-huh","category":"E"}},{"pageContent":"Got you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yes, whos speaking?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay. And you mentioned before that this whole process starts with the consultation with them. About how many consultations are you guys.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"What would the program consist of?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"It was more like what Air was, the AI, just the information on the AI industry. It wasnt necessarily Air in particular. When I was scrolling, you all popped up with speaking on the information.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I mean, the way to set up is you have different people. They might have a marketing rollout. They try to put their marketing roll out, grow their business, or get awareness to their business and get it in different eyes. So what we do is we have a consultation. We figure out what their budget is, and based off our pricing sheet in our platforms that we offer and that we have access to, we offer them a rollout. We create a rollout that gives them the maximum amount of exposure for their budget.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, I was just interested information to see what it was.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Basically.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"The AI is becoming a thing. So my thing is, okay, lets learn about it and get the information. Because its like this. You say three K to build up an AI to generate more. It will generate more leads, but it cant necessarily guarantee X amount of money.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, I havent received it yet.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"You have to move around and be.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Mostly. I mean, you have a few expenses. I say about out of 25. Probably like 17. Five is profit.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Hello? Hello?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"What do you mean by high ticket?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Im a learner. I have to read and digest the information. Im more or less like, I cant really like a cold call sale is just like a salesperson. So a person has any sales call, they dont give you the same pitch of car sales.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I mean, thats what the digital marketing kind of is. In the coaching room, we offer consultations and everything for that. So thats why I say I just wanted to more or less get the information to actually what your company does so I can read it on black and white. When you run a business, words is cool and conversation is cool, but its not real to us on black and white.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"The way our business model is kind of set up is kind of like its in real time. With digital marketing, the entertainment business, you cant really like you market on the Internet. You generate your traffic through the Internet, but you dont actually generate you generate more money marketing on the Internet, but we actually have to be outside in real time because its not legit if were just playing the internet, if you get what Im saying. Im just on the Internet and doing sponsor ads and advert hosman and doing all that Google AdSense. But thats the only thing Im doing. I have to actually be.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ive had months thats been months that it might have been more than 15K. It all depends on, like I might have an artist come and say, hey, Im doing an album. I have a rollout. I got 25,000 mark. Okay. Thats the budget. You might have an artist that same month or the next month, and he might say, okay, I got this amount of money for this budget. Okay. Well say, okay, this is the project were doing this month. So the focus will go to that project, and then well move on to the next. Everything is project based.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Explain a little bit more.","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Yeah, thats correct.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im more or less entering the information so I can understand exactly what you all do so I can move forward. Its not necessarily I need a presentation to read.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Its not set up to be. Its not like Im working at Walmart. Im working at McDonalds, where were looking for this bottom line, everyone thats not that its another form of residual income. Residual income doesnt necessarily residual income just means extra income a month. It doesnt mean Im not looking for the digital marketing company to pay my bills. Im looking for it to bring in more money to invest in other things.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. How are people reaching out to you? Is it via social media? Contact us form on a website?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"A slow month would probably I say anything between two to five K. Thatd probably be a slow one. Five and less is a slow month. Kind of starting out. I say anything between one and five. One and three? One and three more realistic of four slow ones?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"As long as the dots line up, yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I have a clothing brand. I have a website for the clothes. I do digital marketing, catering, anything that can benefit any of my businesses. Its not necessarily I kind of do seven to ten things. I do a lot.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, its been times when we made more than that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. Got you. That makes sense. And how are you going about attracting clients?","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"When you say rollout, what do you mean by that?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Now, if I was doing Amazon Drop shipping and ecommerce, then I could say, okay, yeah, this may guarantee because all its doing is going to push it in different areas.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes, I run a few businesses.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"It all depends on what the budget, and it all depends on the budget and the platforms that the customer is trying to get on. We have a spreadsheet that consists of we have a product sheet that probably consists of about four or five pages, and we just basically create digital marketing rollouts and schemes for customers based off the budget.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Because, I mean, when it comes to entertainment, when the sun is out, its a whole different market. During the wintertime is usually the slowest time.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Some months may be two, some months, maybe five, some may be 15. It all depends on the market in the entertainment industry and whats going on.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I say about 25.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Some people are doing digital marketing, some people have $1,000, some people have $3,000, some people have 15, some people have 25. It all depends on we work with the budget. You could come with $500, and well figure out something to put together that will match your money. Its not less. We work with whoevers trying to work and grow their digital marketing and create their content and boost their brand. We work with them. Its not a set dollar amount because everybody started from $0 when they started a business. So to say we owe you only can work with us if you got X amount of dollars. Thats negligent.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I mean, that was the whole purpose of trying to figure out what you offer.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, it all depends on the customers. I mean, a lot of people we deal with is a lot of artists, small businesses and stuff like that. So it all depends on when they scale. Like, weve been doing digital marketing for ten plus years. Its residual income at this point. Were not searching for a specific number of money. Weve been doing it for ten years on top of everything else that we do. So thats why I say I run, like, seven to ten entities at one time. So digital marketing may pick up this month. Airbnb may pick up this month. Event catering, event planning may pick up this month. It all depends on whats going on with the current climate.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]