[{"pageContent":"Because I had it down pat because I was doing a million three in three months.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Because theres just so many people when I tell them I only work for three months out of the year, theyre like, oh, wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"New person.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"So anyway, its been like that for quite some time.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"A person I would talk to because basically there was a guy on I dont know if it was on TikTok or Instagram, and he said to mark this box on the bottom and that he would email me something. And his name was Perry. Let me see. Austin Perry, I think it was. Got it from that.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Because basically I had ten locations and it was just overwhelming taking on all these other tax offices to help them build their businesses. It was like, for me, at that point, it was overwhelmed.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Is it so basically, what is it that you do? Because basically I just signed up for AI mastery, and I really dont know absolutely nothing about it, but I wanted to do affiliate marketing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Say that again? Im sorry, I can barely hear you.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Yeah, but Im not interested in coaching anybody. So I must have a wrong connection with you then, because Im looking to just do the affiliate marketing. Im not wanting to coach anybody.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Whos this?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes. I only work three months out of the year.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, as long as their ego doesnt get in the way, because some people, they want to hire you to coach them, but then they want to do it their way. And my thought is, if you want to do it your way, why did.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I have a 1099, but I get paid through wire transfers.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"And so I had a friend that wanted to make it go all over the United States because I didnt know how to do that part, but then I thought, oh my, this is like, overwhelmed.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"That would be my cup of fee versus because during tax season I am so busy, I am working like 1012 hours a day. The last week of tax season, I think we did 400 people.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Do I have? What?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"And your name was?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Well, its just that he has destroyed California, and hes taxed this to death. And my thought is I should take my money out of my house and run to another state and then just come back here for tax season, buy a condo or something. I can come back here during tax season, or I could even sell my business. So Im not sure.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"I havent checked. Im at work right now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, I just, for some reason, feel that I need to make a lot more money. I feel that its just possible because you could accomplish anything that you could set your mind to. You know what I mean?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, that would be what I would be interested in, because Ive done it before and I know because I wanted everybody that signed up with me to be successful and I made sure that they were successful. Thats just who I am.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes. Basically, I have heard so much about it, and they keep having a gazillion things on. I think its instagram about doing affiliate marketing. And so I was just really curious about it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Im just older, Im 68, and thats not how I want to spend my day, babysitting somebody.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Like, a specific well, no, I have my own business. Im an accountant.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay. Probably about $230,000.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Yeah, theres no purpose for it. It would just be extra money.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"But I did it for a couple of years. Its just too much for me.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"If you dont want to listen to me, why am I here? Thats what Im with you.","metadata":{"fillerID":39,"fillerText":"Yeah","category":"F"}},{"pageContent":"Let me ask you a question, because basically Im looking for something that I make money while I sleep. Okay.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay, not this week. This whole Friday, Saturday, Sunday, Ive got what it is, is tax season is over, and I havent had any days off for the next four days. Im not doing anything.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Kind of move the okay, so what is the private training thing?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, yeah, supplemental income.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, awesome.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I dont know, at least 25 or 30.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I dont want to go if it could be structured in some way where I wasnt having to be hands on and be available 24/7 because I dont want to even go there anymore.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Like yours left and right for the tax offices and this was early on, I think I got $2,500 upfront and then I got $50 for everything they did. So it ended up being about 10,000 for each one I set up. But like I told you, understood.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"A friend of mine thats just been very helpful. I just already got plans.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That would be wonderful. I had thought about that because its something I know well. Ive been in the tax business for 35, 40 years, and everybody that I set up to do the tax offices were extremely successful.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, because basically I think thats pretty lucrative.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Let me ask you a question. Say you set up between now and December, you set up two or three people a month. And so by the end of the year, it was like, I dont know, 20, 30, 40 offices. And then tax season came on and they couldnt do everything. And so what happened with me is I was getting calls twenty four, seven a day.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, because what I found is I think that theres so many people that would jump on that bandwagon, because most people I talk to, especially even, like, my tax clients, theyre like, oh, my God, I wish I could only work three months. And then I have to learn how to say no, because otherwise Id be non stop busy.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay? I dont have any w. Two s. Im self employed.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I am more where I sign up like this Clover business. You sign up somebody and everyone you sign up, you get a couple of month, which its real easy to get to 10,000, like right away. And I dont have to do anything. I just get this money that gets deposited in my bank account.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes. Well, it was just because at that time I had nine tax offices besides doing the consulting and what my intentions were was to franchise and then just go kind of be like an H and R Block, but be, it my business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. I dont want that time commitment. Thats why I set up this business. Ive been here for 34 years and I work three months out of the year and then I have the rest of the year off.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Maybe 10,000 a month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Anyway, so Ive got a lot of things going on right now.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"To 30k just ended. And I got to give that some thought on what Id want to put into that, because Im going through a thing right now where I want to move to Florida. I live in California, and right now Ive got about $2 million equity in my house, and I feel the real urge to I could come back here for tax season, but I just dont want to live here anymore. Theres just too much stuff going on here in California.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its like 830.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, Ive just been very blessed with being able to make money.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I didnt want to do bookkeeping. I didnt want to do anything that would involve me having a commitment to be here.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay, thatll be great.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Monday would be good.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Sound good? Okay, talk to you soon.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"People, I got this down pat and for some reason, youre just wanting to and then youre saying, well, anyway, I only had one like that, but I just believed. And everybody that I set up just made bank. Okay.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"No, I dont.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And I think that the coaching is kind of like a hands on where its a big commitment for me to do that situation. And at my age, Im not really looking to be a babysitter. Yeah, for sure.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Of the people will just do what you tell them to do, but then youll get that one person, oh, no, Im going to do it my way. Well, if you dont succeed. And the one person that said, Im going to do it my way, she failed.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Saturday is my granddaughters birthday party, and after her birthday party, I have another birthday party to go. I dont want to really do anything for the next three days.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, but you know what? I almost know how to do it myself because Ive done it before. As far as getting the clients, I could do that all day long.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Ethan. Okay, Ethan. It was very nice talking with you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And then you ask them, why am I here?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"So we get really busy, busy. And then after tax season, I havent had any days off because I havent been able to catch up.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Recommend because I never thought that Id want to leave California, but it has gotten so bad with what everything is going on. Basically, its just Governor Newsom 100%.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, I havent done that before, but I just signed all the paperwork two days ago, and I have several accounts. Theres a bar in Arizona thats called Blondies, and I dont know, they do 150,000 a month, which you get like a 15% commission on the 120,000 or whatever he does a month. And then this other company, its called Small Cars, and they do about 120,000 a month. And then Im signing up a lady that does she sells those off road vehicles.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Added up, that would be something totally new. But you know what, I used to do consulting for anybody that wanted to open up a tax office.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah. Okay, well, if you send over those videos, I will definitely entertain them. But you know where my heads at. I dont want to hands on, babysitting.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Can I help you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"That you mentioned and very stressful.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Im not interested in coaching anybody committed.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Coaching wasnt really something that Id have to give it some thought before I would commit to, because that wasnt really what I had in mind. Because the last time I did coaching, it just took so much out of me. Because to get dealing with all these different people, my thought is to have something where I dont have to engage. 24/7. Got you. Im at an age now where I dont want to commit to for me, it was like babysitting 100%. So I would have to really give this Id have to think about it before I could just even go there.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, at that time. Now I dont have that many. I only have one tax office.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"It was like, and so what? What end up happening is I end up devoting so much time to them that I let my stuff go on hold.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Anyway, I would have to give this some thought because this wasnt really where I was going to yeah, for sure. Whole different things, because Im also starting this other business with its like a referral program with Clover, and its where they give you a percentage of anybody that you sign up. And its pretty lucrative for you dont have to have that many accounts, and then you just have this stream of income coming when youre I mean, once you set them up, you get this money every month. Understood.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Monday would be better for me because I dont want to reschedule. I cant really reschedule my three year old granddaughters, my only granddaughters birthday.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Oh, for the three months I worked, sure.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"And it was very profitable.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}}]