[{"pageContent":"Whos calling?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I said it was a good question. The way it was posed, is that a gift, Justin?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"I would love for my gross annual or gross average order size is about $5,000 a month and get higher then great. But 5000 is a good place to start. Minus my cost of course, will be bringing it down to about 4000 or 13 3700 or something. But anyway, something along those lines, I think its good so that I can then add on other services to them later on to enhance things and give them even more value. Then Ill start talking about their sales process, their optimization, getting the most of them, their lead database, their reactivation campaigns, their review campaigns, their citation campaigns, making sure that everything is tipped up so that they get seen in the best light. So the other service to offer to bring the value up, but right about that is what I would like it to be. So about 5000 a month, annual per month client value would be good. But whatever we start with, and there will be some other things I do as well, which are getting people into the funnel, which are low cost, low ticket things to say. Okay, you can get access to report, special report or special this or some marketing intelligence that people cant normally get for them to pay to get into my funnel, as it were. So, different things, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"In the toilet.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"So were talking about Saturday the 15th.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hold on, please. Do you mind if I bring on a partner?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, sounds great. A conference call. A conference call line, absolutely.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I have a different phone number that I can merge calls on.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Got some time to deliver. Yeah, a million dollars a month.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Let me just get a response. Okay, so lets do 06:00 P.m., saturday, Eastern Time.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"A million dollars a month. Twelve months from now? Be good.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"It does, and the point taken about how scalable that is. If you can automate the sales process through ads and so forth, we will get into that stage. But at the point of where Im starting from, with the amount of hours I have and the amount of appointment slots I have open doing it, the way Im starting is, I think, sufficient to begin with.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"If we can get half a million will be great. In twelve months, monthly recurring rate of half a million, thatll be cool. To create a $3 million company quickly, overnight and then on the road to scale. And then Im not really looking to make a whole lot of money. I dont like paying a whole lot of taxes. So I probably want to expand it, but not too quickly. I have a growth idea in mind based on every 90 days of doing different things and replicating myself and bringing onto the teams and things. But theres a growth path in my head, hand written out. Absolutely. Now is a fun part of breathing life into it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Are you really getting into the weeds of my business now, arent you, Justin?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Good question. The way it was posed, is that a gift?","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, well, Ive set pricing at $1,500 per keyword for local keyword, up to 5000 keyword up to 5000 searches per month, generally speaking.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Under 550.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, I hear you. Now do you know which phone number itll be calling me, or should they.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Lets do evening.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, sorry. Yeah. So lets do seven then.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Thats a brilliant idea. Thank you so much for that. Thats been worth the entire call. Thank you.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Im just starting to be quite frank with you. Ive just come off a sales workshop last two weeks and now Ive been working on my positioning and the channels that Im wanting to go through, but primarily the sales process of what do I want somebody to do and when they get my messages, what actions they want them to take and what experience they want them to have. So that by the time they get through to the sales call, theyre really predisposed to buying as opposed to selling. I want to be an order taker and they tell me what they want rather than me trying to tell them what Ive got and they should buy it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"To the call and come in zoom meeting on Saturday. Or is it going to be just a phone meeting?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, so what Im looking for is to send them an initial message probably by email because Im getting emails freely through LinkedIn of peoples real email addresses that theyre using to sign up for the LinkedIn account. And then because theyre on LinkedIn, theyve identified themselves as who they are. And I can sort of trust it better than Facebook as to who they are off hours, but who they are working hours and send them a message, ask them to take an action and then from there put them through our propaganda and salesperson.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Got it. Okay. Thats very interesting. I like that approach. How long have you been doing this for?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Wonderful. Thank you so much, Justin. And your name of the company is? Airtable. Is that for air? AI.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"In New York City.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hey, Jackson. How are you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Let me check. Unlikely. No, I do eight, but I prefer 815, to be honest with you, because I have something that always finishes it at about eight, and it takes me a little while to get settled again. So even 830 is better than 815. But Id rather not do Friday. Its just too short notice for me personally.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Specifically. Justin, do me a small favor and give me the phone number that I can call in at 07:00 P.m. Rather than them calling me. Im not sure if hold on. Just double check.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"I came across being educated by a company that has a proven track record, which is what came across in your ad, that youve been in the space, youve been doing it, and I could learn from you. So its a new opening industry, and I wanted to be close to the beginning of the opening of it, if you like. I dont have an immediate need to focus on that. Im focusing currently on selling advertising services to businesses and with a new way that way that flips SEM and SEO and PPC on its head, as it were. So somebody plays by different rules, rule set, and get different results, and they get seen to be positioned as recommended by the search engines. So thats what Im focused on right now. But later on, I want to start having a content division side of my company and produce, publish a lot more information, educational materials, training materials, guides, reports, software as a service and various other things. And Im wanting to use AI to help launch the publishing side of things.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. And then youll send me the cost of material that we can both look at it together before then. Wonderful.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I have enough funds in order to scale my business, I have enough funds. The only problem is that I underwent a problem the last two weeks and my bank account was closed. So Im waiting for them to send me my money from abroad to the United States. And Im probably going to send them an email by the end of the day as to whats going on. But once it comes back into my account, I have enough. Im not concerned. Most of my business should be grown through client acquisitions. Its a really low cost business to get into. The issue is not money and cash flow. The issue is getting the right people to hear my message and getting them into the sales process and so forth. So Im not concerned about a liquor store has to spend a lot of money in licensing and shop premises and leases and fire inspections and everything else before they can get ready. Im not that kind of business, so its not an issue.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats a liberated question, Justin. Thats an excellent resource.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hold on.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Some keywords may not be of any value to them. Right. Some are looking for best plastic surgeon salary, thats not relevant, but somebody looking for best plastic surgeon in New York City maybe, or rhinoplasty surgeon. New York city probably more relevant. Right. And that plastic surgeon may do several procedures, so he might buy several keywords. Right, right.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Air AI. Okay. Thank you. I didnt look at it yet, but looks like Im going to look at it sooner rather than later. Thank you again for the call.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"You, too. Bye.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Not good. I have a dental appointment first thing in the morning. And I have something else fridays. This Friday is not good, but we can do next week.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, I am building out a custom my own game plan already, and Im going through the steps, and I am working on it. Having the Air feedback of somebody whos done it before is always a good thing, and there is no harm in being able to consult with somebody about this. Thank you again, Justin. Be good.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, I can merge the calls. Thats fine.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Im going to initially do cold outreach. Its the most scalable, its the most secret. I dont have to spread my message to people I dont want necessarily to. I want to go off people. Ive been cherry picked and invited to be a customer. Kind of like how Ferrari sells their cars. Rather than telling the whole world who cant afford it, I want to get those who really can afford it and offer them privately.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Totally agree with you.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Absolutely. Got it.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Said while you have my now you have you on the phone. Whats on your mind?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Well, Im getting the assistance I need. Im getting outside consultants to come in and lend the expertise in different areas. The first one is LinkedIn Messaging and LinkedIn Processes and LinkedIn Automation in order to attract the right people and have them go through my sales pipeline automatically so that it pumps out 15 to 20 appointments each month minimum and preferably more. And then also Im getting help with my email marketing messaging system in order to make sure that email addresses are set up correctly. Theyre primed, the messages are good, sequences are good, automations are good. And then Im also getting help with my CRM systems to make sure that the CRM sales processes work well, that the automations are there, the missed calls are there. The automation that I can sell somebody quickly and easily at a low cost are there. And all that set up. So I expect by the end of the month should be definitely by the end of the month, there should be revenue coming in. And I can hold out till then, no problem. I can hold out even longer if I needed to, but I dont want to. But I dont think so. Im thinking Ive got the expertise in the main things that Ill be launching via LinkedIn email, and then the sales process to be followed up by text message and everything else. And Im getting outside help with that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, I did. I didnt look at it, though. I requested it, and I put in my information and I put it as my to do thing for later. I was kind of busy, so I didnt delve into it in any way. But I put down the reference. I can go back to it. Now you have me on the phone. Whats on your mind, Jackson?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes. $1,500 per keyword. There are costs involved approximately between four and $500 a month, something. There is some margin for me to but Im not like Pepsi Rump where Im charging a dollar and its costing me $2.02 to make it. Its not that kind of markup, but still its healthy. Im looking to sell bundles of keywords. So somebodys not buying one keyword at 1500, they may buy 3450 or they may buy six. They might buy five and get the six one free. Or they may buy ten and therell be volume discounts as it goes up. So ten would probably be about $10,000 apiece, something like that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I said hold on.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"As things grow and I get into the AI publishing side of things, and then Ill be looking for somebody to help with that too. So thats why your ad interested me. Not for now immediately, but for later on, further down.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Theres no problem. I dont think there is. Just to make sure. Thats fine.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Thats a good question. Ill downsell them. Be honest with you. I probably tell somebody, listen, we all would love to have all the keywords in the entire market, but obviously we dont have the budget for that. And so we have to realistically look at what makes the most sense and best use of our funds available. And looking at this in the position that youre in ahead of your competition right now, you can get very best keyword, which is this one, the prime keyword. It gets 2200 keyword searches a month, as opposed to having that one plus the one that gets 950 and the one that gets 125 and the one that gets 376 and so forth. And having them as a bundle. The main one is you can afford make things comfortable, keep that for yourself. And its tied that one up. Right now, Id rather have them as a client than trying to say Im going to maximize everything on the first sale.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]