[{"pageContent":"I thought there was an Ecommerce on there. Okay, well, not currently. Right now, I guess thats something that were not all hell bent on, because our agency, the other consultant company we do have most of our work, like I said, comes from government agencies.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right, sounds great. Thank you.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Hi.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, I dont think so. But let me check my spam because it may have went there. No, I didnt get it now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Let me see.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, were a platform. We sell fragrances, men and womens fragrances. And were in the process of manufacturing replacement topper for perfumes in a manufacturing system. Topper. Its called top your fragrance. And Im just looking to increase sales. We just got done with the SEO, trying to get online presence, some advertising. We just have a LinkedIn, Facebook, and Instagram, but were trying to increase sales.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. You said ad agencies and what else? The consulting and coaching.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I do have service based business, but that business. Were geared more towards government agencies because were in kind of a niche market that were in.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I clicked on one of your ad. Just wanted to know a little bit more about what you guys do in reference to the Ecommerce platform.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}}]