[{"pageContent":"Alfredo, come again with that.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"No, it makes perfect sense. Believe me, it does. And not to discredit the position youre in right now. Im in that position myself. Were only trying to get past this, you know what Im saying? Were always trying to get to the next level. And I do agree with you because everything that you say your team right now is offering is everything that Im pretty much doing on my own. Except my CRM is pretty much just a spreadsheet per call. One by one handwritten, Im tallying them up, putting everything in, and then reorganizing it. Its tedious. Work.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"But Im.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I Freelance. I got companies. I affiliate myself with these companies. But I freelance. Its all on my time. I make it happen. I get paid. Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Three to five times, exactly.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Have a good weekend. You the same. Take care. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Youre talking about basically hiring you guys as a marketing team, which is something that me and the guys at the office were kind of talking about. We were dancing around the idea that would seriously depend on exactly what type of results well be able to produce utilizing you guys, because theres a lot of companies that are actually and not to discard, you gave me a call. I just put my number in a couple of minutes ago. I didnt even get a chance to finish browsing through the website. You caught my name and number right at the beginning, which is sharp. The guys got me to reach out real quick. Yeah. In this world, in this industry that Im in right now, if you dont do it, someone else will. So that makes perfect sense to me. Im with you on that. But again, Im right now weighing out my options. The next big deal I present to my people. To even think about escalating a conversation into another investment, Id have to be absolutely confident. Id have to see a lot of the materials and get some case study on the results that you guys have experienced in the past with your system. Theres a lot to this. I mean, Ive been in the industry for a little while now. Im starving out here. And thats not to say that I dont eat. I eat, but I work like I dont eat. So Ive done my research. Im the guy they pay to do the research. So this is why I take the opportunities to listen to ideas, because if I dont listen, then I wont know if you guys are valuable to what Im trying to have accomplished here. So, one, I do really appreciate the call. I dont want to cut it a little bit shorter than Id like to, but I would love for you to get me out some more information, maybe allow me a chance to take a look at that revisit on your website for a little bit. Like I said, I just put it in, and I ended up getting a little caught up just now. But now that you called me, most especially when I get a few more minutes this afternoon, Im going to revisit the website, take a look at any of the marketing material that you have to show me. That way I can, if anything, at least present it to some of my partners, and then well be able to talk about it, and you and I can get back on the phone, and well move forward based off of how everything looks.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Alfredo okay, tuesday is great. Can you fit me in anywhere between two to four? Anywhere between there would be fine.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yes, likewise. Ill definitely be looking forward to our next conversation.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"This is bringing in around anywhere between eight to twelve. And thats just because its a new company. We opened this company back in July, so we were still working on its. No return clientele just yet, but like I said, I can get on the front end.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I can get a little bit of both. It depends on how I feel about the situation. Sometimes I could take a portion in the front portion in the back. It all depends on the size of the deal. If I got a big deal, I might just take a little something on the front end, but typically its my choice.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. Im trying to figure out which one is the right one for my company as well. Thats another thing. Im trying to scale the company up. Basically, I put the company on my back, and Im doing everything that I can to make it so that the CRM, the leads are drawn and right. SEO, search engine optimization, so that when I put things up, theyre guided right back to the website. Theres a lot going on. You know, theres a lot to this one person trying to understand the entire game and then play it at the same time is why I am so cautious about dropping the next dime, because everybodys trying to offer you a deal on how to get that done. And its not easy. If it was easy, then there wouldnt be programs where people were spending $3,000 to have a whole team of people utilizing all of their talents to make something happen. Everybody coming together for one common goal, and I understand that. So, like I said, thats why Im going to take a good look at the information that you send me and then convey with my partners, and then were going to see what we could do here. Thats the best thing I can give you on this call right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Money? I contract funding for small to medium sized businesses, and then recently I moved over into the private equity. So basically Im in finances and consulting. So I get some funding, help them go through the process of growing their business. Ultimately, they become an accredited investor, and I then move them on to bigger greener pastures and get them on board with Some Pretty Low Risk Opportunities that Could Be Life Changing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. The market has been nuts, though. A lot of people these last couple of months, with inflation the way that its been, everybodys scared to open their wallets. But listen though, I want to apologize this is a great conversation, and were covering a lot of ground, but I do have to go right now. I got to go take care of family. Saturday. I got to go get some lunch for everybody and make sure everyone is good. Allow me to.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yeah, I definitely did a couple of minutes ago.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hey, Alex. How are you, buddy?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I work with a private equities company, so I deal in pre IPOs, and I actually took on the task of revamping our website to increase the user experience and kind of see if I could find a way to streamline the process, because things look like they could be really well if they are. Right now, were short manned, the team is small, and Im looking ahead. Why wait on a whole group of people if the technology is here to be able to handle the orders, if I can get everything streamlined? So basically, Ive been looking around, trying to find out, do some research and study about finding that right AI that could basically, I need to find out if people are accredited and then their likes and interests, and then guide them into the right pre IPO. We have several of them on our platform right now, and if I can get something in the process of able to handle that process, that would be very beneficial to my company.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its pretty much everything just short of a shoulder. If the person I can have a nice conversation with someone and we figure out a game plan to help them expand on what theyre doing right now or either help them expand or help them get into a better situation. People typically tend to buy things for two reasons because they need to or they want to. So I find out whether its a need or a want, and then we isolate on that and solve the problem.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Theyre leads that I got through my company, through my contacts. I have several lead source agencies that I have available to me that I can reach out to and get some leads. But again, theyre far and few from exactly what I need. Every now and then you reach out to somebody who isnt annoyed that you called them in random and is actually looking for something like what I have. And then they got to like the person when they speak to them. Sometimes my New York accent comes off a little bit too. New Yorkish.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, absolutely. Or the third option, you like it, but just not right now. Yeah, exactly. If I can get one of those three responses, yes, Im on now, or yes, I have interest, but not right now, or no, dont call me anymore, and if its one of those three, I can pretty much tailor my next few steps. I know which way to go, what I got to do. Based off of the responses that I receive, either theyre going to give you an excuse or a condition. We cant work with conditions, but we can sure work with excuses.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Some months? One, some months, two.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Im curious though, as far as getting your prospects currently, whats kind of been your method to get them? Are you running ads, or is it referrals? How does that kind of look?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Well, I got the information that you sent me. Its Saturday now. Can we reconvene on Tuesday? By Tuesday? Ive already spoken with the rest of my partners. Weve all gone over everything. Ill have their reply, and then we can talk about what we could probably do together.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"It all depends on the day. I can dial 300 times sometimes and only speak to five people. And out of those five, how many of them are really going to convert? Sometimes those numbers, I got to do some extra research to get the right numbers, buying the right leads. They tell you youre going to get the right leads and call its a block number, or its a dead number, and you got to go through the hassle of getting the leads over, having them replaced, because youre spending money. So, I mean, theres a lot going on here, so it varies. Like I said, thats why I put myself into certain groups with a bird to play, you know what Im saying? Thats how Ive been maintaining myself. I live in New York City, so its not cheap living out here. I got it closed. If I dont close, like I said, man, in a New York minute. I know you heard the phrase, things can change faster than a New York minute. Yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I havent even been able to decide that much yet. Im still in the process of scouting out situations. I need to know what amenities are available per program. And I need to know pricing. I need to see what everybodys working with before I finally decide to pull out and pull the trigger. So you said the funding, the pricing of your services, which I need to know a little bit more of, because what really piqued my attention when I saw the website was it said high ticket, and you dont get no higher tickets than in private equities. I can close a single deal one day, and it could be a $10 million deal. Ultra high network individuals. I just need to be able to help them get through the process without feeling that they can trust the process that theyre in and theyre getting the right responses. So thats what Im looking for. Im looking for AI. Program that I can basically train to get the answers. Because I know this is a young industry. Everybodys just starting off with the AIS. Ive been in tune with them for a little over a year now, following up on a lot of the changes thats been going on. And Ive been trying to utilize them to basically put some marketing materials together and get some ideas for what Im working on right now. So, like I said, I just need to find the right program that I can implement, a nice little chat box on my website, and for those times that there isnt a live agent, we can catch those stragglers.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"If the numbers are right, if the benefit outweighs the risk. If the reward outweighs the risk. Of course Im looking to make money doing this, and all parties involved in the process, naturally theyre going to get their just due as well. Its just a matter of partnering up with the right people with the right strategies, and that way we can implement them as a team.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]