[{"pageContent":"Yeah, I can do that. Sure. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes, if you could, I would really like that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, absolutely.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, thats about.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"They will be admitted. I feel like no matter if they join me ever doing what I do or not, I feel like theyll be proud to see that I set out to do something a long time ago that I didnt stop on. I feel like theyll be definitely proud. This is something that I just kept on strolling along with even like you said. I know that its got us keep the vision of it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"On your I think thats comfortable. Matt. Yes. When I think about the return that would come back, especially from what we know AI is doing there, I can see that being able to be 1020 times that, of course.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah. So just looking forward to, like you said, giving that coaching and awareness to everybody. Theres so many things that we need to keep on optimum level that you just dont know. When you dont have it, youll be glad that you do. Its just things like that that Im somewhat thinking about, I think for the most part.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right now, Im honestly Im going through a broken tooth issue. So it has been just keeping that in mind and having a real story to share with other people. Its like Im just looking forward to as many health and wellness ideas that I can pass along because like I said, Im going through a broken two dishes. So it affects a whole lot of everything. Even my impact Ive had with being able to help folks with this financial services industry because Ive had to take a lot of time to just cope with this and get this all situated. Sold. Yeah. So Ive been sorting through that too, with everything.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, I can see that right away. Exactly. Because there are some, like I said, tools that I know Dr. Billy Williams gave with AI thats going to be super valuable and maybe I can pair notes with you guys and see what he has and what you all have. But yeah, theyre all going to just help to yes, sir. Buy everything.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So Ive been up and running for two years now. I have a small client base. I feel like I should be a lot more established. So Ive been working on some things. Like right now Im planning on working on writing an ebook to get some type of system in place for the business. So I have that basically in progress now. And I know that AI is definitely a tool that a lot of insurance agencies have been talked to about, because I know theres a trainer by the name of Dr. Billy Williams, and Dr. Billy Williams had a training one day and it mentioned a few different AI websites that you can use that somewhat help with what we do in insurance. So I know that its definitely something that helps us to level up in this industry financial services. So Im really going to be looking forward to everything that you have to share with me in your realm. That Matt.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You know what, honestly I do love it because like I said, some of the personal issues Ive kind of paced in my life. The reason why I got into insurance in the first place was because I lost my uncle when I was twelve years old. He unfortunately got Gunned down down in Des Moines, Iowa. Thats where Im from. He was 27, I was twelve. He didnt have life insurance back then. So my family had to unfortunately do what they could to get him taken care of when that unfortunate moment had to happen. So just based on that, that happened in 1988. So Im going to be 47 this summer, 35 years ago. I just as inspiration to know that I would love not have to see any other family space back.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Oh, hi, Matthew. Im doing fine. How are you doing?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Ill be totally honest with you. Im not quite there where I plan to be at. I just recently got a policy together with Ameritus Whole Life Policy, which wont have any type of cash value available for quite a while. So Im looking to delve into more plans such as those, like an IUL also. And other than that, Id be totally honest, not there where Id like to be on liquid assets right at the moment.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes. And some of the reason why it is that way is because I have a day job. Im looking forward to letting my day job go to the wayside soon. I do independent living care, so I pick people up and take them to the YMCA. I take them to dentist appointments, doctor appointments. I took a client today to a place called the Cafe Meow where you can actually sip copy and watch cats while youre in one place at the same time. So thats just some of the things I do. But Im looking forward to, like I said, catapulting my agency to be more reputable than where I am at now. So I know that I have the day job to eliminate and thats what Im looking forward to accomplishing by June, Im actually aiming for that to take place.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, I would appreciate elaborating on that.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Youre right. Yeah. I appreciate you probably that way.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Okay. I understand that. I should be able to watch that video for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Youre right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. All right. Matt so I have Vortex One Financial Services, which is my independent insurance agency. Im, of course, licensed here in Minnesota, my home state, licensed in a few other states, iowa, Illinois, Wisconsin, Michigan, Pennsylvania at this time. So looking forward to helping my client base, specializing in retirement planning and estate planning for the most part. And I say those areas because just because of personal experiences I had. I had an experience with a cousin of mine who lost her mother. She was having a knee surgery done and the mother had her vitals checked for two days in a row, then went in the third day, and then they did the surgery. And unfortunately, she did not make it after the surgery was done on her. So the daughter, she had to go back and forth traveling to tend to the mothers estate because it wasnt settled and all that stuff back then. So he, unfortunately, my cousin had got cancer herself and she unfortunately passed away. So it was just a really big mess with just the state issues that they went through. So I know from personal experience thats an area Im looking forward to helping some folks in my client base to be able to have some clarity in. A lot of the things Im doing to help people with is some things I went through in my own experience. So I feel like Im pretty qualified to help this community and those other states I mentioned with those beautiful needs. Yeah, beautiful.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Be the best yes, this is the best number.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Per year, I would say maybe about 40 to 45, but looking forward to being able to change that with the insurance agency to see more of that increase.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Tuesday will work better.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes, I would love to do something on that note because Im connecting with a place, basically theyre called Estate Planning Documents. May help with putting those documents in place.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. Because you know that old saying, note takers and money makers? Hey, I took in like 15 years of notes. Ive been in it 15. You can only imagine how many notebooks Ive kept on everything that you need to be knowledgeable about, about it. So yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"You know what? I think three would work better, actually.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Honestly, Im thinking tomorrow. Ill definitely be able to watch it for sure. Tomorrow during my day.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. Yeah. I appreciate it. Definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, that should not be a problem. I probably wont be at a library, but usually I have private room. So, yeah, Ill be somewhere focused on everything. Man beautiful.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Im sorry, can you hear me better that way?","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Definitely not what Id like it to be right now. Im going to say honestly, about $1,000 a month, but Im looking to increase that up to anywhere between twelve to $15,000 a month by November, December of this year because I know its going to take me some time. However, its definitely a climb that Im looking forward to grasping.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, actually it is. Im somewhat getting ready to leave my office here. About to take my gal here home. So thats what I have going on. But Im able to talk with you on the phone if that works, for the moment. I know theres going to be, like, a demo for me to look over with you, so Ill be looking forward to that for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Very appreciated. Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Definitely can be something to put you in monumental when those things happen.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, sorry. So the name of this company is Estate Planning Documents, and they help basically with, like you said, the advanced care directives, learning about your financial power of attorney, your medical power of attorney. So, yeah, that is definitely up my alley right there, what he just mentioned.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, actually I dont. I respect it. I know that you said time is very much heavily invested in essence, so I understand.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"It sounds real good. Thank you.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes, me too. Yeah. I appreciate you for listening and giving me all the inspiration you just gave Matt. Thank you.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. I have three girl sons. My youngest is going to be 25 this month. I have a 26 year old, little Dre. DeAndre, and then my oldest son, Eric, hell be 28. Well, he just turned 28 on the 12th actually. So when they were younger, I used to give them math worksheets and just try to keep them reaching for more. Just because you have a classroom at the school doesnt mean that you can extend it at home, too.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Central.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, 745, okay, understood.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I said true.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I would say just because to me, theres a lot of opposition against that. But Im bringing another perspective on what we just have to do, keep each other just moving the right direction. Theres a lot of unfortunate circumstances and people that dont quite see it on that level. So I guess thats probably why apply it so heavily on that level like I do.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, that would be realistic. Yes. I can see that being able to work with that.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes, I can hear you, Matt.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"DeAndre that sounds like a plan to me. Matt yeah, Im definitely ready for everything you have to offer.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I sure would, yes. I appreciate it a lot, Matt, because you kind of read how things are transpiring for me. So I appreciate that a whole lot. That helps for you to understand my story. And Im just trying to get out here and help out on a certain level to keep that community superhero standing going on somewhat.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, Im not married and I have no business partner here at this time.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yeah, you too, man. Thank you.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Honestly, Ill be totally honest with you, its not as good as I would like it to be. Its probably about maybe 580 or 590 somewhere in that area. I do have somewhat of a credit builder on my checking account. I started, however, Im looking to, like you said, definitely build on funding so that I can look at improving that personal and my personal score most definitely, because a lot of business credit that is very beneficial is going to be based on personal guarantees. So I definitely want to get that together. Right.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Honestly, I would say yes, because I am a father of three.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right, bye.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Definitely. Yeah. I was visiting with my son Monday night. We talked my son give me some of the things back that we talked about already. So I appreciate it. Hes out on his own, but yeah, I can go over there. We have a grand old time. We suffocate a lot of ideas off each other.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]