[{"pageContent":"Good, how are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Hey, whos this?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I will. Thats part of what Im using the consultant for, and our training is going to be done, hopefully, the back end of May, where Ill really get some in depth and then start to be able to make it my own and start to optimize and innovate a little bit.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I would need to be able to basically hire medical workers into my company, so there needs to be acquisition of talent into my company that I can then go out and place at different clients.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I want to grow. So Ill put it this way. There are billion dollar staffing companies. I dont know that I necessarily want to be that big, but ten year goal is 200 million.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, so SEO is going to be one of them. Word of mouth is going to be another smile, and dial is going to be one as well. I got a marketing company that Im going to be working with as well, that Im going to rely on their expertise, but I dont have the details at this point to be able to tell you exactly what the marketing plan is. Im still developing an aspect of the business plan here, so a lot of research going on on my end. But again, Ive got a consultant that has done 200 of these types of businesses that Im starting successfully. So theyve got a pre tried and true process. I dont have it yet.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I dont see it in there either.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I dont see it in my email.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"I just think if that 60 Minutes conversation is going to be that valuable, I want to be able to bring my A game to that conversation to get the most out of it. Right. So I would love to look at the two and a half hour training now and then look at setting something up in a month or so with either Caleb or Ryan.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. I dont know the skip button is yeah, not yet.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Sure. Yeah. Im starting a medical staffing business, and so theres two basic components to what we do. One is to go out and actually acquire the contracts and the clients that need to have staff. And the other side is recruiting and placement of the nurses, skilled nursing doctors, et cetera.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right now Ive got no revenue.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"For sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. Did you say sell my business or start my business?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"And so Im working with a consultant right now to get up and going, but it seems the industry on whole is a little antiquated and ripe for some technology infusion to help with the recruiting and placement and general marketing in general.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You know, the main reason that Im appreciative is that you made a sales call on a Saturday, and I feel like with my business right now, times of the essence, and I didnt have to wait till Monday for the conversation with you, so I appreciate that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Last time I checked, it was like 730.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I mean, definitely worth taking a look at that training and seeing what it is.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, so a couple of things. Right. Youre going to send me over the training video that I can watch, right. And then thats the first step. And then your proposal is 60 Minutes call with the trainers and all of that is complimentary. Obviously, pricing is going to be something thats going to come into play at some point. I dont know enough about what Air offers to be able to say, hey, its a good fit. Im assuming over the two and a half hours and the conversation with either Caleb or Ryan, that would become apparent. Also, I probably want to be a month further down the line from where I am so that I have more knowledge of my industry working with the consultants Im working with to be able to really have a beneficial conversation with Caleb Orion. Does that make sense?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, Im good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"At my junk real quick.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, it would depend on the skill set. It would depend on what the client was paying. I think theres multiple variables to it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Oh, Lord. Its going to depend, I think. Again, theres two sides of the business, right? Theres the recruiting side, and theres the client acquisition. So client acquisition, my goal would be to have ten meetings a day and then five days a week, 50 times so called 200. And theres going to be multiple people in those roles. So 200 per person in that role. I would expect that to be at the beginning, probably 400 would be the need for client acquisition. And then on the recruiting side.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"All right, have a good day.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I got it.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, just getting to my computer here. I was not running around.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah. I just got laid off from a tech job, so I was making 400 to 500,000, depending on the year. Got laid off, and Im starting a new venture.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"The industry doesnt necessarily have qualified youre not looking necessarily for qualified leads because if a medical institution is up and going, they need staff, theyre paying their staff. So its not quite the same as if Im looking to sell a Widget to somebody.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im in California Pacific.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Well do. McKenzie thank you. I appreciate you calling, and look forward to watching this information and talking to the consultant.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im hoping to have my domain sometime in the next week so I can have my new email address for the company. In the meantime, just use the one that I submitted.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, thats it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I got it. Ill be there.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, I speed everything up. So thats perfect. Yeah, I can do 07:00 A.m on Tuesday.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"No, I dont.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Tuesday is a little jammed up. Wednesday is wide open.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Ive got 680,000 to launch my business, and based on my current projections, even if no money comes in from anything else, that should be good for about 18 months, is my expectation.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, totally. I have no problem charging what somethings worth. The need that were trying to meet is two fold, right? One fold is the client needs the staff positions. They dont want the HR headache and they want to be able to move quickly and have people fill positions when they need them. Short term temp, long term permanent placement. And then theres the people that will work for my company, which will be, like I said, nurses, skilled nursing, people that are certificated that have to have the certain qualifications to go into these positions that were looking to fill. So you can look at it like my company is going to be the broker to match up qualified employees with needs at different medical facilities.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes. My incorporation documents are filed with the state right now and were waiting for those to come back. Hope to go live sometime between June and July 1.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats not a good question because Im trying to get all of the pre opening things done, getting the business name filed, getting the corporation set up, getting the funding documents handled, getting bank accounts set up. Its just getting a logo, registering the name insurance. So my day to day is not running the business yet. Its establishing the business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And then on the other side of the business, too. Right. Im basically recruiting and hiring people with certain qualifications. So there might be Im brainstorming through now what aspects of AI can benefit the company and it could be qualification from a certificate standpoint on the recruiting side to know, hey, what are the qualifications that X, Y and Z person has to be able to put them in the right funnel for the right person to follow up with them? Brainstorming right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, right now, its zero.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Let me look. I was looking at this morning, and I had a whole bunch of soccer games today that I had to get out to with my kids.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I can do that as soon as I got contact information.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I am married. I have a business partner that is not yet on board. Were still working through partnership agreements and itll be overtime bringing on. So right now my wifes not involved in the business, so its me.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Would say on the recruiting side, it would need to be at least that, if not 50% more.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, I have not personally run ads before, but yes, I am planning on its.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, Im pretty well capitalized and part of the value that the consultant that Im working with brings to the table is relationships on factoring companies and short term funding to be able to carry the growth that I need. So I think Im in a good place to scale as quick as Im able.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im just trying to see if I got two and a half hours to watch that training before I get on with those guys.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]