[{"pageContent":"And Im a certified HR specialist, of which theres not very many. Most everybody learned on the job. So certification just means I know the laws and stuff probably better than many HR people, and Ive been tested on them repeatedly.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Theres a range. Some clients, my base fee is 150 an hour. But then for people that engage most people dont hire me for a single thing. They hire me for kind of to be around the clock resource so that if they have an issue, they can just get on the phone with me and I will help synthesize a solution and, if need be, create a process or set of forms or whatever that they can put into place to protect themselves from the same problem recurring later. And I usually stay on an engagement a year. Right now, Im on one that Ive been on for, like, shoot, two or three years. But Ive known these people for about seven years, a lot of its word of mouth.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, so you didnt send me the case study so you could call me and offer to send me the case study. Thats pretty cool.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So I know which one I use for what purpose.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"For example, right now Im working with a company that hired a young HR person in, and they use me to give her the tips on how to build a better HR structure. If you do it properly, it becomes a defense against problems with employees. It assures that everybodys treated equally. And as you probably know from seeing all the information that goes out on the news and everything, thats a big problem. Theres a lot of people out there that have prejudice against all kinds of people.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats as far as its gone. So far, attorneys charge anywhere from $300 to a couple of $1,000 an hour, depending on what their specialty is. And Im not an attorney. I wish I had gone to law school, but I didnt. Im the lower price spread to do some of the more tactical things that attorneys dont like. But attorneys like me because I understand what their job entails, and I put together the information that they can use for evidentiary purposes. So Im in between an HR clerk who just basically does stuff in a mindless manner and doesnt really know why theyre doing it, and an attorney. So Ive stuck at 150. But Im sure if I had more stuff I could offer, I could probably raise my prices to, say, maybe 200 or 300, like a low month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I just wanted to find out what it was about. I think AI is interesting from what I understand of it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Between this month and last month, I think right now Im sitting at where normally I might make three, 4000 a month and higher. Last month. Hold on, let me look so I can cry. Last month th I made about $2,600.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Ginadmaranda at Gmail.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, Im really trying to work with multiples, and I would really like to package more discrete offerings. Like, Im working on a book for startups, which I have to finish. Thats where I thought the AI could be somewhat helpful that I can sell on as needed basis, because if I have books and things like that to sell to augment my normal revenue stream, its a multiplier effect as opposed to trying to make more of me. I dont think thats possible, to be honest.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats right. I have different emails for different things.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I can productize some of the things I have. I do things that are a little bit different. Thats why people hire me, because I tend to put structures into place that keep them safe all the time. I dont just have employee files. I set up systems that capture, input and document interactions with all levels of employees all the time so that we always know its just like you saying. And we capture this on audio for documentation purposes. Yeah. Well, no, you dont. You do that for legal defense purposes. But thats okay. I understand it. I do the same thing when it comes to HR.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats last month. In the first couple of days of this month. So it was really terrible time. Fortunately, I have a cushion from last year, but in the year before and the year before that. But thats still pretty bad.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. Most of the time I remember, but not always, okay? Please leave me alone. I really hate all of these things that go on here. Like, Google now wants me to give them all kinds of stuff that I dont want to give them. Okay, here we go. Yeah, theyre just like, give me your picture, give me your address, give me this, give me that. And Im like, no, I dont. Because somebody could hack into your stuff and find it. And what if theyre lunatics? Of which there seems to be so many out there now?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Good question. Because a lot of my clients are in agriculture, and California just went through a flood. My business sucks.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Hold on, let me look. I have to log into my email.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I dont see it. Im looking in all mail right now. I dont see it. I did get a text or something. I believe it was from you guys. Yeah, no, I dont see it. So what I do is wait a minute. No, thats not it. I do HR consulting.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah. Like, right now everybody seems to have a gun. And I grew up with guns. I grew up in Texas. I dont think they should all have guns, period. Okay. I dont see anything from you.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I couldnt bill and I couldnt do any work because everybody was closed down because their fields were flooded.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thats what I do.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]