[{"pageContent":"Hello. Please state your name after the tone, and Google Voice will try to connect you.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, right. Good to hear from you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I consult consulting. Can you hear me okay?","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Since 2015.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Well, Im in the process of starting another business, and it has to do with a different type of industry, but its a type of business that will inspire a lot of people. And so Im working with a crowdfunding coach, and she and I are looking at ways in which I can communicate my vision to my prospects and people that I would like to request that they further my campaign with their inside of their spheres of influence. And so I want to make sure that my communication is solid. And again, I believe that this could be the artificial intelligence tools could facilitate that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. So I used to live in Orange County and Im in a different state now, but yeah, I used to live in Newport, huntington area, back and forth between. And I did mortgages until eight. Remember when everything crashed?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah. So what are you going to do? I think its brilliant. I am all for you, for sure, maybe be a customer one day. But what are you going to do with your real estate coaching and business investment coaching while youre doing that? Youre not going to shut it down, are you?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hi, Kimberly. This is Tracy Lewis, president of Tier One Acquisitions. How may I help you this afternoon?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Tier one acquisitions.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Exactly. And they also recognize that tomorrow is not promised.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You sound like my dad. Now, he would always say that you dont want to talk too much about your ideas because somebody will take them and run with them. But no, but my husband and I, were old enough to be your parents probably. And so were at the point now where were looking to travel around the world. And so he was in the Navy at one time, and he did get a chance to see the world before he and I met while he was in the Navy. And hes since retired from Secret Service. So he was saying, you know what, why dont I get my sea legs back and buy a charter yacht and take people charter sailing? So thats what were about to embark on.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Which part of La are you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"These are blind spots. Yeah, these are all blind spots. Yeah. Theyre undistinguished. What are thats all it is. All these things that are going on in their inside of themselves that they havent shed any light on. And it all gets sorted out in communication. That too. Gets sorted out in communication. Yeah. Thats what the coaching practice is all about. So while I say Im a business coach, Im really a communication coach. But I dont have to tell them all that. I just tell them Im a business coach.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Youre so sweet. And then spell your first and last name for me so I can make sure I have it correct.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure. I havent even given you a helicopter view of my business. So it seems like I would love that, honestly.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Whether its crystals and healing and that kind of thing, or its what are the bowls that make noise? The singing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And people lost out? Well, one of the persons that I did mortgages with, he was old school. Hed been doing it a long time. He was like a top producer type of guy. And he stopped in like six. And his wife was a stay at home. They were country club kids, were in a private school, $200,000 vehicles. The whole nine were making a lot of money back then and again. Hed been doing it a long time. They lived in Newport Coast. Anyway, sorry, Im letting the dogs out. Its snowing. So two years prior, when everything was just booming, he was like, somethings coming, I dont want to be in this anymore. Im done. And everyone thought he was crazy, and he sold their home, got rid of everything they owned, and pulled their boys. They had three boys, pulled them out of private school and they got on a yacht. And they werent the captain, obviously, but they traveled the world. And she home schooled the boys and they were gone for a year and came back completely different. People like, wow. What mattered to them was not the lifestyle they had before. And their sons were so advanced from just reading for a year all these different books. It was just a really cool story, I always thought. But a lot of people want to do that, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Youre talking about in my business or just personally altogether? For you, I say 150.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay. Im ready whenever you are.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Ive been doing it for so many years. Like I said, I wear many hats, so I dont do that. Very honest. Ill be honest with you. I dont do it very often. Im filling in for someone right now. So thats why Im telling you. Im like, well, hold on, let me I think Im going to send you over here because Im taking this call in a whole different direction than the regular call would go.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Was that a question for me? No, this is my business. I dont have a partner. My husband I mean, you can call him my partner, but hes a silent partner, more or less. But anyway, who created that course? Its another company.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"To.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Have right at this moment. I might be able to do ten or eleven, something like that. Okay.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"What about Friday morning, the 7th?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Well, you dont need money to invest in real estate. We teach that. But anyway, bottom line is they got to at least have money for the course. But heres the other thing. I have ways in which they can get money, but thats a whole other thing, and I dont really want to deal with that. I like what youre talking about. Lets get the hot lead.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I need to look it up, but its pretty decent. Hold on a second. Just trying to see if I can look it up now. No, I cannot. I thought I was under the impression I had a way to look it up really quickly, but no, Id say its in the 600.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, I consult people on real estate investing as well as business entrepreneurship.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, its been just like anything else for the most part, and so Im looking to utilize AI to create.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right, perfect. And as a matter of fact, because if a person like AI is so good and I have a marketing system now that I put in variables, if someone has they say that theyre interested in real estate. Thats all I care about. They said theyre interested in real estate not as a realtor, but as an investor. Theyre instantly a lead. Thats it. So I have processes. So the leads that I have are people who are interested in real estate. Theyre interested in the law of attraction.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats the stuff.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, I can.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Exactly. Hell be the captain and Ill be like the cook. I dont know if youve seen Below the Deck, thats a TV show. Thats is that the one with the.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Tell me about it. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Excel. Are you kidding me? I could have done that. But its not just that she does it, its how she does it. And shes on TikTok. Thats the other thing. She did it all through TikTok.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Id say its around 656, 46, 50, somewhere in there. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Social media. And Im about to actually embark on a crowdfunding campaign. Yeah, I definitely can see how having a tool like this would make my life a whole lot easier.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"May I interrupt you right now? For sure, yeah. I wanted to interject. I literally they say when the student is ready, the teacher appears. Thats the first thing. I believe it. Yeah. So today I saw teachable. I mean, Ive got courses on teachable, but I had never considered that I could create my own course and upload it to teachable. So literally, I created epicentric Dharma schools, just toying around with everything, just like it said, oh, you want to create your own school? Click here. I was like, I dont know. It was almost like magic. And next thing I know, I had a website. My school is just like, that isnt just now. It exists. So I can see myself really? Courses. Yeah, I can see myself dropping courses. But heres the thing. I was saying to myself, thats going to be a lot of work. Im going to have to invest a lot of time to get that thing going. But youve just offered me an opportunity to create a team. I dont have to do it all by myself.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, Im an affiliate.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, the goal right now is to set it on autopilot. So its interesting you mentioned that. The coaching side, I found out that I can actually create actually, it could even be more of a group coaching platform. Ive typically been traditionally been one on one coaching. Now, I had envisioned that I could do that on the boat, thanks to Elon Musk. Theyve got ways in which you can be in the middle of the Atlantic or the Pacific or wherever you are in the world and still be able to communicate with people through technology. But now Im seeing that I dont really want to be tethered to one on one coaching. I have a sense that I can put it on a platform. Teachable is the one Im looking at. So thats what Im about to start working on. So that when I all my clients, Im going to send them to the Teachable platform and possibly create some sort of more of a monthly face to face, and then other than that, communicate through email. Yeah. So thats what Im envisioning. And in terms of the real estate side, actually, right now, Im not engaged in real estate. Im more or less selling education to other people who are interested in doing real estate. Ive been there, done that. So Im essentially moving on to my real estate is going to be my boat. Im more on the business side versus the real estate side. Right now, real estate is going to.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, let me do the check. Lets see. Yeah, I would say wed have to get something on the book by Im going out of town next.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"And this is AI too. Right. I saw that you all have the different names. I cant think of who its all attached to. Maybe its Odin, I dont know. Just making up a name.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Ill send it over. You got it.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"All right, beautiful.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"I dont know exactly who youre talking about, but I would presume youre talking about the is he the CEO?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"All right, beautiful. Thank you so much. I appreciate it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"To make a long story short, when I had this accident, my car, like, I was on an expressway and someone hit me from behind. So my car flipped over five times on I 395 south, just right outside of Washington, DC. On a Saturday night at about 08:00 p.m.. Oh, my gosh. Im technically not supposed to be here. Okay. I dont know about you, if youve ever spoken to someone whos had a near death experience, but life doesnt show up the same after that happens. And so Ive had two, actually, but the most recent one is the one that made the biggest difference. And so I was fed up of the status quo. And fortunately for me, when that all happened, COVID hit. So the whole world had to sit down and be still. And it was like we were all in this thing together. And so what I discovered is that theres something inside of ourselves. Some people call it the soul. I call it Ottman, A-T-M-A-N because I chose to look at how the Hindus I went back to their culture and Sanskrit. And so I started studying from there and I started listening to these mantras, language. And I would have bawling sessions, like, I would just be crying, wouldnt even know what the language was being said. But I just knew I was moved in such a way that these tears, they were cleansing tears. It was like I was just washing my soul, these tears. And it was an awakening. It was like self realization that sometimes people say that and I just havent been the same since. And Im continuing. Its a process, its a practice. Its not like, I dont know, I lost the fear of death, for example, that showed up. I became far more brave and just really just who I am is a totally new person. Its like the old me died and this is a new person. And my family says it. Theyre like, we dont even know you. So theyre like amazed. Like, okay, my husband is now listening to some guy on YouTube called Sad Guru. Hes listening to him and he comes back, tell me what Sad Guru tells him. And Im like, okay.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It is.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Well, yeah, they would. And part of that also happens at the workshop. So theres a presentation there that tells them all about all the classes and stuff, so it makes it really convenient. They dont have to go to another meeting. They get it all on that same day. Yeah. So I would have them theyd have to commit to being there for the day. But its $50 value, so thats the low thing. Were gifting this to you, but its like other people are paying $50 to be in the room, so theres something there. Were adding value. So then from that, they do that. And then there has to be a follow up to put them into the course. There is a piece right there. We can offer them a strategy call from that point. After youve done the workshop, then you need to schedule a strategy call, and that could be with The Closer. Thats fine. And then once they close, then theyll get with me for the onboarding okay. Yeah, thats easy. Look at how easy that is. Are you writing all this down?","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, Im not a grandma yet. Okay. Theyre taking their time. Yeah, okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, I do. Thats what I was talking about. $5,000. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay, so Im going out of town on the 11th, and this week is tied up. I dont have any openings this week.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"No, just my son. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, thank you.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No, Ive heard the name.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont believe it was as far back as Friday or Saturday, so Im pretty sure it was yesterday morning.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im going to watch it. Im not going to promise tonight, but you never know. Im actually in another training tonight, so I dont want to give my word to that, but definitely tomorrow Ill have time to watch it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats incredible.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"When I do do it, its not my favorite, but also its not uncomfortable. Its like, either. You know how you said when the student is ready, the teacher will appear?","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I would have to double check. It doesnt stand out to me on its own.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"All right, Id be happy to take a look at that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Bye bye.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, lets talk again because I need to get going here.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"When was it?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Okay. Sounds good.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay. Can you send it now?","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, well, the video will be getting texted over to you. Youre going to love it. Youre really going to love it. So Im excited. So yeah, especially even after you watch it. Let me know what you think, okay?","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I do, Ive got three adult kids. Its funny to say adult children, but you know what I mean.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"More streamlined approach to being in communication with my prospects and my customers.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"But really just people are having I think COVID did it a lot. People are having awakenings. I dont know if its just where the planet is right now, continuously being raised on a huge scale, but Im seeing a big, theres a big need for that and not a lot of people teaching it yet, but the ones that are, are doing extremely well.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Sounds good.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, thats what Im saying. Im just giving an example. It wont really be like that, per se, but were going to really our goal is to inspire families to live out their dreams. So thats how were going to crafting it, like that. And Id like to turn it into a television show.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I love it, love it, love it. Keep me posted on that for more information.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, I agree.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"It doesnt matter. You can text. Thats fine. Okay, go ahead.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Saturday. Im booked Saturday. You said itll be a 60 minutes consulting session. I could possibly do Monday. It would just need to be because I also have a weekly event that I host on Mondays as. Well, I got to stay present to that. So whats the latest? I could book on Monday. Whats available?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, most of them dont. I end up leaving voicemail. So yeah, you got a good one.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Do I?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Maybe lets see. Today is Tuesday. I would say it must have been yesterday morning.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"We know banks, but they have to be credit worthy. Thats the. Only thing, but we can get them like, I dont know, $60,000. 70,040 might be the most weve ever gotten. Anybody those people would buy our big package. Our big package is 20,000. So the commission on that is 10,000.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Because what youre going to run into.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, let me look. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"What do you find standing in the way the most?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Eleven Pacific, so I dont know what time zone theyre in, but eleven Pacific.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"All right, I got it. Okay, thats fine. I will let you know. Do you want me to let you know at your 208 number, or do you want me to let you know through the system where I receive the text message?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"ItS like in this industry for twelve years. Ive been in the industry for twelve years and Ive watched people come in and do the high ticket coaching. And Ive worn many different hats with many different types of companies.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Mmhmm. And how do I reach you again if I need to get back in touch with you?","metadata":{"fillerID":47,"fillerText":"Mhmm","category":"G"}},{"pageContent":"Youre welcome. I love talking to you.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"With the high ticket, usually the coaching theyre looking for is business or real estate or insurance or how to like how to do this or how to do that. Right. But lately theres been a big shift. Theres been a big shift in people that are yearning. Theyre hungry, their spirits hungry for it, for the more spiritual stuff.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I havent.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Real mindset.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"And so one of them is the computer that calls people.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Love it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, yeah. NLP yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"You could do this for your business coaching. People are always going to need business and real estate coaching. Thats a great one to know. Those are two great things for you to know and be able to teach. Always but then taking what you learn and doing what youre really passionate about or getting into something deeper than that or having a bigger calling. I dont know, this is whats coming up for me, for you, but I have no idea. I could be like, freaking you out too. I dont want to do that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Were just having a conversation. Im taking notes. I believe it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Oh, my gosh. Im not where I want to be, thats for sure. Im not making any money right now. Literally, I see this and its not like Ive never made any money before COVID I was crushing it. I didnt have a coaching business, but I was selling these classes like hotcakes and Im talking about the big package, like I was making six figures before COVID But anyway, I was in an auto accident and then that just kind of and then COVID hit. I have been on a different type of journey, more of a spiritual one. And so now Im coming to the other side and Im saying, okay, now that Ive spent a lot of time with me, getting to know me, I actually can see how I can be of service to other people to get to know themselves. And Im just doing it inside of a business context. So thats where I am. So you asked me how much do I see myself making definitely six figures this year. And were already where are we? Like early April. And then I see this being a seven figure business the other day. Yeah, theres this woman this is the other thing I was going to tell you. I was just looking at Apple News and there was this woman, shes in her 30s, she lives in Sedona, Arizona, someplace Id love to visit. Matter of fact, I had attempted to go visit there, but I ended up not going. I landed in Phoenix, and that was as far as I got. But anyway, Sedona, shes making seven figures. She started this business in 2020 or something like that. In her 30s, she retired. Her mom, she told her husband to fire his boss. He now works for her as her CFO. I mean, its real. And she does courses and what does she does these courses. She recorded the courses and it shows people she started by creating a course to teach people excel. Thats how it all started.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. It sounds like what I was sensing when I saw the ad, which, by the way, I saw the ad on Instagram just going through. It was on my feed. So just so you know, the ads are working.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, thats actually better than the 10th. The 10th? Im concerned with that. Ive got a lot going on. I dont want to get yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. The 7 april. So were looking at something around 1030 that morning, Pacific Time. Okay. Or eleven would be even better. 11:00 a.m.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"COVID taught us that tomorrow is not promised. And your loved ones, they could be here today and gone tomorrow. You just dont know.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Perfect. Love it. All right.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Sort of. Kind of. He would love to be into it, but hes afraid if he went that direction, he wouldnt be able to sustain a day job because he might go on the deep end. But I believe over time hes going to free himself up more once he gets that seat. I just see like as a future thats already here. Matter of fact, hes walking through the door now. I mean, thats how this stuff works. He told me he wasnt going to be home until 07:00 p.m. And hes walking through the door right now.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"If people are ready and open, then theyll want to talk, and if theyre not, then they dont. And theres plenty more moving on to the next right. Cant force people to be ready to want to make changes or grow or take their business to the next level.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"It does.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thats it. Sounds great. Sounds great.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, I do. Like, $20,000 and something like that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Its in its infancy phase. However, my husband, like yesterday, was asking, when are we going to buy this boat? Hes so funny. Thats definitely something that were in the process of working on. The only situation that were dealing with is we may end up getting a boat built. So thats going to take time. That would put us out to 2024. Thats the only impasse, if you will. But the moment we tell them what we want built and obviously we give them the down payment, then all were doing is waiting for the boat to get built and shipped over here to the United States. Thats perfect. But Ive got plenty of work now in terms of I love the AI dialer. So that was one of the things that interested me. Right now, Im working with somebody in Nigeria whos doing my cold calling. And to be perfectly honest, its not going so well.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Now my commission is $1,000. Im not going to get the whole 2000 because I didnt create this, but I have no problem. I dont know what you all charge. How does that part work.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yes, thats it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Whats that like savings? Id say $5,000 right now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"It?","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Exactly. The business coaching would be my course, 100%. This is something thats easy, quick money. Theres no limit to how many of these people we can sign up. Right? I have leads already. Ive got over 1000 leads just kind of sitting in an Excel spreadsheet right now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yes, its good.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"That is exactly the direction were headed. Thank goodness. Even when it doesnt necessarily look that way, thats exactly whats happening. And once more and more people I like what you said, the awakening. Once more people discover that there are no limits. First off, they got to get that there are no limitations within themselves. And then the way they get it, its like they get it inside and outside all at the same time, and theyre like, oh, my God. The way they say, I should have had a V eight its kind of like that V eight moment, and then thats when life really takes off. Thats the way Ill say it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]