[{"pageContent":"Do you know what the subject line would be? Just case study.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Obama? Obima.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"I love that.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"I see it. Hold on 1 second. I see the email. Let me open it now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I could say that Im 36. Im not fresh out of college. I appreciate that.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay, perfect. Yeah. Because Im in Texas. Hes in Oregon. So thats why I was like, oh, let me just make sure. Okay, perfect. So then what Ill do is I will send this over to him tonight, and then is this your number? Can I call you on Monday?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Let me look really quickly.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Its 652 right now.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"What Ive been doing recently on my free time, I build resumes for people and Ive been utilizing the Chat GPT with it. I was doing it on my own and then people were like, hey, you should start using this. And I was like, oh, okay. So I started just using it and just asking it questions and stuff and doing building blocks. Im like, hey, sound friendlier, and doing things like that. But I was just like, I dont know what else I can do with this. But yeah, I would be interested in that. Yes.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Is around this time work for you?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"From where?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, we can do 630. My time.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay. I love that. So let me do this now that I have the case study and I have the opportunity to send this over to him right. Its not one of those things where its like itll lock if I send it.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I would say I know for me getting into this industry, I wasnt like the traditional candidate. I was definitely a unique one because I was in college, the school closed down and for me, I just sat there and just utilized LinkedIn to its full potential on how to find jobs and how to build resumes that cater to being the top 1% candidate. And so my way of giving back was I was doing resumes for people for free to assist them on to apply for jobs and then also teaching them how to do mock interviews. And so that was kind of something that I was doing for a little bit. And then the job obviously started kind of taking over. And so I dont know, I feel like I have a lot of information in different outlets, but I dont know how I would be able to utilize it in one place. For me, Im just one of those people. I love to grasp as much information as possible. And when I saw this ad, I was like, oh, Im curious. What is this? I want to learn it. And once I understand the concept, for me, its really easy to pitch. I kind of pitch it as, like, its a no brainer type of vibe versus it being like, this is why you should do it. Its like, no, its a no brainer. And its like, oh, if you dont, someone else is going to, so you should probably want to maybe get your feet wet. And if it is a no, how do we turn it into a yes, and what are your pain points? Is it a true no, or is it because youre not really understanding the material? So thats for me, Im always trying to figure out why customers and clients have the answer no for things, especially in my job today. And so Microsoft is one of our biggest clients, and theyve been with us for a really long time. And I think for me, now that AI is starting to be like, a really big thing. I think for me, Im just trying to learn the process, and so I try to tag team with my brother, like, hey, do you think this is good to talk to these people or not? I always talk to my brother about stuff before I jump into things.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It would probably just be me. My brother is a college student, but hes really smart, and so am I. But sometimes I like to talk to him about things like these type of conversations. Im the oldest of eight, and so these type of conversations I dont really have with my sisters. Theyre kind of just like, what? Theyre all in different industries, and hes trying to merge into tech, and so we kind of chat about this, and hes like, oh. Im like, oh, what are your thoughts on AI? Hes like, oh, I think its a great tool. I know a lot of people are trying to kind of get all scared about it, but I think its a great way to kind of Im trying to figure out how to articulate this. Feel more comfortable about your future in reference to how to utilize stuff to keep your business afloat. I think a lot of people are getting scared because theyre like, well, what if it gets into the wrong hands? And its like, well, thats why we need to get as many people learning about this, so that way it doesnt get in the wrong hands and we can figure out a way or build some process so it doesnt get to that place.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Perfect. Yes. I really appreciate you calling me today. This week has just been crazy. I think you have been texting me, but Im going to be completely honest. Email is always better because I keep my phone on do not Disturb when Im working. Sometimes I forget to take it off. I need to get better at that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"You as well. Take care. Bye.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I see it now.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, I would love to. I mean, Im already doing coaching in the space that Im at right now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"1 second. The storm coming this way. Okay, say it one more time.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Well, I currently work for a Legion company right now as a manager. I literally signed up for this because I wanted to give it to my brother because I was like, oh, maybe this is going to be something that could fit his business. But I just have not had the downtime to get back and speak with him on this. I wanted to read the case study and be like, oh yeah, I think this would be a perfect fit. He started teaching me about Chat GPT, but I dont really do too much on it. I have created resumes and things like that. And next week Im starting to sign up for some AI courses that Microsoft introduced me to I network with somebody who works at Microsoft whos trying to get me to start taking the courses and stuff. Thats one of my biggest clients that I work with at my company. But my end goal is I would like to thats why I wanted to talk to my brother first about this. But I would like to kind of get out of the nine to five, get out of tech and kind of be on my own, but I just didnt know what that looks like. Ive just been seeing AI everywhere and I was like, well, how do I utilize it?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, cool. That makes me feel better. Well, then, yes, please send me did you send it already? Because I dont see it.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Im in Central Time.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Is that my time?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Oh, yes, I did. I was going to try to get in contact with you this weekend because its just been so busy. How are you?","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah. So just to confirm, the case study is just this video, is that it? Its not like a documentary. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}}]