[{"pageContent":"Okay. Were trying to avoid the stressing each other out and working together and being in a relationship XYZ but of course at the end of the day I get to say that Im the sales expert and shes the CEO. So its a fun dynamic.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Tell me a little bit more about that because thats like for our information, whether on whatever level thats kind of more the wheelhouse that wed be able to enrich for you again in so many different forms of fashion. I dont know yet, but tell me, community outreach, methadone clinics, things like that, what do you charge? Like what is your package? So say theres a clinic that needs your services and excuse me if I butchered the jargon there, but say theres a clinic that needs your services. Whats your package? How much do you charge? How are you making money from this?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, the AI company is actually my fiance, so this is more so like me kind of getting involved with her stuff.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Good. I remember I clicked on something last night, but I dont remember what it was specifically in relation to your company. Thats okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, thank you.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, were device agnostic, but we currently have the software development kit for Garmin activated because we liked because weve been mostly focusing on the research, and weve been funded by multiple grants over the last several years. But we have done implementations. We have plenty of research behind our back. We currently have an NIH two to three year grant for a research project with the VA and contracts with them, and were trying to move this more into helping them, like, obviously with vets and opioid misuse and addiction from injuries, blah, blah, blah. And then were also trying to commercialize that and bring it into various treatment facilities here. Were not at the moment specifically, like, targeting, like, a 28 day treatment sort of facility because were looking for an ongoing revenue. So were looking more for methadone clinics that would have a reoccurring client base and wants to retain those folks. Were also a really great opportunity for people who are in value based care, who want outcomes based care. And so some insurance companies do pay based on that, and were able to provide that data because of the AI machine learning that we implement. It provides all that data to say, like, okay, at 90 days, you have X number of people who return to use or didnt or XYZ, and it keeps people more engaged and they keep cleaner for longer. And its shocking, like, the differences. And if we can get this out into the more hands, well be able to save more lives, which is kind of a social good focus mission. So really passionate about that and trying to help that organization out.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im in sales in two different companies. My primary position is an outside sales rep within a commercial print industry. Mostly its transactional work. I build relationships with clients and then I try to choose clients who have a need for my service, which is commercial printing. So thats folders, banners, packaging. We dont do creative design work, but we can do following style brands. This is R Donnelly. Its a giant organization. We have 500 sales reps, blah, blah, blah. And then the other company I work with is Behavior AI. They use machine learning and AI to predict opioid, misuse, and potential cravings. They can track cravings or they can predict cravings up to 4 hours in advance of them occurring. So people helping people get the proper intervention before they might have a craving state so that they feel connected to their community and someone out reaches out to them to help them have them help during the gaps in care where theyre not physically at a facility. And so I was interested in your guyslittle pitch because it was like, oh, sales. And Ive been doing sales for ten years. I do relationship building, cold outreach, stuff like that, but I find myself with less and less time and doing more and more administrative work, and I still need to grow my sales and exist as a human, and they keep cutting my commissions, so I have to keep finding more business in order to remain profitable.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Trust me, Im excited to, you know, thats one of the many reasons why I love my fiance.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I havent looked for it. Ive gotten some text informing me that Ive received it, but I havent had time to go look. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thank you. All right, have a good day. Bye bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Jennifer.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Do you gather information on me and add me to your CRM systems?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Aim for Friday, because next week Im all week at a conference for addiction care.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"YouRe on Good Friday. And my largest clients are churches, so Im actually just yeah, thats fine.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]