[{"pageContent":"Is this a human being or an automated system?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"But Im glad you called me. Thank you.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Honest to goodness, I dont know. I mean, theres several different models, business models out there and I, honest to goodness, do not know for sure. I almost feel overwhelmed looking at all the different options.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Starting from scratch? Um, well, Im interested in looking at it then. You said you sent some information to me in my email?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. And so thats not bad at all. I mean, thats nothing. But to really get it up and rolling and going quickly and strongly, what would you recommend?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well played. Im good. How are you, sir?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, yes. I was actually a gentleman. Were you the same gentleman who tried calling me the other day and we got disconnected?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Im not financing anything. Ill do. Cash or nothing.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, no going online, ultimately, Id like to do at least 50 to 100. I mean, I see its doable. I know theres probably much more than that. Its doable. I just dont know how and I dont know whats real and whats not. Like, I got into this one program and as soon as I got into the one program, put a few thousand into it, all of a sudden for us to show you how to do it. Now its going to be another few thousand. It just was a turn off to me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No. What would it require financially? What kind of an investment do I have available to be able to get it up and really rolling? Yes.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Great.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, obviously you guys are market online, and I saw you online, you perked my interest. I was starting a business with a friend of mine. We were going to do that Lifestyle Blueprint. I dont know if youre familiar with it, where you market on the Facebook marketplace, that sort of thing, but honestly, it doesnt resonate with me. And this is the AI, right? Is that correct, sir? You use AI to scale and build. Is that correct?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay. Are you the gentleman in the video that I saw?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, Im just starting a new position this year, so I dont know. Ill probably be making a minimum of ten to 15 a month with what Im going to be doing. Probably ten.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And, sir, what was your name again?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Well, I dont know how to coach people, so I imagine not coaching. I wouldnt have anything to coach them on unless they wanted to. The only thing I know how to do is sell. But I would say I dont know. I was thinking about selling products online just because I see so much of that. But Im also open to other ideas. If I could find something that could be highly lucrative where Im not afraid of work, putting work in, but also being able to eventually look at it as a means to retire one day and work it, that would be great. Do you have different models?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, most definitely. I mean, thats kind of a no brainer there. And Im not saying that I wouldnt be satisfied with less as well in income. Youre kind of asking me these questions, and its off the cuff answers here, because, like I said, I work full time at another position, and Ive just now left my old job to start a new position, and Im in training. And its like, before I take on any more ventures, I need to get situated in this new position and very comfortable knowing where Ive got it mastered. And then Id like to, in the evenings or in the mornings beforehand start devoting time to building something online. How much time investment do I need to be able to build something? And 25,000 50,000 a month, how much time do I need to be able to invest realistically?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Got you. Okay. So are you ready for my email, sir?","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Okay. Its air.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, I will soon as I get going with this job. The email that you sent me, does it explain everything?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay. Im going to give you this one. SSR like Susanchanineradcliffe s Srtaxes. Taxes@gmail.com. And if you wouldnt mind sending it there, then Ill take a look at it this weekend and maybe we can revisit it again next week or something. In the early evening, I just have to go to sleep because Im in a real intensive training program and Im exhausted. I have to get up early.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"I havent. Im just now starting a new position. Im having to rebuild now. What kind of capital would it require?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, yeah, because Ive got family that Id like to help set up. Id like to be able to help provide for my grandchildrens college. I would like there to be spillover also to help other people as well. I like the idea of being able to help people learn how to do it as well and maybe even go. One thought that Ive had is going into once I was in a situation where I was able to financially, maybe even be able to get laptops into peoples hands that dont have the financial means too, and help them to learn how to make money online. But thats premature, very premature. I dont know how to myself. Its just something that kind of crossed and kind of passed right through my heart to help us.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"There another email to send it to thats not inundated with all kinds of emails from work and this and that and everything else. Let me give you a separate email, if you dont mind, because hardly anything comes to this other email, and itll stand out right there.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, it wasnt 1099. No. I was an employee, and it actually dipped significantly. Id say I probably made about 70.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Hey, Tony. You take care. Thank you. So much. Okay. You have a nice evening.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Honey, I havent even looked. Ive just started a new position and Ive been in intense training for two weeks and I havent slowed down to look at anything. Im so sorry. I dont have no worries online business at this time that Ive been working or generating funds with. Im not exactly sure what I was thinking.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}}]