[{"pageContent":"Yeah, thats fine.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"What she anticipated.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im doing well. How about yourself?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Its a possibility I did and also that I didnt. Im not sure.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, actually, I would like to see about 100,000 a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"To some extent? Because like I said, Ive been working on getting my business credit up so that I can have some funds that I can actually, you know, kind of invest in some in different areas. So, I mean, thats what Ive been preparing myself for for the last, I guess, six months or so, which I wasnt really in bad shape. Its just that I just want to try to make sure that Im in a good enough shape, because if I can get 50,000 alone of 50,000, I can actually work on doing a few things that I can kind of change my situation real quick. So thats really what Ive been looking for, is to be able to because the finances in which to kind of push forward to adventure into some of these other things. Ill need something, and I really dont need 50,000. I mean, Im just saying 50,000. But if I can get 25, thatll kind of put me in a place where I can make the investments. In some of these other places, I can at least make an additional, lets say ten or even maybe 20,000. And its not as much of an overhead as what Im dealing with now. I have some stuff set up, some ideas, what directions Im going in, and a plan on how to get there. Like I said, Im telling you a lot more than I thought I would need to, because like I said, Im trying to find out more about you. You know more about me than I know about you and what your business. So Im just running my mouth. Im ready for business.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Almost definitely. Look, I made my eleven year anniversary in trucking business this past in April oh, yeah. This month. So Ive been doing this for ten years. I drove as a company driver for three years. In the last six and a half, seven years or so, Ive been driving as an owner operator. So Ive seen pretty much different angles. Ive driven flatbed trailers, I drove tankers. Right now Im pulling a reefer, and the reefer is a refrigerated box truck. And I actually have hazmat and tanker endorsement, so I moved chemicals as well. I know the business.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I have some people that I could inquire with. Im not sure how they react to it, but yeah, I know a bunch of people that I sold with before and people that I feel that actually has it, but just never really tried it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Whats my real goal? Honestly, if I can make a million dollars a month, thatll be awesome. I wouldnt stress anymore. Yeah, I wouldnt be stressed as much as I get sometimes.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Thats why Im looking at other things where I dont need to spend $3,000 a week in fuel. Almost shit last week because almost $4,000 in just fuel.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, well, sure. Hopefully theres some things that whatever I need to put in place because everything that you said, it sounds very attractive. I try not to get too excited about different things, but I had no idea what you were going to offer when you called. But Im definitely enjoying everything that Im hearing. So, yeah, Im looking forward to seeing this video so that we can hopefully my vision can be broadened even more to see all of that, what all is available through this.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Because.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"My personal, because Im not sure about my business because I hadnt really had any much flow just to kind of.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, its sounding more and more interesting.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I mean, Im Im learning a little bit about the AI space and how it can be utilized for business, and Im just kind of trying to see what kind of help it can give, because Im not sure if its something that will actually fit what Im doing at the moment.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thoughts process is at. Okay, share. Yeah, Im here, Im listening. You got me.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Well, to me, thats kind of bare minimum because my mom is getting older, she still works. Im trying to place income for her. I have a son thats coming up that hes going to be going into college and just preparing things for him as far as because I got rid of my condo and just kind of stripped everything as far as what I spent monthly, because I spend more time in my truck. So I want to be able to purchase a home where Id rather pay cash instead of having a 30 year mortgage or something like that. I have a lot of different things that Im kind of looking at, and even if I do get a mortgage, I can at least do a short term mortgage. But like I said, $100,000 a month, not like it doesnt do anything, but at the same time, thats still kind of me just on the lower tier, because, of course, Im one of those. If I can see a million a month, 10 million a month, Ill take it. But just to realistically look at it 100,000 and it open up windows where I dont have to spend most of my time on the road. I can actually have my feet on the ground doing other things, and Ill add on from there while Im setting up other people to kind of where I can delegate, put people in places to manage the things that Im setting up. So thats kind of what Im looking at. Just kind of like I said thats on the surface. Maybe getting into some internet stuff to where I can do some Ive heard what theyre offering the Amazon wholesaling, Im.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, youre saying the course, you said 3000, thats how much the course is.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Almost definitely. I mean, thats the main thing, is to really be able to supplement. I say supplement, but to be able to where I can make the transition, because like I said, Im on the road a lot. I want to be able to spend more time with my son, have the option, and he can come stay with me or whatever. Yeah, definitely. If Im making $100,000 a month, my time will be spent on whats going to keep that 100,000 a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I saw an advertisement on I think it was TikTok or Facebook or somewhere, and I just clicked on the Learn More just to kind of see what because you dont really get a lot of information just on the surface. So, like I said, Im not sure if its something that will actually work for me right now because Im currently a truck driver, but I have some other things that Im kind of working on in the background. And like I said, if I can see where its a benefit, maybe thats something I can utilize.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, thats great.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Maybe in the next week or two, I may have that kind of money to put up where it wouldnt hurt me because Ive been keeping up with my bills, but I hadnt really had a whole lot of extra recently and starting to kind of see a little bit of a difference from time to time. But yeah, it probably take me, Im just going to say maybe two weeks before I can say I could have $1,000 to put up.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I dont see why not. Honestly, Im still young and I got a lot of Im really to hustle and Im not limiting myself to any one thing. I think God gives us many opportunities and to waste them will be foolish.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"She has retirement set up. She worked for the state for 30 something years, 33 years at the first point. But like I said, were dealing with new problems right now. The inflation is insane. Just regular everyday costs go up, but theres no real change in the income that she can make.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. Right now, I already feel like thats the case because I didnt even know people like you existed and with deep pockets to back up whatever it is that youre going at. So Im excited just knowing you guys exist. Like I said, Im in sales. Ive been in sales. I hear no many times, but hopefully that this wont be a time where I have to hear or accept a note or maybe Ill come back with another plan where youre more like either way, I think that this is a win.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, I will do my best to be parked so that I can.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thats something that I dont know because a lot of people are learning different aspects of the business. I dont know how many people are actually going through to learn everything all at once, but I guess combined, because as far as dispatching the brokerage side.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Annual. Well, shoot, last year got pretty low because during the pandemic it got kind of scarce. So I think I did about 151. I had to pull it up. I didnt hit over around 100. Yeah, somewhere around there. Lets say 125 to 150, something like that. But usually Im over 200. Usually about 225, 250, something like that a year.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Cool deal. Well, like I said, Im all the way in.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Ive been driving.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"All right, well, I appreciate you calling because I did see your messages, and I was like, they bother me about, man, what they want. I just was looking. So Im glad you called.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"YouRe going to be yeah, like I said, if I need to be taking notes, that might be a little more difficult, but I do retain information pretty good. But like I said, I didnt know how much I might need to note take, so thats why Im saying okay. But even though if it comes to that, I should be able to take at least an hour or so to stop if need be.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Oh, yeah, definitely. Youre sending it over today? Ill be watching it shortly after youll.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Cool deal, man.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, Im not you know, I somewhat worked in marketing to some extent, but I dont know it in and out like that, so I would definitely look at it from different angles. Like I said, its not an expertise. My biggest thing is in sales, but thats not necessarily because thats what I did before I became a truck driver, I was a salesman, so Im good at pitching and I can sell. But as far as actually the marketing, if somebody theres a price tag attached to it, I can make my way in between that, you know what Im saying?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, well, right. About that. That too is a possibility.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah. Other than that, I promise Ill show up. But like I said, of course anything could happen the likeliness, it wont. So Im just going to say Ill be there, Ill be ready five to ten minutes before the meeting.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Youre looking for a credit card or something? No.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Well, no, to some degree. Because like I said, because that actually sounds great with everything that youre offering. Like I said, my biggest concern was more so how many people are actually looking for this type of classes on a regular basis?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Alex Morales. Okay. Are you from Louisiana?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"All right, see you then.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats Alabama. No, Morales is what we call Louisiana kunaz theyre usually occasion in Louisiana.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Got you. All right.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Maybe more, but I can.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"It really wont matter. I can adjust. Regardless of what time zone is, you just let me know what time zone.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right now, the market is kind of low, so Im really right now only doing about 16 to 25 a month. Like I said, Im in trucking, so, I mean, thats not my net. And Im looking at things where I dont have so much of an overhead because, like, fuel, tires, repairs and things like that can eat me up pretty quick.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"S-H-E-C.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Let me ask this because Im curious that just based on Im not really sure the market of those people whos looking for those types of classes, like building a class that no ones really looking for doesnt really make much sense to do if theres millions of people thats looking for it or whatever. Yeah. And Im able to afford it. So I think thats the part that I guess I have more concern with that before I go too far into any direction, that its going to be beneficial on both sides. Because youre talking about the back end. We still got to make sure the front end is worth something, exactly what were putting all the efforts into creating. Yeah, it may make a certain amount of money down the road, but is the class thing the main thing that youre suggesting? Or is there other things that maybe we could because I know offering classes especially, or if theres a bunch of people thats offering day to day classes. I see. Thats how a lot of people are making money. But theyre charging $150, maybe $300 a month on more of a subscription base where people actually did maybe throughout the year, thats what they end up spending is the 10,000 or something like that. But Im game for whatever I can do, especially part of my expertise, and I can share it with people and they can benefit. And I can benefit. Cool deal. But at the same time, Im not so sure about what this market allows financially.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"You said show me.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"No, Im still supplementing certain things. Like I said, I have my business where it still sucks up a bunch of my money with this trucking. Like I said, repairs, fuel and all that. So I can supplement for her. But as far as the things that Im looking at, thats coming in the near future, no, its not quite enough. If that was my net, if the 20,000 was my net, thats what I had to spend. Oh, yeah. I wouldnt really have a problem. But thats what Im making. Thats not compared to what Im still having to spend week to week.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"In the middle of a traffic jam or something crazy, but 01:00? Yeah, I think I have enough time where I can that meeting will be for about how long?","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"All right. Hey, Im glad you sound this confident. It eases my mind that you got that part in. But like I said, Im going to check out the video and see what all everything that you offer and try to come up with some questions. So you have my email.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yes. One of the things that my mama told me is, before your eggs, you dont count eggs. Before your eggs, you dont go around telling everything youre trying to do. So thats why.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes. And Im sure that we could do some market research to see what something like that would actually if we were to combine it all into one big course, what it would cost. But driving school itself, just someone learning how to get their license, that right there is probably about 6000 $5,000. A friend of mine just went to school a couple of months ago. He ended up not driving, but he called a job with Walmart after that. But I know he paid almost $6,000 or right about $6,000 just to get his license. So to learn all of those other different angles. Yeah, I think $10,000 would be fair.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right now, Im on Eastern time zone. Im going to be in between Eastern and Central between today and tomorrow.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, I appreciate it, man. Ill be looking forward like I said, Im going to check and open a video and start watching now. And you say, whats? Two and a half hours? Well, I might need to wait until at least I pick up my load, but this afternoon, because Im about 30 miles from where Im picking up my next load. So once I get set up there, yeah, no worries. Set up my video. So Ill be watching it this afternoon and well take it from there. Ill be at 1300 tomorrow.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, you never know. You may have some family out there, but thats like a mobile phone number.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, Ill take a look at it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Because its still within transport, and honestly, if its something that is attractive that way okay. Maybe thats something that I can get into where I can use it. Im also looking at it from different angles, so Im looking at opening different businesses because I have a segment or community that I can help with getting them some employment. But like I said, I was curious just to kind of see what things it offers, and if its something that I can use down the road or whatever, at least I have knowledge of it. So Im one of those. Im always curious about whats going on. Im Nosy.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yeah, Ogun. Yeah, its Ogun. But Im just saying I think youre the first person that actually pronounced it right the first time.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Personal credit. I think it was around a 670. And I was actually going to go through a service thats supposed to get some other things where it clears other things off because they just shouldnt be there and probably will raise me over 700 easily.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Okay. Yeah. Believe me, Ive been in business for a while, usually pretty optimistic and usually doesnt work overnight.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. It has to be in a total, like, a true emergency for me to not show up for an appointment that I make.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes. Shes in a shes worked as long as I know. She retired for like two years and had to go back because income where she wanted it. Theyve been drawn back. Like, all the expectations she had for her Social Security was nowhere near, like, it was one fourth of what she thought she would get. And its just a bunch of systematic stuff, but it doesnt really matter. Like, I try to figure out a way so that she could have a few years to enjoy before she spends her last days not having to work all the time.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"I like 01:00 P.m..","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"The sound part.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I got you here. Typically, I know with every business, the time the turnaround is different with different businesses. But typically, what would you say on average would be like I say if I make the investment you said 3000, $5,000, how soon would I be able to start seeing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"You do the same. Tell me your name again.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Ill do my best on writing questions because a lot of times Ill listen to videos where Im trying to gain knowledge or whatever. I listen to it while Im driving.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"About an hour?","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah. Right now Im trying to recover from some of these repairs and recent repairs Ive done or whatever. So right now I cant say that I have any unless I was to pull out a loan or something and get some funds that way. But I dont really have anything right now. Thats one of my reasons for trying to move from the trucking business, because I spend more money on repairs. Its mechanical thing, and its just this one truck. I mean, if I had multiple trucks or the capability of getting more trucks where I could make that type of overhead will still be there, but at least itll be at a different rate. But Ill tell you, one of the benefits that I do have is because Im an American Indian, my business are tribal, so Im totally tax exempt. So thats one of the things that kind of helps me with. And Ive been working on trying to get some government contracts as well. And it seems like that stuff has been kind of been slowing me around. And the business that Im trying to get the government contracts through is just a year old. So some of the stuff that theyve called me on, they said my business wasnt old enough to qualify, and that would have been half a million dollars to $2 million a year. And thats a five year contract. So really thats two point five to ten million dollars contract that I could have had if my business was a little bit older. But still in all Im set up in position to be able to take things because I wanted to be a contractor, work on doing some contract work. And I do have the expertise, I know people where I can get a lot of these jobs done. It just need the resource or at least a chance to be able to. Because like I said, my cousin has a group of guys that they kind of partner with and its about 15 trucks that I can get right away if I get a good contract. The company that Im leased to right now, theyre willing to help out with the contract, with even investing, getting more trucks and this and the other. So I have different things in my hand, but at the moment I feel like it was just kind of a matter of time that something will come about where Ill be able to move things forward. Trucking really type of me this past year.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"I say hes about to head to college, but Im trying to prepare for hes going to be in the 7th grade next year. Hes about to finish 6th grade. So hes in the next five to six years. Yeah. He wants to go to either Japan or Mothers from England. So its one of those two places that hes thinking about spending some time for schooling. So thats not going to be cheap.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Only person that from the first time got my name correct. Like Ogun.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Of a case study?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"You, too, man. Bye.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}}]