[{"pageContent":"All yeah. Well, I went to a lot of stuff. Cool, man. This one with the small business leads.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Well, Im in my car right now, so Im nowhere near a computer or anything.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, I guess everybody throws around 10,000 or so. Id be pretty happy with 10,000 a month for sure. More than that. Im sorry.","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}},{"pageContent":"Well, I like working. I think working keeps you young seven days a week without as much money as Im making. Its just too much. But I dont mind working every day for something, especially if its growing and pulling in more money. But work, its just that Im working too long for too little glad that Im working. Half the world fell apart with this pandemic and all, but I just got to do something that I make more money at with the money, with the time Im putting in.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"30 years or so. Yeah, Im an old guy, but constantly looking for better ways to make my life sure.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, well, Ive done the teaching part too, but I like playing. Theres just not much playing to be done these days. But Ill tell you what, Im getting ready to park. Im getting back to work here. But if you want to send me something or if what Ive spoken to you about doesnt meet your qualifications, I understand that too. But whats my email address? Right. TSF for HomeCast.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Not really. If I found something that I could work at a few hours a day and was making money for me and was honest and helped other people business wise or whatever, Im sure I could like that. But passionate. Im not saying, oh, man, I want to blah blah blah. The only thing Im passionate about is music. Thats what I really love. If I could make some money, Id buy a little club, little restaurant or something and play three nights a week in my own club. That sounds silly probably, but not no, it doesnt.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im always looking for something to do. I work seven days a week to keep my self employment business going, and I need to make more money with fewer hours, you know what I mean? And AI seems to be pretty the world is going these days. So although I dont know exactly which one of your websites which one it is, thats why Im looking at stuff for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im a title examiner. Real estate.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, Ive had some people working for me over the years, but thats as much of a headache as working for yourself.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Have a great day, bud. Take care. Bye.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Three or four days a week I would enjoy for sure because I work with some good people and I like what I do, but its too much time for not enough money. But you got to keep the clients happy. They want their work when they want their work. You said high ticket. Does it cost a lot to get involved with your company?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Was I back and forth with you on your website?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay. And your name again is? Sorry.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Alex with air. AI.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Alex. All right, Alex. Thanks, buddy, I appreciate it.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Class on that actually, the business is disappearing. Theres more and more being done on computers than what I used to do, and people are losing their jobs doing what I do. So Im just happy to still be doing what I do for a couple of companies that keep me busy enough. But as far as bringing in new people, the job is Im watching people losing their jobs year after year. Its just the computer has changed a lot about what I do and thankful Im still doing it. Sure.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Not seven days worth, no.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, but Im a pretty good jazz guitar player below 35. I made my living playing in clubs and playing doing weddings and teaching guitar. But I had to get out of that because theres no real future unless youre a star. But as far as business is concerned, Im not really passionate about. But he walked across the street right in front of Amazing. Well, you know what I mean. Im just looking for something. I like this artificial intelligence stuff, but Im looking for something I have the time to do and makes me some money. And something is as good as all of the videos and all of the information says it is because a lot of stuff is all of a sudden you get involved in it and its not half as easy or half as good as you were told to believe when youre looking at the videos. And whatnot if that makes sense to you? Thats what Im looking for.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}}]