[{"pageContent":"Is this about education? Sorry, who is this? Sorry.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"That is why Im on the phone with you, is to generate a plan. Because I do have a plan. Im listening to videos every single day. Im writing down a strategy, et cetera, but I havent implemented it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. Fair.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No paid ads, no funnels. Correct.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Again.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I do. And Jake, Im just going to have to hop off the call because I have a podcast at 04:00. You can totally watch it if youre available on my Facebook. So I have to get off the call, but if you could send me information about what it is that Air is about and I can get an understanding as to what Air offers, because I just literally clicked on your ad and put in my phone number, and Im on a call with you right now. And I appreciate it very much. And I do have to get off the call right now, so I feel like Im a little over my head with all of this. Its a little over my head, so I have to get off the call. Can you send this to me in an email? And I can go through the qualifying process from there and reach out to you if it feels like a good fit.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"It would just be me duplicated, obviously. Maybe have I really cant answer that question right now. Exactly. Because thank you for the creative question, but Im just trying to say.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. So I work with yoga teachers, energy healers, wellness practitioners, transition to online. Oftentimes people that occupy those spaces are not exactly technologically advanced, so to speak. So I create websites. I worked in corporate a little bit. Im a quick learner, so I can help set up an online digital store and the obvious income route would be zero to ten K in 90 days. Yeah, thats it in a nutshell. And be able to create. People that are working in the wellness spaces oftentimes are. Financially, theyre vulnerable. Financially theyre giving all this energy and love and body awareness and whatnot into the world, but theyre not really being financially compensated per se for their time so Im trying to help them get organized and have an online presence and as you said, make greater impact, but also be properly compensated.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"This amount of time right, I do not have a ready to buy market. I do not have a ready to buy market, so to speak. No, yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I do not.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I love the psychological questions that youre asking. I get it. So thanks. I just dont know how to land the plane properly.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I do.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. No, thats a new word. So yes, please share with me.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, thats a really big answer, and I have that answer, but for times sake, you really just want the shortens quick is that? Im from well, this is really for my therapist, but Im from an oil family. Im from an oil family and Ive seen what big money does, literally, to the brain, and I just am really interested in scaling my business to $250,000. Look, if I stumble across a million dollars in the next three years, then Im happy, right? Once I get my nervous system regulated, its one thing for money to just appear into your account. Its another for you to really work for it. And so thats the kind of legacy I want to create. I want to help people that go from zero to ten K and be able to help regulate their nervous system so that people can understand what money is and how to use it and how to live in integrity with it. So thats it. I dont know if its so much a limiting belief, but its like just where Im at. And I dont know if that was the answer youre expecting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, thatd be great. And just to explain, I accidentally was filling out a form the other day and I accidentally pressed my number in for education, and Im getting, like, 50 phone calls a day. Its pretty ridiculous. Im like, I have an education, so sorry. Anyway, Im really happy I answered the phone because typically I just dont even answer the phone. So this is good. Okay.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Perfect.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Please.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So why did you take it down from 44?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Thats where Im at right now. Thats where Im at. I am creating that process as we speak.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I know. And thats so silly because its not like I feel that way, but it certainly has it doesnt mean its not real.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Excuse me.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"That means just like getting my offer in front of people. Thats the part thats the money story part. Thats the fear of rejection, whatever you want to call it. Thats really it. Thats the mindset. I think thats because I have everything else, and I dont understand why I have really been sitting here for three years spinning my wheel. Im the queen of getting ready to get ready to get ready to get ready. And Im sure youve heard that phrase. Yeah, thats me. And then the actual reaching out and putting my offer in front of peoples, whatever, its like, totally, theyre not going to love it. The whole itty bitty shitty committee starts going off in my head, and then I get distracted and go create another program.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right, of course. And look, everybodys in business for the same reason for the most part, right. Its impact and its obviously taking care of myself. Right. Because ultimately as well, if Im making a bigger impact, Im respected more by the amount that ultimately were having that transaction. And its making sure that its abundantly clear what youre there for. Its people first, because thats what sells to begin with is actually providing real help. So I love it. I love where youre coming from. Whats your pricing?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Oh, no.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Not sure exactly the answer to that question.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, I know all these excellent both.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hold on. Weve gone over time, and I have one call coming in 1 second.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"No, its all good. Im just saying I dont have the process in place. Just to be clear and straightforward and transparent, I dont have that process in place. I have an idea, and Im working on that. Like, Im making posts every day. I have a podcast. Im constantly friending people. My weakness is actually reaching out and making offers. Thats where Im at. And that goes back to the money story, period. I know where it all is, and thats the only part of my process that I just dont have completely. So, yes, and thats why Im on the phone with you.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, absolutely. Are you open to raising your prices if you knew that you had clients willing to pay?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"It not at this time. Probably the rest of the questions that you have, Im sure I probably do not have in place because I have yet to really get to the conversion part.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, I have, actually. Just briefly. Yeah. Nothing converted.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Hello? Hi.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, yeah. I mean, its like Patagonia leaving his billions to the environment. Yes, I understand 100%.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I do. I mean, I have just an organic social media outreach, content, calendar, et cetera. So I post something like, Im on a mission to take on three clients this week to X, Y, and Z. Yeah, I dont exactly do reels. Im in my stories every once in a while, so I dont want to say lacking. Thats not the word. But Im busy doing other things. How about that? Does that answer your question?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, that sounds great.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, so Ive joined a $10,000 coaching group out of Australia. Theyre helping me craft my offer, helping me get 90 day strategies. You know, all of this. And so Ive been working in the coaching spaces for about six months. And so Ive hired another high ticket business coach. Ive been, for the last three years, kind of building everything and trying to get all the foundations. And I understand that Ads and so on is one route. The other is the organic reach out route, which is where Im at. Just full transparency. Im not looking to scale to a million, honest to God. Im just looking at 510 clients a month. Im looking at four clients a month right now. You know what I mean? Thats where Im at. I want to really build a strong foundation of what it is that Im offering. I want to give my clients high integrity. Its not so much for financial gain as it is really helping people transform. But I need to transform myself first. So Im looking for quick routes and Im looking for ten K strategies a month. And thats where Im at. Im very green. Im very new to this process. I know what I want, I know what my goals are, and I just love that and Id love to hear more about it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Because I couldnt answer the last five questions that you are asking me and Im not exactly looking to scale right now on this level. And I have to get off the phone because thats just what I have to do. And I appreciate all the kind of wonderful questions that youre asking to kind of, but I dont even know what you guys are doing. Theres so many questions I have for you. So I just appreciate it. Is there something you can email me with? I dont mean to have interesting energy right now. I just feel like theres a whole lot of questions and when you get to the financial aspect of things and asking me more personal questions, its kind of bringing up a lot. So I just need to get on in a headspace so I can be quiet.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"I really appreciate it.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. So why dont you send me something that would be under half a million dollars. And Ill look at the options that you have and well go from there. Does that sound good?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I love it.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Im not exactly sure the question, Jake, but I keep saying it over and over that I need to get off the phone, and I just really would appreciate you hearing me on that. And I dont know the answer to the question.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"I appreciate that. Its just I honestly expect to be on the 30 minutes side and then I usually take about 30 minutes to have time and space and meditation and all the things that I clear your mind before I go live. And having this overwhelming energy and having this kind of vulnerability coming up right now is like I was trying to say earlier, its just a little uncomfortable. So I would appreciate you can honor that. Just please send me an email because I cant say this again because I have to get off the phone now. Its 20 minutes and I really need to have this time because Im going to be sending her a link in 5 minutes. Can you appreciate that and can you hear me on that? And also can you send me an email now that you know what I can afford or whatever and we can set up a time then that would really feel good to me if we could do that.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yes, I do.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Ten to 25 appointments.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, absolutely. And congratulations on being a wonderful human and have a beautiful day.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah. Im getting a little like Im not being heard, so Im curious as to what it is you guys are offering. And the packages that you have, do you have 20 different packages? Does that make sense?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Outbound appointment via setters.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes, it does.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I do, yes.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Right, so the conversion rate is essentially 30%, is that correct? Is that what Im hearing?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I do.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"It does. I lost.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Kathy, can you hear me now?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"It was about $500 a month, and I think I ran like, three months, 90 days, something like that. Yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, yes. Im in the organic outreach, making posts on all the social media platforms. I have a podcast. I dont go live on Reels, but thats where the podcast comes in. I have a YouTube channel. I have various Facebook groups. Im reaching out into various Facebook groups. Im making connections, Im friending people. Like, all of this. But the process to thats the attraction part, and Im working on the conversion aspect and then obviously the delivery. So thats where Im at.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Can you repeat?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Is that summarized?","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Of course. I just had this conversation actually three days ago with my landlady who has like hilarious. No, I mean shes like, when I die, its all going to good because we just had like a big financial planning session and Im selling shares right now, so Im just looking for a house. Im doing all this, but I want to have and so on to grow and so its very exciting. So fabulous answer, Jake. Im listening.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I dont.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Love to build a team, obviously. Yeah.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I dont know. I mean, two and a half hours. I would love to see if he can explain to me what is scaling again? Im not exactly there to the scaling part, but I think I covered that a couple of times. But Id love to have here if he has.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay. Sorry about that.","metadata":{"fillerID":39,"fillerText":"Yeah","category":"F"}},{"pageContent":"I just need a ballpark in what it is that youre looking what it is that youre offering, just a ballpark of packages that you offer.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I do. Its like 785.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"If we can do this in 7 minutes no, 5 minutes, then I would love to hear what you have to say.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"And end this on a good note.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"If Im just being completely honest, a half a million dollars a year would be fantastic.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, Im not new to the wellness Ive been in the wellness space.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"You mean the conversion rate?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Legacy. Really? Its about legacy. Its about what you were saying earlier, and I understand the impact that big money has, and that is a promise that Ive made to my mother, who has since passed, that every single dollar and every single thing that I receive from everything would be green. I would turn it into green. I know, but its all heart centered and heart led, but I have to get into a business mindset in order to achieve all of that. So this is why Im on the right, but you cant lose that conversation.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I was in between calls, so I.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No. Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Its looking anywhere from between eight thousand three hundred and thirty three dollars to ten thousand dollars a month. So thats the 100K, obviously. Right? Yeah. So my first year, that would be fantastic.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No plan for what? Im so sorry, I misunderstood you.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Those are complicated and private conversations. Lets land the plane. What is it that you are offering? What is your rate? And if you can send me what it is that youre offering, I will take a look at it. Can we do that? I dont want to get into yeah, no worries. Personally.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Theres a little bit of vulnerability thats happening for me because I cant answer a lot of the last five or six questions that ask, and so its putting in front of my face that I may not know what the fuck Im doing. So I need to get off the phone so that I can have a minute so that I dont bring this energy into my podcast. And then you start asking financial questions. I can afford your program. Is that the only question that I can afford the program? Im just looking to see whether or not its a good fit for me, whether or not Im even ready for it. And its getting uncomfortable for me because I keep getting pressed a little bit on answering questions, and I dont even know what it is that youre offering.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}}]