[{"pageContent":"Okay. No, I appreciate that. I appreciate your honesty about it, too. That is just trying to sell something I dont need.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yeah. No, I appreciate it. Thanks.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No, actually I havent.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, Im not doing any outbound calling right now.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Its Kevin.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, I run a real estate brokerage. The reason I looked for that is just kind of saw an ad for it and trying to educate myself really more than anything at this point.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont think I want to start either. Frankly. I dont like doing it for one thing and if I dont have to, I wont the other things that you do. So you got the outbound dialer and then you got other things that are really more focused toward creating the training side of correct.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, Im just not at that point well, Im not at that point for any of that. Thats just something that I started looking at. So I wont even get to point. I dont have anything developed to dial about at this point.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Good, how are you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, to be honest, I dont do that much. My brokerage is very small and virtually everything we do is on.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"So I dont do a lot of marketing, I probably do need to do some, but I guess I was curious about the AI aspect of what you had and how you would apply that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"About six years.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, Kevin is my work name. Kevin is my real name. I go by Cam on a lot of stuff outside of the real estate because youre required to use you can register a nickname with the state, but it becomes a pain in the ass. So I have to use the name I register with the state on when I do the real estate. Arizona is a very highly regulated real estate state.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So if I were to start a program and this wouldnt be as a training thing, but as a new marketing thing, if I were to start some type of marketing program that would be looking for high net worth individuals who are looking for an investment opportunity, is that something that your tools would give me benefit to?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I suppose light? Yeah, I havent thought about it, so I wouldnt really know how to look at that. I dont know that Ive ever thought about having enough value to share.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, thank you very much.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]