[{"pageContent":"I have not done that yet, but I have so many accounts open on there, its not funny, and I have to pull them all together, and I wish everybody shut up right now so I could talk.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, Im not selling those books at all. What Im doing is using the Black Flaw Dictionary against the government itself. Because Britain, its law you can take in and case study. Now, if you become how are you.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Now, this is going to sound very strange to you because youre probably not going to know what the heck Im talking about, or maybe you will. I am kind of like an entrepreneur, okay? Im a strange person. I have a very high IQ, and I think of things, like, out of nowhere, and stuff just starts happening because thats who I am. I just do crazy stuff and not crazy where its illegal or nothing like that. Yes, Im peculiar. A very peculiar person. Number one. I sing. Okay? And Ive been singing since Ive been eight years old. Its not a dream, its something I really didnt pursue and I do very well. And by the way, I made it on American Idol in the year 2009. Then two days later, lo and behold, Im crossing the street and a drum driver hits me and more or less I had to have my job rebuilt. I dont even play. Same person I did before I went.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ive been seeing, baby got to sell for themselves well, you know they can never love me when they cant even love themselves and you know I need somebody, somebody really love me like a man I just screwed that up.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I never seem to lose a darling even though I tried to find a man that could take me home theyre taking me for a ride and I need someone to love me someone to really I understand. Dont do votes.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"When they came here to Denver. Dont misunderstand me. Im telling you the truth now. When they came to Denver, to the investor field, they set up tents and they took four at a time. I made it through that audition and had my green ticket and went flying down. Theres a long line they had to register, and I made it that far. And then two to three days later, I was supposed to go back for an audition, but I was crossing the street and a drunk driver hit me and well, I died four times in two months, and I had to have my health base rearranged. And this is a good part. I have a tendency this is why they say Im a survivor and Im smart and why I get ahead. They told me that if I lived during this time, if I did that, I would never sing again and never walk again. And I had already died twice and resuscitation didnt work. And I came back into my body because that is what happened. I came back into my body. Im tired of saying the words that people want me to say I want to say the words are true. And now I dont go into it and tell those people that stuff because I dont want to be on a talk to them, be made skeptical while when people argue with me about something that you cant argue about.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Im sorry. Ive been having Zoos try to call and written else, and Im getting aggravated with them. Actually, what I am saying is true, though. Theyve been particularly messing with my health care, and I am allowed to tell them about the health care. Im sorry.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yes. Im sorry. Okay. Is this better?","metadata":{"fillerID":39,"fillerText":"Yeah","category":"F"}},{"pageContent":"Dont do that to me.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"And without a credit score, that stand up for me. Like, for instance, I have two daughters and my husband, they back me up with that, and they stand in for me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Go ahead. Im listening. Im just about ready to kill my dog, and Im trying to get quiet here, and I cant.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Okay, well, just to make it even, probably be $75,000 without even trying.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Excellent.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"I said dont lie to me.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Ive got a phone altogether.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"You know how everybody is going through on Facebook? Theyre either trumpsters or theyre Bideners. You know what I mean? Do you know how Facebook is fighting in the whole country, fighting over this election?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Theyre all fighting over that. Well, yeah. Massive division.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Anyway.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Its not going to be a fit for us right now. That blackball dictionary youre underestimating, Matt, I can come up with that easily. All the courts and go straight to the Supreme Court.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"And by the way, Im also a therapist, and I have a four year degree in English. I mean, you dont know exactly Im a multi talented person that Im not.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Paula, what do you think?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Monetize it? You teach people how to use the dictionary. You teach them how to use it and you teach them the correct language. For instance, this is a very tiny thing, okay? They tell you in Social Security that you cannot receive a certain part of your check if you dont give them a physical address. Okay, well, the physical address in there doesnt mean exactly what it sounds like. It sounds like, oh, I have to give them the address that I lived in. Thats not true. As long as they can contact you at it, thats a physical address. Well, when they held my check back for a year and I got angry and I pulled out my Black flaw, guess what? I had my check within five days. And on top of it, they were telling me to call the congressman. So what Im trying to tell you is this. I teach people how to use the dictionary and how to translate the law the way it really is so they never have to go to court. Like, sometimes you dont even have to go to court. You could just write a letter or go to the nearest police station, write a statement, say, Im not turning up unless you all this might fight me because of this. That article something subsectionist and blackball dictionary. So what I do is I teach them that. And then this is something else I do. Instead of teaching negativity to everybody and everybody getting on there. I call it I have now coined the phrase called dont laugh, called the triumph versus obeying saga.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And Im not lying to you at all. If you want to know the truth about the car, I got very nervous, and I called the FBI myself, and I told them what happened. And then they started laughing. They said, lady, did you ask for anything? I said no. I did not. And I said, do you have? Yes. I said, every text message. What did he tell you to do? I said, go buy an SUV. He said, well, what are you waiting for? Go buy an SUV. I went. Oh, yeah. Okay. Im just telling you.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. I went and bought a black law dictionary, okay. At that time, it cost me a Black law dictionary, okay? Only lawyers know about that. Theyre given that when they graduate from law school. And that book is worth a mint. And especially the 6th edition. You dont want anything but the 6th edition. Really? And I bought that book about a year and a half ago for $39. And about six months ago, I looked it up for a friend and they wanted $6,000 for it. Now, I dont know how much its going for right now, but something tells me that that book is worth a whole heck of a lot for it to go from forty dollars to six thousand dollars.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Thats kind of what we do.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I understand that.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay, here we go. This is nothing.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"It actually works. Guess what? It actually works. And you know how it works? The algorithms do not pick it up. And Ive not gotten jailed, not once. And everybody is starting to love it. And the reason they love it is because I dont use presidential election either. I use residential selection. Im teaching people new words is what Im doing. In other words, because theyre fighting so much. I said, theres a way around this fight if you listen to me. And theyre starting to listen to me about it. Im sorry. I just hope that one doesnt bite my mind. Go ahead, and sit down, Barbie. Yeah. So I teach people. What Im saying to you is how not to fight. Okay? My ultimate gain here is to have Republicans and Democrats at the same time be able to talk to each other without biting and calling each other names. And Im actually being youre going to.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, so you need $10,000 is what youre saying.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"To like, since I didnt have a car last year, and a guy from Sweden bought me one, and I didnt even ask, and then I have a $3,000 bed that I didnt ask for, and it was never something new was given to me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Tools. I take the tools out of their hands so they cant fight with each other, and they have to talk and find a solution. Instead of lets beat up the Republican, lets beat up the Democrat.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I forgot to tell you the second time calls that free insurance. So go ahead. What do you want to do? Get arrested? Rent.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Go on. Right. So what I intend on doing is taking the tools away from them so they cant do it. And I found out that Im kind of successful at it and how I take their tools away from them about fighting about that, and I call it.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"See if its your credit score is right now? No, I do not. And I use my husband because he messed me up years ago, so he allows me to got you.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"And then what do I get for $10,000? Im not being rude. I just want to know what we.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Is this going to anybody?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"At the present time, youre going to last 500. But if I have my husband call a friend, I have thousands upon thousands there. He got an inheritance from his parents in front of his aunt, and he knows Im very smart, and he knows Im entrepreneurial, and he knows that I pick up stuff easy. Okay.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Youre not talking to the IRS, right?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Who are you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}}]