[{"pageContent":"I hadnt seen it yet. Im running around sort of for my boss to do a trip.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Probably if we booked up some standing. And its like a practice, right? Its like a law practice. You get more and more clients and then somebody recommends you to a corporation and then you use that client as a springboard. And the same way I built my graphic design business, its sort of one relationship at a time.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, thats certainly possible. I mean, that was why I didnt know much about it, but so its always in the inquiry.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"47 years.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, design logos.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im teaching professionals. Im in Silicon Valley, and I consult with all of the Google and Apple and Applied Materials and all those guys. Its good money. Its sporadic, and Im not in charge of it. Right. They assign me to go places, and sometimes I have too much damn work and sometimes I dont have enough. So my secondary business is its okay, but its kind of a pain because I cant control like, I would have loved to work my head off this winter. I worked my head off last summer when it was nice and beautiful and I sat around on my ass this winter when it was raining all the time, and I would have reversed that. I would have loved to have that kind of work when there was nothing to do.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"We hadnt thought about it. We werent sure how it was going to be. Our first class was overseeing were giving our second class this weekend and it was well received. That would be my third business. I hadnt thought about that specifically, but it wouldnt be the worst thing if we scaled that up to some degree, but I hadnt thought about it. We were just sort of seeing if it worked.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Our friends right now, but people certainly consult to businesses for reasonable bucks.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"We didnt invent this. This is Marshall Rosenberg invented it. Hes used it internationally to bring people to different agreements.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, making money talking people is always a better way than having to produce a product, I have learned. I mean, I was really successful as a graphic designer, but I still have to produce a product. If Im talking to people, the downside is I have to be there. But after a while, if you train people to go out and do it, then youre just kind of running the business, and you give a lot of flexibility that way.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, something like that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Just because Id been dating my partner for eight years and we havent fought yet, and its something that people know about us and something that people remark about. And so people started coming in asking us how we did that. How do you manage to be with somebody for that amount of time and not have a major blow up or even a minor blow up? And we said, well, we use a lot of NBC. And so thats how it sort of started, finding out the needs and feelings behind what each person is doing. Right. Everybody does things for a variety of reasons, but it all comes down to what did you need and what were the feelings behind what you needed, right. So youre upset because somebody disrespected you, right? So you have a need to be understood. Youre feeling disrespected because you have a need to be understood, need to be valued. You have a need to be seen. And its that kind of a thing. So then you could say to somebody, look, I was upset when you said this because I felt misunderstood and it violated my need to be seen and valued and listened to. And they could go, oh, well, thats not what I meant when I said it. And then you have a dialogue rather than your fuck had go away. Right? So its that kind of a thing that we were sort of propelled into it by the people around us, sort of asking for techniques and how do we do it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Good, good.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No, I havent. All right.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Not in business, per se. My friend and I have a personal consulting business. We teach people nonviolent communication, which is sort of a technique to reach agreement between different parties that are having its. Almost mediating, I guess, is the closest word youd have to it, for sure.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, its our own course. There are lots of different ways to do it and lots of different things to focus on. So were teaching people its not a course per se, its just a bunch of material that can be presented in many different ways.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its my business mostly. I work also for an engineering firm doing other stuff, but this is mostly my gig. Yeah, its just me.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, but its pretty low. I had some tax problems a while back, so its really not borrowing money is not a thing I do a lot these days.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I dont know, like three or four grand or something like that. Not tremendous amount.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"But Im not in control of the engineering part. Right. Its something they assign to me when they have it. So sometimes its a big bucks and sometimes its nothing for a couple of months and its annoying.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Like, I dont know. This is something new, and the whole AI space is something new. And we werent sure where it went or how it was applied. It was something that we wanted to make sure we got in the ground floor and didnt miss it. Two years from now when everybodys a millionaire and were still shoveling coal, but thought, wow, that would be a shame that we missed it.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, we hadnt thought about franchising it on that level. At this point. Not that thats impossible. We just that hadnt been part of what we were thinking.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Probably 15.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Doing relatively high end logos? Really, is what Ive been doing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, there were some years it was up around 120 that was in the beautiful heyday of graphic design. And these days, its a harder and harder business to maintain because you have so much competition and the barrier to entry is in so low now, anybody with a computer can do it. And the AI is helping you draw and helping you people think that they can just go online and get the kind of services I used to charge a lot of money for. So the business is not what it used to be, unfortunately.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Nonviolent communication.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Echo.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Very good. Thank you.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, I didnt know much about it, but I was thinking about it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"We know what we know how to do, and thats one of the things we know how to do. And that was where we got our standing from is because people know us in the community and they know that despite being well, theyre different people. We dont really fight. And theyre like, wow, how do you do that? And Im like, well, its kind of like this.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"I would always keep the graphic design, but I might shelve the engineering for a while because thats hit or miss. If I could have an international business teaching people what I know about relating and relationships, that wouldnt be the worst thing in the world.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right now its just $20 a person for, like, a three hour class. But were starting out.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Be yeah, well, mostly when Im doing it, Im just sitting in my apartment and watching TV. I mean, thats when I do my design, Im sitting back. And thats why I like it so much. I teach engineering, which is more lucrative, but I have to go there.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"K. Fifty k. Probably 40 last year.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Probably only, like, $500, maybe.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}}]