[{"pageContent":"Happy Easter to you, too. Bye bye, now. Bye.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Im hoping its around anywhere between $50 to $100,000 a month to be completed. Thats the goal. Thats what Im aiming for. That would take my family to the next level.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I technically can, but its like, I want to be able to give my 100% to each one.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Because right now, you got to think, I got a client that has the full package, right? So I got to go into Googles algorithm, their Google Ads, mess with that algorithm, make sure thats up to date, then go to the Google Guarantee. Thats another algorithm.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Boom. Then go to the Google my business. Thats another one. Then go to the Facebook ads. Thats another one. Then go to the Instagram ads. Thats another one. Then go over to Microsoft Bing, get on there, mess with that. Then go to the Bing Police for businesses, mess with that. Im literally dancing between and then I got to go to their website and update that. So its like, if really Im just looking for somewhere, a system or platform where I can just plug everything in and itd be there.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I mean, the honest truth the last couple of years? The only way to do that would be to hire more staff and dont want to do that, so no. Thats why when all this AI technology came out, I was like, whoa, maybe Im just in the right place at the right time with my business to where its like, I dont have that heartbreaking, heart wrenching situation where I have to let people go in order to scale my business. I can literally just strive from here and hire probably one or two people to handle accounts. They just be account managers. They can do it themselves. And I really want to create a streamlined business where its like, everything can get done simultaneously without having all these moving parts. Because it was just one I was scouting my competition, and these people, man, they had like six people in this meeting, and one person did the Google Ads, one person did the press, another person did the Facebook, and another person did this. Im like, this is crazy. Overhead on this company must be out.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, thatd be great, man. I really am like, man, Im just looking for that, like you said, that moving, momentum shifting moment where Im just like Im just out here just killing it. I know I have me. I know its coming. I was just at a Chinese restaurant eating ramen, and the owner, he went from a private to a franchise, and he just opened back up. And, you know, we just talking, and, you know, my wife, Im not even thinking of business and anything. Shes like, yeah, he does all the marketing for such and such, and hes like, you do marketing? Lets talk. I got to meet with him next week. And Im just like, yeah, this is my life. For so long, I just been doing really good work for my clients and my tight knit clients because I knew I couldnt be that guy because I didnt have a staff. Now its all just different now, man. Thats not an excuse. It literally is my time to fucking take off.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Im sorry, say what? The webinar.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"I can take on more clients. Its take on more clients at the cost of what? So thats why Im like, all right. With AI going on, I know thats an opportunity for me to be able to take on more clients, but still give that good quality service to where Im not missing calls, Im not missing text, Im not being laid on post, Im not missing holiday posts and things like that. Im on top of everything.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. All right. So the webinar is going to come here too, right?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, but send it to Nathaniel. Nathaniel. All right, let me just real quick.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Millennial Inc. I n c.com yeah. Nathaniel Aniel.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right, sounds good. Basically good. Your tools are made by you. Okay. All right, thats good.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Some people and then do you have a problem with growing too fast? Some people have a problem with growing too fast. I dont want to have that problem with growing too slow or not growing at all. Thats why were on this conversation. Having this conversation. I knew that in 2017, when I started the business, that if I wanted to be like these other guys, like Billy Jean and Ty Lopez, and Ty Lopez is really where I got I started the business from. He gave me the idea and the blueprint, and I went from there. But if I wanted to be like these guys, I would have to have to grow fast and get a whole crew. And that was the only way in 2017 18 and 19, the only way. This is new. This is now. So its like, Im the only person with this leverage is a Catch 22. But Im the only person with this leverage. Im still the new kid on the block, but I have all this experience. I have clients that can vouch for me. Ive done great work for every one of my clients. Even the ones that went under in 2020, theyve been able to bounce back. And theyre calling me back like, hey, I need you again. So its like, I know if I was to run ads and doing all this stuff, I can get to that 100,000 a month. I can get to that 50,000 a month. Its just all right. Once I do that, boom. What are these tools that you guys are talking about thats going to help this thing move? And if you dont have the tools and Im going to find the tools because thats where Im at in my journey, finding the tools, the AI tools to make what I do automatic and make it more of a process.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its just me doing sales.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"In a second.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I hate to get pulled over. Thats basically why I contacted you guys, to try to see whats the deal? Whats going on? What do you guys do? And are these tools, like, did you make these tools? Are these your tools, or are these tools I have to purchase outside of the network? And please forgive me, I did not get the case study. I wasnt able to check that out. So maybe my questions will be answered in the case study. No worries.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"How are you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, I prefer something in the morning, around 11:00 a.m.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, it varies. If the person wants just search engine ads or Google Ads, Microsoft ads, if they just want those type of services, it stands between $1,015 a month. If they want to just do social media, marketing and content creation, thats $2,500 a month. If they want to do the search engine optimization and the social media, plus the content creation, its 3000, 5000 a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right now, it would be tools. Tools and a system.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Nathaniel.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"You, too. Happy Easter.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I dont want to be like that. I have an advantage over my competition right now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Lets do noon.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And right now, with AI and everything thats going on, Im just in a market trying to find the best tools to utilize to help my clients get the best results in the marketplace. So thats really where Im at. Thats what Im looking for now. When I seen the YouTube video, it was like, the top three tools to use. It caught my interest, but Im literally in the middle of doing three other things. I wasnt on the phone just now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im in Eastern Standard Time. Monday is working.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Nathaniel at motivated millennialinc.com.","metadata":{"fillerID":47,"fillerText":"Mhmm","category":"G"}},{"pageContent":"Right now is really word of mouth, because I respect the power. Really? I respect the power. Any sort of ads right now? No.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Anywhere between 14 to 20,014 to 20,000.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Hey, man, Im going.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"She is, man. I was like, well, thats cool. That came out of nowhere. I got you quiet. I was like, okay.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Okay, all right.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Your email. Ill send you something right now.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Message subject as Millennial. Yeah, I got the invitation. Sure.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"All right, absolutely. I think I just got it. Hold on, let me see.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Absolutely. Definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, definitely. Im not going to mess this up.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right now it would be the 3000 a month.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So I run an advertising agency right now.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right. Cool. Thanks so much.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Hear me?","metadata":{"fillerID":33,"fillerText":"Yeah","category":"E"}},{"pageContent":"Absolutely, but I know the power of the Internet, and I dont want to be that guy that be careful what you wish for type situation scenario.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]