[{"pageContent":"Yeah, I was looking at that, too. I was like, man, maybe it wont be a good idea. But its just my legal name, though, you know what Im saying?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Oh, man. A million dollars a month.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, cool.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"In your email? No, I looked it up early this morning and nothing came in as of yet.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Sinclair County, Michigan.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Wow, that must be an actually, I got seven in the house, but I got nine kids all total.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"I would say a little bit under 50.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"You see what Im saying? So to avoid all that, I was just like, you know what, lets just do the coaching. Lets do the coaching. And I think one thing it is, is that what my old lady said, Im too nice, okay? So I need somebody kind of to coach me of price pointing things, you know what Im saying? Because I dont want to charge what lawyers are charging. No lawyers are charging one thousand five hundred dollars to two thousand five hundred dollars just for you to talk to them sometimes, you know what Im saying? And to step in court. Im battling a guy right now. He paid him $20,000 and Im under a power of attorney. So I turn around and get all my information that I needed from the courts. They see me, I come in there, literally jogging pants and a shirt, right? And theyre like, they dont even take me serious. But Im like, okay, once they see my paperwork, theyre going to see a different side of me. So I went in there and the lawyer was like, yeah, Im going to need that 20,000. Thats just for this first court appearance. If it goes beyond that, Im going to need another 20,000. Im just sitting there, listen. Im just like, wow, my guy, hes going to pay me as soon as the foreclosure of the home and stuff like that. But when I turn around and I beat him already, so I beat him at district court, got the $8,000 errage dismissed, and now were into the foreclosure, which is a prerequisite that you got to forfeit first you got to void the contract, then you can go back and ask for damages. Well, since he lost in district, he has no more claim, he has no more standing in circuit court. So now hes getting paid $40,000 to lose. So now me different. I dont want nobody to lose that much money. I dont care if Im adversarial or the plaintiff. Okay. And the reason why is because I feel like thats stealing from people. And if I have the knowledge and power to help people out, I want it according to their living. My area is a very deprived area.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right now, not nowhere at the couple of thousand yet because I got, like, seven kids, so its hard to save.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I think a good point that youre kind of making is most people, when they have to go into court, its like theyve gone into an alien planet. I mean, they have no idea, like you say, what their rights are. Unless theyve got a really good lawyer to let them know all this stuff, they could lose money, they could lose property, they could lose time in their life. So that seems very valid.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I took myself out of the workforce three years ago, so Ive been struggling with making ends meet, but the thing is that its been really low. So I took myself out of workforce to do schooling, to pursue the lawyer thing, and also to keep my business, my credit repair business, going until I switch over to what Im going to do now, because I think itd just be more lucrative, its more trendy. The credit repair space is not trendy no more. It was a couple of years ago, but now its just okay.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, about there.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes, thats very net positive.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"How are you? How are you doing, Rick? Im all right.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes, very busy. So the thing is what my idea of what Im doing right now is a lot of people dont comprehend that lawyers actually are a defective thing when it comes to representing somebody in court. What I mean by that is that lawyers, their first duty is to the courts. Okay? So which people dont understand the terms of the legalese terms of the definitions of these things, and you actually lose rights. You waive your rights to any type of claim of damage or injury that the courts could impose on you. So this is why theres a lot of unlawful incarcerations and stuff. So what Im trying to do is transform that by keeping I was thinking I was like, how can I keep peoples rights together by me being a bar lawyer? I said, Well, Ive been thinking about some outside of things and talking to other colleagues, and what theyre noticing, like, in your area in California, Ohio, and different parts of New York, is that lawyers are becoming more advocates. Now theyre a vice or cocounsel to people who want to go pro se. So its more like of a coach, you know what Im saying? And its literally the terminology of coaching somebody through each stage of litigation or criminal procedure so they can keep their rights and so that their rights can be appealable if any erroneous acts or injury or whatever might come on the record. So what I was thinking is that I might as well just get into the coaching field and really start to advocate certain processes, concepts, and legal theories for the masses. My goal is my selfish goal and alternative motive is to teach at least a million people their constitutional rights and their procedural rights when it comes to doing handling their own affairs.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. So now what happens is this, bud, is that and I got it pulled up right now. Its paragraph A, borrowing money, issuing bonds and debt, natures general powers. Right. Each federal home loan bank. Dont get messed up with the loan bank. Thats just a title. Just like my name is James.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So thats something I was entertaining too, to drag it out. But I was also thinking too, probably take the principal value that you gave me of 3000 and create numerous different type of digital products or even advocacy or coaching products that could be like half hour, hour and have multiple of those that could add up to the value of one of 3000. See what Im saying? So itll give them multiple. So on the back end I can even probably yeah, that sounds really good, man. Actually. All right, now you got my brain working. Okay. All right, go ahead.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I have concepts where I could show people this is what the rich people do. All right, so people think rich people just go out and spend money and dont have a care, right. Thats incorrect. Thats so opposite to what wealthy people think and how they think. Right? So like say for instance, a wealthy person might go into Dollar General instead of shopping at Myers, right? So the reason why is because they know the importance of keeping their money around them. All right? So the biggest thing that Ive seen so far is that with houses and stuff like that, you can actually contest your mortgage. The down payment of your mortgage is actually illegal. I can show you the laws. The down payment of car loans are illegal. Like right now Im about to get my girlfriends stepfather stuff back to get everything. Its called a right of rescission. Right. So what happens is that these people are unlawfully enriching themselves through the ignorance in advertising it, and thats illegal. So any advertisement of a down payment or anything that is not culturally instilled or what I mean, culturally or socially instilled means the political body of the whole people. So say, for instance, that weve been trading in cows and all of a sudden you want to bring gold that is outside of the culture of those people. So United States set a culture through statutes and federal rules and regulations, especially under tiller Regulation Z and Regulation Q. So with those regulations, those set the cultural standing or the culture of how you do business in certain local or state or even out of state business. So what happens is that a lot of people dont know that your security is actually a bill of exchange, all right? So your application, when you apply for a car, youre actually selling them an instrument at security, all right? So theyre borrowed. Okay. So. Twelve USC. 1431 turns around and states that the power of the duties of a bank is to borrow. Okay. Or create mortgages or exchange or sell bonds and securities. Thats only power that banks have anywhere that says anything about a loan is that amazing?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, please.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"But the contents in the context of James, youre only going to get that through speaking with James. Right. So its just a title. Its just a name. All right. So now, Federal Home Loan Bank shall have power subject to the rules and regulations prescribed by the director, who is the director. Right. So I start breaking these down. The director means the Federal Housing Finance Agency. So theyre an agency. So now you start to look at the bank differently. So now when I start throwing out terms such as Negotiable Instruments Bill of Sales bills, your monthly bills, even your monthly bills, I can show you how to remit those bills back because all obligations, debts and bills are to be paid by the United States Corporation. Okay. In essence, you know what Im saying?","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"No, I already got them on my corporation already. I got my girlfriend, and then I got one of my friends.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"All right. Very economically deprived. Okay. Were actually number one in the nation. We have more unemployment rate than the whole fucking country. Excuse my land.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Who is this?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Thats everything I need.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Im thinking about no more than a year. I think if I hit it hard like I did with my credit company and I was just being super cheap, thats what it was. I had a different mindset. Now that Im looking, Im like, wow, so I can do this, I can do that. So Im giving myself a year just to be strict with myself so I can bring somebody else thats way better, like yourself.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, its very important because, man, I get all choked up about it. Its to show my parents that they did good. Its to show my parents that regardless, through trivial times, my bad experiences with them, it came out to be a good product. You see what Im saying?","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Oh, my kids. I get to do things that I wasnt given as a child. You know what Im saying? Its more sentimental to me because my father, he was addicted to drugs, illiterate. My mom, shes dying, and she drunk her whole life away. And my biggest thing is that my kids dont see me do none of that stuff. And to sit there, I wanted to go Disneyland with my parents. I wasnt allowed to afford that, you know what Im saying? And its cool, but thats what I want to do for my kids. I want to make them smile every day. And making that million dollars a month will also help them improve their future wealth. And they will be like, oh, well, dad did this. They see me doing 1012 hours right now and aint making no money, and theyre like, yeah, dad, youre smart as hell, but its not making no money, you know what Im saying? So if I make this money, theyre going to sit there and see, like, you know what? Im going to follow that, man. You know what Im saying?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. No, I laughed at it because I do want to do things for people, but I also too, want to make money. Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. So its really deprived. If you know anything about Detroit, Michigan, its compared to starting to get to that. So you have a lot of majority of 75% of this economy down here is women, approximately two to five kids per household. And most of them have fathers that are struggling with child support. I have a remedy for that and foreclosures down here. So thats one of the biggest prospects down here. So what Im trying to do is figure out what is the average income and see if I can work some type of payment process or payment something for those individuals. Because most of the people only can afford one hundred and fifty dollars to two hundred dollars and theyre literally taking food out their kids mouth.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, man. Ill put all that money into universal whole life insurance and let it compound and live off the insurance money. How I look at currency or any type of legal tender is it buys back my time automatically. By investing in other instruments and other things, it will totally relieve. And I can sit back and hire smarter people than me. CEOs. I can start moving. People went into the corporation that actually a lot of people dont like them. But the Rob Charles, I dont like their mentality, but I like their movement, if it makes sense. It was very smart and intelligent, what they did. They put all their money in assurances. So thats what I want to do, is do that. Thats the first stage. And the second stage is to hire the best people that I can find. Like Donald Trump. Donald Trump hires nothing but the best.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yes, Im getting to the coaching industry. Im becoming an advocate. But also, too, Im pursuing my bar association too.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Not really. I havent did no research on that.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Both. I do want to have a website, but I also want to have an open door policy because when I was doing credit repair, a lot of the times CROs are required by federal law to give their first transaction of work for free. Right. Easy plaintiffs say is like, okay, if I were to give them a consultative, 1 hour consultative or two hour consultative, and doing what were doing now, that is considered exhausting. That federal law and complying by it saying that you will give them a first thing free. So since I got out of that, no longer under that federal regulation. My thing is that I still want to keep that open to bring an incentive to people to come to the website or either bring them on as a client. Now the only thing that I havent worked out yet that I havent looked at really too much as a coach and being a lawyer at the same time is that a conflict of code of ethics. So thats one of the biggest questions that I had over my head now is to say, all right, if I was to say, if Im an advocate, consultant, different language, different categories and industries, how can I do that with ascertaining my bar? And also, will that put me in some type of bind or put them in some type of bind? So what I came up with so far that I did a little bit minimum research on it is that coaching is not really heavily regulated.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, because the only thing Im doing is business cards in a conversation, face to face.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"At will? What does that mean?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right. What is business? But my question was my biggest question for you was what are you seeing structure wise as far as how are corporations or companies or LLCs that youre working with? How are they structuring their coaching products, how theyre positioning them?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, the past three years, Ive been running into a lot of problems and issues in my life, too, as well, but its been a slow but beautiful, great learning process. Thats one of the biggest things that Ive learned is to keep trucking, man.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"No, you good, bud.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yes, actually, my girlfriend was telling me that. She said you should name it lincolns Lawyer Firm or Lincolns Law. My bad. Lincolns Law firm.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I actually have my corporation built with financial backers that credit scores are between 719 right now and 730. So I got people who are actually going to be more than willing if I need to secure some type of marketing or some type of commercial loan.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Im ready to go. Only thing I got to do is I got to do a name change, and I got to do some stuff with my articles of incorporation before I start landing. Only thing I was really interested in was learn about what your guystools are and what youre doing and how you guys are moving. Like I said, Ive seen you guys a couple of years ago, and you guys exponentially blew up, man, you guys are everywhere. So if this local city is picking up on your guysalgorithm, it says a lot to me because were kind of the last city to get a lot of stuff in Midwest area, so thats one of the biggest things. So I do want to go forward with you guys. Like I said, I just got to do a loan real quick, what they call loan, but its really me selling security, so I just got to go sell a couple of securities, get that going so I can have something back to marketing power of. This.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"It blew your mind.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"A lot of things theyre doing is illegal, though.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"That sounds perfect.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, we could.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I got 21, 221 year old daughters and all the way down to a one year old daughter.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}}]