[{"pageContent":"No, Im right at my desk. Like, I work from home.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Usually, you know, its like just your very presence of believing something where everybody else is just whatever is offensive to a lot of people, but you dont have to say anything and theyll bring it up, well, how could you not do this? Or whatever. Thats the way it is. People are offended because it calls them out. Right. Just for the mere again, Im like, 0%, perfect, but having the audacity to say, but even so, Im still going to try my best to make him the one ideal of my life that calls people out. Because the vast majority, even Christians and Catholics going to church arent that way.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Because ideally what Im looking at doing is Im going to bring in my program is 90 days, and Ill just do cohorts. So my goal is, okay, do sales calls and whatever, and bring in people every week or two within a new cohort. So theyre starting from the beginning. So at any given point, I could have it really doesnt matter, but like, cap my cohorts at ten or something. So if I were to do that every other week, its like 60 people in the program at once, which right there is like 600 grand and 60 people is not. But Im still a newbie in that. Ive been in the masculinity world for quite a long time, but I havent been external. I havent been out and about online with it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, cool. Let me pull up my computer.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"And they dont realize that Jesus Christ was a man. Right. Like, he was bold, he was courageous, he was a leader, he was self sacrificing, and he was masculine. Right. But for whatever reason, theres a message around him just being like this soft, timid, pushover kind of guy, but that just couldnt be further from the truth. And so Im 100% in alignment there and theres a lot of people that dont recognize that and dont internalize that. And the reality is your concept of Christ determines your character as a Christian. And I dont blame them. Its just what is taught and what they were taught and they just havent really looked into it for themselves in most cases. What are you saying?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I realize since Ive been for so long in this kind of, like, building out research and all that, my program is going to develop quite a bit once I get it out the door. And I kind of also just open up and start sharing. Right. Im a little bit stuck in my head once I get these types of conversations. Gets me out of my head, into my heart, and thats going to help me to develop my program even more and more quickly.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right, sounds good, man. God bless you. Thanks for the call, brother.","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}},{"pageContent":"In a way that I feel is replicable. Not just like, oh, I made some money, but actually and also I got into a ton of debt. I got scammed a number of years ago, which is a good life lesson out of, like, 40 grand on one of those marketers. And now I love watching him do his Facebook ads and Instagram ads because I think his life is imploding because you sell shit and okay, you got a bunch of people, you hoodwinked them, but its not like hes, like, pitching a bunch of different products and theyre all dropped.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Yeah, just give me a second. Look at the calendars. Yeah. And the faster I can drop my job, the better.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Good, maam.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, Im in Maine. I lived in Boston for a decade, but moved up to Maine during COVID because I went remote on my job and this is where I grew up.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Ive been working on this for five, six years, and I had a product out, a coaching program out, like, five years ago, and I didnt like it. And I scratched it and started over and did a ton of research, took a ton of courses and have been stuck in the analysis paralysis for quite a long time. And I also honestly dont like the majority of the stuff out there on how to build out strategically, how to build out your product. Until I found this one. Im using the Fletcher method. I dont know if you heard of them, but its a strategic method for, one, designing a program, and two, building it out so it can scale. Im a bit of the philosopher introvert. I dont like getting overwhelmed with, like Im not like your type a guy whos going to be like, go, go, grant cardone. I like to build out something that I know is solid, which obviously has been to the detriment of me getting it out there. But the value is that Im right on the edge of getting it out and now I know, okay, this product I can stand behind, and its got all the infrastructure to scale, which if I had just gone out, I wouldnt have had a scalable product. Im in a bunch of different coaching programs and a lot of coaches will just go out and they just start coaching people, right? And they dont have any particular roadmap or anything. Like a buddy of mine, he went out right out gates making like one hundred k or whatever a year. But you kind of get capped there because you dont have any infrastructure or scalability.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, whats that? Yeah, I was sure if you asked me a question or not, but I was like, okay, good, go ahead.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Got it. And so forth. Yeah. I want to start off okay, Im starting off let me scale to this level. So it would be this initial thing again. If it works great, then I have no problem reinvesting and expanding.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Yeah, so I just paid off like, ten grand on credit cards. Clear those so the credit card score will go up, but its been low because of this. Ive been in a debt consolidation program for four years. Its been low for that, and thats not quite done. Its right around almost like Im finishing up resolving it with a couple of companies.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Think I know what Ted whatever. Yeah, I found out, like, a bunch of people got scammed by him. I took his program, and then I was like, you know what? This is really just Russell Brunson, but I could have bought the book for $20 instead of he ended up charging me for which is like, $40,000. But anyway, whatever. Those are the life lessons, right?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, absolutely, and I watch it two X, so as long as its like sometimes I have to slow it down if theres a crazy amount of content, like I need to slow this down. But I usually do two X.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Thats me.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Awesome. Yeah, I appreciate that. And Im going to look up that book or youre talking about Im always looking for awesome books.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, awesome.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"No, Im up at 430, so Im not worried about being there for eight. And I literally my business is like, I work on my business from like six to nine and then I start my day job. So Im literally sitting at my desk, as long as you guys send me the calendar link or whatever, and Ill put a reminder and all that, for sure. Beautiful.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, Im in the middle of launching out a product in a short while. Yeah.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, to a degree. The way I envision this was, all right, Im not looking to get right in right away. I want to go in, finish what Im already working on, get that, get clients in the door, and then look, okay, lets talk about optimization and scaling and systems. Is that where similar to what you guys are?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. So what is it like you send me a video or is that something thats part of the package?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Im not like a Dean Gratios. Hes already got all this experience or whatever hes been doing. His craft Ive been doing in the back end. But I will need some time for the development of, like, you have to practice a skill. Right? Its like 10,000 hours. Ive got 8000 hours in the back end. But I need that time of sharing and honing my craft as I go public. I dont want to scale to the moon. I do need to continue to hone my craft, and I will do that as I get out. So I want to scale in stages. Right. But I definitely think I can scale pretty quickly to certain levels. Okay, Im going to stop here for a bit, and Im going to make sure Im really solidifying it and then Im going to go to the next level sort of thing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So anyway, Im right on the edge. Im using this system called the Fletcher Method, which is like, go really deep on your product, make sure its broken into nine steps. You know, the actions youre taking them through each one. And I paid for a lot of products on how to build a product, and they mostly all suck because they teach you how to market, but they dont teach you how to build a quality product. And like Alex Hormozi says, the secret is build something, build a high quality product, and then the marketing will be easy after that. Correct. And thats where Im right now. Im like, okay, Im getting that all done. And with this company, with the Fletcher method, Im getting all the sales script on and the nurture sequence and all that shit. And it all makes sense strategically versus just a bunch of shit thrown at a wall, which I think a lot of the marketers have you do like, just throw together something and then do this or that way. I saw what you guys are doing. I was like, okay, Im not ready yet to go to the next stage, but I want to see whats out there and choose what will be the tools that I look at for scaling. Once Im ready to scale what Im probably going to do. Im going to take the first couple of months and get some people through my program, get feedback, et cetera, tweak it, and then look to scale double, triple my price, et cetera.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, totally.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Like 112.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay, cool. And its 08:00 a.m. Eastern.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Out of the gate? Yeah, out of the gate. Im going to start with three k, which is a massive price down. Ultimately, Im going to be shooting for ten k. So its like scalability. Its like, I need 100 people and Im at a million. And its a group coaching program, and Im using a software that allows me to automate a lot of the stuff. Like, itll be a course in there, and then as theyre taking the course, theres a habit tracker and theres all this stuff to help them stay accountable to each other. And Ill just have to pop in like once, twice a week for calls. And so thats why Ive spent a lot of time in the back end, because I know Ill have to do a lot less work, like moving forward versus kind of like getting one on ones. Yeah, you could charge them 50 grand, but then you have to show up one on one for all these people and you kind of cant scale that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Can you just give me I know this is not normal because Ive been through a million of these calls. Can you give me a general ballpark? Whats the investment? And its not scary to me. Its just I like to know what Im facing.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, I mean, absolutely. And starting with me, plenty of work to do. But thats the thing. Its like what used to be, oh, follow Jesus Christ was like this image of an effeminate Jesus. And now as Im reading through scripture daily, and Im like, man, like you said, the more you read it, youre like this, like and you put yourself in the position of, like, what was going on? This is one ballsiest shit. 100%. He was pissing off everybody. And he didnt care because he was speaking the truth, but he was doing it with love. And thats, I think, also the other piece is like speaking the truth with love. You cant just go around like, oh, heres the truth and I dont care, but its done with that fathers love that I do care. And then because I care, I want you to know this and Im not going around and correcting everybody all the time.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Me, it used to be really two things. And what I had to learn was when youre the nice guy, you think that youre doing the right thing, you think youre a good person and stuff like that, but actually youre a fucking liar. Youre lying to yourself. Youre lying to. Everybody else just to think that youre thinking that youre doing a good thing, but youre not. Youre living a lie. Youre living a facade and not really saying what you actually think and not really doing what you actually want to do and not being who you really want to be. And then really, the second thing that I learned and I talk about all the time nowadays is it is better to offend the world than to offend God. And I say that all the time. A lot of people will bend to not either offend somebody in person or not offend somebody online or whatever the case may be. But its much better to do that if it means honoring your principles and what God has laid out for you as a man, as an individual. I 100% agree with that.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"And crushing it. And then I can just I dont really care. I mean, at this point, its like you taught me a lesson. Thank you.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Here, but in a good way, for.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Im not really sure what it is that you guys do. I did see I literally just saw the thing and I was like, oh wait, I know these guys. Like Dean Gratioc. I know everybody was on that list. Right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"He was very courageous, and he truly did not prioritize at all what the world thought. He only prioritized what God the Father wanted for him and what the purpose that God the Father actually laid out for him. And I think more men ought to or at least more Christian men ought to recognize that and model that in their character.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, the training video thats going to.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I could do Tuesday 08:00 A.m., thats a meeting packed day for me.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Just to replace the income, really?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. So on the one hand its like, I know Ive made some wrong choices and just choosing jumping around, but sometimes you have to make mistakes and learn. So if its like, I dont really want to replace what Im currently doing. I want to complete it out and get it built that way. Which again, I can get this going in the next three weeks. But on the other hand, I totally down for that call because I see the value and Im already looking forward to like, okay, well, once Im out the door, I really want to be looking at systems. SOPs getting it built for scalability and I dont know where Id like to know more about what it is. My goal is I dont want this humongous machine of people and a whole company of employees that I would have to hire to run a system. I want to be clean and efficient as much as possible and I dont know if thats where you guys are or if youre like you know what I mean? My goal is to run an efficient company that doesnt have to have tons of people because I also want to do other things. Im going to be homesteading thatll be part of my business. My grandparents owned like a 600 acre farm and my goal is to buy it and then homestead on it and do videos of that. So I have a balance between my coaching also just like having fun, which for me that sort of stuff is fun, right? And like recording and sharing and be like, oh, this is how Im getting more and more self sufficient and whatever. Anyway, so the point being like, I dont want to be working 18 hours days. I think you can make tons of money, right. When you run a system like clean, you can run it well and spend less hours versus 16 hours days all the time. Thats my opinion for sure.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah. His name is Ted McGrath.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And weve kind of taught away from the emotional connection that its like, oh, dont be emotional. Make decisions. Thats what it means to a man. No, you cant shut down the emotions. Emotions are good. They should be a guide. But if you find out that somebody got raped, some kid got raped, and you dont feel anger, then theres something broken in your system because its normal to feel anger and want to do something, to write it. Right. Like, we dont need men who are disengaged from the world. We need men who are engaged but are able to take those feelings and direct them towards action, towards actually doing something.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Give me a second. Let me look at my work.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I didnt get a chance to check. I was out last night and I was taking a nap to recover.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes. Well, Ill tell you where Im at. I really want to get through what Im doing right now to get it out and I dont want to really interrupt that because I have been a bit of a ambulance chaser or whatever. Whats the shiny object?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I have. Ive read it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Anyway.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yeah. So Im going through this. I paid like six, seven grand on this for coaching to get me to that part. So Im using the Fletcher method. Im in milestone two of four or five milestones to get launched. Theyre going to help me get launched and then optimize the marketing, all that stuff. So thats my first goal is to get the system going and get optimized. Im currently at finishing up the product roadmap and building out my lead gen funnel, which is pretty simple, but the way that their system is, its like youre looping around quite a bit on the roadmap to get that tight and your avatar tight, because then when you go out, the messaging becomes a lot easier. Id say Im like three weeks out from being able to really start marketing, and then from there, Ill optimize. What is it? So I didnt get your email and I looked and spammed.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So, yeah, Im super happy with what Im doing with it now. And if I had gotten it years ago, I would have been able to crush it years ago. But I forgot what the question was. Sorry.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Ive got a nine to five while Ive been building this out. Like I said, I had a coaching program years ago. I ran it a couple of times. Im the sort of guy that even though it worked and people got a ton of value from it, I have to be behind it for me to sell it. But once Im behind something, like, this is an awesome product, I can sell it to the moon because I just believe in it and it shows. I obviously got stuck in the analysis paralysis, but also I was looking for something that would actually help me build out my product, and it took me a really long time to find a company that could actually show me how to do that rather than just teach me how to market it. Which I was like, thats not my problem. My problem is I need help learning how to. Which seems stupid, but its like, its a skill set, and if you dont have it, you dont have it and you have to go find out how to do it. I literally bought like five different programs on how to build a program, and they all suck. Theyre all, like, jumping over the one thing I needed it to teach me.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay. Yeah, sounds good.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, its a long story. Its kind of a 20 something year story. I joined a Catholic seminary when I was 18. I was going to join the Marine Corps with my brother, but kind of got conned into this other thing on this trajectory to become a monk priest. And I never really wanted it to be it, but what I wanted was, how can I be a good man? How can I be philosophically, like the ideal? What does it mean to be a great man? Like Aristotle, Plato, Socrates, like, sort of someone who is going to be worthy of emulation and that stands the test of time, do something big with my life, something meaningful. And so I was on a search for, like, what does that mean? And how do I do that? And I ended up getting conned into it, but it saved me from getting murdered in war. So I cant fault it in that way. But I was in there for eleven years. I traveled the world, had some good experiences as well. It was a horrible experience and destroyed me spiritually and psychologically. And I had to start over when I left from scratch with nothing and really broken, depressed, suicidal, and completely lost because what they had done, talking with my brother about it, because my brother spent eleven years in the Marine Corps and went to war a lot. The difference is that with them, they destroyed my identity, who I was, and at the very core of who are you, who are you in the world and who are you with relation to God and who is God in relation to you? So I had to rebuild that from scratch and was a lot less trustworthy than I had been previously. And I had seen like, oh, all these people that are pitching things like, this is how you become a good man. I was like, Ive already been there, Ive gone to that. And that has led me to death. And it doesnt mean that what youre preaching is wrong. It means that the implementation doesnt work and youre dishonest because youre not admitting that its a lot harder than it looks, or that just knowing the stuff isnt the same thing as living anyway. So when I got out, I started looking for solutions. This was like eight years ago, and I didnt find it in my Christian Catholic world of how to become a man. It was kind of all circular stuff of like, oh, pray harder, whatever. And I was like, thats meaningless to me. I need to fucking get my life in order. So I ended up finding solutions elsewhere in the secular world. A lot of mens coaching stuff. A guy named Andrew Farabee was my first. He had a podcast called Knowledge for Men. This was like seven years ago, and I ended up hiring one of his coaches. And that got me on that journey. And then Ive just been hiring coaches ever since, upgrading, learning more and seeking for answers. And it kind of brought me back to my faith, but in a new way and with new tools. Realizing like, okay, we were afraid to talk about the shit that were all embarrassed about as men. The things that we struggle with and whatever. And what I feel I can bring to my niche is being as authentic as I can be, talking about things that they dont talk about. And yeah, I dont have my shit together, I dont have it all together. Im not perfect. I struggle like any other guy, and thats totally fucking normal. Whats important is to continue to grow and never say, oh, this is okay where Im at, but always to be pushing those boundaries and also accept that the way forward is first to accept and recognize where youre at. So Ive been building out a program thats like, okay, if I were to rewrite and rebuild something because I paid for Im in an entrepreneurs group. And this morning we had a call. I was like, how much have I spent on coaching so far? Its like over 100 grand. Some people cant understand that, but its like, if you dont upgrade your systems in yourself first, you cant help other people. And even if you do get to a level of success, youre not going to be able to hold on to it. So I was asking myself, okay, if I were to write a program for myself, like eight years ago, what would I do? How would I create it in a way that would get me to where I wanted to go as fast as possible and as secure as possible? In the sense that, how can I guarantee the results as best as possible? You cant ever guarantee results with anybody thats trying to grow. But if I could stack as many things to create those wins and thats what Ive been working on, and Im super pumped to launch pretty soon. So, like, pulling stuff from all these books and courses and whatever theyre taking and like high level people that are like Carl Newport et cetera, and Cal Newport and saying, okay, well, its nice to read a book, but whats really hard is to implement shit. And what if I create a system that helps them to implement and it was based on what is essential? If I had to start over, where would I start over? What upgrade in mindset, upgrade in body, upgrade in spirit? And what habits are the most important habits to start with? And thats what Im building out. But its based on this idea that Im still a Christian and I firmly believe in it. But if you dont do the work as a man, then the spiritual doesnt do shit for you. Its like pouring water into colander. Its just going to run right out. And especially, I dont know about the Christian world, I think its similar, but in the Catholic world, you honestly just get a bunch of guys that I have no affinity for. Like, I want to hang out with you because its like this bunch of effeminate men talking about loving God, but whose lives are a fucking disaster. And theyre asking like, how can I go out and help other people? Like, Dude, help yourself first, get your control, and then youll have something credible to share with the world. But if youre like, hey, be a Christian. And youre like, Man, I dont want to be like you, dude. Youre broke, youre fat. Your job sucks. Youve got no future. Go fix your shit. And thats not to be an asshole, but thats the reality. You have to work on the human element. And as you build that out, then the spiritual can also go a lot further. But if you dont do that, then its just right. Yeah. Its nowhere. And then a lot of it had to do with also, I was in the middle of that childs sex scandal shit. In the middle in the sense that I witnessed it and up and close. And I really struggled with, like, how the fuck could this happen? How could grown ass men find out that kids were being raped and it was their responsibility to do something about it, and then they just blind looked away? How could you get to that place and then still call yourself a moral spiritual leader? And so a lot of my journey has been to try to figure that out. And it has a lot to do with again, it goes back to being a man and what does it mean to be a man, but a father ultimately is the apex of that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. So what is it like a modular sort of like, oh, I need this, that and the other, or I dont need that.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"What is it that you guys would do? What is it that is the offering or whatever?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Yes. Anyway, I was looking at my calendar, so Monday at 08:00 A.m., I could make that work. Yeah. Eastern.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, so he pitched me a program. Id gone to program with him at the time, he was in La. And it was like, Im going to do this. Its 40 grand, whoever signs up. But Im going to help you get your business out the door and scale and all this shit, right? But you got to make a decision right now. And once youre gone, its gone. The offer is gone. And he had a guy there that was working with him, which was like a financial whatever there that helped you get the funding. And the guy was like, oh, yeah, I can get you this funding. I was like, well, look, bro, I dont have this money. Their whole thing was like, well, we can get you business credit to pay for it. And itll be like, 0% for a year, so youll have time to pay it off, get your business going. Well, what they did is and I told them Adamantly, I cant afford this if you guys fuck it up. But they had me max out all my cards to pay for as much of the program as I could. And then they were supposed to transfer that debt over to business debt. But then when I left and I went home and I called up the company, they were like, oh, well, we cant transfer that debt because your cards are maxed. You have to pay that off or pay it down, and then we can transfer it. I was like, so you just fucked me over. And at that time, I didnt realize that it was predatory. I didnt know that it was like, I could have just called up the credit card companies and told them to reverse charges. I paid for that. Im still finishing off paying on that, right? Like, five years later. It is what it is, though. Lesson learned. But yeah, that guy was, in my opinion, a dickhead.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"And whereas with me, I was like, Im going to hold back, Im going to go deep, and then Im going to make sure Ive got the scalability, the product that I can scale to the moon. So two different ways of doing it. Sure, I know the way Im building it. Its scalable to multiple millions versus his. Hell have to go back and kind of reproduce it before he can actually kind of go on that he got the initial. But to actually go up, you got to productize it, in my opinion.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, if you look at Jesus Christ himself, jesus Christ was highly offensive. He was extremely offensive, if anything. I mean, he was literally going to religious leaders and just calling them out to their face. He was very offensive at the time, but not in an asshole way. He was just stating exactly what he was, who he was, and what he believed in a very assertive and grounded way. And not everybody, I guess, receives that. But for me, when I go ahead and read Scripture, that just stands out to me just time and time again where Im like, damn, Jesus was bold.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Ive heard of him. I havent followed him or anything, but is he on Instagram?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Awesome. And youre going to send me the link for just because I havent seen anything in my email yet, right? Yes, I got your text, but I just want to make sure Im getting them in just in case.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Yeah, Im just trying to see what it was.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Ted. Fuck. What is his name? Ted. I see him all the time. I literally watch him for enjoyment, mix something, I think. Ted. Ted McCall. No. I cant believe Im blanking now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Its kind of like I can see how a guy sees the world, and if hes like the nice guy, hes going to interpret everything biblically in that perspective. The nice guy I have to be a nice guy above all things, replaces the Bible as their go to interpretation of reality and how to face it. And that becomes a huge problem because then youre no longer asking like, what is God telling me to do? Youre asking, what is the nice thing for me to do? And so then youre looking all around the world and saying, what do you expect of me? What does the world want me to be? To be considered a nice guy rather than, what does God demand of me and invite me to? It doesnt matter if everybody else is wrong. This is what God is asking me to be, even if the whole world is going the opposite direction. And thats why I think its like the Parting Waters for what Ive seen is because, yeah, its not about like I kind of skipped over the last part of that book, the hooking up and part, but theres lessons to be gleaned. But the first part is that so many guys dont have their own compass, and so theyre always looking to like, what do you need me to be? What do you need me to be? And so youre never standing strong on what it is that, okay, this is what I believe. Im going to put my fucking foot down. Im going to drive the stake in the ground and say, I dont care if you like it or not, and I dont have to be a dick about it, but these are my morals and you guys can go however you want, but this is what I believe. And the only way you get there is if youre willing to destroy that ego, which is the nice guy, which is, I need to be accepted and loved above all else, which is I come before what God wants of me, which is thats ultimately what thats about, right? My acceptance into the group, whatever is more important than what God expects of me, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Perfect.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"So it is low. Its like 600, which is another reason why for me, potentially, it could be I dont know what the price of the program is, but it could be like, me getting a couple of clients in and then going in and hiring. I want to get cash in so I know, like, okay, Ive already got a viable product that Im making money on, and then I can turn it around and turn that into strategic development.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, so I would look at I currently signed up for two different coaching programs, like, separate from three, so I paid one off, which is the program Im in to finish me building out the product. I hired a coach for Bodybuilding for the next three months, and Im doing a Breathworks certification. So those two are like eight grand. One of them Im paying off 500 a month, the other one Ill pay at the end of the three months period, so I dont have tons of extra in between because Im doing those sorts of upgrades. And so I live a pretty frugal lifestyle in the meanwhile. Right. That being said, Ive got two credit cards that I just cleared, so theres like around ten grand in potential liquidity or like, being able to but my goal is not to go back to that because Ive done that in the past again. I think ideally, I really just want to rush the door to the launch, start getting some money, and then I can take that money and turn around and reinvest it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"That was one of the challenges too. I was like, finding out, well, how do I want to show up as a coach and marketing and all that, and like, well, now I know I dont want to be that way.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, hows it going?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, because my systems currently are go high level, which Im using as my CRM and funnel builder and Im using upcoach as my coaching platform.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]