[{"pageContent":"So I am an audio engineer. I work in the music industry. Ive been working in the music industry for about 13 years now to work with really great artists. Ive been nominated and won a Grammy. Very nice. Thank you. And now I was signed to a management company, but I left them because I wasnt getting the type of workflow that I was hoping to get.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"YouRe doing from everything? Yeah, I believe it was right around 60.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im using my phone.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"I got it. Yeah, Ive had a huge appreciation for music. Never really gotten into it as far as playing an instrument or doing any of this kind of stuff. But Im fascinated on how when I see these guys sitting at that huge board, they can just kind of a few levers, and they cut out they cut out any kind of wind instruments, or they drop the vocals down. Youre hearing nothing but the harmony. And yeah, its just amazing how all the stuff that goes to making a song has definitely changed just a huge amount in the last 15 or 20 years, I guess, with the instruments and stuff theyre coming out with as well as far as the boards and stuff are concerned. And you can kind of denote exactly what little things you want to make changes to. Thats actually pretty cool, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, so Friday I have a session at 04:00 p.m.. And its an hour long meeting.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Where that I would be able to.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Freedom.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"You too.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Are you an only child? Is helping your mom something thats paramount to you?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, sounds great.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I remember hearing that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right. Okay, so friday is tomorrow, right? Is today Wednesday or Thursday?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"And then since then, its been a little of a struggle to pay it all down. But like I said before COVID I was at, like, 721.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, that sounds great.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So I wanted to kind of update it a little bit in the way that I do it and make it a little personal for me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"The actual service of it I have clients that Ive built up over the years, and then I also am on a platform that Ive been getting work through specifically for engineers. So pretty much thats the bulk of my revenue at the moment.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I have not heard of him.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Hi. Who is this?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. And whats it called? And then I also do like consulting. So if people dont have the funds or the budget to hire me as a mixing engineer, I also help with consulting. Ill listen to their songs and listen to their marketing strategy, how they plan to go about a release, how they plan to develop their career as an artist or producer and kind of give them a little bit of insider knowledge on potential ways to expedite the process for them to be full time rather than just making beats and making songs in their bedroom all day while having a nine to five and not being able to figure out the metrics they may need to monetize it and become successful.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"She was very happy. Very happy, I think because this industry is full of struggle. Its not like when youre an accountant, you go to school, you get your CPA, you start working for a firm, and right off the bat, youre making livable wage, livable salary, music industry. Youre doing everything and anything and everything, moving across the country several times, trying to figure out where youre going to plant your feet and where the opportunity lies. And nonetheless, especially having a music degree, and I do have a business degree. I got a masters in business from the University of Florida. So I do have a little bit of a business background. I just was always so focused on making it in the music industry that I didnt really care. I got the degree just to get the degree, and now Im seeing myself apply it in many aspects of my own business and with certain situations like that. But for me, its just like, I want to have a spacious house. I want to be able to take care of my mom. I want to live a lifestyle of thats not going out and buying Gucci sweats. I dont have that type of taste. Even if I had a million dollars, Im not going to go out buying Balenciaga sneakers, because I can. Maybe I will, I dont know. But it wouldnt be like I just dont have that urge to further the whole world, to see me wearing thousands of dollars worth of clothing. But I do want to live comfortably. I would love to be able to hire a trainer to motivate me to go to the gym every single day. I would love to have food, maybe pre made meals by a personal chef. Thats what I see as like, my life.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"I am neither.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"If I had a package that represented a $3,000 value and that would be a monthly thing for one month, $3,000. You get this, this and that, this many consultations, you get this access to this community and whatever. And I can have people that I already know just kind of tap into that community without me charging them, but to create some type of whats the word? Like a schoolyard where people can communicate. Okay.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"All right, man. Well, Angela, its been great talking to you, buddy.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, its interesting, but its just fascinating. Its crazy.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right. Because I think another thing with the industry is like, knowing people and getting to know people. So I just met with someone a few days ago. It was more of a lunch than a consultation, but it was, for all intents and purposes, an unofficial consultation and was going over basically the way that you can grow your career within industry. And granted, hes in North Carolina trying to do Latin music. And I told him thats really tough because how do you go out to a club and meet Latin artists when probably the Latin demographic in North Carolina is not all there?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Like, where they can sign up and book me?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Exactly right.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Revenue wise is the mixing and mastering.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So, for mixing and mastering, if its with a label, the fee is, like, $1,500 for per song. And then if its for an independent artist, its more like 750, because budgets, they just dont have it. Got it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, for the mixing and mastering, its the thing that is actually above industry standard. Okay. And it kind of coincides with the amount of credits you have for something like that. So, like I said, a lot of people are charging like $200, $300 for a minute.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So its like a really high, but its not on the scale of, like, I dont know how many people visit my Instagram. I dont know how many people have thought about it. That was something that I want to do with my website, is create a funnel yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And now Im at below six.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"No, I havent yet.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, exactly. Thats why I told him and then I introduced him to two artists that he could potentially work with, one of them in Canada, one of them here in Miami, and just to build his network a little bit and see what comes from that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"She is in West Palm, so its an hour drive north, not far.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, I would be able to do probably something like 15 to two because theres a couple of things around the studio that I just been wanting to sell anyway. Got it. Okay. And that would be like, going towards that.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"One little mistake here.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Email? Let me check.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So now Im back to being solo, and Im looking to expand my horizons in terms of collecting clients. Thats something that I do remotely, entirely. I just mix and master a song for someone in Turkey.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So, yeah, they did a lot with what they had.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"One I would love to develop assets, have ownership of the things that I am a part of in terms of my life, like a house, car. Right now, I rent and lease. I would love to be able to travel, love to be able to help my mom, love to be able to just have a carefree life without considering things like, can I afford it? Really? Just have this influx of income to do whatever I want.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, honestly, for me, I feel like to have because when I saw I found you guys through Instagram, it was like an Instagram meme thing that you guys did. Right. And just having at least the way that I interpreted it was that its an AI system. That. And the way my mind thinks about AI is that I just see the matrix, like all the ones and zeros. And then it goes and finds people for me, communicates to them for me, gets the emails for me, gets the contact info for me. And I feel confident in that. When people work with me, they come back. Thats something that Ive always known. Its just how do I get the people in the first place?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats what Ive been doing. Mainly I just want to grow to get a consistent workflow and flexible work coming in. I also have an ebook that I havent published yet, but once its done and ready to go, I would like to also incorporate that into my suite of services and products. I also do consulting. I also do things like that as well.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"They didnt say what year that was that Pet Sounds came out. I dont remember.","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Thats exactly like my goal with getting a manager or signing to a label last year was that I want to be able to do what I do and not spend so much time or mental effort thinking about. Okay. I got to follow up with this email to make sure that theyre going to come through. And I got to follow up with this person, and I got to get paid from this person, and I got to do this, and I got to do that, because then Im spending more time focused on those administrative and more business side things rather than actually just doing the business. Its like when youre a creative in this industry, its a music business, keyword business.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, well, how long have you been kind of doing this part of it? And as far as doing the consulting part, of this. How long has that been in the mix?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"All right, cool. Okay, awesome. Thank you so much. I really appreciate the call.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"There you go. Okay, exactly right.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah. And you kind of think back then, also, back in the what did the recording studios look like? What kind of mechanics? I mean, very few things were digital. Right. I mean, if anything, nothing was digital. Yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And have you seen your revenue kind of grow, or has it been pretty much kind of a steady growth, or has it been a rapid growth? Hows that gone?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, of course. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I can see how that would definitely change a relationship that he has with her as opposed to what you have with her.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"COVID messed a lot of people up. COVID was a situation where obviously I wasnt going into the studio every day, so I ran up my credit cards because I had to buy food.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Its like, come on.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Where would you say that goal is annually? I would love it to grow to something six figure and plus and have the real goal of having something like an ebook become such something thats working in the background while Im doing other things. Okay. And the consulting same thing. If I can set aside like a day or two or whatever to meet with all my clients and all my consultations, I would love to have something like that build up that network, build up that client pool and have that consistency to grow from. And even if theres a community based aspect to it, I can create some type of community board where all my clients get to communicate with each other and develop relationships that they may not have otherwise had.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Of course.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I would imagine because I think the interesting thing is because Im not 100 of people yet, the few people that do contact me are to book me immediately.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And Im already charging three times more that and then for a label, Im charging seven times more that. So its kind of like when you get to a point where youre mixing for Justin Bieber, even that guy, hes charging somewhere between two and four, two and 4000. So that would meet your benchmark of three. But mind you, thats the guy who does it for Justin Bieber. Dua lipa, bad bunny thats got it literally the top of the ceiling, so to speak.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And Im working on a website. I dont have it published yet.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im Eastern.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right, bye.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Miami.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yeah. Its mainly through my Instagram, where I market my services.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Kind of yeah, exactly.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I would say it goes both ways. I think you can most certainly learn how to eventually I think you can learn the basics. Like, this is what this does. This is what this software does. This is how you would achieve this. But then its at the same time, knowing when to do those things, because you can know that a cake takes baking soda, baking powder, sugar, eggs, but how many eggs and maybe the egg to baking soda ratio isnt good. So how do you fix that?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. So in terms of the professional services, its like mixing and mastering or audio editing, which is its something that not a lot of people understand within the music industry, but when someone makes a song and someone finishes it finalizes, the writing, the recording and all that stuff, they have to get it mixed. So mixing is the process of taking all the stems, all the instruments, all the vocals, and adding effects, adding certain things to make them all mesh well together. And then once you get it mixed where all the stems are working together, you get it mastered so that all the songs within the project can all sound cohesive. Okay, so thats what I do. Thats my specialization. I also specialize in vocal editing, things like that. Like when a singer does a song and they record layers and layers and harmonies and backgrounds and all that, I edit, make them sound clean, very tight, fix any tuning, pitch wise, any rhythmic issues and things like that. And overall, make it sound polished. But like I said, I mentioned Im doing an ebook which goes over mixing in the modern world because a lot of ebooks, or rather a lot of books within mixing and engineering is based off of practices from maybe 1020 years ago.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Nine. Thats cool.","metadata":{"fillerID":19,"fillerText":"Yah umm","category":"C"}},{"pageContent":"Okay, youre welcome.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Oh, you guys are quick. Hi.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Thats something that I wouldnt out of all the parts of Florida, I wouldnt do Orlando. I lived in Gainesville for four years, four and a half years when I was in college.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. Melbourne beach.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. 09:00 p.m might be better.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thank you. And we said Friday at nine, correct?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Let me think. Specifically Friday or Saturday?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Is it too sweet? How do you counteract the sweetness without ruining the cake?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, sir.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay, lets do that. 07:00 P.m friday.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Yeah, its under six. Before COVID it was above seven.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"If not, I dont I dont care how. How did she feel when you won that Grammy?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I would go to Orlando, obviously to go to the parks and stuff, but I didnt like my time in Gainesville so much in terms of atmosphere. I have friends of mine who, after college went back and moved there, and they love Gainesville. They love how such a small town and all that. Im like, no, I cannot. I like Miami right now. Im looking out on my balcony, I see city. I like that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"One to the other channel.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, of course.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Saturday, I am going up to my moms for Mothers Day. I want to spend the weekend with her.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"And if I didnt have to worry about either or, it would be easier. But obviously I would rather much focus on the music than the business than opposite.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, yeah?","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Exactly. Yeah, exactly. All right. Thats my life of luxury is like, freedom to do whatever I want, not spending time on things I dont want to do. Got it.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Okay. Yeah. It kind of seems like realistically, when you use the word consulting, almost everything you do is consulting. Either youre talking to them about what you can do for them and then you do it, or you consult with them and tell them how they can kind of do things. So, yeah, consulting really kind of wraps up the entire thing. And as far as last year is concerned, do you have an idea what that revenue number is that you were able to bring in on everything that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Got you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}}]