[{"pageContent":"I get it. I will be totally honest with you. Im the kind of person who likes just to analyze first and watch some materials and then decide if we can do that after analyzing materials, which youre going to send me, and video after that, maybe arrange the meeting.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I would love to run a team, at least like, ten professionals and be a site of Videography just to run the business more so we can have more free time and with the revenue, I dont know, like at least 100,000 per month. If were going to hire more people who can do this remotely, like editors, videographers, different projects.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, sure.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Oh, I love it. Its my favorite city in the United States, to be honest.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yes, I would love to watch.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"What is it again? Can you repeat this one?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Yeah, sure.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay, but Ryan, can you please send some information about the company so I can read more? And Im going to have to talk with my husband about that because right now we are in the middle of one project, and its a little bit hard to spend, like you said, two hour and a half during meeting and watching video.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"ThatS a big thing. Yeah, I think so too. Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"You already have sent it?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, and I would love to hear actually more about your company because I just saw yesterday and I would love to know how long have been the company existing sure. How actually the process of this. This is like an app. Yeah, like a CRM app.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Its from 10,000 per month, something like this, because right now, since the spring has started, its actually moving faster, but during winter it wasnt that active.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Ive been just one year here, and I just received my Social Security number after a whole year. So thats why I just started.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It depends of the company. Depends on the project. So it can be from 2000 and the sky is the limit. So it depends of the company who hiring us.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Not much, to be honest, because were trying to expand all over the United States, because currently we are located in Ohio, which is not a lot of business here. And right now, I dont know, like five meetings during month, but usually its remotely so. Right now were trying to implement different marketing tools like social media and Facebook ads to promote ourselves.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"East.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, my main experience is in marketing. Ive been like more than 15 years in marketing, in different fields, in it too. And I started doing videography and working as a producer only four years ago. So hes been doing this also for four years before he worked in architecture.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Probably. But my question is, how much does it cost?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, but its more like a bad month. I see.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I just know that we need extra tools to grow and to do this quickly. So I think that its actually really possible.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, were both producers and videographers and I have marketing experience, so thats why we just put all efforts together and created business here.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, not at all. Im already expanded this number in my head.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Great. Thank you so much, Ryan.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yes, correct.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, we are actually shooting by ourselves, or we hiring some other people who can do this. If its somewhere where we cant go, or if we are busy recreating video marketing strategy or content strategy and implement this by ourselves.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"We just came back from New York a couple of weeks ago.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, let me check our schedule because like I said, right now, we are currently at one project, and were going to be totally involved into this. And I dont know, in our kind of business, its sometimes like you can be fully on set or you can just be a couple of hours. So its a little bit hard to understand how many time were going to spend on this project right now. So I just need some time to check our schedule with the client.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Were trying together because two of us just working in our company, but we can hire remotely people. So thats why we are currently at the moment when we trying to grow, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Good, thank you. How are you today?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, I just wanted to know more details, how it can help because currently Im using a couple of apps like Chat GPT for my work, but Im looking for another tool.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Let me check. Im just in front of my computer right now. Yes. Wait a second. No, actually I cant find your email. Maybe its in spam.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Do our due diligence probably about, like, 2000 or something like that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Weve been doing this together for about one year, but weve been doing this separately because Im actually from Ukraine, and Ive been running business over there for three years, and he was doing this by himself here for three years. And for one year were doing this together here in America.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I can probably say that my credit score is zero right now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Up a follow up? Lets maybe contact on Monday.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Afternoon.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I would like not outsource. I would love to have people in my team who can do that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, so me and my husband, we are running production video production and marketing agency.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, sure.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"We have all the not a problem. Like I said, we just need to set up the time, because right now were with the project, which we still waiting for some confirmation of the timing from our client.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, perfect.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Like 60,000.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, Ive just started building this, to be honest, because Im new in the United States, so Im still building.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Philip, with one L. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}}]