[{"pageContent":"Really?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I havent checked. I was asleep.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"About $33,000.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Okay, awesome.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"On what basis? Like, on a monthly basis?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Should say Matthew.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"What is air? AI.","metadata":{"fillerID":29,"fillerText":"Mhmm","category":"D"}},{"pageContent":"Okay, Im doing it right now.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thank you so much, and God bless you. Oh, my goodness. Youve made my way. I was sleeping. I woke up when you started talking about the business, I was like, whoa, wow. Thank you so much.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"I have no idea because I dont know what would be needed to get started. New to all of this.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right now I would have to say zero.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay, I just sent it to you. The text was with a 60 two number yeah. Okay. I just sent you my address.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So I have osteopina because I was taking that medicine and Ive been told by the doctors that I have to have a hip replacement and a left shoulder socket replacement, but were going to wait until if it gets really bad where I cant walk. So thats the situation with that. So thats why I was trying to get something together, get something going on while Im waiting for that, then Ill be able to boom, really throw money in there, right?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Not sure. Possibly online, maybe with coding or quality assurance.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"It did.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Let me check 1 second. Okay. I see she codes.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thats correct.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Exactly what you said.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I dont have a business. Im just starting out.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Everything. It would change a lot, and it would take a load of stress off, be able to do things. I get a joy out of giving. Im a giver, and I love buying birthday gifts and taking the grandkids places and buying them outfits and stuff, just things like that. It gives me joy. It gives me joy. But also I would like to be able to do things that Ive always wanted to do for myself as well.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes. Actually, before the pandemic, I was at 679, sharing an apartment with my son. His job closed down, so I had to take over paying all the bills and using my credit cards, and I overused, and it knocked my score down to, right now, I think its at 456. So Ive been trying to work on getting it back up. So thats also been hindering me.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Its been a while. Since 83. Ive been wanting to start a business, just didnt know how to get started or what contacts, and every time I reached out, I guess I was picking the wrong companies or whatever. Got scammed a couple of times, so I kind of put it on halt because I was like, wow, people are just cruel.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"One was two years ago, and the other was three years ago.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Per month? I see people talking about how much they make. I dont know. I think to be reasonable, I would say 10,000. And if it grows higher than that, then that would be awesome because I dont want to go saying I want to make 100,000 a month and Im just starting out and I dont know what Im doing. So I know that you have to take baby steps to get to the top.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Just the cost of living.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"WonT change. If you do that, youll still be living the same mundane life and wondering, wow, what if I took that chance again? So Im not a loser, so I cant just give up.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay, so now that youve told me that, I want to tell you something else. Im actually in a class action lawsuit and Im waiting for them to take it to court. The company had a how do you say, they stalled it. I dont know if Im saying it correctly. I dont know if they paid the judge off or whats going on, but yeah, I dont know, because it makes no sense. The class action is for them giving people medicine and they knew that it would cause bodily harm and they didnt take it off the market.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"ThatS whats going on with that, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. Well, I was married, and then when I got divorced, everything changed.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Thank you so much. This call is a blessing. I did not expect that because nobody has ever offered to give me any information or anything and I thought, well, what is wrong with these people? Im trying to live a better life and theyre just trying to take money out my pocket and not help.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Go to Hawaii, go to Vegas, go to musicals and stuff like that. Just living life. Enjoy.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Ive never done it before, but I was always interested in the marketing because it seems like people are doing so well in that field.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im a veteran. Disabled veteran.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, the second one well, the first one actually both, but right at this point, Ill do the second.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"You as well.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yes, Im trying to get just making the payments and everything and trying to get it back up. Getting the score going back up.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh my gosh. Okay, I will do that.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"I dont like the life that Im living. I have grandchildren that I would like to be able to spoil. Well, do for them. Do more for them. So Im just not satisfied with the income that I have. I want to have more income to have freedom.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Coach strikes giveaway. Okay. Let me check my spam. Maybe it went there.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Okay, I see it.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}}]