[{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"My health and not destroy my become crippled in a wheelchair. My back was nearly broken at one point, and then over the years, with a lot of lifting, it just put too much pressure on some lower nerves. So it was time to move on.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"To know how the application is and to know what else is out there and to know that, okay, this one has got value because this and this and heres how it can help. But I dont have that kind of knowledge at this time. About what? So thats the kind of background. Its like you need to have an education before you start marketing something. And a broad application of what just not your product, but what your competition is like a three dimensional understanding instead of two dimensional understanding of a surface. I just need to look at the stuff that you got and then evaluate. The conversation would be a little more two sided at that time, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Like, recently Ive had a number of solar companies come through, and Ive sold some windows before. And you just listen, and its interesting the different methods of what people and what they try to bullshit with. And then you come across one who I could work for that company, because what theyre presenting and what they have is valuable. So if you have a valuable asset, a valuable product, then I can get on board with stuff like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont know. Well, what did you send over? Is it a video explaining what you guys actually do and how this works?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah. Let me look into it some more. Ill have time. Maybe later today.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I dont have that. Ive got quite a bit of background knowledge at the moment, but I dont have the track record to support. Ive been doing more research and testing of different things. So what I have right now is not valuable in the sense that I would see marketing it. But Ive been to Ive been in contact with some guys whove been doing this for 40 years, and their knowledge is way beyond me because theyve been in the field. But I understand a lot of what theyre doing now. Implementing it and finding a system that fits me and is consistent is what Im looking at. And my son deals with AI in his field of design, and hes created some crazy stuff. And I just started looking at some of the AI and not in depth yet, but I know the potential of it. So when I just saw the AI, I didnt look into when I clicked on your stuff, I have not looked into it at all yet on what youre doing. Thats why just from where I was searching, I thought it had to do with trading.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"For sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No trade myself.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I just cant answer it because I dont know enough about them.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, yeah. I mean, obviously anything involving a coaching type of scenario without the knowledge, good knowledge, expert knowledge its like watching you can tell the difference of a presentation on a solar system just because I just went through that of guy trying to just get your business and once youre aware of what else is out there so you need a background of the industry that youre dealing with.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I guess I thought it was when I saw the AI, I thought you guys were dealing with the commodities market. Your dealing doesnt sound that way though.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And I did this to try to look into the feasibility of a second career. So thats just in the learning process. Ive been involved with a lot of different stuff in the market over the past couple of years and trying to work on the futures here and learn as much as I can. So its interesting. I enjoy it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, if I become successful at what Im working on now, then coaching the system or helping people become profitable using second income or replacing an income, I could see doing that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Honestly, I dont know. I dont really think I have a big grasp of the process or the market for it and who would it be valuable for or how you would apply it. So I need to just see some more of that, right?","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Its not exactly in the field that I was anticipating. It sounds like itll apply to different things instead of just specifically I was looking at AI or starting to look into AI as a trading tool, which some of the companies are now. Theres a number of now producing AI because the technology can react without emotions a lot more quickly than you can, and they can trade a lot faster than you can. Thats the basis of looking at AI. Just when youre scalping the market, its in and out at times where you can pick up a lot of income if you do it right. And AI allows a better margin of error and less risk. Click the buttons a lot less than manually, you can react anyway, right? Yeah. Utilizing AI, and my son uses AI on a different way for design a million images where a designer would take them forever to produce a million images. Who want to do that to a supercomputer with AI programs? And then he can narrow it down and then modify develop programs to modify the resulting images that are left over. And thats what he does with design, right? Yeah, theres tons, but hes at a level way beyond I have not dealt with AI or that field. I was on hands on in construction and dealing with people, but Im aware of the technologys capability and just finding a system that is not too exorbitant, but youre using it in a different way, but same, correct?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, let me look into it some more, and if you had any other material that after this conversation that would enlighten me a little more, Id be interested in looking at it for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, the latter probably. Im not married to trading if I saw a better opportunity come along. But right now with my situation, trading is the most feasible thing Ive come across.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Two years.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Thats why I clicked on it, and I have not had a chance to look at it yet.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Not yet. I need to see some more stuff for myself. Look at it. Let me watch the stuff you sent before I go that in depth. Its like you want to read kind of what the book is about before you get too involved. Actually, right now, I got to go pick up my wife at the airport.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, I had some accidents over the years, and I owned a construction company, and I did a lot of my own work, and my back ended up dictating that if I dont get out now, Ill be crippled. So decided I needed to go another direction. Thats where Im at.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Right, okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Let me look at the stuff you send me and today or tomorrow I should have a chance to start looking over and we can maybe chat again.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im just trying to pass prop trading trials evaluation.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"The futures trading.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thanks, but bye.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Possibly.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. Well, I appreciate it.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I havent looked.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Who are you from?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, for the most part. Teach people on a failed.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Coaching. Ive been in, watched a number of rooms, and I basically ran my own business for years. So Ive dealt with people a lot over the years.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Why Im doing it.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}}]