[{"pageContent":"Services in exchange that I want and need as a barter. But if I was to get cash paid out, it would be about that range. It would be worth about one per company. But I would eventually like to work towards 4000. Thats after a lot of experience, and I build my portfolio.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"A lot of ad spend that needs for the marketing, of course, to be known to get out there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hi. I presume this is the AI that I signed up for.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I dont have interest in it, to be honest. And Ive seen other coaches online that do that. They call it like arbitrage. Yeah. They have different names for it. To me, I want to do it as a side hustle, not a main thing, and just kind of lean out of it and go fully remote because I want to travel and be able to just work remotely.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Good. So, to be honest, Im just immersing myself with all things AI.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Is it a case study? Im not locked into any contract or anything for that.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I just want to know what because I dont think I read what your company provides. Im just unclear about what benefit or if I even would need your service or how.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, because I get commissions for bookings and just helping with setting up, decorating the rooms and houses and be on call to communicate correspondence with the guests and whatnot.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sorry, what do you call it? The case study. How are you?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"And if I had someone to help hire an assistant to help me with the workload so Im not overwhelmed, that would.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. All right, great. Ill look at be in touch. Thank you for your time. Have a great day.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Ive heard about it for the last five years, actually, but I just havent researched a lot of it until the last six months. And of course with Chat, GBT and all that coming out amongst other companies coming out with their own version of AI, chats and bots and all that, I wanted to know what your specialty was because I may in the future incorporate whatever services for I want to start a digital marketing agency.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Average.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"That for the last three months, actually. Im working with three companies right now. Theyre small businesses and Im helping them with their social media posting and content creation. And then Im going to do a blog as well for a few of them. And I want to do my own blog as well and get into ecommerce and incorporate digital marketing, ecommerce, all that together. And then as companies grow, I want to automate as much as possible and even hire someone assistant to help with all that. So Im just sort of like, researching now what tools Ill need down the road.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Credit score?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, I just want to know if its the right fit. Thats pretty much it. How would you help and if its even necessary for both parties? I dont know.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I think its more like I want to develop the skill. So I feel confident because I was in a different field and I decided to get to dive into this new field. So I think after I have three case studies that I guess there are case studies that Im doing now, if theyre successful, then Ill just be more confident to reach out to other bigger companies and say, here, this is what Ive done and I could do better. I just dont have the experience. Yeah, I dont have the full experience. And thats more on the confidence level right now. Mindset.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Is there an outline in the case study of what you suggest if I did have the marketing budget?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"It varies because Im freelance so its not much. If I had to put a dollar amount average, its not much. Can I do it just over a year? Be like 50,000.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, great. Thank you so much.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"About six years for various oh wow. Yeah, I was in the Bay Area and I had a full time thing up there. But right before COVID I moved back down to Los Angeles. And then we had lockdown, of course, but I had done property management for building with units and organizing peoples houses and closets pantries and all that I kept afloat. And then I was doing a PR assistant for a friends crypto blockchain company. But she started automating everything and didnt really need help after that. But I learned a lot in that marketing world, and I just thought, this whole digital marketing is going to be where its at. So thats my newfound interest navigating towards that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"What is the minimum requirement for that? For the credit score?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Got you. I feel that six months down the road, Ill definitely have a lot more amazing budget. I have a lot of in savings, but I dont want to touch that savings, to be honest, especially in the times right now. But I would definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, its not that great. So, like, 640 or maybe 650.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I like the research part and contacting getting the company. I guess that would be like the person fighting booking the work to get hired, but the actual work. When it comes to sitting on the computer, its not my thing. Other than doing research. I love researching and reading and talking on the phone, but not the actual work when it entails the emails and all that automation.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Again, experience. Im totally new to this game, and I want the experience to feel confident, to be out there, to take the risk, all that. Yeah. And also have more savings. Ill be more lenient on spending. I just need the experience and time, thats all. Six months. I think six months is pretty good.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I organize interior, decorate and property manage interior. So its along property management, airbnb bookings and help set up rooms, help book rooms.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, $2,000 a month. Thats pretty reasonable. Its not, like, 10,000.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. The marketing, social media marketing, especially with TikTok, and theres a slew of other social media that is good to promote on as well, depending on the business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Why? Is that a factor?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Go ahead. Yeah, of course. What is the monthly that you charge.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, I wouldnt know it at this point, so thats another factor. Maybe its not a good fit. I would definitely would consider it down the road when I do generate more like ten minimum thousand a month to have ad spend and marketing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So if you were going to show me how to do that, what does that entail?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Exactly. But Im like very small fry micro. Small fry. But I want to grow it eventually. In a year from now. I like to generate more than like right now. Im doing small fee and barter. So their services are worth about 1000 a month. Its not bad, but its not great. Per company or total no per company. Yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Right now, not 100%, but another question was, do you have affiliate marketing as well?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Time frame for my personal where Im feeling for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Pardon?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}}]