[{"pageContent":"Its Ben. With who?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Again before I guess the obvious answer is yes and it should be but yeah, I want to find out more about it. I look at things in very different ways sometimes because Ive had other people tell me with other things Ive looked at, this may not be the best fit for you. Which, in a sense, intrigues me even more because then I want to figure out how can I take whats being offered and make it work for me, knowing that its probably not being utilized by my competitors in the same vein.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right. Im a car guy.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"That.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"So what Im going to say is reach back out to me early next week. Right. And I appreciate your approach and not doing the hard sell and giving me a bunch of excuses.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"It just so happens that youve been in it for so long and youre so knowledgeable about it that youre able to do it as a passion project. But.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im actually the third category. Im a unicorn in the solar industry, and Im very into it so much that I tell people I meet with that, look, you dont have access to anybody that knows as much or more about this industry and how to educate you and inform you on things that you really need to know and understand than me. And thats not an ego statement. Its not a statement of arrogance. Its not me being narcissistic. I literally know more about this stuff than anybody your average person could ever hope to gain access to and I educate consumers. So when it comes to consultancy versus sales, I tell everybody, if this ever starts to feel like a sales pitch, disconnect on us. Hang up, show us the door, do whatever, but save yourself some time because were not into selling solar. Every clown that can spell the word solar, S-O-U-L-U-R these days is pushing it and its all about a bunch of bullshit and a bunch of hype and everything else and theyre grossly misinforming their prospects and whatnot. So ours is a process of educating and educating on what that bullshit is. Expounding on it so they can make a financial decision.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Its called everything under the sun.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Ill be honest with you, man. Its been a confusing mess. Ive been getting calls from several people and emails and scheduled appointments and then canceled appointments with you guys.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"It definitely sounds like were aligned in that sense, but it also sounds like youve got a shit ton of experience in what you do. Im just curious.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right on, man. I appreciate it.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Ill give you a quick rundown and its just I went to book an appointment from the ad. I wasnt able to it said, oh, theres no availability in the calendar or something like that. Please email us at whatever it was. Okay, cool. I sent an email, so that was the first thing. It was like, wow, okay, I cant schedule an appointment through their appointment scheduler. Then when I do send it in, I start getting emails from a few different people. And one, the first one I engaged with and went ahead and scheduled something on the calendar. And then the next day I see that its canceled. Theres no reason or anything. Then I get another email from somebody else for the same thing. Hey, Colin, noticed you made an inquiry, blah blah, blah. Again, this is now two days later, though, and that was another red flag, and its happened. Well, youre the fourth, I think the fourth one.","metadata":{"fillerID":38,"fillerText":"Ummm yah","category":"F"}},{"pageContent":"Ive only got a few minutes.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Good place with that? It absolutely, positively can even doing it the way that Im doing it. And Ill give you a little bit better understanding. So average Solar customer, average new project that we pick up, well say that the ticket on it. The price tag is about $40,000. Now thats realistically, anywhere from $25 to $65,000. So well call it closer to $40,000 on average. Within that, the margin to me is, lets see, probably close to 53%. Okay. Right.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"15 to 20. And thats because Ive got a very small organization. Right. I had a much bigger company before and it was just a nightmare of logistics and it wasnt worth the money that it made. And the net to me was about the same. And so I figured out how to scale it down. And I was working 10 hours a week making netting personally about half a million a year and realized I could triple that. I could quintuple that if I just put a little more time and energy in and start scaling things up, it doesnt really work. The numbers dont work out that way just because the more you do, the more work you have to do to manage that work. CRM ERP software and all that other stuff. And installation, more installation crews, truck shows, bigger warehouse, blah, blah blah. Right. Its just all everything snowballs up now I figured go ahead.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont think theres a way to keep up with it. Its just a matter of hanging on. Because what I see is it expanding and growing and improving at just an immeasurable pace.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Maybe Ill get you on the show and well talk about things and then this AI stuff, and then bringing that up, I might start asking you, so whats an English or a British word for this?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Thank you. Its going to be different and I dont hold back. I think certain words that some people might find offensive are the most appropriate word given the statement or conversation. So I use it. And Im a bit of a clown, too.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im in Arizona and we dont have daylight savings time here.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Ive got a few minutes.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, I own a solar company, so we sell residential solar. Been in the business for 16 years. Im one of the old men on the hill, and Im best known for being the guy that calls bullshit on the bullshit in the solar industry. I mean, seriously, theres a shit ton of it. And I can only imagine whats coming my way with AI. Holy crap. Ive never seen anything move so fast.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Well, honestly, at this point, Ive just lost interest in dealing with the company and.","metadata":{"fillerID":38,"fillerText":"Ummm yah","category":"F"}},{"pageContent":"Im 57 years old and Ive done very well. Ive lived a great life, but along the way, Ive spent everything Ive made living life and didnt really set myself up for the later years of my life. And then all of a sudden, I wake up and I go, shit, I better start doing things differently. Im trying to do it so I can make more money that I can put to work, right? That I can invest and put to work so I can live off of that and continue the lifestyle that I want and enjoy. Now what does that mean? I could make well, I could its very difficult for me because Im very pragmatic. Its hard for me to put a number on a goal or whatever because theres no such thing as in my mind as too much money. But at the same time but there.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Lets book a time. I imagine youll just email me a link to that video. Two and a half hours. Thats going to be tricky.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its because the old cars, they literally had a trunk on the back and a case, a travel case before they had an opening. It was something that you strap to the back of a car so you could throw things in it, and it was a travel trunk. And once they integrated them into cars, they just kept calling it that here. But yeah, its funny, people are fascinated with simple things, like theyll get into conversation about, well, what do you call this? And then it just keeps going, that and AI. I mean, wed end up probably having a podcast that spans over three episodes, right? Itd be an hour and a half long thats the premise behind the show. Im mainly doing it yeah, Im mainly doing it to help educate people, but also keep the process of educating them interesting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You to I dont feel burned. Honestly, I dont think there was any intent I just dont feel that if something as simple as booking an appointment and I get it I own a business. Right. Ive had miscues that just went from one scrupe to the next, and it was just like, wow, how the hell did that happen? And it was a fluke occurrence. But booking an appointment should be the simplest thing that should be a company thats doing AI stuff. Im not down with it anymore. With this, I would suggest pass it on. Right. I know its not your fault, and I appreciate it.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Lets see here. Unless you prefer I wont have time to watch that video because even at one and a half times or two times speed, Ill probably be pausing it, backing things up and going, what was that again? I need the weekend to try and get that in.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, hey, that yeah, so I dont.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"WeRe able to run circles around our competitors. My challenge, thats awesome. My biggest challenge, and its your biggest challenge, its any businesss biggest challenge is getting people to listen. Just getting them to listen because theyre this huge flood of people that have jumped into solar. And I can only imagine what its all those that are going to get into AI. But the quality has gotten diluted, of information gotten diluted, and so many people are now at a point where theyve heard all the lies, the BS theyve experienced. It far more than the truth. And the resistance that was going away is building back up again now because of the solar industry. And the way I see breaking through that is having technology that can address, respond to questions, inquiries, concerns, doubts, whatever, in the most effective and efficient manner possible. And to me, AI seems like thats the solution.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I dont have a business partner that would be married.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Not everybodys videos do that. I do that as well for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Living large. Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Whats your name again?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"People love that kind of stuff. Right. Something as simple as calling the hood of a car a bonnet, right. Or the windscreen. What do you call Fennick?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I see it actually going all the way through the entire sales process, potentially. And I dont know where Im sure.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, so Ill answer some questions and send me something. I do look at these things. I am interested. One of the core values I created for my company is always try to find reasons to say yes versus excuses to say no. So Im trying to keep that in mind.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats how real I see this being.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Correct me if Im wrong, Michael, but it sounds like your sales pitch in inverted commerce is much more about educating people so that they can make the right decisions for them. And inevitably, that is once they see the light and they realize that actually solar makes so much sense, you are essentially educating as part of your pitch. Is that about right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I will have my guy Adam probably join in on this and he handles my tech stuff and I get interested in it, and then I hand it over to him, say, hey, bird dog this, chase it down and or make it work. Right, okay, cool. My job is to be in front of a camera, behind a microphone, on a stage, or in a meeting with another business that can refer business to us and we can refer business to them. Right. Thats like my whole purpose anymore.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. Yeah, no problem.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Wow, thats amazing. Because Im like brand new. At it. I used to have a show called the Solar Express years ago and it did well, but it didnt have like, a listening audience because it was very subject specific. So who tunes in to listen about that particular subject? People would get referred to it, we would promote it. If youre curious about this, tune in, whereas this one in writing, the description or thought process for it, I said, I want to be able to talk to my guests and people about things that are off topic. Pretty much everything under the sun. And as soon as it came out of my mouth, I went, thats the name of the show. It relates to solar, right? Everything under the sun. But at the same time, everyones got a story. And so weve already got four episodes in the can and that have all been done and recorded, and my editor is breaking them down into segments and doing some different things, adding subtitle text and blah, blah, blah.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Well, not just yet. Not just yet. Youll see what the future holds.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Is it just a phone call?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"You did good, man. Because I was done. I was done with you guys.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yes. And his is Adam At. Cool. Same thing. Just Adam.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"I was going to say when you click it to put it back to normal speed then it sounds like theyre talking like this.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Make it go as fast as you can and still understand it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, we just started it and just released the first one.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"ThatS how I operate. I really appreciate that. Honestly. That means a lot. And, yeah, if thats the case, then it will be. I dont know if it is. Well see. But, yeah, I massively appreciate that. That means a lot to me, man. All right.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Either get on board or get out of the way. Thats the way happen.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Well, let me ask you this then. So as far as tomorrow is concerned, whats the latest appointment time?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Well, the show is called Everything Under the sun and so, yes, it is about solar, but its also about Everything under the sun. So my conversation with you is probably going to be part of that podcast as far as just with my co host. Well be talking about AI and how we see it, benefiting us, impacting us, fears about it and things like that, rather than just making a show thats just about solar and energy efficiency. It gets boring really fast and I found that all my guests, everybody has a story. Its like if you were a guest on the show, theres something that youre going to say or something thats going to come out of you that if I say, oh, sorry, thats my dog Sparking, you go, oh, Ive got four dogs and a miniature pigeon. And then I take the conversation in a very different direction. Its a show thats as much about human interest stories and people as it is about solar. And thats kind of the hook.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ill forward it to him.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So I figured out what a model that will work, that will take me where I want to go and probably beyond if I want to continue to put in the effort and then starting to hear about AI and go, well thats scary and blah, blah blah, I dont really want any part of that. And my initial thoughts were that if everybody gets into AI and it becomes this kind of perfect model and everybodys using the perfect model, then it self cancels. Right. Because if everybodys got it right or whatever, then nobody does and it becomes mundane, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thing, youve still got my attention.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"All right, take care. Have a good one.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, like you said, you are a mixture, a mixture of the two.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, well see.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Let me see what my schedule looks like tonight. Tell you what. Yeah, I should be able to make it work because this is something that Im very curious about. So Ill watch that stuff. Ill go through it tonight. Okay, yeah, sure. That gives me a little bit of time too, because Ive got a podcast tomorrow that I have to do.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So as a business owner, even though I own a solar company, my business really is marketing, right? Thats what I should be doing. I should always be promoting the business, the brand, the capabilities, the differences, the uniqueness. So with AI, I see it as a marketing initially, as a marketing tool to get a more effective message out and then be able to deal with inquiries in the most efficient way. So if somebody responds to an ad, we have things autoresponders set up to respond to them in a better, smarter way than a human could do. Consistently, every time, absolutely. Depending on even just what their initial response is. It knows from that particular response that ideally the best response is actually this one, rather than what I thought it should be or whatever. So I can simply get an appointment booked, and then from getting that appointment booked, having that conversation, and again, it could be the AI thats having that initial conversation.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Its a perfect term, frictionless. From what Ive been, and I dont know a whole lot about it, Ive been studying like a fiend just the last week or so. My mind gets blown every day of what this stuff is capable of.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Tomorrow? Yeah, probably. So, yeah, well include him. Let me give you my email, then Ill give you his.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]