[{"pageContent":"No, tomorrow. No, because tomorrow I have appointment.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, thats what I have in one of the credit cards.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Do a 05:00 P.m.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, no. It makes me feel like, ugly because my plan is get out of debt. I want to keep the cars I was trying to get on those programs to release that, and they are garbage stuff because they put you in a bad situation and say, no, I dont want to do that. But basically what I would like to do is pay the debt and have a freedom controlling the money, but have a freedom. Thats my focus right now. Im looking forward to be free of that and be able to live with the money that I do, but eventually sell the house that I invest and continue growing business because what I do. I know Im pretty much confident that were going to reach the goal, but unfortunately, its not the best modeling in the world, not only in the country, but thats my focus right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"When you say capital, how much money youre talking about.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, I have a good experience selling stuff, like every time I find a customer.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I dont understand what youre talking about.","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}},{"pageContent":"Good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. The only thing is it looks like I have to start making videos or what?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"No, its good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, this is yours. Okay. Sorry. Go ahead.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. Im in Washington state.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Ten years.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Thats right now something that Im working, because the last four months, I was without no jobs.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"So it sounds to me like you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Like 25.","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Currently, I think were on 660, I think, right now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"What business youre talking about?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. But its a high ticket for me if I use it because I had to pay.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"From where?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Five years.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Thats it.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Counting how much will be at the end of the year.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"What youre curious about, where I start making money?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Does that make sense? It will take 30 days.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"The last five years were very consistent. Production. Like, every month, seven grand. Every month, more than seven. Sometimes ten. Some months, like 25, some months, 2018. Wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"God bless you, too. Thank you so much. Bye.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, I would like to understand, if I take the classes, whatever is the training time right? How long will take to reach the optimal point?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So theres always issues. They dont understand how important it is. For me, the customer, its not about if they are rich or poor, they are old or young, or if they have a good car outside or ugly car. I dont care. For me, this is a business car presentation. Every time we consolidate one job from beginning to end, and we consolidate our friendship with the owner, because I can go any house that I already serve, and I can have a cup of coffee with the owner even. Theres no work that is in front of me for them to serve. Theres no obligation to open the door, because there is. I see that you need a new paint in your house. No, I just go say hello. Hows everything? But the thing is thats most important for me, I would like to conserve those friends and those connections because they are my best how do you say the promotion the best advertisement? Because they refer me. I had all these years zero advertisement on Yellow Pages or website or things like that. I got no projects coming from those advertisement. I have projects coming from mouth to mouth. Its because weve been serving just like that, all my clients. And thats important. Thats why its hard for me to find employees that I can keep them for a long time, because every time I find something thats not safe, its not good. I say, okay, right, thank you, but theres no more job, and thats it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Give me a second. Give me a second. Take care.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Depending on how much it will cost me, yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thursday it can be good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Thats crazy average. Thats why I say seven. Its not consistent. And the problem is the problem that I have, and I accept that way, is because I have problems to hire people because I dont find the right.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, but how can we do that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Say that again?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"My focus every time when I find a customer that needs my service, because we do several things. We do painting, remodeling, we do aluminum railings or waterproof index. So if somebody call me that, I can be one of the contractors that they already call. So my first approach is not to sell something. My first approach is to show them whats going to be the benefits that I can give it to them. So I have like, lets say railings. I say youre not going to paint it anymore for the next ten years. Youre not going to have to worry about rotted pieces. Youre not going to have any problem because its any crack on the wood, because everythings aluminum, great crack, cable or glass. So what I do is I offer the benefits. Then I say this one, it will be a quick installation. This one will look amazing. This one, it will increase the value of your house. This one will make safety for your kids inside the deck, planning or running around. So then they say how much it costs. And I tried to explain not only the price, I tried to explain that what were doing is when I warranty that anything happened, they can call me any day for the next 3360 days. Or if something happened later, Im going to come for free to inspect and give an estimate in case we need to do something that is away from our responsibility. Or I give a simple, easier, quicker solution that it will cost less and it will be good at the end. So I understand that the first thing that I need to get is their confidence. If I reach their heart and I reach their needs, Im on the boat, Im inside, Im aboard. And most of the time people buy my stuff. I never compete with anybody. They show me prices sometimes. Can you match this price and say, no, give it to them? They need the job. And if they are offering for that price and looks cheaper than me because theyre going to do the job good, I dont want to compete with them. The sun is for everybody, comes out for everybody. So probably the opportunity for them to make money.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yes. Are you done? Because I have somebody here that I.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, like November, December, January, February was damaged.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Okay. If I do that, Im trying to remove my debt from credit cards because after all these investments and the credit crisis that we have because no job coming in, I start using credit cards to pay a lot of bills, a lot of things. And basically Im trying to not use more credit card because its killing me. But if I use 1500, what is the return and when its going to be the return?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Absolutely. Yes.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"What kind of business? I do I do handyman.","metadata":{"fillerID":29,"fillerText":"Mhmm","category":"D"}},{"pageContent":"Before that, you say free resources, but whats your benefit? Whats your profit on this? Yeah.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah. But you say start looking for customers.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, right now Im broken because I have other situations that I invest money in a house were waiting to put in on the market because it took a long time to finish to rebuild and make it nicer. And unfortunately, the location and the neighborhood and other rules that are around that didnt make us the opportunity to sell it, because when we tried to put on the market, it was exactly last year in October, and everything started collapsing. No sales, no houses for sale. So all my money is on that house right now. Im waiting for that.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, just me.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I dont hear yeah.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Thats my role.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Lately, everything started growing. 20 minutes ago, I received two different calls from two different customers, and during the day, I received another three calls from different three different contractors that we work together for projects that we already involved. We say, were going to do this. Everything is going back to normal.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Awesome.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"How does that sound? Sounds good. The only part that serves me is that I had to pay money right now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]