[{"pageContent":"I havent really changed the affairs of my day to day work, but Im feeling more tired going through them, so Im still lucid. Im alert for the most part, and Im engaged to make this happen. I saw your ad. I thought, this is a side of the business I know nothing about. Ive seen little pigs. I downloaded the app, and I have.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats another issue. We dont need to discuss it but its something that, well, I am able to get up and down by myself and to move through the motions of the day without assistance.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay, cool.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Im good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Interesting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Im trying to empower the real estate owner to sell the property themselves with a broker assist situation in the background. I have prepackaged a program where all the components necessary for the sale of property, undeveloped land as well, are in a menu driven presentation on an order mask. So I own a condo in San Diego. So I pull up the web page, pick out the type of property that I want to sell. Click it, opens up a page. You will need to do this in this order. Click number one. And this enables and empowers the owner to execute all the components that a broker does on his behalf, except at their time, their leisure. And so the negotiating of the final price is held into the hands of the owner of the property, not the broker. And the broker is in the background to make sure that, one, the client doesnt hurt himself, and two, that the transaction is actually done correctly. Because in the end, a broker will sign off on the contract if necessary. But we identify issues with non compliance per California Department of Real Estate, and it takes sale of a million dollar home that charges $60,000 down to $4,500. Thats a lot of money. Thats tuition for a kid through college.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, so outside of what you need to do, what you need to do, how much liquid do you have available just for the business at this point?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay. Really fascinating. Well, were just looking for people that can provide real value, and then we have got the whole machine to move it. Right. Get it into peoples hands, get them to know about it so they can actually benefit from this genius thing youve done here. And its life changing, like you said. Can at least save that money and put it into unborn childs college and just make a huge difference and doesnt need to go into massive commissions because tech can let people be in control and just do it themselves. So Im really excited about what Im hearing here. In order to make this thing totally go, youre going to need some systems in place to make it work. Right. And so Im going to ask you some questions to kind of find out where youre getting started from in terms of the knowledge of how to actually move this and scale it with the marketing side out there. Now, I dont expect you to know, frankly, any answers to these questions, but I dont want to make assumptions. Itll give me a good sense for some of the gaps that we could fill in for you. But before we do that, I would want to make sure so were just giving you the most value that you would meet the basic financial qualifications we recommend people have before rapidly scaling a business the way we do it. So do you mind if just ask you a few financial questions surrounding that?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"All right. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yet to use it, but a friend.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Of mine came over, saw it on my computer, and used it, and I was impressed at what he put out. It was just like.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"This is a fascinating conversation. Christos, I dont talk to people every day that have figured out a way to democratize selling your house, who have cancer and want to leave a legacy and whose mother has passed away and leaving them absolutely everything they need to make this vision a reality. This is really fascinating. I feel like its an honor and privilege to be able to talk to you about this. So thank you for sharing this with me. I really do. Thats cool. Now let me ask you these questions. So one of the first things youre going to need in place is a process to get this into peoples hands at will, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Zero.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Well, its a flat fee service, and it can go up to, like, $4,900. And the client, if they dont have 4900 to pay up front, we have lending sources that will, upon proof of ownership. Right. Well do a title search upon proof of ownership will front the money. Itll be another debt, like a mortgage on the house until its sold and itll be cleared in closing escrow.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"It does, yeah.","metadata":{"fillerID":19,"fillerText":"Yah umm","category":"C"}},{"pageContent":"Okay. Concerning the video, lets see.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thats it. Right. I dont have it. Is theres some sticky parts to it? But conceptually, theres no reason it cant work. Ive already checked with Car Legal, and none of the attorneys at Car shot it down. They said, why not? As long as the rules of the road are obeyed, they dont care if the transaction goes through a brokers hands solely and exclusively, or the owner handles it. The broker is the necessary evil to make sure somebody doesnt offer something or somebody doesnt omit something that will come back and unwind the transaction or wind them up in court.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"That sounds very customer service friendly, my young friend. Yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"But eventually its menu driven enough to where I wont need to.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Am I open to it? Of course Im open to a campaign, but I dont know how to structure it, how to present it, market it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right, so what time of the day you feel like most focused and stuff? What would be good on Monday for you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Well, one, I have been diagnosed with cancer, so the thing is, its not going to be a long term gig for me regardless.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I would like to leave a mark like Schwab.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im not releasing a Social Security number.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"It is a big deal because people get sticker shock when they read the closing statement and see what I walk away with. Its criminal almost, right. It can be addressed. And a lot of people are confident enough to be able, if they had a lifeguard on the sideline, to call and to double check that they arent making any. Theyll take it. They will take it. I would take it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"You can figure that out. Got you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Pacific.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Anytime after 100 Pacific. And the reason is I run a crew out here and these guys start showing up between nine and eleven. Difficult for me to stay in one spot much before eleven because I got jobs running at multiple places out here in San Francisco.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Just real quick. This is kind of like the democratization of selling your property. Just kind of like Uber kind of disrupted, like taxi, in a sense.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hey, Christos?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thats correct.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thats cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Well, educate me on the process.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"None. Im still waiting for a guy from fiverr to come back with the flow chart and an initial order mask. So I am. It envelope. Right. But I have access to people that are much smarter than me. Im just the guy with the pen.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"If you do, while Im still up above the ground, you make sure oh, yeah, man.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, youll have way more context and then everything will make way more sense because this is not your marketing, is not your wheelhouse, like as youve shared with me, right? Correct.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, for anything under ten liquid in the bank. But I live alone. My expenses I have no children, I have no rent, I have no car payment.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Not at all. Fascinating.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Daniel 8589-4548.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Me, too, buddy. Believe me, that came as a fucking shocker.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"What city are you in?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay, cool.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay. All right. Bye.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"That would be nice.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I do, yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So thats it. Were the necessary evil in the corner.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Got you. Okay, so you got about ten that you could put in the business without hurting anything else at all.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"There.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"And.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"That is hard to say. And the reason I say it, and Im not trying to be evasive, my mother passed away on March 1. The estate sorry, was left ten and a half million dollars split between me and my two siblings. Weve already been receiving distributions. My share is almost three. So pretty much whatever I wanted to got you probably more than would be necessary for any guy coming to the table here, for sure. Yeah, I think so. And the thing is, Im just waiting for legal to see the timeline on it. It was all in trust, and it was a debt free estate. My mother was just a penny pinching gal. Weve all been receiving distributions already. Im just like wanting my entire share sooner rather than later, and then I will have access to ample capital.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"$45,000.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, thats great.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Theres different rules of the road per state, but overall, the rules, its like a drivers license. In California, you have to stop before you turn right. In Missouri, you cannot make a right at a stop sign or something. Theres just little differences. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And then in terms of cash on hand, that you could directly put into the business that you dont need for rent or groceries or other operations, but what you can realistically put into the business right now, if it meant growing and scaling this month, how much kind of working capital liquid do you have of that right now?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That have been responsible for us getting almost 3000 booked sales calls every month, getting 80% of those 3000 people to show up to those calls and closing every other one, like closing half of them in our other company. Yeah. Its allowed us to scale at such an elite level. Now somebody, and this is great for you, will fundamentally walk away with more knowledge on the growing scaling process after watching that full training. So for you, I want you to really slow down and just take some notes on the sections where it walks you through how we generate the leads and then how we get in contact with those leads by actually having teams of a player talent that will just make a human phone call and talk to these people and have a great conversation with them and find out what their home means to them and why its so valuable. And explain how the money they save can literally grow for their children and all the kind of fun, exciting things weve been talking about and really kind of get on a heart to heart level with these people and find out whos right for your program. And then once theyve kind of established that if theyre the right fit, then those people schedule them on a call for the sales call so that the way these people show up. Theyre really warm, really bought in, and then your closing rate is much, much higher and you make more impact. But I want you to take notes on that whole kind of appointment generating process and how we generate those leads with paid ads. And so I think thats going to be really valuable for you to understand that process. And then also itll explain how we use the AI, which is really kind of fun. So before I touch on that second.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No I have no question concerning no show. And by no show you mean Im not here too, when they call and I dont answer or I dont call?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I dont see it happening, but its a question.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Christos, have a good rest of your weekend.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Just for your real estate.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"02:00 Monday. Do you have anything for Tuesday? Because I would like to have my office clear of any kind of coming and going interruptions. So I dont get what time on Tuesday is better?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Well, I take cruise out to get homes, ready to sell foreclosed homes, sometimes need trash. Got you like that.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"This is definitely not the last time you and I are talking, because youve got a really rad thing to bring to the world, and Im going to keep my eye on you, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"What kind of cruise are you running?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"You own this idea by a property owner, just anyone, your parents, a buddy, and see how they like the idea because the negotiating of someones home, the price that they finally receive, that is very personal. Its like sharing your wifes bra size.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"What time on Tuesday is better for you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, in the mid to upper 500.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont know. I havent scaled it out to a national thing. The California is big enough for this one guy.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, I agree with you.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"That sounds wonderful. Wonderful. I am excited now. Im glad Im Saturday morning.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"So credit score and income, these are key indicators absolutely paramount for being able to scale quickly and responsibly. So do you know what your credit score is at the last time you checked?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thank you, Daniel. You as well.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No, I dont necessarily have to take the sales call.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Any broker can handle the question.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im not a marketing.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Calendar for Pacific and see when we can get you guys on together.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Exactly. Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"With the voice here. Hold on a second. Daniel woods.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, it was too far down the road. I knew it was going to be there, but Im still trying to get the mechanics of the totally.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Daniel woods case study. I got you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yeah. Oh, heck yeah.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"And then what was your income last year based on a W? Two or 1099?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So at the end of that call, if they feel like youd be successful with us and for them, they see a crystal clear roadmap to take this thing like 100K out of the gate and take this to a million dollars a month and beyond. I dont even want to limit this to a million a month. But Im just saying, if they see a clear path to just take this thing to the moon, theyll share with you how to get access to all. Of our internal software, all of our AIS, all of our sales network, and even work with our team of executives at a much higher and ongoing level, all of whom work with our close friends like Tony Robbins and Dean Negraziozi, russell Brunson, Alex Sermozi, all the big names youve seen all over the internet. These are our buddies. Now, obviously, if thats the case, of course that does require a higher level investment. But even if they dont think that for some reason that youre not a great fit and the call doesnt really end going that route, youll still walk away with so much value of that training and being able to kind of sit down and sit with one of these guys. Thatll be a net positive either way. So what time zone are you in?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I can. So it sounds like youre beating around for a credit card number.","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, I got you.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Oh, heck yeah.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Piece.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Well, its the price. The broker. Its bedside manner. Think about it. Youre going to engage yourself with someone who is engaging. If you called me and I was cold and distant, would you be excited about a follow up? Probably not. But if I tried to answer your questions without getting too yappy about it, theres something to discuss. Thats the kind of agent broker that Id like to recruit. And Id probably hire a recruiting agency to bring in guys that would take calls. Right.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im in the Phoenix area.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Christos.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, I didnt give it is it 602-353-7939?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And they get the same thing. They get to operate a very big business transaction, and theyre going to be familiar with the protocol involved, because before they can be a client under that umbrella, they have bought, like, a $49 online course that will preview how the course works in the dos and donts of the road. Like, you cant not say this house for sale to all but Asian American. Itll labor, the obvious, but itll also go into other minor.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right, let me take a look. I want to make sure that I get it.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, thank you, Jen. I am happy to have spoken to you and that is a sincere outreach. I am happy that I picked up this phone and Im very tired. This fucking thing, it sucks the life out of me, I tell you. I wish I had my kids around, so I will.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"I am down.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Heres what Im going to do for you.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"All right. So if I said, what was your plan? You would say, I dont really have one.","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Okay, so yeah, Ive got a few, thats all. Word of mouth. And every day I got cruise running.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes, I can see it but I have to leave my screen to read it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, 02:00 is good. Will I have time to view this video or whatever it is?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, Im going to send that to you. Im going to put in some notes and then youll get an automation in about five to ten minutes in an email and a text. Itll have the number from which theyre calling. Youll have the name of the executive consultant, and then itll have the link to the video. And then we left the control on there so you can bump that to 1.5 speed and its about 90 minutes at 1.5, which youll totally manage before two on Monday. So, yeah, 02:00 good.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"You know whats funny is my dad was going to UOP Dental School when I came along, and before I even turned one, my parents moved to Arizona. And I have not been to San Francisco since I was a baby. I need to make a pilgrimage back to So. Im one of seven kids, but Im the only native Californian, so I got to make a pilgrimage one of these days to my birth town.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Totally.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I said I wish.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"I appreciate you kind of thinking about whats going to be more clear for you that way. Right? And I just want to double check that that time is good. I know it is.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Lets say Im watching the video and I have to step away. Does it have a pause button on it?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Charles Schwab. Heres a guy that took on the SEC for fixed rate transactional costs. He had no friends there. And now hes a dominant player in the industry, the biggest and self directed pension and trading in the world. And he started off as a single branch working at a bank of America in San Francisco. Now its a global. I could see something like that, someone younger who has some grasp, with a vision that this can take, because its not just a real estate play. This could branch off into many things. You could get a registered asset investment advisor who takes over one of the franchises and offers the client college planning for their unborn kids. For a couple just starting out on the money, saved the buyer. Because this is owner driven.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It does, yeah, it does. Okay.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. All right.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Good. Great.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Something sounds very engaging. I would like to see what comes to the mind of someone in the business of marketing. If you guys have a crew of closers that would field inbound calls on it, that would be beneficial as well. Or line me up with somebody.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thats correct.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Explain a close rate from somebody opening the ad to not buying it.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Since March, probably. Ive received 40,000 so far. Close to it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I did not, but let me check here.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Youre excited over it.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Christos. Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Are you thinking about any kind of legacy for thats what Im doing, yeah. What would be your why behind the legacy? You got kids. What are you trying to do in terms of legacy goes?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I do. However, Id like to predicate my request with are you a property owner yourself?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And Uber doesnt own a single vehicle.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, so 02:00 works for you?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Im not going to ask you for that. All right. One of the biggest challenges that I see holding back businesses we consult its their ability to secure funding and capital for things like marketing, ad spend, like you name it, weve just seen it affect the results rate.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"San Francisco.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay, no problem.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Now, the second thing I have for you, and I think this is actually going to be like the best thing I can do for you. Christos is over here. Air. Weve got a team of full time executive consultants. These are the very guys that scaled that last business, the one where I gave you those stats of 3000 appointments a month and 80% sure, 50% close rate. They mastered all the sales processes, the SOPs, the lead generation, everything front to back, A to Z that makes the machine tick. Theyre all trained directly by Caleb Mattox. And by the way, those stats that added up to a million dollars a week in revenue from those appointments, 4 million a month.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Well, thank you. I have something to look forward to besides discovery videos. I look forward to it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"There we go.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, Ive got a 02:00 on Tuesday as well.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay. All right.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I do not know. No, I have not logged in yet today.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Id like I think its possible to do, like, 90,000 a month coming out of the sheet. Theres 1700 for sale by owners in California alone. Every month it fluctuates, but about 1700, if I could appeal to 5%, I would be more than comfortable and my phone wont melt down. I can farm it out. Id like to the concept, Id like to spread it around but be in control of the name. The trademark name? Yeah, something like that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, this thing will not require millions, not even hundreds of thousands to get it moving. And grooving. How much in distributions do you have currently?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Whats that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"The second resource offering, how does that sound? Would that be helpful to kind of orient you a little bit?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"This has been wonderful. I feel empowered almost because this was a dynamic of the concept that was really causing me some consternation, my friend, because I have no talent with a crayon. I am no artist at any scale and having somebody who lives to market in my corner with something that I can afford initially sounding anyway, is exciting.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Thank you very much. You have a beautiful day. Enjoy it. Where are you calling me from, roughly?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]