[{"pageContent":"Okay. Yeah?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, like I said, at this point, because we went through ever since COVID its been like just keeping our head above water. And so we had gotten almost a year behind. We had to do the variance or whatever on the mortgage and all that stuff. So credit is taking a hit and thats the hard part, right, is because Ive been commission only for 20 years, is why Im seven years behind on taxes and have no provable income. Because Ill flip a house and I might make 40, 50, 60 grand on it, but now its six months or eight months before something else comes up. Theres no consistency because again, its me basically relying on my other agents to say hey, Ive got this person thats going through a hardship and Im like, hey, thats me, Im a creative solutionist. Let me come in here and teach them about some of our alternate exit strategies and what we can do sub two or how we do a wraparound or a short sale or a wholesale, whatever. But thats kind of the thing too. I dont want to be limited to real estate because again, Ive done sales and taught sales psychology for just as long as Ive done real estate. It just happens to be where Ive been at now because Im not an employee. And so real estate is the only place Ive ever been. It was the place to go to to be self employed, be your own boss and kind of be in charge of what you do. And so Ive done well with it here and there. Unfortunately, like I said, it always seems like the end of the year, the slow times when taxes come up, thats when the market slows down and the money slows down. Its been crippling.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Of when I say go, thats what I mean. Thats literally me saying, okay, well, what can I kind of trimmer? What can I cut out to know that I can commit to that? Like, hey, I dont need cable, I dont need this or that. I dont need to go out to eat for a month so I can make this happen. Theres nothing I believe in more. Im sorry. Go ahead.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thank you for calling. How can I help you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Literally a couple of month right now thats disposable. And thats only because my remodeling company has luckily been keeping busy enough to where Im making a couple of couple of that. I can spare this extra with no predictable income. This is what sucks. So some months I might get a check for $1,500 from the brokerage, some months nothing. So its never enough to sustain. Im always having to hustle and figure something out on the side. Ive started writing three books, got about four or five chapters in and then I get an idea for another book. My problem is Im always being pulled 100 different directions at once. I really messed up an opportunity years ago I had a company that heard me speak once and they called me and offered exactly what I needed and I was too greedy at the point I didnt want to split everything. And they said, look, well put up the money, we will pay for you to go out on tour. Well do all the marketing and promotions and everything. But its a 50 50 split on everything from here on for it. And they knew I was coming out with a book and they were going to help me build my coaching programs and put me on stages and all this stuff, because Ive been on some stages, and at that point in time, I was greedy. And I just couldnt see giving up half of what my life is. My life story, right? And everything that I was doing. And so I told him, no, it was a huge company in San Antonio and I messed that up at this point. At that point I felt like God was telling me, no, Im not supposed to split that half with somebody. Theyre not entitled to half of my life story. But now for years Im like, something is better than nothing. Im still dragging my feet and kicking tires and trying to figure out how to do it. So I know that I need to invest. Im past the point of that scarcity mindset, right? Im past that. But its financially capable right now is whats hard because I really have, I mean honestly have not made any money. My wife and I are trying to sell egg rolls and stuff on the side because my wifes Asian. She makes these handmade homemade egg rolls and so weve been trying to sell those on the side just to supplement, to be able to keep the lights on and all that stuff right now. Now again, it doesnt mean last month huge. As a matter of fact, hes a great, great friend of Caleb is Bryce McKinley. Hes a good friend of mine also here in Plano. Coach Sharpen, hes spoken all over stages and stuff as well. Caleb spoke at his event is where I met Caleb at. And he called last week or whatever and had 100 acres in McKinney. I had a buyer for it. I was going to make $125,000 commission on it. The deal fell apart and thats real estate, right? And so it was like I see a light at the end of the tunnel and then crash, boom. And so Im not saying things wont change, but right now, to be honest with you, at this point I couldnt even commit to more than a couple of month because I dont know where the money is coming from next month. Its just me hustling every day trying to figure it out. And its been that way for 20 years. Just imagine. And you know, because youre an entrepreneur as well, if you woke up every day unemployed and had to come up with six, seven grand a month just to cover your overhead and bills, its a different type of drive, right? It gives you a sense of urgency that most people just couldnt understand. And so Ive got it. Its just figuring it all out and putting these pieces together. I need a mentor, somebody thats done it. They could help me build this stuff out.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Im good. How are you doing?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Together. All right. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"McCasky. McCaskey.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Ive been commission only for 20 years. Yeah. And thats been my problem.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Its? It, are you there?","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Ive never been able to build a system because Im not super tech savvy, so Ive never been able to build my system and sell my coaching or sell programs or any of that, because I feel like Ive kind of been taken advantage of by all these brokerages. It used to be agents used to have to pay for coaching inside the brokerages. Now they switched it to where its like, well, youre a recruiter coach, and you get paid a small percentage off of what your agents produce. Well, the problem is, most agents dont do anything for the first six months, and we all know that. Anybody in real estate knows seven out of ten agents dont make it. So it seems like for the last three or four years, Im constantly I build a downline, and then people get six months under their belt, think they know what theyre doing and go explore somewhere else or whatever, or theyre out of business. Its been very tough. Its been hitting this financially.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Clearly, Corey. Youre a seller. You know how to sell. You know how to talk to people. You know your tonality, your cadence is everything. Im asking this for second time because Im trying to find the disconnect here. Why havent we done something? High ticket? I mean, you are a guy, Corey.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"It appreciate it if you talk to Caleb. Tell him I said, whats up? Hopefully he remembers me. Ill send him a picture.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, I can hear you now. Go ahead.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I actually responded to the text message. So Im not in a position right now where were actually scaling yet. Were still kind of juggling four or five different things and trying to make ends meet with all of those. But the reason that I liked commented all that stuff and started building it out and backed out was simply because Im not ready. But I know Caleb, and I know his dad, Matt, from years ago. Havent seen him in years. And so when he popped up on my feet, I was like, Caleb, thats why I reached out. But yeah, were at a point where my wife just came home full time in December. We are juggling a couple of different things and trying to figure out whats going to work and whats going to replace both of our incomes, kind of. Were not even at a point of scaling yet. Were at a point of I love that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]