[{"pageContent":"It takes me probably 20 minutes to fulfill to complete an order. So from the time that I see it, it takes me about 20 minutes to fulfill it. So I think around 45 a week gives her enough time to be able to knock all these out and still, of course, take care of our family.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I got my calculator. Im doing that. Plus.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, thats it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, maam.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Very new to this, so feel free to guide my mind if you need to.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, Ive been doing a lot of revamping of my website. I think the website navigation initially wasnt really conveying what we did, if that makes sense, because looking at the analytics, people were going to the landing page and then leaving. Right. So they werent going past that. So one of my buddys wife works in marketing. So last night we went and sat down. We kind of revamped the entire website to kind of immediately show what it is that we do. But I think that thats the problem right now is trying to convey to the customer what exactly it is we do, which I guess Im struggling with our learning is a better word right now, learning. But I do plan, so I have a few friends that are in photography and stuff like that. So I plan to make some short ads, very aesthetically pleasing ads, and put those up on social media and stuff like that, like TikTok, Instagram, and hopefully those will do a better job at conveying more than just like an Instagram ad that says fast, easy travel, click here. You know what I mean?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im doing good. How are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I do.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, its just right now its just me and her.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, Im there. Hold on a second. You got me doing public in the travel business.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"What state?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"787. 90.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I could imagine them being like, God damn it, this guys not fucking paying attention. Okay, were done here. Okay, cool. Anyway, yeah. If you guys are that good and theres that much value to learn from this and theres a feasible possibility. We can get to 45 clients a week. I think I can sit my ass down and take notes for an hour. Lets get real.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. So my introductory package is a basic package, which just gives you the basics for a trip to a place. Right. So itll figure out your budget, itll figure out your time frame, and itll tell you a really brief description of what youre going to go do. Example will be like, youre going to go to lunch? This is the place where youre going to lunch has a hyperlink to it, and you can expect to pay $45 right. On the silver package, or that ones $150, and then the next one is $200 for our middle package. Our middle package would kind of give you, okay, youre going to go to lunch at this place or this place. This place has this type of menu. This place has this type of vibe. You can expect to pay her on this type of money. Right. And then the $350 platinum package or pro package or whatever you want to call it, would kind of break that down into you can go here or here. This is a spot that locals tout and praise, and you really get immersed in the culture of the place. And this other place is kind of a touristy place. You can expect to pay this amount of money. Tip if you go to this place, make sure you order this. Theyre famous for it. Right? And then that ones 350.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Plus 16, plus 80. All right. Our annual income post tax is $215,000 a year.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Were extremely low debt as well, I think, in car loans for the two of us, I think we have $20,000 in debt for car loans, which is a very small payment a month, and then our mortgage is like, $2,500 a month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I have a three month old, actually, today she is three months old.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Donna okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"So right now, my day to day, I work kind of a kind of a unique job. I have a lot of free time right now, and then Im going to be on finish out the rest of my maternity leave for the next until mid to late June. So Im going to be pretty free that entire time other than, I guess putting the baby down for nap time and stuff.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Tomorrow.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Realistically, I think right now, I think my goal right now is to get to 45 clients a week. Thats my target right now. I just think before I can do that, me and my wife can do that. My wife can sit home and run this program and manage that amount of work. Right now, anything above that, Im probably going to have to start hiring people and really kind of expanding it as a business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah. And right now our ad spend, like I said, a few days into our ad spend today is like $18 per day. 15, Im guessing. I think no, last time I checked lets just say last time I checked, 11,800. 11,800 impressions and 260 clicks.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, for sure.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Hi. Who is this?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Lets see. So if we do 45 at our base, thats a week times four weeks at around 36,000 a month.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"What Ive got some friends in Kansas City.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I do have a little one. Shes perfect.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"What do you mean when you say at will?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Yeah. So I just started this business, I mean, literally this week, I finally got it up and running. But essentially what I do is I had so many friends, so Im prior military, and thats afforded me the luxury to be able to travel the world and see all this kind of cool stuff. And all the people that I talked to say that they would or they dont have the knowledge to feel comfortable doing something outside of their box and all that type of stuff. So what Ive been doing is Ive been working, matter of fact, to create essentially customized travel itineraries that are typically tailored to each individuals wants and needs. And we can do that. It doesnt matter where you want to go, doesnt matter when you want to go. It doesnt matter what kind of budget is. Our software can figure that out, of course, with your inputs, and then tailor a trip to meet your specific needs. So thats kind of what were doing. Like I said, I started at Thursday.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, for sure.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Um, well, so, like, in order to ask that question or in order to answer that question. Okay, so cash liquid that I have right now is the family has is around $170,000. It just depends on, I guess, what your guys success rate is like. Okay. If I spend $30,000 right now, can you almost guarantee we get to $45 a month? Then? When the hell? Yeah, Ill spend $40,000 right now. Thats kind of how.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im posting ads through Facebook, Instagram, and well, as like Google, SEO things, Im pretty sure, and were using Otis AI marketing for that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, sure.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Im in Central Standard Time. So Im in the Florida panhandle.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"For myself, solo, or my family?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, I do. So lets say they think this is a great idea. They think that Im a prime candidate for your guys services. What does that generally look like on the financial end for me?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, for sure.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Okay. All right, well, I cant wait.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, for sure. Like I said, a unique job, got nothing but time. Just chilling.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Florida.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Youll know, though business is cool, work is cool, but what we leave behind is our children. Right. And the more love that we can pour into them and the more influence I can have on their life, the better. Right. Because if Im not influencing them, someone else is 100% rather be me and my wife than some Joe Schmo down the block thats running the after school program a day.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I definitely can. That was you messaging me earlier, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No. You broke up a little bit, and you said its $100 cancellation just for.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"I have not, no.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I dont know if I received it in my email. I received a thing where it was like, Sign up, and I got halfway through it and it just quit working. Okay. And it got me to the point to where it wanted me to schedule, like, a meeting, but it never actually worked.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"The ultimate goal is to build a business that we can run that provides us the ability. So Im not trying to take over the travel world. Right. I dont want to run a multi billion dollar business. Thats not my goal. Right. I come from nothing, and I built a pretty damn good life for myself. But what I want is I want the thing that I value the most is my time. Right. So this gives me the ability to provide a service that I can essentially build wealth and value for my family with without it consuming every waking moment of my time. So thats my goal. My goal is to generate income in a quick and easy way for myself and my family and to take care of them, but to also be available for them and to be present with them, because I think thats more important than any amount of money, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So thats ultimately what my goal is, that 45 clients gives us a good work life balance. I think thats really my goal. And if I can scale it up more from there, thatll be something that we think about then, right? If I got the 45 clients a month, you couldnt find a happier dude, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, this is kind of my baby, but shes helping.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I will. Im not to head home to her right now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Correct. Yeah, thats probably the best way to put it.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"They can cancel the call if I ask a dumb question, essentially.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"You broke up and I didnt hear software. Okay.","metadata":{"fillerID":38,"fillerText":"Ummm yah","category":"F"}},{"pageContent":"Right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No. If they feel as if I havent utilized the video or watched the video, then they can cancel the call to save their time.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"She cannot.","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}}]