[{"pageContent":"Im referring to having people be able to talk to the businesses and resourceable people throughout the state of Alaska. And now we merge into the lower part of the United States for agricultural purposes and carbon. Like, we got a big deal going for the forest here. We have Congress here in Alaska, the last rainforest of his life in the world. We got some things that grown up to play that were going to be saving. Everything takes marketing and consulting. Everybody needs to be corralled eventually.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, that too, but how not to waste? They have everything here. I dont think that they should charge people for power. Im not sure. I guess down there. You guys have problems with what is it? The Colorado River, whatever river is dammed up across the United States, but the water source is supposed to be in jeopardy down there. And its like were jeopardized up here, too. We have all kinds of crazy things going on. Glaciers around, earthquakes and things. The water is poison. Were not that far from Japan, and were not that far.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, Ive been having some problems online, so Ive been trying to straighten that out. Actually. Thats what I was doing. I just got my mail. I finally got into an account that it was locked out of almost three years. So I got all my browsers set different.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Oh, yeah, I did.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, thats it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"They got everything to play with or all that beauty, but they dont want that. They want to sit on the surface and look into the phone. Another six months, well just hologram ourselves there. Thats what I say. We dont need a phone. And this state is like were the military state of the United States. We have the best technology for medical. We have everything new. I mean, theres such new stuff at hospitals half the time. Then traveling nurses dont even know what it is, how to use it. Its crazy. You would think that, oh, well, Canada has free health care, right? Well, up here in Alaska, they have that supposedly free health care for native people. Im native, part Native, too, and its not its designed after military. Its not its just part of the gig. Youre just enrolled. I mean, I dont know how you be in this city right now. Things are going to work crazy because the jets are escorting some erections out of Alaska borders lately. Its ridiculous. I dont like to think about that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"From where?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I can give you an idea. Have you seen that Gold Rush last game that they got out up on freaking Telegram? Somebody just launched that game and they got, like, gold pieces and they got crypto and I mean all of it to the hilt. And its like Im not so sure if I could get into my notes and shit that Ive kept off of the computer systems because we havent launched our game yet. Its been sitting on the table for a while. But, hey, Im in a hurry. I got to get that thing launched. And then the projection on it is up there, I would say, on that one plan, its like 5 million and the next year up there. So what Ive got going, Ive got Alaskan Toy Company and Son and sun stands for first of the north, but its where the grown ups play, like Elon. I actually got a company going on with him, too. Yeah. Sales is like I just got to do some delegations. I want to do some research on what you got going on and see what is your main objective there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I love New York. Id love to go to New York. I was envious of you. Yeah, its beautiful. What kind of weather you guys got today? Im curious.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You know what? See, the thing is, Im like a manufacturing one avenue, and then on the other one, Ive got agricultural where you need to get out there and go talk to people in the fishing industry everywhere. In marketing, definitely marketing is like, I havent looked at all your models, how you got stuff set up, but it would be neat. I cant wait for your emails to get in. Theyve just got a couple of things that stamp out the buyers on Friday. So the consulting, I mean, I get this team together. Theyre going to need it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"The resources that are in their backyard. I mean, people need to learn to live different. People are here stuck in their telephones. I mean, just bad down there. I think you should have game where you put your phones on the table and you open up everything and then pass them to the left every 15 minutes. See how much fun you could have. See how I can mess up your life. People cant do without the telephones. This is evolution of artificial intelligence. You guys probably dont even cant get a piece of wood in the city. You know what I mean? I dont know if thats true, but is it like that? Are you concrete sidewalks or not?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, sounds good.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I got to get some things done. And I enjoy talking to you.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah. Noise companies, like, where the grown ups play, do all kinds of stuff, like seed balls by drones. Make a competition out of that. We can plant stuff where up on the shore, where the cities I mean, the villages are washing away. Theres so much erosion. So theres a lot of different things in there. Theres a lot of work here. Just like Canada is screaming for the same thing. Theyre screaming for people to build. Theres a lot of work to be done, but since this pandemic, stay home will pay you happen. Nobody knows whats going on. Its a math now. Theyre victim everybody if they let, and they dont have jobs. Biggest homeless problem right now. Here in English. Its ridiculous. So what do we do? Hey, 20,000 Ukrainians. Come on, take it. It doesnt make sense, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Have a good day. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, cool. Good. Yeah, let me check it out. Im like sucking up and all, just for sure. Anything? Yeah, I was going to come down there if somebody invited me down there, one of my employees for training with drones for, like, a year. I wish I would have done it, but you should see the footage they have up here down in Alaska. You can get on YouTube in Alaska from above. Look it up. Its beautiful. Theyre just flying over the lakes and the rivers. You dont even have to come here to see how gorgeous it is. Something be said about that, right? Where youre at? Your bunch? Yeah, for sure. And thats a big market. And a lot of people need training in that, too. Were just changing so fast. I cant believe for what Ive seen even in my lifetime. Probably you, too. No still sighting, but Ill get her let you go. Yeah, shoot that to me.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"And to the people I know, that kind of seems like thats a business sort, but I pick an education and teaching in school, and thats the same basic format that everybody learns by. You know what I mean? And you got to be able to know how to do that. Just get your stuff straight. People should run their lives like a business. They do better. They really would. And what kind of models do you have for marketing, consulting? Are you teaching or youre just, you know yeah. Pipeline.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Theres a lot of avenues I have nailed down. Ive got a big business plan. Its just theres a lot of stuff going through my head right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, up here were trying to teach them and we need to stop. What were doing is saving carbon and what stuff that we do have to tear up. We can be upcycled and recycled. We have a lot of stuff here in Alaska that people dont realize as far as we have a lot of food here people dont know that we have. But if they think people dont stop making plastic and fucking around here, were just not going to do it. Thats got to be the tail end part of anybodys business, I believe, is you got to be able to have some carbon credits and if thats what youre going to go out there and sell in order to get to your business, whether youre making toilet paper, youre cutting down trees, making houses, it doesnt matter. Its got to be done. Its got to be learn how to deal with it. If they dont, then its over, and thats where everybody is. Theres a consulting as far as we have. The major epidemic of opiates is right here in Alaska. And our problem here is that this state likes to treat everybody like criminals and thats nobody even in the United States. We imprison more people in the United States than anywhere in the world. They have to make some shifts and change for people to get in there and help. I like to do it in a fun way that it helps people not just putting somebody at the bottom of the pile. They got to work their way up. Thats going to stop. What happens if the dollar does crash, you know what I mean? What do you live at?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]