[{"pageContent":"I dont want to convert. I know that thats one of the most important things. Right. To sell. Im learning that. I know that you have to do it. You have to sell. So I dont know. I know that there are administrative tasks that you have to do. You have to measure whats working, whats not. You have to organize the calls, answer calls, guide people, blah, blah, blah. The payments. I have a couple of software to track for payment or for funnels, but none of that is finished yet. So what are you offering?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I could be in my presence online. I could do the course. I could do webinars or lives or things like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Is your relationship with them? Because.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I am trying to replace my income.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So Im basically in the beginning stages of this. I do real estate, so Im kind of deciding if Im going to go genuine real estate or sort of a coaching kind of course creation for women that I want to do and go online and all that. And Ive been procrastinating. It also has to do with finance, education, so its an online business. So Im kind of I know that Chat GPT is a big thing right now with helping people create what theyre going to create for advertisement, et cetera, but Im very new to everything.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right? None of us. Fine.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, Im working on my credit score, but I also tried to build business credit at the same time.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Eastern.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, I have to start creating a list right. So I dont have that yet. By offering something for free, getting out there. I havent started, but I have an idea. Yeah?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah. Just to be transparent, I just feel like I dont know if it will be a little premature for me to think about getting that kind of help since I dont have my course created yet.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, theyll get me organized. Theyll take care of the present demands because I am spread out in so somebody that has high energy and is able to communicate to the customer with empathy to the customer. Right. That the customer doesnt feel like theyre being manipulated, but mostly that they are going to be gaining something by associating with me, getting the course, whatever. I want to provide a real value. So I want that person to transmit that and not come across as not caring for the person. It has to be more energetic than me. It has to be a person that doesnt need to be told how many calls. Give me a report. But I dont need to push you. You should be reporting whats going on. I dont know. Am I communicating? Well I dont know. I havent had this employee yet. But thats basically somebody I could count on that is going to help me put my business a little bit more automatic and I could dedicate to making the offer and creating more value.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hi.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I appreciate you right now.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No, I understand the automation. I just wanted to give you feedback because with this message, I wouldnt have called you back just because it says, do you see this? And then a question mark. But it doesnt show me anything else. It doesnt tell me whos calling. I probably wouldnt have clicked on a link, but if I know that I already asked for more information from Air AI, I would have. So what Im trying to tell you is that the first message that I got from the automation was, do you see this? And then the second message was the question mark. And then later on then you send me something that says jump, bumping this up for you. Are you looking to scale using AI? Then I have a better idea whos talking? And then you say its. Alex. Yeah, that one at the bottom. Okay. I mean, thats the one you just sent me, so obviously thats clear, but the automations are not. You may want to take a look.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, I dont want to do everything.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"03:00.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, you know what you wrote me before, but you didnt say much. You say, do you see this? And a question mark. But theres nothing to see, Im just.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Things like that, right? Yeah. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, I dont know. Originally, Ive been in the lookout for something that would give me freedom, right. For my family to do what matters. But then, as I am learning, I see a bunch of people stuck in that routine with no hope of getting out. So if I could share a little bit of that, thats one end of it. The financial, unfortunately, financial have to be there, but at the same time, initially it was women, but then later on, I know that I understand the Latino culture a little bit more maybe or maybe not. But I know the difference between, for example, people in the US. And people in other countries. I dont know if Im going to be able to break through. Because culture, if people dont have an open mind, they are not going to change. Right? But the ones that do want to change, the ones that are looking, the ones that are looking, the ones that feel trapped and they dont have answers, the ones that are proactive. Im looking for women that are powerful, meaning not the one that is okay with the system, but the one that is looking. But she doesnt have the answers. Its a young mother, maybe, or a young wife that has been imposed. Things that she rules that she feels Im not okay, but she doesnt know where to look for the right things for her. And she just keeps going because shes strong, but still wondering, what can I do different? Having better family life, better relationships, enjoying life more. I mean, its only one life after all. Feeling pretty, feeling appreciated, all those things.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It does, yes.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Personal power. Women, especially, if I subset it to the Latino community, we spend a lot of time catering to others, but we kind of forget a little bit of self care and growing on our own. And many things are confusing because you handling too many things. Too many things are expected of you. Kind of guide people a little bit, things that I wish I knew when I was 20 years old, 30 years old.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Monthly? Hopefully 10,000 at least to start.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, one of the recommendations is to do a free summit or a free challenge. Right. So I could start with the people I know, but I could also borrow list from other people as experts and sell the summit, et cetera. And they advertise my program to their people, too, but I havent done it. I couldnt tell you more than that. The other thing is just to do social media and start doing something on Instagram and doing TikTok, those things I have in mind to do.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"When you asked me before what kind of person I would like in my sales team is somebody like you because you care for the other person. Its not about being excited about your product and trying to just convince somebody, just for the sake of it, youre interested in the other person. Thats fantastic.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sure. Thatd be Saturday afternoon sometime.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"$100 cancellation fee? How do you do that?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No. At the beginning Im willing to see working for me, but then hire somebody as soon as I can.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Good night. You take care.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"155.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"What made you made me pivot? Well, just to desire to help other people in certain areas, because Ive been learning a lot throughout the years, so I want to make money helping other people. I decided I dont have to hold a job that somebody else is the boss. I want to be my own boss. I still work and getting a little older, so I want to just do it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So Ill be, like, swamp for a few days there, so dont do it too quickly.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im fine, thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"What does that mean? Yeah, I appreciate that. Obviously, were scheduling something. You should be responsible. But what does that mean exactly?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Likewise. Thank you.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Thats what sales really is. Because you believe in the value of what youre selling. Right? What it becomes about work is when people are just trying to push something down your throat, and its not for their benefit. Its for yours only. But the way you talk, thats what I mean by sales. Im learning that sales is not a bad work. Are you there?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right so far I do feel like you are a good company. I do want to learn more about your company before taking any decision.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure. Yeah, that makes sense.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, thank you.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, its been a pleasure talking to you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"It sounds very interesting. Yes.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So the thing is that Ive been spending money in trainings and in tools. Right. I would say right now I have 5000. I think I could have probably 1520. But I dont want to also, like you, Im doing due diligence. I dont want to jump the gun because I am not ready to advertise yet. So Im trying to figure out my first steps. I was just curious because Ive been exposed to chat TBT and talking about AI and I just want to know how to plan next. What a plan?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I am a realtor part time, and Im also an investor, but my main career is the pharmacist in the pharmaceutical industry. Okay. The real estate Im talking about is investing. So Ill do it anyway this year, but I have to have some income coming in before I take advantage of some opportunities. Sure.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, actually. No.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"You want to do it that quickly, you cannot do it in a week, maybe next Saturday.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Youre so good.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, only about 600.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]