[{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Whats a monthly price for someone like.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"My one business was acquired. I have a new I have a book coming out. I have my own thing, but I have a few startups Ive invested in, but one of my bigger ones, Ill be taking on head of Growth until we have everything.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im sorry, what?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Yeah, its all green, its all solar. And were working with the CEO of Nissan and with big tech companies. Were in conversation with Tesla right now. Were looking at working with them for this next product. Were coming out with B to C. We have some pretty phenomenal people and influencers that already were building special ones to launch.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats why everythings referral based. And I dont do commission work. Everybody has a retainer.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im in the middle of an email. Let me see. 1 second.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"What was the company is called Aero Build. And then its launching. The first one was very popular, and the second one were launching the B to C, the straight to consumer.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It is a special trailer where we build out for coffee shops. How they have trailers on the street.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I can be on both because I have myself and I have clients. Lets ask this. What is exactly youre selling your system wise for AI?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Got it.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Im not sure, but I really dont have time to talk about this right now. Im going to go through your information. Ill give you a call back if Im interested. Okay.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, I would never go that route.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, Im on the board.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Guys havent Im just trying very direct, and I come off very dry sometimes.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Ive hated HubSpot.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"I have a fund and I have a publishing company, and all of our advertisers are clients, and then theyre referral based. Were a high ticket. Were not a typical marketing agency, and Im not looking to be one.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, got it.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I did, and I need to go through it. I hadnt even gotten that yet before I got your call.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, Im not a big fan of HubSpot.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Its kind of a gold mine that I came across, long story short, but we havent done a lot of marketing because its a very niche. Its not like when you think of a trailer like a white trash lets go on. Its a very specific niche brand, and were going the very niche route. But I dont really love HubSpot, so Ive been just clicking around. I came across an ad, and AI is changing everything and just trying to kind of play with different things to find out what is going on because it seems to be a new AI system every week.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Good, how are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I just got it.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yes. I just reshank, and I have not received it yet.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, I have a book launching, and I have a new website were building for myself.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I kept ownership a part of it.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Well, no, we havent run ads. I dont want to run ads. Why not? Well, first off, Ive run ads for a lot of companies, for clients, and I would be interested if you guys ran ads for maybe this company that Im working with. If you guys do ads and youre good at it, but if its only for agencies, then it wouldnt be good for me.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im an old school person, I guess, and as much as Ive learned about AI, Im just not into this hype of trying to find the best. Im like Im going to find somebody whos really good in studying all this and then just work with them and give them work and provide them with basically Ill provide them with more work because I dont have time to be testing all these AI systems. I really dont.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, Ive owned a consulting firm for ten years. My one was acquired right after the Pandemic. The pandemic. Some people would say their business was slow. My business was absolutely absurd. I positioned. I was acquired. I have other things going on. But I just invested in a pretty phenomenal big startup company, and Im going to be pretty much the head of growth and running pretty much everything. Because theyre two owners, and one is in finance, and the other is running the company. Its called aero build. And were just launching the second company, coast. And we had dealing with all the marketing and building the sales and making sure this investment goes okay for myself. And theyre based out of Nashville. And so Ive been looking into a lot of things because I really hate HubSpot. Ive always hated HubSpot for the different startups I invest in.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"But whats pricing look like for someone like you?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, it started with crisis management, and somehow because of my age, I got into digital marketing and social media and all of that. But Im pretty known for overall consulting, crisis management, but we became a digital marketing agency as well. Okay.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Now, I promise I wont spam you.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Just coaching. Yeah, its going to go into an agency.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right now, I dont have time to have this conversation, so Im going to have to get back to you. Let me look at your case study, see where you guys are at, and then I will get back to you. Okay? Thank you.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I got madeline, I got a text from you. I did not get the case study.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Partner of mine have a fund and on the side of working with our investments and all that, once youre kind of in the agency world and in that, you get really bored because youre just so used to always doing something.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Some growth agencies, theyre like, sure, well do it commission wise because people are so hesitant with certain agencies. Right. Theres a lot of agencies that are now starting to go the commission route where unless they provide leads or they provide certain things, theres commission.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]