[{"pageContent":"The AI should take your voice and just copy it and go from there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"That I would like to get?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, thats the same with us. We dont put a number until we see that youre effective as well.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I would say $300,000 monthly revenue.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No problem.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Are you an AI?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, sure. But I think I should first see your demo so I can convince her as well.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, theyre always there. What we do is we try to book a call and the first objective is to get a demo. But physically, right. We do a cold call per se. And we have our steps because we use grand cardone system, which is really effective. So it takes in consideration all the objections and all of that. I mean, we can probably mirror the AI you have towards grant Cardones teachings that we have so that it could do the same thing, but faster. We can feel it with all the objections, et cetera, et cetera.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its www.termlineenterprises.com. And there you can see what we do. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, we have four sales guys. I think we get one each a day. Were slow.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Good, and you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. So we want to scale up and we want to I was interested in your AI, that book yeah. So it says, Prove it. Ten calls a day. Well, thats why were talking.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, because saw that you can book calls really easy.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"In order to do that, you have to have a target niche, and you have to ask me a lot of questions. I think the leads, where were getting them from, what are the titles by these coding machines and all of that. Were supposed to give you the leads and the phones and you book them, or you supply the leads as well?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"ThatS more than 50%. Yeah, no, thats less than 50%. Thats what I was talking about.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Well, if we see that the demo works, I dont know, we can probably put a percentage of our growth towards that. Lets say Im invoicing 300 and youre going to make me invoice another 300, then 300, you know that Im going to make about 180 in pure profit. So we can put percentage of that towards you.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, a goal is to double the business in one year. So if Im invoicing 4 million a year, I want to invoice eight.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Now were going to say yes, Im an AI.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Dont know. But my partner, we have an excellent credit score as far as the company, and the company is in her name, so she has excellent credit. And just to put it this way, we dont get loans. Weve been growing with our own money. We have American platinum cards and I mean, financially were very well.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Cannot say because I havent seen your system. If your system is 1% or 2%, depending on the percentage of effectiveness of your system, if your system gets 100 people, but it makes us call 100 people and we only close five. Then Ill put 5% of that. Whatever makes me close, I would put that percentage towards your so let me ask you a question. What are you usually asked for?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah. We sell coding and marking systems. Everything in any industry is coded or marked with a date code or the time it was produced. If you see the Coca Cola bottles, you see the coating right on the date they were bottled, for example. So imagine everything you have, you hold in your hand that can be coded. We have three brands, and were the master distributor of Sojet brand in the US. And also the El Reid brand, the German brand in the US. And Mexico. And another brand, which is a link stand. Its British. So we have these equipments we sell to the food industry, to the pharmaceutical, to the automotive industry, all the industries that use marketing. Right. Were selling them directly to all the processors of food. And also were looking for distributors in the US. They already sell their equipment, so we have distributors, so they sell our coders as well. I can give you my website so you can check it out.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, I would say 40% of that.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Because I was like, hey, man, its wonderful. I dont know if theyre going to ask you that question before, but I had to ask.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I do, I do about 100 and 8180 thousand. Yeah.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Okay. We have different prices for distributors and different prices for end users. But were talking about printers are between $2000 to $12,000.01 2000 to 12,000. Yeah.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Thats what I was saying. We invoice 4 million and about 1.8 is after all our cost, thats where our income is.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"We want to double our business. I dont know if you can. We want to get into more demos with our target market so that we sell them more printers, either distributors or end users. So I dont know if I would get just two demos a day, lets say, for one of the sales guys, thats what, ten demos a week? Thats substantially a lot more than were doing now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, not yet. I think let me see. Let me check just a second. Dollars? Not yet.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Let me ask you a question.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"What would they do? Well, thatll be great because well hire more guys that do the demos, and you guys just focus on the calls, get the demos.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Our what, sorry?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}}]