[{"pageContent":"Up, of course, yeah, I got to do it. I dont have to do it, but thats the direction Im going in. So if theres synergy between some of what you offer yeah, Id certainly be interested.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats right, Nick. Right.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Depends on which work stream were talking about. So Ive been working with some others, and part of what Ive been doing is around health and wellness and trying to touch a different demographic of individuals that might actually benefit from getting supports in health and wellness, actually for some of the younger professionals and people, starts at the phone level. So I was looking to automate sort of intake processes that actually could use branching technology to drive solutions to different people when it comes to the area of health and wellness and mental health, things like that, that type of thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. Okay. I havent got into the group the group engagements and all that kind of stuff. Im sorry. Im going to have to roll off the phone, Nick. But again, Id be happy to have that discussion at another time. I have to go to my next meeting. Im so sorry.","metadata":{"fillerID":39,"fillerText":"Yeah","category":"F"}},{"pageContent":"Health and Human Services. So were talking about housing for people who dont have homes. Were talking about community development. Were talking about all types of things that help improve peoples lives.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I think you said it. I think right now, where our country is after everything has happened, you got a lot of people thats isolated. I seek purpose related effort. I dont just do it just to fulfill the pockets. This is, I think, an area of need thats been clearly expressed to me. So thats why I think its important to focus on right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That was per week.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Youre advertising at the moment. Ive been interested in AI and looking for solutions for my organization, my job. And thats the driver at the moment.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Nick, youre asking a lot of great questions, but I just havent had a chance to wrap my mind around all of it right now. Is there a chance for us to pick this up when Im able to engage a little bit more into this discussion? Is it possible?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"So thats the big picture for where Id like to go.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, Im looking at consulting around general technology practices and services, but also how to not just responsibly but smartly implement AI based on the different types of projects were working on. Thats where I want to go with AI if possible.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Id have to check. I havent even had a chance to wrap my mind around it yet, Nick.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, these are services, so you can call that profit. Yes. Except for maybe just office overhead and things like that and R and D. But yeah. Most of this is people services now that were talking about.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello. Can I help you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Actually, John, Im in Eastern Time, and I cant talk for the next week and a half. So I cant tell you how overwhelmed I am right now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"ThatS why I said I dont have to do it. Im just intending to do it regardless. Thats what I meant.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"United Way.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Take care.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So thats part of the inquiry into AI. Again, how do I engage more customers? Using an efficiency model that can be even scaled better by AI is the question that I have. And were still kicking it around. Ive got some experts. So Ive got coaches in the health and wellness industry or area. Ive got content developers. I also have technologists, and I have credited licensed therapists that are part of this. Okay.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im plugged into this nonprofit. I also am looking at doing some other types of consulting that are more generalized around technology and how to apply AI types of things. Okay.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its been more of a formal effort with the university as well as now working with clinicians that might want to partner. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right now? You asked me great questions. I havent had a chance to think through it all off the top of my head. With the therapists that are working together, lets just say weve got six appointments per day. Per therapist do it times five. Youre talking about 30 per day week. So maybe what if youre talking about 30 per day. 150. Sorry.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I need a minute to breathe. I dont know whether youre reading distress. I need a minute to breathe. But if youd like to send something over, I can read it, and then maybe in a week and a half we can see if theres a chance for us to connect. Thats what Id like to do. But I do appreciate this call, I really do.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, it is. And I started that with Georgetown University.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I just havent had a chance to get back to that. Everyday work and stuff has just gotten to my schedule.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, it varies. One of the things I havent yet had a chance to do is really sort of double down in that area just because Ive got the day gig and all that kind of stuff. But so Id like to grow out. If youre talking about the partners that are looking to work together on this, I guess you could say revenue looks like probably between 100 and 200,000 so far on the therapeutic side. Okay.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, so what Im hoping to set up is a conglomerate of consultants that could range right now, were not even thinking about international, but have national pinnacles across the country. For me, you just used a number that I hadnt thought about. Im being realistic. Whats that? Well, you just talked about 100 million, and I hadnt even thought about that level of impact. But certainly Im just going to be honest with you, up to 10 million is where we were looking at.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"How are you doing, man?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Not advertising. I work in nonprofit more so how to use AI to engage with constituents that have passion around the work that we do is what I was interested in doing.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, unfortunately its yearly because I just havent had a lot of energy or time to put behind it. But Im hoping that will change, setting up some goals for this next year. So its a formative time for me next year.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Im trying to get there ahead.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Do you have a process? Its not that I want to put a cap on revenue and positive income. Its just thats where Ive been.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, Nick. Thanks so much. I appreciate your time.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So, again, we want to engage people in the work that we do. And so finding AI seems like it could be a great opportunity for us to employ systems that can help make the effort of engagement more targeted, but also more impactful and get to a wider swath of people who are interested in who are aligned with what we do.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, that was per week. Okay.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Yeah. So were doing a lot of word of mouth. Were working through the school system. We are also activating formal methods. This is not where I want to go, but this is where we are right now. Just to be honest. Youve got healthcare industry. So Kaiser Permanente, we subscribe counselors and consultants with them. And because they are then linked into patients that need the service then based on an hourly pay scale, we would then be brought on by Kaiser to provide that consultation and therapy in wellness health and wellness and coaching and all that kind of stuff. Weve also got people that are court mandated to have mental health care services, and thats where we deploy more of the licensed folks, even the social workers that actually dedicate their time to court mandated counseling and coaching. So thats the other part. And then the third part is public. So we work with a number of churches that actually has some synergy right around health and wellness. For us, it works because weve got some churches that are community centered, not just compartmentalized in their own faith, but wanting to connect into communities at large. Were leveraging on all of those levels, and were having sessions with groups. Weve got Mental Health Wednesdays where we actually are engaging in the community, and that leads into opportunities. So everything is people based. Its not as much where I want to go, which is leveraging the technology to engage with people who are not really as present in the channels that were using. So youre talking about kids that have their heads in phones all day. I would love to leverage things like AI to automate avatars that would engage with people who are using phones as the first point of intake. That then could branch them through something to where we make a recommendation for them thats either giving them information that they can read or thats either recommending them out to a coach that would do health and wellness with them or somebody thats even based on what the need is. That automated branching, starting with a real sort of avatar. Im just using the avatar as a placeholder, but a persona that actually would engage from a virtual standpoint with people who are engaging with digital is, to me, so smart relative to engaging people who actually dont reach out. To other people easily, which is becoming many more of our youth today are not engaging in the ways that one did, like, 15 years ago.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]