[{"pageContent":"That is what were working on.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, definitely. Can I get your name? Whats your name again?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, so I know my credit score. My credit score has fluctuating and things like that. Its normally good, its always good in the green and things like that. Yeah, definitely. Funding and capital is one thing that is needed for where Im at. So as far as that goes, yeah, its building. Im roughly fair 650 as far as credit score.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right. Carly actually a student, you know what I mean? Yeah. So its kind of work in progress as far as more out in the future, wanting to get it lifted off, you know what Im saying? And things like that off the ground, jump started. Okay, what is that now? Its basically just getting my ducks and row as far as different software and resources and things like that. Thats why right, okay.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"You dont mind me asking, is this a particular program? So what is the investment just off tops as far as what Ill be looking at expense wise? Yeah.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Oh, its going pretty good. How about yourself?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, definitely interested. I have started the beginning stages of cultivating my business online, brand and everything. So I know AI definitely is booming then. Booming. So yeah, definitely a good opportunity to come across absolutely five different tools if Im sorry.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"A what?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"So its a brand specifically and Kings Incorporated. So its actually I have worked through a variety of different things. So right now I just have my website and everything potentially looking to first and foremost kind of just getting my content and everything out there to kind of get the ball rolling and things started and eventually growing. And as far as educating people more so everything like spirituality, health and wellness, mental health, you know what Im saying? And things like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, you too. Thank you. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes. Who am I speaking with?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"You said, do I see a way that I can yeah.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Yeah, so its pretty much everything intertwining of mindset, mental health like spirituality, mix like health and wellness and actual fitness and intertwined kind of spirituality and things like that. So I got my own spin on and things like that. But yeah, potentially getting one to get a group of specific email lists and specific clients and actually coach and help people with their everyday physical fitness, health, wellness, things like that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, I think the structure is whats the structure of it all, how exactly I want to structure it, you know what I mean? As far as implementing health and wellness, intertwined with the mental health side of things, a specific course, a couple of courses, you know what I mean? With some ebook content that I know I can structure as far as making it packaged together so it can be, you know what I mean, offered around that price, because I definitely would want to look upwards of that, for sure. 100%. Yeah. It just comes down to getting it all structured together and packaged, like you said. Got it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"You definitely I appreciate it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes, exactly. So three things as far as health and wellness and pretty much that avenue.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Jackson, okay. Yeah, for sure.","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}},{"pageContent":"Yeah, 100%, I definitely have and definitely on the table. And as far as credit goes, I know with this specific credit line I have open, literally, I just pay the balance down a couple of, probably shoot my score up like 80 points.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. Yeah. So as far as, like I was saying, being in the beginning stages and things like that, utilizing different software, Im just wanting to because I know youre saying this is specifically coaching and consulting. So does it essentially kind of automate your clients and things like that built around your business and your list of clients and things like that? Is that kind of how this particular yeah, absolutely.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"It was just like a few thousand dollars, you know what I mean? Because it was a job outside of school, everything like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, well, Im still in the process of building my email list and actually getting to that point. So this was an opportunity, you know what Im saying? That I came across that as a resource, you know what I mean? I looked into it a little bit. As far as the success behind, is this the main specific person thats behind it all, or is this a team member that Im speaking with?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, so my main goal is definitely to help people, you know what I mean? I have desire to help people and so I know as far as my process is kind of working the evolution of it, Im looking to have just kind of think of a specific realm of people, you know what I mean? Clients and putting a specific number on it. I know business wise, I know its probably something that you want to have planned and things like that, but as far as the overall business, if Im able to assist people, thousands of people, tens of thousands, you know what I mean? Obviously Im probably looking at the brand 1020 month and things like that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right here and there Ive had jobs and things like that, so definitely have tax forms and things like that. W two and then a couple of jobs. But as far as that set annual salary, Ive been a student and had a couple of jobs.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. So as far as looking to officialize, my LLC, and I know that you can potentially get access to business credit and funding and things like that, thats kind of my goal for now. Thats my goal for now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Single.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}}]