[{"pageContent":"Up front as a return for the ideal customer Im talking about?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Net to us, yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, you said about AI and it sounded like it seemed like it was like a text program that youre doing or something like autoresponders and set up appointments automatically. I have four people that are working full time for me doing telemarketing to find out, to look for qualified customers. For us, we process catalytic converters. And so were looking at junkyards towing companies and muffler shops. And so once we identify them, we try to set up appointments with them. Do live calls. We do video calls in the lab so I can show them what the process is and kind of explain it. So, the fact that you said you had this automated system, I thought, well, lets see if theres a way we can incorporate in our business to speed up the appointment setting and closing your customers.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"That sounds good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Internally for our net gross, if you would. Id like to be doing 1200 pounds a day, which is two drums of material process which comes out to I think its like 12,000.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Okay, and how does that work? Youre helping them land the customers, they provide the leads, your AI looks for the leads, or how does that work?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"What exactly is okay, so I have some girls in the Philippines that are doing it. I started off using a company and then I basically just hired the one girl directly and then she hired three other people for me. So I bought some auto dialers. They call them seats with ready mode where theyre CRMs and auto dialers. Dial 15 numbers at a time, connect you and then drop the other ones. Then you could do lead management. So theyre using that. So I can track the number of dials. I can track the number of leads I can see. So I got four seats, Im sorry, three on that and another CRM. So theyre doing that 40 hours a week. Theyre generating me appointments, actual appointments. Were doing probably today, they got me six. And it was a slow day, so were probably averaging about 40 appointments now. It doesnt mean they all stick. So the appointments are video calls or phone calls. After they receive our mailings and our emails, they scrub the list. So thats what were doing now, and I want to increase that and increase the likelihood of them keeping the appointment. So with this AI thing, once we have the number, itll automatically send some of the videos that we want to send or automatically send the appointment reminder. Im looking forward to talking to you tomorrow to help these appointments stick. Anything to increase the effectiveness of the phone calls following through before, obviously they ship, and I get them as a customer for them to try us. Its a phone call. There has to be at least a phone call or a video call, and then it splits. It becomes a customer. Or they decide they dont want to do it, whatever, but I have to get to the phone call.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No problem.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"This is Chris. Can I help you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"You, too. Take care.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"All across the country. So I got guys shipping to me from California, my biggest customers out of Texas. So actually, ironically, I dont do a whole lot locally. I dont know why. My closest customer actually thats local, like an hour and a half away in New Jersey. Big junkyard. I just landed. So its a national marketing effort. Theyre dialing on, like, the lead list that I bought. Id have to check with my girl. I think were up to probably around 50,000, and were going to add another seven and a half thousand to that. So I think thats what were up to. Our initial list was like 30,000, I believe. Then I added 15,000 or seven and a half thousand. Now were going to add another 7000. So thats what were.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So we process them. We shear them in half we get the catalyst outside out of the converters, then we mill them and screen them. And then we acid digest and run them through a machine for identifying the amount of platinum, platium and rhodium are in it in the material. And then we pay them based upon the content value and their volume. So if theyre doing 1000 pounds or if theyre doing 25 pounds or anywhere in between, we have payouts based upon their volume. And then we hedge the price, basically sell the metal and pay them. So were like a toll processor, if you would.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Whats that? Yeah. So $26,000 a year divided by twelve, I think it was more. $2,100 would be my return on 100 converters that we do at a time. So if theyre doing that monthly, then thats what Id be looking at as a return. I get that if they ship to me, well, from the time I get it, it takes us seven days to turn it and pay them back. We get 75%. We pay out 75% on Tuesday after we process and hedge on Monday. And then if theyre over 100 and we pay the shipping, then the other 25% is paid within 21 days when you smelting stuff. So I figured, like 2500. To give you an example, I got the guy from Texas, he shipped me one pallet of like, 135 to start off with, and then the next week he sent me two, the next week he sent me three. And now hes averaging three pallets, like, close to 400 a week.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, my goal is to do net again, 85% or less is our payout. So majority of the dollars that I deal in dont stick with us. They go to the customer.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont know if it was a case study. There was a girl that was doing, like, a testimonial, but I dont know if that was part of the ad that I saw or what that was.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"The problem I got with that, maybe theres something else we could do along that line, depending on how you do it. The problem is it takes 350 to 400,000 minimum to get set up to do this, and thats doing it on the cheap. And thats not including all your marketing expense and everything else. So were a building like, I already had the building. The building is available to use. So its not something that even though I describe what we do, it sounds really easy. Its a little loaded on the front end, and its not something that youre going to get banks to loan on because its a high risk business. Right. So teaching them how to do the whole lab work and all the processing is I know that thats not real feasible, but on the other hand, I dont know if theres a portion of this I dont know how you do. What you do with your AI is the small guys, I show them how to decan themselves. If theyre doing 25 to 50 converters and the shipping is high, we show them how to decan and ship in less expensively. So what did you say your sweet spot was? Per customer? I didnt quite get that.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"It can be three times that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"To be honest, I dont know if I did or not.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"And weve only been doing this a year so far from that number, were doing about one drum a week and the projections that I just gave you is two drums a day. But weve only been doing this for a year and were just scaling the marketing now. We really werent pushing the advertising the first year. We were kind of getting our stride as far as how everything would work because its a new business venture for us, building our list.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"All right. Bye.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Thats the whole sorting process that were doing in the telemarketing card. Weve got 5000 qualified leads that weve already sorted that theyre qualified, but most of them have hung up and said were not interested. But the truth is when they say theyre not interested, the girls have and heres the thing, two of them have a little bit of a strong accent and two of them dont have as much of a strong accent. So I listen to the calls when they say theyre not interested. Normally the girls didnt even get the information out to even give them a chance to be interested because they think we just buy by code like everybody else and they got a guy and theyre fine with that and they dont realize theyre losing 20% to 30%. So to be fair, they dont have enough information to really make a decision that theyre not interested in what we do.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont deal singlely in converters, so more easily, the average customer I could tell you the average customer that Im looking for that Im targeting, what my return would be roughly on the customer for annually.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Well, that number I gave you.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Through a list service company. So USA, they gave me I bought the lead, the list from them, and then the girls are going through and calling all them because a high percentage of them are not our potential customers. Just because theyre a towing company doesnt mean sell them. And just because theyre a junkyard doesnt mean that they take in cars. So they got to clean the list to find out if theyre actually a possible candidate. And then once they find out that they do deal in junk cars, they do deal in catalytic converters, then theyre a qualified lead. But theyre not a hot lead because it might say, yeah, we do that. And then when the girls say, well we do, is we process the catalyst and the converters to get you paid 20% to 30% more. And they say, no, were not interested. We got a guy pooh them, they hang up. Okay, they dont think theyre interested at this point, but theyre still qualified. So were going to pursue them but we just dont know how many they do. And we know theyre not interested at this point, but thats fine. But at least Im not wasting money mailing out to these companies that dont do it at all. So they may eliminate in the course of the day, they may only get me one to four leads a day per telemarketer, but they also will eliminate maybe 75 that are not a candidate and say, no, we dont deal in junk cars, no, we dont do that at all. So we just get them off the list as non qualified, and then while they might only have, like I said, one to three leads or four leads that say, yeah, they want to talk to me, and they set up a phone appointment. While they have them on the phone, they might have another 35 that say, yeah, we do do it. Go ahead and send me some information. Im not willing to set an appointment now, but can we email you information? We couldnt set it out a hot lead only because they told us, hey, we do 50 converters a month, heres our email, go ahead and send us information and look at it. But were not ready to set up a phone appointment at this point.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Give me a second. Ill look at it. So the customers that Im going after, its a loaded question, because I got customers that sell 2000. I shouldnt say I have customers. I have candidates that sell 2000, 3000 in a month, and I got ones that sell 25 in a month. But the ones Im really targeting, that is kind of my sweet spot. Dont get me wrong. I love to get the ones that sell 2000, 3000 a month. But my sweet spot spot is if theyre doing like, 100 a month, give me a second. Ill tell you what that looks like times. So my the ones Im targeting just that its 100 converters or more, thats like $2236 a month times 1220, $6,000 a year. In other words, the ones Im going after that Im sorting. Not that I dont send information in mail to the ones that say we do 50 converters or 25 converters at a time, but at that point, that doesnt excite me. Its okay, and well take it. But I really am targeting I got, like, 76 right now that are hot leads that do 100 or more a month. And some of those on that board would do 500 pieces a month or 1000 pieces a month. But they got to do 100 or more at a time. And sometimes that doesnt mean its every month. Sometimes thats every two months. But at 100 pieces a month, I pay the shipping. So its really a sweet spot for them and for me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"What would the marketing do?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"So about weeks were going to have to downtime three and a half million.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, I appreciate your honesty. If you dont see how its going to work, I appreciate it not trying to sell me on trying something you dont feel is going to work.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Well, the marketing is the key really. The business, 50% of the business being in a new venture is marketing and the other 50% is the process, the service end of it. Both of them are equally important. Were not going to have the customers.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, the so Im not really exactly sure how it works. I want to get some information on you and see if its something that we would consider using and how we could implement it.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Good, how are you doing?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Let me just run the numbers real quick. Ill tell you of this. 15,000 a day times 693 thousand a week. Yeah.","metadata":{"fillerID":7,"fillerText":"Yah totally","category":"A"}},{"pageContent":"All right, buddy. Well, thank you so much for calling me. I appreciate your time.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"On one catalytic converter?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}}]