[{"pageContent":"Street from Russell. Thats a nice day today. Two days in a row of 70 plus.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Actually, its a four way thing. So we went and got a doctor. Actually, a doctor just bought in. But these two guys, its all four of our things. We went and made it a little LLC. Theyre flight paramedics and they teach. It just fit naturally.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, man, I just want to free these guys. Lets get this thing in the two comma club. Start there. Gotten two comma.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I did.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"The agencies will be nice because we can charge them $2,000 a year for 50 students, but the class itself, for individual students, they can buy it themselves. Its just $300.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, we havent even started marketing it yet. Not even a little bit.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"They finished the class about a month ago. They both went to Disney. One went to Disneyland, the other one went to Disney World. Then they work a week on at a time, a week off. So weve had about a week together now. Where its been go time. So weve just been sitting around chatting. We havent had a lot of time where its been ready to go, but its ready to go now. The class is completed. We got the certifications and the funnel works. Weve gone through the processes of testing. It all out. Its all good.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, youve seen the funnel right there, right? So whether theyre an agency or theyre just looking to get the class themselves, were going to push them through the funnel. Funnel will do most of the heavy lifting. Its got all the automated emails, follows up with them, tells them how to download the app, how to get into the class. So the questions should be at a minimum.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Cool. Thanks, man.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Got you. Okay.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Idaho.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Sounds great.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure. You got a computer nearby or anything?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Have a good day.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, its go time.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, I told you we got a doctor that bought in. Right. So, yeah, well have money to advertise now, and its going to be me manning the phone.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, lets do it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Probably about $125.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I talked to him on Twitter. Okay.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Well, heres the thing. So the plans for the agencies, they need to be yearly, depending on the team size. The product for agencies will be charging $2,000 for the year. Yeah, its those little guys. I mean, everybody can buy their own continuing education. Thats why the class is $300. And thats just what the competitor, the market price was at. So thats what it could take a long time to get a two club at that price point. I understand.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its a class. Its the ultimate product. It doesnt require a lot of hands on, like, shipping things out and stuff thats going to be time consuming, other than like, hey, I forgot my password. Oh, okay. Well, click reset.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"And theyve got paramedics got to have 50 hours of continuing education every two years.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thats what our competitors were at, so we just matched it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Theres really nothing. Theyve got other classes theyre going to start recording. Thatd be nice. But the way to get here quickly would target the agencies.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"It mattered to me, maam. All the appointments.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"No, that was a lot of words, man.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"So the appointments there could possibly be appointments that if we could get the attention of the decision maker in these flight paramedic agencies around the country, that would be where the appointments would come in.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"California is like, pages by themselves. Theres thousands of these guys. I just hired a lady to compile it. I said, all right, instead of just, like, getting them all, go get the first the top five for every state. So shes in the process of doing that. Shell have that done by Thursday. She originally started just making a list, and she didnt even hardly make it out of California before she ran out of time. I hired one of those time inc virtual assistants. My phone dying. 1 second.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, open up a browser. All right, go to www. Dot standby four, the number four. And then tones.com.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"My buddy got two buddies that are flight paramedics, and Ive been in ClickFunnels for a long time. You guys need to record a class. You guys are always taking your continuing education stuff, arent you guys just become a continuing education thing? Because they both teach. So we got them in front of cameras, and they were comfortable, and we recorded a critical care class and got it certified with the proper people. And now its just about ready to go. The next point is scaling it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"My Role will be scaling it. I just compiled a giant list of every flight paramedic agency in the country. Now Ive either got to call them or start running Facebook ads. Its that time. People are finding it on the Internet by themselves and just buying. But weve got three customers in this last week that just found it randomly, so its kind of cool.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That sounds great.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Nice.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, that works.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I got a VA virtual assistant to just go compile a giant spreadsheet. So its, I dont know, probably at least 1000 on it. Probably.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You too. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Good. How are you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Of course.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Im sorry, scroll to part of conversation where they said.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"No, people are only signing up online.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"My credit score was 725.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, Ive got to talk to these guys out of charging less all the time. No, lets be nice to the community. Lets charge a little less. No, stop. Its a stupid stop. It have to slap them. They want to charge less for things all the time, but, yeah, I would charge more if I could get away with it with these guys. But they constantly trying to talk themselves down with the agencies. Theres thousands of them out there. We only need, like, 100 of them to be our clients. Theres thousands of them. We got 100 of them. We make this funnel be a two comic club thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, follow Calebs. Dad. Matt hes always talking about you guys. So I went and clicked on it and see what you guys had going on. Followed Calebs journey a little bit for a little while, since he was a little bit younger. Just wanted to see what he had going on. You guys are using AI to scale your stuff. Maybe we could apply it to ours. I got a little bit interested and thought wed see what you had going on here.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I just hired this virtual assistant girl. Her only job is to literally track down the websites, get down the phone number, get down the email address for these places, and then its up to me to literally try and call them, find the decision maker, and say, hey, you got to provide continuing education to your guys. Boy, do we have something for you.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Let me pull up our last conversation. We were talking about when everybody was free. Theyre all together this morning, but I had to work all night long so in fact you woke me up. See what time by any chance we can do anything tomorrow?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"If I just ask them. Hey guys, are you free tomorrow? All day question. All right, we do 01:00 p.m. Tomorrow.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, thatd be sweet.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Weve been doing stuff with ClickFunnels since 2018, so got a little bit of an idea about ads. Not something Im probably great at, but I could fool around and spend a lot of money figuring it out the hard way. But with all the AI and stuff, I know Google is changing YouTube around. Theyve got AI and Facebooks got AI. Now try and target your people, but I want to see what you guys had going on, too.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And push them through the manually.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"At the top, thatd be great if they were around you because most of this is just Greek for them. They have no idea.","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}}]