[{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"It sounds like Im a hybrid. Both of those. Like I said, Ive been teaching for 25 years. You dont teach unless you have a passion about that, and I have to be in a subject area Ive been doing since I was nine years old. Thats art. So its a natural alignment for me with that one. Giving to people is, again, what Ive done for X amount of years. So I dont see that passion as dying. If someone wants to know something about art, Im probably going to have a big mouth about that one. Money is not of course, everybody wants money. Theres no issues about that one. I dont necessarily want a bugatti, but that Austin Martin sounds good to me. You know what I mean? Yeah. Okay. Thank you. So with that being said, thats where I am. Yeah. I think my skills are enough to be able to have developed people before. I hear what youre saying. So development of human beings is what I do.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Way below your grade scale pay scale is what I hear.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Retired. So its under $25,000. About $23,000.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes, sir.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yes. May I help you?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, Im extremely curious about AI. Let me cognize myself. So with the AI process, you have a platform that you rent out to people.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im well. And yourself?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Come on, we are talking to two esteemed people again, masters in education. So question makes sense is all about application for me, where the application will go primarily. So I dont know how I mean, digital in terms of green screen and things of that nature, Im there. Thats already done. I teach television, all that thing. Broadcasting, Ive done that. So the only way I would consider something like broadcasting is something in that area, is if Im going to go out beyond my area. I dont see where that would be applicable outside of Akron. I dont think people would drive well, people have driven 30 miles to take my class, but I dont think theyll drive too much over that, considering the area that Im in.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im an artist, so the only way I can think of that I would use that. Im trying to do a studio gallery scene. Were waiting on contract to see how that works. So I dont know how it might work with AI in that aspect other than to use it as a media process, a media go between.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"AI to use your platform?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I do, yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, Im a visual artist. Visual artist. 25 years. So, yeah, in the teaching 25 years. Got tired of that. Retired, and now I just want to open up a studio for myself in the gallery. And what I basically would be doing is bringing graduate students into to give them their own private space so they can do their thing. And then I would teach classes and other parts of it that would be drawing airbrush to screen photography and photo print.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"For sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"All right, family, be safe. All right. Keep.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"You mean to continue the process if Ive built it out? Correct.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Way below your pay scale is what I hear. Thats what I hear. But okay, so in other words, what Im trying to tell you is I think I understand what application may be, what that might look like, done thesis and stuff like that before. So I get that. I know how to go ahead and I use wordchat not word chat, but word cat, for example, to do our case studies and things of that nature. Im good there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Economic area that Im in, let me be clear.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I prefer for the dots not to add up, but I go ahead and do that anyhow. Quit playing with me, dude. Lets do this. You have a program that I think let me say this again, MAED. Not M-E-D. MAED, which means I do more than just teach, which means Im all about definitely helping people, but definitely finding other ways to make sure that things are expressed. And then again, I dont want to bugatti, but Austin Martin does. Ill tell you what, lets go a 50. Ill go there with you. Okay. Yeah. BMW. Hows that? Thats low end scale for me. Ill go there with you, but I dont want a competition. But Ill go ahead and do the 850. Hows that?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Not much you can do with that. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats why I live in ohio.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, thank you so much. And I appreciate you sending over the case study.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hold on, let me check. Lets see, how can we say this? Let me do it this way, give you background information maybe you can understand. 25 years teaching Masters in education. So Im pretty sure I understand what the application process could be. The question is, what its going to cost me and then how I actually access that information. So Im pretty sure I understand how to deal with AI chat. Of course therell be some specifics and Ill learn those. But again, my overall question is how much is it going to cost me? And that kind of thing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. 240. Not five, not six? Two. Hows that as a non existent okay. No, last time I checked, it said something 580 85. And as far as Im concerned, thats really low. I hadnt really been concerning myself with credit until it said, like, okay, lets do a business. Now Im concerning myself with credit. My question on that aspect is personal credit versus business credit. Does that affect business credit? Does your personal credit affect your business credit? And if it doesnt, then what I would like to do is build up my business credit and not worry about my personal credit. Go into LLC, use my Ein, create a trust fund for it, and pay myself through that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right. Okay. Sounds good.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, thats how much I was.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Again, Ive been doing it for a while, so I like your understanding of the process. Sure. I like what youre doing, but yes, coaching would be an avenue for me to make that happen. If I have to go into actually doing education or teaching as well. I do that as well if its a thing where I can create a product that will allow me to drive Austin Martin, why dont you do that as well? So Im pretty ambidextrous in the ideology. My idea is to make sure that I have as much money as I want, not that I need as I want, and to make sure I can help as many people as I possibly can before I start breathing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]