[{"pageContent":"Okay, so youre 3 hours behind me. Lets see if you could probably try giving me a call after two or three my time, which is I think three is noon your time. So really 11:00 a.m. Your time probably because what time is it now? Its probably nine something. Is it nine something now?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Automotive manufacturing. So I deal with whats called tier one and tier two suppliers. I deal with people that make parts, mostly stance parts for the automotive industry. So if they make seat brackets, some people make columns for frame, door, you name it, trunk situations. There are metal brackets that go into convertible tops. Theres a lot of parts where they do stamping and do extra stuff, but thats what I deal with. Ive got targeted over 800 companies around the United States that have at least 100 or more employees. Not all those would be legitimate clients because some are, to be honest with you, shitty companies. And my reputation does not stand strong if I take people into shitty companies. So I like to have companies that have good reasons why people show up for work every day. And if I can do business with them and bring them good talent, they pay me a pretty excessive fee. It requires quite a bit of work on my part, but its worth it because I get paid well. Its not small sales that I do. Its more like elephant or big game hunting, if you will. I get big checks, and I dont get them every week or every day, sometimes not every month, but then I can have a month that makes up for a couple of years for some people. So just really depends. But Im looking at what it may or may not be able to do for me. I really dont know. I guess Im interested in learning about that a little bit. Yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im sorry. You look like somebody I know. Im so sorry. I thought somebody walked by me who was a good friend back 20 years ago, and I havent seen her in a while. Sorry Im back.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Nice. Ive got two daughters that play, one played in college and ones playing now in college. And they grew up going all my stuff and their babies. And of course I helped open doors for them to get in front of the right people, including myself. But lets face it, dad can bring a lot to the table, but they dont want to listen to dad sometimes, too. So I got to make sure the drug dealers I put in front of them that push the game of volleyball or the drug Ive been addicted to are the right kind of people. And theyve pursued that. Once I got them hooked on my drug, I was trying to take it away from them all the time, going, you guys have done too much. We should do something else. I knew that if they let me, they didnt want to do this because of them, but they didnt let me. And theyre still pursuing it. Like I said, I got one thatll be a senior next year, but Im going out to the mens college tournament and thats pretty cool. Its way fun to be a part of it because I did that 30 years ago. Yeah. So Im going to be gone next week, but I will be back in town the week of the 17th, and Monday is going to be terrible because Ill probably be exhausted from traveling and working the long weekend out there. But Monday is kind of a recovery day. And then Tuesday Ill be back in the saddle. So maybe the 18th or after that we could talk because I will say this, Ive done some side consulting for my business. Ive done some sales training, motivational speaking. Okay, I have done that. Thats not been my main focus. My main focus has always been executive recruiting because thats what I was brought into it with. Thats what I was raised with. But as an executive recruiter, you learn a lot about sales. You learn to study different things, about asking good questions as you have. You learn about the difference between open ended and closed ended questions because you get information. So Ive done a lot of sales training and motivational speaking, that is one of the things that Im thinking, well, Ive done it on the side, but I could still use that as a valuable asset to my business. And maybe AI is something consider. Im not a post. Hi, Mrs. Cotch. Is that Mrs. Cotch?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, well, thats fair. And thats why I was just trying to look and see. I dont know if its a good option, to be honest. And I dont know if outsourcing what youre talking about would be a good option for me either, because there are a lot of people that try to be recruiters. They cant do what I do. They cant ask tough questions or true questions. They dont get good information. So then they spend a lot of time chasing their tail on projects that arent worth working on. They think they got a client just because somebody said yes, but they dont have a good client, somebody whos going to pay us. And thats important, too. We have to pre qualify, if you will, pre close all of our clients. And theres a lot of important questions that we ask to make sure were on the right track. Ive been doing it for 27 years, and I know a lot, but not everybody can do that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. You just sound like youre in a tunnel, so its very echoey.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im interested in maybe getting her back out of that. I mean, she doesnt need to. She never needed to. She was just looking to do something to keep busy. So I would like to probably get her life back a little bit this time of year, because this time of year, we have her schedule, which is something we havent had to deal with in well over 20 years. Im talking a lot, but thats what Im thinking. And Im wondering whether or not well, Im curious. I could help me with that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Where are you at?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Phil what is your name? Stop.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Tuesday, tuesday the 18th. Got to be afternoon. I got a zoom call for a speeding ticket. Im fighting in the morning. Go figure. I probably earned it, but Im going to see what I can get. They wrote me for 90 miles an hour, so hes kind of a tick about it. I think in the afternoon, my time, and lets say I take a long lunch just for fun. So lets say after 131 30 my time.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Whats that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I dont know yet. Like I said, Ive been so busy this morning, Ive been working on I got a big side project Ive been working on this morning and its really occupying a lot of time. So I was going to get into my work emails this afternoon, but I havent had a chance to do so. Where are you located at?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I am an executive recruiter. I work as an executive recruiter in the automotive industry and I own my own company. Im not sure that AI is a good thing or not. Theres a lot of relationships you called me personally and I have to basically rely on that quite a bit. Im not sure to what level AI can help me, but Im interested in learning about it. A lot of my business comes from phone work, some is from email, but a lot of it comes down to relationships with clients and asking good questions. For instance, I have like.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Im sorry, whats that?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"There youre not going to be able.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, Im interested in checking it out. I havent had a chance to yet today because Ive been busy with work.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Whatever you want to do. Well coordinate before then, and you can give me a tap or something. Perfect. Lets see. Alex call AI. Im going to just put AI for right now, and were going to say I want to put that time in 130 my time. Cool. I got you on my calendar.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes. Bye. All right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Good. I cant hear you. Youre very echoey. Who is this?","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Yeah, its very interesting because actually, Ive had an old CRM I paid for 1520 years ago. Ive gotten updates on it, but its not automated. Theres no AI in it. It does what it does, and Ive used that. However, there are Ive got 40 plus thousand candidates in my file, and I know not all of them are worth money. Matter of fact, some of them are either dead or retired, and some are never worth money. Anyway, on a good year for me, on the recruiting side, if I place 14 to 20 people, Im having a banger year. And of course, if I go above that, well, then Im breaking the bank. But also, yeah, I get it because extra opportunities to take some of my resources or the resources I dont use or have, and use my tools to develop those as business prospects wouldnt be a bad thing. Im even considering a couple of different things to add aside businesses. I lost my leg, my left leg. Last year I had a situation where I became an amputee. And so Ive been an athlete my whole life and Im actually looking at doing things still. Im taking my dog for a walk on my lunch hour right now, just to get out of the office, blow some steam and also work on my prosthetic leg as I get around. But that being said, Im actually considering setting up, how do I want to say, a small store of some kind. It may be bigger than I think because I could use this situation, which is not exactly a great situation, and turn it into a positive situation. It already is positive because its motivating me. But one of the things Im looking at, because I dont have a leg, some of my friends, my good friends, they call me the pirate. And so Im kind of considering setting up a pirate store with different things. And part of it would be T shirts that could be sold online in different areas. This is again, its totally different than what I do, but sorry, its garbage truck. Whats that? Im sorry.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Im glad we talked more than face value, because theres some possibilities. Well see. All right, man. You have a good day.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"What tools do you use the AI for? Is it dialing? Is it texting? Its probably all but email, too? Is it all three of those areas?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah. I am eastern. Yeah. Okay.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, I was thinking about having some shirts designed. Ive got some different places to get designed. I could have the shirts made. I can even set up a store where people could order and I dont have to touch the merchandise. It would just be shipped out. So its kind of like a very passive thing I would do. But this pirate store that I would have would be something that there are people like me, there are some people that would just support others who are in my shoes. And I dont know, it may do something, it may not. Ive got a lot of people who are pretty pumped about it, but that doesnt mean anything. But you could do shirt like that for not a lot of money. Twenty dollars to fifteen dollars or something. And it doesnt cost that much to make them, of course, but youve got some back end costs. And I was debating not just shirts. I mean, it could branch out to be more than that, but the pirate store could have a lot of different things that are pirate related to it. And for the most part it would be merchandise. And it doesnt have to be all amputees, but there could be an amputee section and there could be other reasons. But Im kind of considering it as a side hustle that would not take up a lot of time away from what I do. Maybe its a little bit of time and set up, maybe its 10 hours a week, maybe its 20. I dont know. And frankly, my wife stayed at home raising kids for 21 years, and she just went back to work at a CPA firm. So she works 80 hours a week right now because its tax season.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Have a good.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Alex. Let me write that in here. Alex. Will we do a zoom?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"In the meantime, well see what we can do. I think theres a future in there somewhere, actually. I mean, I know there is. Thats not really the future coming, but the fact is, I think good things are coming, and Im just opening up options for myself.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont do as much as I did. Ive been doing this 27 years. I used to do a lot when I was a rookie and younger. Now Ive got a good enough relationship that I get a lot of inbound calls. Although Im considering doing a little bit more outbound because as youve been in the business for a long time, some of the people that have been my clients and customers have grown up, gotten older, and are looking at retirement themselves. So I have relied a lot on dialing for quite a few years, probably 20 years. Ive relied a lot on repeat business. My reputation and clientele, thats still been pretty good, but Im actually going well. I dont work like a rookie anymore, which means I have more time to do so. I just work a lot smarter, not as hard as I used to. So Im considering whether or not AI would help me in adding more tools to my box to work with my clients or other clients. Okay. Anyway.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure, thats important. As you know, Ive got 13 key questions. That at least on five of them. If I get the right answer, were striking gold. But I dont have to have the right answer for all of them. But I got to understand, and thats what youre doing to me. And I appreciate that. I really do. One of my most important clients, I ask my clients is that why would somebody quit a good job and come to work for your company if they dont know I really cant help them? I mean, I could, but its very temporary. So its good when you got a good understanding with the people youre working with, and you can get a lot more out of that for both sides. And I totally appreciate you and what youre doing. I do get that. So I appreciate your call, and I thank you for you taking the time to do so. I will still check out your information just in case it storms my brain in a new direction in the future. You never know. Ive been doing this so long, sometimes I think about other options. I could do a lot. I could sell quite a bit. But Im really good at what I do. But Ive been doing it for a long, long time. So I kind of feel like I need a new love, in a way, and Im exploring what tools are out there to develop that love. So well see. Yeah. But of course, if the coaching or.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. You know what? How about we do this, because Friday is Good Friday and its religious holiday this weekend. So my family is going to be in town and were going to be hanging. I wont want to do anything come Friday. Actually, next week I travel to Kansas City because I played volleyball in college, on the side. Ive coached, Ive played. Ive done a lot with them for 30 years. And Ive even officiated. Well, Im going to the Mens Collegiate National Championship Tournament next week and Im going to be officiating.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont have a number yet, but I could afford to. I mean, Ive done well enough with what I do that I dont have to continue to make it like that. Its been good. Its been lucrative. To me. Again, it allowed my wife to stay home for 21 years, and we have had a great life, but I dont have to make as much as Ive made, and thats partly why I dont work as hard as I used to. For me, if Im bringing in six figures, thats good enough to even stay slightly comfortable, but Ive been way above that. But I also work my ass off. And Ive got four kids. Theyre all kind of grown. Ive got one still at home, but Im looking forward to the next level within three to five years. Well, maybe well say five to ten. My oldest is 23, and shes got a serious boyfriend. There could be grandkids, I think when that happens, my wifes going to go, hey, we want to go to Fort Wayne any effing time we want. And thats where my daughter lives. If she wants to do that, by all means. I can still go now. I could take my smartphone, I could take my laptop. I can work from anywhere. I really have a lot of flexibility.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats what I was thinking, a little bit of something like that. And then if things go well and I take advantage of the idea of this futuristic AI type of development, if I can use it, Im 52. I really think Ill be working well past 60, but honestly, Im also ready to go south quite a bit, get warm and win the winter. And I could still do that with my business. But like you said, Im ready for a little bit of even more flexibility and working hard to do what I do. But yeah, using tools that will help me create flexibility for my family and my kids. I mean, heck, Ive got electrical engineers busting her ass. I dont want to teach her too much flexibility. Shes got to go work for somebody. But well get there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]