[{"pageContent":"I find that labor of love tends to get taken advantage of from other larger groups, so I definitely want to have some kind of income flow going that would actually support the entire thing and feed into it as well. Im not actually sure of what numbers I should be looking at as a goal, just that Im open to growth, and if Im going to see growth, then Id be hopefully using it to the advantage of the actual project or for other projects.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, so its basically when you go to the hospital and you are seen by a doctor, the one that kind of oversees the care and coordinates your care, and is more or less the first line pair of eyes, pair of trained eyes. That to see you after you see the Er, the emergency room and get admitted. Theyre internal medicine usually. Theyre the ones who are going to be looking at you with a generalist eye to see what they can see, figure out what exactly is the most underlying cause of your problems at that time, and then get you the care they need. Get you the care that you need at that point.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Commute is around 30, 40 minutes.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"More or less, yeah. As far as my own career medicine goes, I picked this route more or less because it gave me that generalized approach to things. And I can go any which way after I graduate in a year and one, two months. Basically, Im more or less set to do anything anywhere at that point because Ive got nothing tied down to where Im at right now.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Time zone, right. Eastern time? Yeah, Eastern time. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, working nights right now, seven to seven. So I guess anytime after 07:00. A.m. Before drive and everything before, I want to say five, six p. M. Okay.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. For some reason my residency is at a point where Im comfortable, where Im at, I can see patients just fine. Im more than fine with handling patients at a larger patient load than most other residents at my level right now, so I figure with the extra time, why not?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"What space? Yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Starting something up specifically.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im a physician. Im in my second year of residency as an internal medicine physician. Gotten another year to go before I had to decide whether or not I want to pursue other things as well. But it just seems like a very large patient population that I have or large number of patients that Ive seen that just dont know what their health is at, what its going to look like in years if they dont start taking care of it. And because of that, there is a large not just is there a cost to them over time, but also the amount of resources they take. That kind of outweighs any kind of benefit that might be going on with not talking to them about it. So I just kind of figured if I can make some kind of platform, I can actually reach out to them, educate them. Public access? Not necessarily public access, but like using mostly Advertisers to fund, but at the same time using AI for just making it all happen with minimal human effort. Not human effort, more like minimal human involved. Does that make sense?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"WeLl see.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im actually on my way to work right now, so could we possibly have this conversation in a short while?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, Im near the end of my drive. I like to get up to work earlier sometimes, depending on the workload.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Like, closer around to noon.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, now speak. Sorry.","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}},{"pageContent":"In that case, youll hear from me, hopefully soon.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"That sounds perfect.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hard to say. So the ultimate goal is just for my own personal mission against ignorance. But ultimately the ultimate goal is like 100% altruistic approach to public medical education such that the net benefit can be seen on a macro scale, such that Ill be able to see it personally with the patients that Ill be seeing down the line years from now. Kind of like a personal goal thats kind of like a business goal, depending on when you look at it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Pretty much, yeah. Not nearly as glamorous, but yes, the diagnostic aspect of it, as well as managing whatever that particular internal medicine doctor is comfortable with managing. So if they are very well experienced with heart conditions, they might not consult a cardiologist, like someone whos more comfortable with gut conditions. And basically a general internal medicine doc will be doing anything and everything within their level of experience and comfort to just treat whatever you have. And they should be at a level where they can see what you have and know when they need to reach out to a specialist to get you more advanced care or care or care that needs a specific pair of eyes to oversee. Thats what Im training to be. But at the same time, a lot of people dont know exactly what it is that I do as internal medicine. So, yeah, thats kind of where Im at.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I would say okay. Health information.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Between work hours? Between work hours and sometimes when theres nothing going on and the patient lifts is low and theres no one coming in from the Er. I do get some downtime during that time, and I like to either get some studies on or work on side projects or hobbies or whatnot. So if you have any reading or.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Mostly its kind of almost like a podcast, but more catered towards medical education for the general public as opposed to medical education for health professionals. Because a lot of patients that I have are not just aware of what their medical what their medical conditions entail. So I was hoping to develop a platform that would reach out to them specifically.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Like three, four, five, depending on the traffic.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, 06:00 P.m. Tonight until 06:00 A.m. In the morning. But that could include depending on whats going on in the it tonight, and that could be extended any which way, shape, or form.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]