[{"pageContent":"Yeah. Getting the right lead to see the offer will close the deal. Correct.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"This week doesnt work. Im headed to Park City for family for the rest of the weekend. So Monday or Tuesday is the next opportunity.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Again, the initial contact has been in the past seven days, one of which was yesterday.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, its a package for them to be able to treat more patients.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Again? Ive been interested in AI. We sell a big ticket item if theres a way of getting more. Were specifically looking to reach the medical audience. Our market are successful doctors who want to make more money.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right, sounds good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Correct. Well, thats how you can correlate what the actual cost okay. Is. Yeah.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"I dont think I have.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes, shoot that over now because I can watch that when Im on the flight here.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"You suspect no, they can pay a couple of grand a month. These are doctors. I can have them finance. Thats not a problem.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I saw a little video this morning.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, Peters.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Pacific.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Its a combination of equipment, training, and our pitch. You can look at my website. Its pretty self explanatory. Weve got a package we guarantee to bring them new patients. Our package sells for $99,000. Our guarantee is if they dont collect at least 500,000 in revenue in the next twelve months, we will buy back our equipment. So its a really compelling offer. We just need to get it in front of the right doctors.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, no, its working. Theres another company who specializes in medical marketing, and so Ive got a deal with them that Im sure is probably similar to what you guys do, and weve been getting good leads from them. So I was curious to see okay, well, what do you guys have thats maybe different, better, and to add you into the mix and really see which one does deliver better than the other or theyre both great. Hey, cool. The more the merrier.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Ill probably close three out of the four.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Whats your domain, jim Newageneuro.com is the short one right now. Thats where we send most of it. The same thing with a bit more detail on the equipment is same thing, but just info.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"The answer would be yes. Ive got to run now. I got to head to the airport. Im headed to Park City for the weekend. But yeah, we can schedule another call. Send me whatever. And have you guys worked in the medical space before?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"No, if we were generating that many real leads, we would need assistance to handle that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Spend, theyre coming in under $300 per appointment.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Of those four? No.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"The ones that I have spoken to thus far, they get it. They went to the website. They got to see what this is from a high level. And so if I keep getting the caliber of leads that theyve been generating, Ive got no complaints at all.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Refund, we buy it back.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"We will get between 102 hundred doctors over the next twelve months.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Why dont you do noon?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"This is a new project. We literally just launched it a couple of weeks ago.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"What do you guys do above and beyond getting somebody to book an appointment?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, we can do that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I have a potential sales team. Is that something you guys do?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Again, it just started up, so I probably had four this week.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, the next twelve months.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, right now weve got some campaigns that are out there and they book a call just like you guys do. They book a call with me and I sell them. And then weve got people that go out and train their staff and thats how it works. Its pretty simple.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"This program with them is new. Its just a couple of grand.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thus far, Ive been taking the calls because I want to make sure weve got everything refined. My sense moving forward is Ill probably record Im toying with recording a webinar and letting them make their first exposure to the webinar. Its kind of the same pitch that Im doing live, but just not quite as personal. Right. Which, again, would weed out even more of them. But so far, if I just keep getting leads like Ive been getting happy.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats our ideal client.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, lets do it. Lets finish this up here in next 30 seconds because I got to run.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"What do you mean? Thats what theyre retained to do. Its just get my message in front of the right people. Because if they get it in front of the right if the right doctor calls because theyve seen the offer, if they get them to the page, the right doctor is going to call. I mean, its a really compelling offer.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Saturday? Ill be flying back. You can try me on Sunday.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"They would get doctors who are looking to generate an extra half a million to $2 million over the next twelve months, who are already working with the diabetic population.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im good. How about you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}}]