[{"pageContent":"So I have an LLC. Last year was kind of a clean up period, so I want to say average somewhere around area about 40.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"13Th would be better.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, surgery one. Holy ship. This is going to be crazy. Hold on, let me see if I get my calendar so correctly here. Let me see. 25 minutes ago was I want to say that my first surgery was April 20. And then the next morning, April 26, they did the second surgery. So the first surgery was 6 hours long, and then the second was nine. You can imagine the amount of crap they pumped in the body to keep me several ICU. And then I was approved for inpatient rehabilitation. So Ive been here probably for a week, and theyre going to discharge me on Sunday the 14th.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah, Im sorry.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yeah. Tomorrow will be 30 minutes, then an hour, 30 minutes, then an hour. And however they stretch it out, it depends on their calendar. But someone whos rebuilding their resilience is really kicking the ass, man. After those four times, I am ready for that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Four.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im in a rehab hospital. Where am I going?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Come within 90 days, I want to be at 10,006 months, 15 grand now.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Right. So my discharge is on the Sunday the 14th. I currently can without assistance, which blew me away and probably nine days before I can take on what I would consider to be a regular load for me. In the meantime, were going to cross utilize some healthcare folks with some home care folks. Both my wife and I work out of the house so its not like were trying to maintain an office space and again kind of reestablishing all the cooperative components of our duty, checking with one another, see one another fully and then pivot out. So its going to be kind of an interesting dance. I know about twelve weeks I wanted to actually knit together and I take some stuff my spine and replacing some of the discs and if I was to go on, say, trap and do several.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, it was 1986. Girlfriend at the time was me and my son off the side towards a tree. And so I sat and ski. Hello. But theres a longer story to that. Hello. Hows it going? Yes, sir. Hey, Rob. Hey, nice to see you. Yeah, lets do it, man. Right? Thats okay. And its where shall I get you? Thank you. That was eleven active. And that happens. Its kind of diminishing results. So the only point of flexion is above it or below it. And of course below it for me was s one. So there are two screws in there and then the fusion fails. So the bone is actually floating in space in your body with two screws against the tension of the rods. So I want to say five years. I was very sure that I was having more and more issues with ignoring, trying to be a soldier to get this extra. And I dont know how the hell I up with it, but when I got to the doctor, he was like, crap. 6 hours. 9 hours. And the carriage that was in, clearly they were using a lot of force because my body beaten and bruised all over, man. They hit like a discount. But Im getting better, man.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Is that your goal more?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"About two grand.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Calendar?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I can say that I can kind of lose that. Jennifer knew this guy in Maui. He was an accomplished photographer, architect, et cetera, in Haiku, which the most amazing places in the world, and were talking this guys big, long, tall, glass 70s, or maybe hes got this unbelievable wife much younger than him. And he tells me that every morning I pour whatever her name was, I pour her hot bath, both kid in the bath, and I read her every morning.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Are open to a conversation about what price should be.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"To lead you on or have any kind of guy thinking. And I just want to be fair about it.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Every morning I have a three hour morning in which, with ease and grace, I get to exercise, movement and then follow into, like, a deep work on that particular day, but do it in such a way that its almost seamless, and Im not shifting gears so hard that fall off the bicycle. And after 11:00, 12:00, thats when I get to spend some time with Jennifer and then do an afternoon program and or early evening program. And it just feels like by sense of being in the right place on mission, on time, that I dont have to rush, I dont have to compare. I dont have to shop from the treetops for folks to understand what my message is, whether its for them or not, and carve out time such that I could spend several weeks a year with my two daughters and my separate son and grandson and not have to make the decision of, okay, its Thanksgiving. Whose house are we going to? Because its understood that its the holidays and we get to be with everybody. Does that make sense?","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yes, sir.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Right in front of me. No. Fucking crazy. And so I come out of this thinking, okay, so clearly I have a mission and I wouldnt still be here. Second of all, that mission is right. Like, all the components going together. And my guide, angel, just wanted to do a good check and say, okay, motherfucker, heres what you say you want, and you cant get there from here. Try. Youll be coming and youll get sick. So I am now, kind of in my minds eye, deciding I want to put my bowl again and build space for family, friends, lovers, all that stuff, and to be able to incorporate all that into a lifestyle that I can do from anywhere, and certainly from my daughters house or my sons house, stuff like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"The thing you need to understand is having gone through this rather large and procedures Im sure you understand that Im coming out of it and looking rest of the whole Panama of my life. And now start to think about people or circumstances either uplift and support me or the ones who are dragging me down or are uncomfortable being around and then making the change. I want to be able to work on three or four things. Thats all Im taking on for a time frame. Project is done and up and I created an email course. Then what Im trying to say is Im not going for learning. I am taking the long view. And I dont give a shit how long it takes me because I know that my health has to come first.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. Okay. Maybe the markets. Again, Ive been working at this. Ive gone to all national restaurants, both regional, and guess what? And now Im trusted to start of making sure and booking myself on six agents rest of the year because that was my plan for 2023. So that not only get the message out again, but even deeper and get some traffic. Because it feels like not only physically, but companies are ready to hear the message because they dont have to go through the whole thing of wasted another four grand to train as somebody whos only going to be there for another 30 days.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I am a career coach for chefs and professionals. Sorry, my voice gone a little bit. And I also do transformational coaching. So typically someone comes to me when theyre burnt out work. I spent 30 in industry, so I know intimately the issues that are popping up, especially during COVID when we lost 6 million jobs as an industry. And the opportunity that exists is to kind of upgrade leadership, communication, and relationship skills such that folks understand that its still an honorable profession and its a safe environment to work at, which, in the case, for a long time. And so the top of the funnel is my podcast, Chef Life Radio, and it gets transitioned over to address our email list and Cheflifecoaching combined content and giving folks opportunity to crossroad individual coaching programs. I have Mastermind Group within the website, and I think that goes for $18 a month, several paying members. Everything was basically coming right into focus right before my back when oh, boy. About three months ago, which resulted in a complete rebuild of my spinal in 2007. They took out all the old hardware, some of which had already been calcified, and put in new hardware from L One to S one. Sitting here right in the middle of rehabilitation hospital, all these epiphanies over the last 15 days and realizing that express their gratitude and to me for the impact they have in their lives. It was really like witnessing my funeral in slow motion.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yeah, I definitely would love to be able to count on several different streams in order to fill the slots.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, yeah, she went into the military in the Air Force to be I thought they were going to school and post general, and instead they sent my ass out to South Dakota and I froze my ass off making TV dinners. Thats what they call it, the foil pack system. So when I got out, Im still intrigued enough about the industry. I just started applying myself right out of Chicago and Indiana and took a series short term jobs with jobs in which I could actually not only with, but also move downtown Chicago so I can start working at some of the other restaurants. Reason I am doing what Im doing right now is I got sick and tired of my book feed seeing a picture of yet another chef who had taken can I get her every fucking day was in trip. And thats no surprise to me because most of the people in the industry can be incredible talent, but theyre almost always immature, and certainly nobody taught them the soft skills that they need to that the industry requires for them not to be a good manager, to be a good leader, but be a great mentor.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. The next step is stem cells.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure, go.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thank you. You bet.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I do small group coaching as a Cohort. And I also do one on one.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So far? So far.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Again, as far as therapy, people, theyre like, go slow, go slow, slow down, go slow, twist. And every time I make movement, Im reminded that I spent 30 years in the kitchen where nobody gave a shit how high the tables were and people just put up with it. And so part of my message, youre only going to have bank account, the relationship, the home that you settle for. And my response to you is dont settle for anything less than what you deserve. And thats a living wage to be supported in your work to several other points. And if you dont have that, you need to go find it. And if you cant find it, that means that you with the bright idea get to create it. So clearly its an outgrowth of own your shit and do your work, basically.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, about 40,000 a year.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Im in the room. Hospital. Where the hell am I going to go?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I already intuitively understand that I am under pricing myself.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats what my company bought.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I dont believe I did.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Isnt that what its all about, man? Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Asheville, North Carolina.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I dont know. Im going to be taking the meeting from the rehabilitation hospital, so I have no idea whats on the schedule.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Hi.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Shes Nashville.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"All right. Go ahead. Be a good fit for you guys, depending on what your target is.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Eastern Easter.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Watch the video. Thanks.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Love it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Its a really good thing, man.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]