[{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thanks so much.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Good, how are you doing?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, I dont really have a business right now. Its just kind of like I have a Stan store. What Stan is its a link in my TikTok bio using a platform called Stan with me. And essentially theres just an offer on there because people I get a lot of traction on my free TikTok videos, I get a lot of engagement and then basically people see that theres a link in my bio that if they want to fill out their card info for $100, Ill do a private session with them which lasts between an hour and 2 hours. Im not very strict on the time. We usually just wrap up the conversation when it naturally comes to an end. And from there I get the notification through my email whenever somebody books a session and it gives me their number and I reach out to them and say, hey, thanks for booking a session. Like, Ill FaceTime you at this time that you chose or whatever. And thats basically it. I just get the $100 through stand, but they take like a small fee, so I end up with $96 or something like that for a call. And its not like my main business, its just something that Ive been making a little bit of side income with. And Id like to figure out other ways of monetizing this platform. My TikTok. Its growing. Im at like 120 something thousand followers and I keep getting maybe another thousand followers every day as of the last couple of weeks. And yeah, Im not really sure. Im not much of a business person. Im really an artist. Im an artist, but doing spiritual philosophy and doing one on one coaching comes natural to me. So Ive been providing that offer to the people that are into my TikTok account, basically. And so yeah, when I saw the ad for this service piqued my interest because of course Id love to figure out how to build it even bigger and get more clients and maybe even a better way of doing it. I dont know if theres maybe an offer I could create thats, like a subscription service for my followers where we do Zoom classes weekly or something, or I havent really decided, but right now, Ive just been doing these one on one calls for $100 each, and its just fun little side income. But if I were to really I mean, ideally, Id love to figure out a way to make $10,000 a month, because thats just a number Ive always wanted to reach in general. So if theres a way to do that with my coaching, thatd be great.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"The last three months have been slow. I made, like, around $7,500 in February, and then I havent made as much lately. And then I dont know, it hasnt been a whole lot.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, Im like paycheck to paycheck. I dont have money set aside, so if Im not, like, someone you guys can work with, thats fine. I didnt realize I thought I was just going to get sent, like, some video or something. I just saw a pop up ad and said, oh, this looks interesting. It said, Check out the study. So I didnt I thought it was just going to show me, like, maybe a tip on how AI could help me reach people or something.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right, thanks. Ill check everything out.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, thanks.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right now its actually really tough because I just paid my rent and Im like I pretty much have no money to spare. But if you give me a couple of weeks, itd be a whole different story. It could be like a couple of thousand or something. So it just depends. Right now, Im pitching on gigs. The way that it works for me is Im always pitching, but Im not always booking. If I book a video, then overnight, its like I could just make a few grand, in which case I could take like, 1500 of that and go put it into a campaign. But then again, you cant guarantee that Im going to triple my money on it or whatever. Right. Or can.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, the first one is like, basically there was like a seven grand limit, which I reached, and now I make the payments on it and I just need to catch up on it. Then the other two, one of them is mine, and there was, like $1,000 limit and same kind of deal, like, I make my payments on it. But then the other one was actually something I didnt even realize, but my mom took out a card in my name that had, like, $1,000 limit and then reached it. So Ive been making the payments on that. So, yeah, all in all, its like $9,000 that have been on credit cards. One of them is like, seven grand. The other two are a grand each. And as of now, just to keep afloat, I just make the monthly payments and Im eventually going to start paying them down whenever I get a big job or something. Like, being a music video director is a bit sporadic. Ive had times where I made $17,000 all at once, and that could happen again, I never know. Sometimes I get a little gig, and its like, okay, Ill use that to spend on the things I need, like money, like food and rent and clothes and whatever. But then something could happen where all of a sudden I make a lot of money and I could just pay those cards off. But, yeah, as of right now, its like nine grand in debt basically, across all three cards. Right.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Last year. Id have to double check. I think it was like 25 grand or something, like around there.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Just because I feel like thats a number that Ive always thought I would like to make to be more comfortable and help support my parents and stuff.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont need to make ten k a month, but you asked what I wanted to make monthly. Something like that would be ideal. Even if I make, like, three grand a month, thatd be nice, because I still do my music video stuff. I still direct. I work in film. Thats been my main career for the last 15 years. So doing this coaching thing just kind of has happened naturally. Its not like Im not flooded with clients or anything like that at all. Most of them arent even really reoccurring clients. Theyre kind of just like theyre fans of my videos and they book a session to get I do have one reoccurring client who books sessions with me pretty much every few weeks or whatever, but a lot of them are just people who, you know, they they really resonate with my approach on my messages on TikTok, which are essentially on how to reframe your perspectives around your problems, to bring more empowerment and to find more peace and alignment to raise your vibration and as a result, to create better outcomes in your life by being less reactive and less resistant towards the unwanted things in our lives.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, no, I dont know what it is, but Im sure its not good. Like I said, I dont have a business. Ive made a little bit of money on the side doing this coaching stuff, but my credit score I dont know, actually. But Ive got one credit card that I make payments on thats got basically have, like, $7,000 of debt on it. And then Ive got two other credit cards that theres, like, a grand of debt on each of those. So Im probably, like, $9,000 in debt. But, I mean, I always make my payments on them and stuff, but, yeah, I havent caught up on those. And then the way that I make money is a little sporadic. If I book a music video project, Ill make, like, maybe five grand at once, and then Ill kind of live on that for a while and theyll Dwindle down, and then Ill do, like, a little editing gig for $800 or something, and then itll kind of all it just depends on how busy things are. Im always pitching on jobs, but its kind of like being an actor where you go out for auditions. Its like Im always pitching for music videos through record labels and stuff, and then I book one and, like, sometimes Ill even make, like, ten grand at once or whatever, but then I live on it, and then it dwindles down, and then Im kind of, like, tight on cash for, like, a little while. And so, yeah, I havent really built, like, a steady income, so this TikTok thing has just kind of happened. I havent planned any of it. Like I said, I dont have a business. Its nothing like that. But I am getting, like, I just had a video go viral last week. It just hit, like, 6.1 million views. Today its still climbing. Itll probably hit like 10 million views. I keep getting more and more followers. I keep getting more people clicking the link, booking these little one on one sessions with me for $100 each. So its nice. I can see that people resonate with my messages and that they want to consult with me. And so Im just exploring this idea of reaching more people for consultations.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, yeah, no, I saw a pop up ad and was curious about it and and I do one on one coaching with people for really its more like in the manifestation sort of space, like in the law of attraction space. I run like, a TikTok account for it. Its called aspiring alchemist. And its not my main gig. I direct music videos as my main job, but my presence on TikTok has been growing, and every once in a while, maybe like once a week or twice a week, people will book a coaching call with me. And so I do one on one coaching for $100 a session, just over Zoom or FaceTime or whatever we use just to do a video call. So, yeah, I saw the ad on Facebook and signed up because I thought it would send me an email with some info or something. But this is cool that you guys are, like, calling and stuff.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ive got debts and stuff. I could pay off my debts. Yeah, exactly.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"I actually dont know what Air is. I literally just saw an ad pop up and it said something about how it was the whole meme of the brains, where it was like, the first level is like, advertising through Facebook and this and that, and then the next level and the brain gets bigger. And then the final one just said, having AI get your clients for you. And I was like, oh, that sounds cool. Like I said, click here for the case study. So Im like, okay, whatever this is And I put in my info because Im just curious to see what I guess I dont really fully understand AI yet. I know everyones talking about it, so I just wanted to see what AI could do to help me get more potential clients, I guess, for my coaching.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sorry, I didnt realize there was going to be an actual human reaching out to me. I mean, thats cool. I thought it was just like I appreciate it. Yeah, they caught me off guard. I was like, oh, I even thought it might have been AI for a second because the texts were so quick, and I was like, this feels like AI. But now, obviously, youre a real person, which surprised me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right now would be nothing. So this is something I might have to put off for a few weeks or something, but yeah, no problem.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]