[{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, from what I filled out, Im not exactly sure what Air does, but it sounded like have a way to use AI to generate income. And I was just curious about that with Chat GPT, and it seems like theres a lot of the apps that you can do a lot with, so I was curious what Air could offer.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Potentially all of that, because each of those things, before you say anything about employee, I was thinking since Im starting out, Ill be doing it myself. Any one of those things you mentioned that I would start off doing and I like I would continue doing, but anything else that I feel like is something that is not as valuable use of my time, I would definitely give to the employee.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Like I said, somebody just primarily has nine to five. I dont even think about how to get customers and create market funnels or anything like that. My wife is the one thats self employed. Im not sure if she would be interested in how this could help, but I can definitely, I guess, see if shes interested. But some of these questions youre asking, Ive never really focused on building my own business before. So, like, a lot of those answers, its going to be, yeah, I dont have that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"1 second. Im at 630 on TransUnion and 648 on equifax.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I guess I just want to kind of keep it simple to start, but obviously as much as possible, the better. But I guess maybe ten is good, five is good. Even two would be good. So Im not really picky at this point. I just want to be able to start somewhere.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, Im sure about that. I would have said four, but I have a doctors appointment at 230 and Im not sure how long its going to go. So thats why I said 630, just to be safe.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im open to different ideas. Some of the things that caught my eye, I saw something where you can maybe be, like, write articles, but AI can kind of help make it easier, maybe kind of help make it be more efficient, not have to spend so much time. I had interest in some tax lien stuff a while back. Real estate. Not really into trying to have to go physically door to door, make deals. But if anything thats online, Im definitely up for that because I saw something about Airbnb Arbitrage or something like that. So, I mean, just looking for something where I can make extra money that I dont have to spend a boatload of time doing outside of what I already do, because what I do is very time consuming anyway.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, it is interesting. I mean, I do have some skills, and I guess I just really havent sat down to think about how I could package a coaching service with those skills. Id be at least be willing to listen to what AI can do if I have an idea for that coaching, what I can help build.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, thatd be nice.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"We can do the 630.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, I dont mean that. When I say not very much, I say less than five.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Um.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im not selling anything. Im just like a nine to five person looking for a way to make extra income and wanting to learn more about AI. If I need to be a business owner in order to really use those tools, then I guess maybe I misunderstood the advertisement.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Got you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"You too. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, thank you.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I think thats all I have for now, Tony. I really appreciate everything you provided so far.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"All right, one train, three high leverage systems. And then you mentioned one of the systems would be scalable offers for new clients and then after that itd be automation.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Not very much, like I said, because I ran up the balances.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"And whats your name again?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"You said leadership, right? Probably health and wellness. Maybe like resume building type stuff, maybe because I think I have a pretty good experience doing that. Um, yeah, those are the first things that come to mind.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I dont have a lot because I was taking care of some things debt wise and just household stuff. Like right now, personally, I have just $700 set to the side right now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Whatever you got, you great.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, Ive thought about it in terms of seeing that its an option for what people can do, but I havent thought about what I personally would bring to the table in terms of coaching and in terms of the services you do. I dont know if you have to have something that is unique to the individual or if you just have something in general, like kind of what you had, like, advertising about, hey, you can generate more income with these AI tools. And so that looks like its in the online coaching space as well. So I dont know if youre just taking something thats already there and just packaging it or building your own version of that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, Im saying its going to work for me, but when you say cancellation fee, I was like, all right, so if youre saying that, I was just curious as to how you ensure that cancellation fee is taken care of. And Im asking because some places would ask for information up front. And of course, if you come to the appointment, then obviously theres no charge. So I was just curious as to how that worked.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, I have a calendar.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So last year I had that W two here, too. It was like $74,000.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Is how to use the AI tools to make it even better.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Im okay.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Tomorrow is pretty busy. Do you have anything for Friday?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Got you. Okay, yeah, sounds interesting.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"I do, but again, thats what I was saying. Like, I had increased my balances last year because of travel and other family things. So basically just trying to pay that down before I really do. Any other hard inquiries.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I can watch it tonight after this call. I actually have somewhere to go, but when I get back, I can definitely watch it, especially since you said I can speed up the cadence, which I definitely will take advantage of.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, so it says $100 cancellation fee. So how is that handled?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Thats fine.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Central.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Just ways to write your resume, to get more hits on it, a lot of undergrads. Im not sure what it is now, but in general, a lot of people think, oh, to get this job, you have to cast as wide in it as possible to appeal to the most companies. When theres a specific job you want, its best to write the resume for the job specifically and have keywords that line up with whats in the job description, stuff like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You said itd be a free 60 money consult or did you say there.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Im ready, Tony.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, you said its a two and a half hour training and within there its going to be two main trainings or just one training altogether.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I can, yes.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Sounds great.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Got you. Okay.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}}]