[{"pageContent":"Thats right, yeah. I would like to hear from it from them. Sorry. And I would like her to be in the call as well because well, shes starting to work with me in this company. She has her own thing, but this is like a thing that we both have. Right. So we wanted to invest into it. Both. She has very good credit, better than mine, actually, because shes been living here for longer, obviously, shes from here.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats good? Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, man, sure.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, you can send me the resources. They can take a look.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I would like to book at least 20 appointments a month.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I think its good. I would like to hear the video. Right. Its a three hour video. Just going to tell me how to do it myself.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, I think that getting leads, only leads. I dont know if theres some sort of pre qualification or something like that might be right. So probably its going to be more than five, but a bare minimum is going to be five. And I can handle up to 15 people coming, all companies coming every single month. So 20 max, the amount of leads that I can handle right now. Okay, right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Probably going to be Thursday. I dont know if you work during this week for religious things, but probably Friday or Thursday is going to be good. Do you work? Yes, this week?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I got it right on the other side. Just text it.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I think that the first goal will be thirty k a month for us. Right now, the business is very young, but were going to make it around 15,000. So that is going to be good for us to start as a goal.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right, thats correct. So I dont know how do you work with artificial intelligence right now, but the team and I, we use AI protect and maybe for inspiration wise not to get clients, actually just to work with the clients that we already have.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Will be 120.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, well, right now the way I get my clients is going to be a lot of referrals. Normally its going to be a meeting I like to do in person. I have clients here. I am located in Florida, but I have people working in New Jersey and also I work in California. Right now were going to start working with a law firm that is located in Los Angeles, California. So the way I do things normally, Im the one who does the sales and the marketing team does well, develops developments and designs and everything. So the way I do it is by going talking to them, having at first probably a sales call like this one. Then we have a soon conversation, and then I just go there and show them what we can do in person. Right. Its probably going to be like that. Obviously in person is for me, better always, but I dont know, probably with a call, its okay as well.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Going to be around three months.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, I dont know. But obviously, if I have the possibility of that, or I would like to know the minimums that you work. Right. Probably you need more than 20 people, what you offer. Right. So I can get an idea of the things that I have to invest and how many people I have to be able to actually talk to and get my numbers right.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, its pretty much like that, right? Something like that. So the business has been, weve been doing this for the past three to four months, so its really junk. But as I told you, I would like to make at least 30,000 a month. Thats a goal, right? Thats what Im aiming right now.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thats great. Thank you, Tanya. Thats really a nice conversation. This company is obviously different than the other companies Ive been talking to that basically just sell leads or, I dont know, information about clients. You dont even know if you wanted to work with me, which is incredible interesting as well. So thank you.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"ItS going to be probably 710, something like that. But I dont know the business. Right? Because its John.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, thats great.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Marketing services, SEO optimization, website development, utility science, like logos and branding, and also professional photography, things like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Youre welcome. Talk soon and have a great rest of your day. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, were looking for new clients, pretty much. Okay. I think thats what its all about for me. I would like them to be certain kind of client. Right. We also need some kind of budget for us to be able to advertise their businesses and to do marketing campaign pictures and that we need them to have at least $8,000, for example. So the client has to have or be able to have that budget, for example. So if you can do that, screening will be great. Looking for clients is pretty much what Im looking for right now.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"My personal credit score or the score from the business?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Through machine learning? Or do you use artificial intelligence for that? How is that?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Like that idea, but if you think that these people can help me out with a business, this is a side hustle for me, and I obviously wanted to grow. But I do have another one, which is my actual business, the one that is growing and where I get my salary.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"For you. You need more than 20 people coming. How does that work?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Dollars? Yes. Are you able to do it?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"No, in the beginning I can do it. Its not going to be a problem.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Or is that no, thats great.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I dont have any specific budget for that. I dont have any specific amount for that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I can do it. I can take a look.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Sounds good. Thank you. You thank you.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"That sounds good. Lets do it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Obviously, yeah. Lets try.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Sure, Thursday.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, its not a problem. $5,000 for that. But I would like to know what is going to be invested in.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, for the marketing agency side, I definitely want to do it. Its something I need. I obviously need to hear a little bit about your company and to know how do you work and who am I talking to. Thats it. Im definitely going to invest into this, and I want to do it with a company, and I want to get leads, at least for the first two years, until probably my website has a great SEO and people are coming, but I dont know. Thats probably going to take years. So until then, I want to have new clients now, and I want to work with someone that knows how to do it, understands the market better than me because I dont live here well. I moved here about a year ago, but now Im starting this business. So I want to know a little bit more about how to market my services. But definitely something I want Im going to do it. Im going to do it probably this month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. Why dont we do it at three? Its good.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thats good. I like that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im in East Coast, Florida. So eastern time.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes, well, we do have a lot of referrals, but I have a sales team, for example, that doing co calling with database that they have. And also we need more people to be able to get more clients. Right. Because right now we already have a few clients that are making a good portion of all the sales of the business. So I think that right now we are good. But if I want to invest in getting more leads, so I will have to get more people working. So right now Im not investing money into get more clients. Thats pretty much what I want to start right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right, the results that I dont know. I dont understand the question. What do I sell? The question?","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Yeah, I think 20 is what I can handle right now. If I have more than 20 people or 20 clients, I dont think that Im going to be able to give them the proper time. And probably the work is not going to be as not going to be able to be as good as I want it to be unless I have more people working. But since its a new company already, I will need more people working to get more than five clients a month. For that, I believe 20 is a good number to get five of them to close five.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im going to try to do it right now, if not, probably at 06:00 P.m., around as soon as I get home.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, can you send me the prices? I know that I have to have at least $5,000. How is that tomorrow? Has any kind of am I going to be charged for tomorrows conversation?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"It will depend on thats. The reason why Im looking for other companies, I would like to know what is there to have or what these companies can offer. I would like you to know a little bit about your services. What do you do, how much does it cost?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"But I know her credit is a good credit. Well, she is my partner in this business. She has a lot of experience also managing restaurants, so she has experience with marketing for restaurants, things like that. So also thats a good target for us. Restaurants. Its a very good target for us. We have a lot of experience there. Well, I have a restaurant as well, so I have some experience with it. Thats right. Thats why I want to have her as well.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Thats right. Big one. All got it.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Maybe I can even look, I have two different businesses. I thought, honestly, that this company only works with marketing agencies, but probably you also work with other things, right? Is that correct?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I have the check, man. I have the check. Honestly, I dont work here. Ive been paying myself through this new company, but its going to be pretty much it.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"The person will be talking with me.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thats right, tomorrow is five. Do I have to be alone only myself during the call? Or can I have my wife because she works with me in this company?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Last year. Its going to be a little bit hard to tell you that since not all my income is made through that system to the double deny. For example, I make a lot of a good portion of the money I make monthly comes from the businesses that I have in other countries. So I can tell you, yeah, thats fine, but its not going to be only from here. Is that okay?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"710 probably is going to be more.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right, okay, thats great.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"In the afternoon, around 02:00 P.m.. Do you have that time available or not?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"For a long time, but Ive been the marketing director of another company for a while, a company in South America. But now some people ask me if I was able to help them with their businesses. So I started to have a lot of referrals for people just wanting me to help them with business. And at the end, I decided just to start my own company. Thats the reason why its so young. But we have cases that are for five year long cases or well, we have a lot of things to show the things that this company particular company is junk. But working for those other companies, as marketing director or marketing management manager, I do have things that I can share for someone.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, its a different thing. We sell products in supermarkets, so has nothing to do with marketing. But we do sell products in supermarkets.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Text you? Maybe its better or do you want me to just say it?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"My income was 120,000. But its not only in the US, right?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"We have other people that you can talk to, but probably is better for with me, at least at the beginning, can do it. I have the time to do it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hey Tony, I think that Donna just text me, right?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes. So is 20 a good number for this company? For Air, I believe, is the name, or you need more than 20 people. How do you do this? Do you sell?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Im looking into getting more leads for my business and I think that this might be a good idea. Right. I just want to know, what is this about?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, I didnt understand that. Sorry. What do you mean?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"I dont know, man, but its way over 700. I know that. I know its better than mine. Mine is at least 720. So her is going to be 750, I guess. Something like that. Im not absolutely sure.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, I ran ads for other companies. I dont run ads for my own business. As I told you, Ive been doing this Ive been working with advertisement and sales and digital marketing and marketing for many years. But I moved here to the US. And Im not from here. So when I moved people connections that I have here, well, I started helping them with their own businesses, small businesses, right. And started to go bigger and bigger. So I decided to just create a new brand and do it as a side hustle, which is what I do right now. Its a side hustle. I would like it to be my full time job because I like it, but I will have to quit my job at the other company right. The other company is also mine, but its what I used to do in Peru where this company is located. So the way I do things. Ive been running ads and Google advertisement, facebook ads. Now TikTok ads. YouTube. So I do know how to run campaigns. I have clients that I run ads for here in the United States. I can do Google, Facebook, no problem. So I would like to invest into my business for advertisement as well. But I havent done that yet because first thing, the website wasnt ready yet. The website now is almost done, but we recently add some new services. So I changed the things a little bit. So right now youre not going to be able to see it, but the name is going to be Metalusa. Like gold medal metalusa.com. Thats the name of the business. Well, I do know how to run ads. I do this on a daily basis right now as well for other companies, I can do it. But I think that you are going to be the one thats running the ads or something like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I didnt understand that we have to pay $100 if we dont show.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}}]