[{"pageContent":"How are you doing?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I am really looking to scale myself out of debt, be in a better position to enjoy time with my family and travel more.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, I totally understand. One of the things I wanted my wife to understand, but she didnt understand that. And I understand where you come from too. Its like if Im working by myself, making five grand, thats good. But if Im working with someone else and the partnership is doing ten grand, thats even better because we each have five grand now. And if it gets to the point where each of us has ten grand a month, thats even better. And like you said, gives us the capital faster.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Well, after looking at my budget, thats going to be sufficient in allowing me to take care of my daily household expenses as well as be able to set some money aside as liquid capital for whatever future goals I have or any issues that arise.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I really dont have anything right now. Like I said, my income dropped drastically over the last six months. I dont know whats going on. I dont know what happened. I need to figure it out.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Of course not. I mean, for instance, if Im trying to get a Mercedes with you go money, thats not going to work.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"570.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, I mean, its not just Air in particular. Its the fact that the process of scaling my business because Im one person and I need to find the best way to scale my business in the shortest amount of time, especially when Im not, for instance, that good at marketing.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"And I totally understand that too, because theres even a Bible script that says two are better than one. Because when he falls, hes got someone help him up. But woe to him. Thats alone. It doesnt say you cant do it alone. Its just going to be harder. Like Im hinting at.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes and yes squared.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Weve been separated for years. Were just supposed to go to mediation for the divorce, but she didnt even respond to her own attorney.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Not really.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"How are we doing?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Let me see. Let me count the ways. I mean, it would really free up my life in such a way that I could be bouncing from here to Hawaii to Rio de Janeiro to Italy at my leisure. I mean, in the next 2 hours, be on a flight going to Rio.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Of course.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Right now, its about 15,000, and it was better until August of last year, but I dont know what happened.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I am still working that out.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont think I have, because I was looking on the Facebook message app and it was showing me how I did not see the Access Now button. Hold on.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"I totally understand.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Im an It specialist. I work on computers. I sell computers. I also sell smart devices, like tablets, smartwatches stuff like that, as well as I help people to be healthy, wealthy, and wise. So I need to be able to scale my business regardless of which avenue Im going, and I need to do it in a short amount of time, since Im not that great at marketing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"What I want to be making is minimum 5000 a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No. I am trying to scale my business in a process. I work with a few web platforms to get subcontract work. In addition, Im working to scale my business on my own. But you dont always get a subcontract. And Im looking at the employment industry, the It industry, from a w two standpoint, and theyre not wanting to pay very much. I mean, the rates theyre wanting to pay is the rate that I was getting back in 1999. And its like, okay, somethings got to give, somethings not right, and we need to get all the politics out, or I need to not change my career field, for lack of a better term, but maybe look for a better route, a faster route. For instance, I can get to Atlanta by going through Miami, but is that the best route? No, I need to go north rather than going south.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"$5,000 TV on sale for $2,000, but I dont have the extra $2,000, doesnt matter what the price is on the TV, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]