[{"pageContent":"I love the grind. I love the grind. I dont love the problems that come with it, but just is what it is. You get the good with the ugly and part of it, I guess.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, Ive been doing flooring since I was 15. Im 41 now.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh man. I guess I must have clicked on the wrong thing I had because maybe I was reading through it and clicked it or filled out some information by accident. But Ive never been in the consulting or actually in the coaching kind of realm of the world. Its always been just hands on construction and sales, something that Ive always been into. So I really didnt realize I was clicking on something that was built out for a teaching or consulting company. I guess I made a mistake. Not sure.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I see. Yeah. Ive never thought of it that way, but you are correct. This would be a shift in doing the same stuff that I do now, but teaching it exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"That is correct, yes.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Im doing good. How are you, sir?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, if Im going to coach any consulting, the consulting aspect would be ideal, but most people, I believe, say they hire me to do kitchen anyways, theyre going to consult me. Im already a consultant on directing them, on what kind of products and where to buy them and how to use it and where this product can be used and where it cant be used. I guess already they kind of get that free out of me when they hire me to do a project. Right. So that portion of it being I think Im already in next draw by me doing that keeps me from doing the other things that I may be paying attention to as well. Because not only do I consult, I actually place the product orders and I also direct everybody on which direction theyre going. Being that COVID did happen and if I did start something like this and I can charge thousands of dollars for it, boy, would that offset the downtime we have on the other projects we have. I just have to hire a project manager to take a step in my position. The problem with that is that two things. One, if youre hiring somebody like that, that is as good as you. They dont need you, they might as well start their own stuff. So replacing me with me would be very difficult.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It just all depends. Some of the bathrooms are around 35 and then get some that are more. But I would say, like, an average bathroom, like just a small bathroom, will be 15 grand. Normally its like 1530, and then if they want something extravagant, 45, 50,000.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its kind of slowed down now. And thats why Im reaching out. I wouldnt have to do advertising if I had enough work for the next 30 years, but that was the whole point of requiring we kind of kind of slowed down. I think its the economy and the interest rate. The Feds raising the interest rate, so thats causing an issue. So it ranges right now, I would say the last three months on average is about 50 grand a month, and thats way below than what I need to be 125, like I was running a couple of years back.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"How many sales calls would I need? Well, thats a good factor. I mean, depending on what our price point is. Well, obviously depending on how many sales calls were going to use. So 20% of your client, 20% of your 100% of people that come to you are going to be your clients. Theyre going to be your customer. Only 20% out of 100, right? So 20 out of each 100. Now, I would take that number and divide it on how much money I want to make a year in the twelve months. And that would determine on how many sales calls that I would want to make for the month. I would say for doing 3000, for every 25, I would have to at least make 200 calls realistically, depending on what my number needed to be at the end of the year.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, I run a flooring and bathroom and kitchen remodeling company. Okay. So I got a showroom.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, we got labor shortage for sure. Everybody now is transitioning and working from home, so physical labor is down. That would be one of the challenges were seeing. Theyre just trying to get rid of the I think what theyre trying to do is just get rid of the middle class, man. Theyre going to be poor or rich. Thats whats going to happen now, the way the economy looks like its turning, so I dont know. Where are you based out of? Arizona?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Budget floor. Is this Damon?","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yeah, I apologize. Ask me that question again. I had one of my clients just pulled right up on me as were talking.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Holy shit.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"I think thats the problem.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Boom.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"No, I still got the manpower to facilitate anything that we have to do on site. Although I love it, I actually enjoy it more than sitting behind a computer and researching and putting bids together and looking at plans and all that stuff. Id rather be out creating with my hands. Im a creator. Thats what I do. Thats what I love. Thats why I got into the business. But the day to day struggle on just find talented people to be actually to be able to perform as you need them to and also to have the drive and the want to show up. COVID taught most people now that didnt have jobs or that worked and hustled all the time that it can survive without really actually having to work every single day.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I guess you could do Google Ads, too. Some PPC. I dont know the answer to that. I would say.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. We do, like, you know, bathroom kitchens and flooring, depending on what it is, where were at on our projects. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"You got to understand, with our schooling system these days, man, theyre meant to keep the general population stupid.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You were doing other than doing the build out, painting the framing drywall, all that stuff?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Wow. Okay.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah. Give me 1 second. Give me 1 second. Are you there? Sorry.","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"It sounds phenomenal. Yeah.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"After I get done with the regular business, I stop here about 06:00 from 68. Me and my girlfriend run it together, so shes there most of the time, but with all the prop building and coordinating the different backdrops that were replacing, I do that on the weekends.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Tomorrow as of right now.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, I did that this morning, I believe, so I havent had time. Ive been balls to the wall since it got started this morning, so I havent been able to look at anything. Was it sent from an email?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"So you guys teach people how to scale a coaching.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, I just bought a new truck, and I think it dropped it to, like, 789 or so or 689. From 820 to 689? Yeah.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Okay? Sounds good, man. I appreciate it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Damn.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay. Yeah.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Check it out.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Oh my gosh, I spent retarded amount of money on PPC ads.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Youre talking about the PPC ads?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"It is, yes, sir.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, I quit here lately. You have to spend upwards into the 1200 a month and up just to really see any kind of gaining any kind of ground, especially if youre fighting over actually, you know what, for the Selfie studio, it wouldnt be so bad because youre not fighting over them keywords.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I guess Id have to think about it. I guess when I was looking things up. Is that what this company is about? Is that what your company does? Well, you guys do advertising, right?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. Yeah.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I think. Well, see, theres a trick to that. So I would say about 85,000.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, man. Of course. We all want to die and be millionaires, right? Its definitely always on your mind. The problem is, the more money you make, the more shit you need and the more money you need to make the next year. I guess ultimately I would love to just make money off of coaching and teaching people how to do stuff. So financially, I would like to make a couple of million a year. If I was good enough. I mean, clear a couple of million a year, not make a million and spend 199. I would like to clear a million instead of showing it on the books that you made a million, but you paid more out than you made. So I definitely would like to see something a little more than what Im bringing, than what Im keeping now. Does that make any sense?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I guess I possibly could. I think the drawback to that is theres so much information on the internet to build in something like that. You got to be that kind of person that wants to drive that likes the grind. And for me to teach it, I dont know if I could teach it. You know, its one of those things in in my opinion, yeah, you could teach it, but realistically, you got to have it. You got to be born with it. You got to be born with wanting to do things and wanting a business, teaching it. I dont know if I can do that. I never thought about it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I think in the beginning, just, like, building any kind of business, I think you need to start I would need to start sorry. I would need to start on the ground. Right. So I would have to take all them sales calls and learn it on this direct. I would have to learn it first before I could teach it, or just, like, learning how to do remodeling. I couldnt teach it to anybody if I didnt know it. So I think that for me, for the first at least year or six months, I would have to take all the calls myself and run the calls at least just to learn it, just to figure out how it works and how its operated and how to teach my sales guys that I would bring on how to do it.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Ive got.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Not enough, realistically. We started in December, and I probably put about 60 grand in a deal. The problem with my area is its Amarillo, Texas, and so were about 250,000 people in just our area, so we dont have a whole lot. And so the business is probably making $8,000 a month. Its surely not enough at all.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yeah. So between the two businesses that I have now, seven days a week, 08:00 at night, whats the other business? I have a selfie studio. I dont know if youve seen any of those popping up.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No. Yeah. As far as Dubois, its more like ten. More like 10% of people know how to say it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right, sounds good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"So I started in the flooring industry then, and then about 25 ish? Maybe about 23, actually. 23? I started getting into remodeling bathrooms and kitchens, so Ive been doing it for a little bit of time. I would say 1516 years in the remodeling portion of it, a little bit longer in the flooring, obviously.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"How do we convert them? Yeah, so I guess that boils down to the process, right? The sales process. Youre asking me, do I want to make the phone calls or do I want to hire somebody out? Is that the question?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Its a selfie studio.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All inclusive.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Im really good, but theres always someone out there thats better, smarter.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, well, three key important aspects for me as being a sales guy, you got 3 seconds to impress somebody how you talk, how you smell, and how you look. So it depends on the person. If they look like crap, you could tell they smoke and they smell like shit, theyre not going to do any good for me. Right. In a sales position, you got to have those key elements. You got to know how to talk good, smell good, look good. From there, you got to be good on the phone. If you dont look good, you dont smell good, and you dont talk. Okay, let me say two out of the three. If you dont look good, smell good. You got to be able to talk good. Youve got to be able to have a conversation and communicate whatever youre trying to get out clear to the customer and be able to educate them. Because I noticed that a lot of these companies that were dealing with now just dont know how to educate the customer properly. And I think that would be the three key points for me because I cant work around somebody that smells like shit. Sorry, dog shit, cigarettes. I just cant work with someone like that. Two, if they dont look good, theyre 400, 500 pounds. A couple of hundred pounds is different, but when youre four or 500 pounds overweight, cant roll out of bed. I apologize if Im not saying this to hurt anybodys feelings, but if youre not taking care of yourself, youre not going to take care of what youre doing day to day in the business. So I would have to evaluate them by those three aspects.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"About six years ago.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"What is the analytics on consulting for construction and remodeling? Do we have any information on that?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I havent checked it since then.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Perfect. Thank you, sir.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Oh, man, its been eight months, probably.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Bye, all.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Ill be back later. Appreciate it. Sorry about that.","metadata":{"fillerID":39,"fillerText":"Yeah","category":"F"}},{"pageContent":"We went to Cancun for two weeks.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, its kind of a tangent. It was kind of off course, but thats okay.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Sure, right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, well, what were doing now, I guess, is studying on getting the right marketing. After my day is done, Im looking at building different kinds of ads and stuff that were running on social sites and stuff for both of the companies. Thats what I do with my free time. Now, just so you know, I dont go out and go fishing or scuba diving or traveling right now until the business is running itself, both businesses which they cant run themselves. But if we were making enough money to where we can just hire people to take care of those positions, we may not even have those businesses. You know what I mean? If we can start a consulting company thats making more money than both of those, theres no reason to really have them. Or you could just have multiple streams of income and allow it to do what it does. But I dont know the free time. If I had enough free time, Im not sure what I would do. Not sure. Maybe start another business. Who knows?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So it would be a lot different because theres not a lot of competition. The problem is having the competition is the issue. Everybodys bidding on those keywords, and those keywords actually keep going up and up. And I heard that Google was having some issues with that. Theyre talking about a lawsuit going from there. I dont know if youve heard anything about it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Some time at 10:00 my time tomorrow.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Someone walked in and asked me what would I be good at?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I wont be driving, no, but that doesnt mean my phone wont ring. But yes, I should be good to go.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"That would be the thing to do, is have that funnel. For sure. Youd have to have it, yeah, absolutely. And shoot a good video and put it on there, edit it and put it on Instagram. Yeah. I mean, I think your guys was just an ad. It wasnt even a video ad, right. It was just a regular, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"After that I go to the gym at 05:00 between ten and eleven tomorrow is when I got some free time. Then Wednesday from one to 230, somewhere around there.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Never.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Absolutely. Yeah, Id like to check that out. Give me 1 second. Did you guys get the other bag to float? Yeah, you already got them? Okay, its looking good. All right, I put the joiner and everything over there next to that house bill.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Absolutely. Yeah, that works out for me.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"People and I think it would be intimidating for me as well. But that being said, Im sure every speaker was intimidated at one point in time.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I think thats what goes back from the first question you asked me. I think that would be me because thats how I was in I dont know how I was raised or maybe it was just in me from the beginning. I think thats the question for that answer is that some people have it and then some people dont have it. Not everybody can start a business. Not everybodys got the heart. Not everybodys got the grind effort. No one can go to bed at 12:00 at night working until 12:00 at night and wake up at 06:00 in the morning ready to do it again. And I think thats probably why I said that because I guess thats how Im wired. I would probably just find, I dont know, maybe I need to not wire myself that way. Maybe Im missing the boat. Maybe Im just focused in on starting businesses and making money versus living life. And I think if the money was really good at coaching and consulting and I was making really good money at it, you never know, tides could shift and I could be like, you know what? I dont know if I want to start another business. I dont know if I want to manage that. Maybe I just either sell it or have someone else do it and just focus on the consulting. But I guess you got to be really good at what you do to start a coaching and consulting company, right? You got to just be really good. You got to be the best of the best.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, but you got to figure now, remember Rockefeller? Hes the one that started the schooling system, you know, what I mean? So smart but devious, man. He decided one day that, hey, were going to teach them kind of what they need to know, but not too much because we dont want them to be competition. And so smart guy, but God dang, man, they left out some key important stuff we could have used as society to be better than what we are now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I guess starting the businesses that I have had, the first one I started was didnt cost me anything. The flooring industry, until we started building up reputation, didnt cost me anything to start a couple of file tax information, your name, blah, blah, blah, DBA. I spent 60 grand in the photo studio, which is not turning the dollar that I anticipated to well yet to see because we started in December. So for you to ask me a question how much I would spend on a consulting company, I wouldnt know. So I dont know if I could put a number to that, but I dont know how much I would feel comfortable with investing in on something like that because I dont know what the return rate is on it or what it would be returning on what I know. So if I was going to start it something like that, probably like ten grand that I would be willing to put off on something like that, but I wouldnt see why it would take that much. But I dont know. Ive never started a consulting company, so I wouldnt know how much I would need to put forward.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right, thats it.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Oh, yeah, if were doing that, for sure. You know what, I apologize. I looked at so many deals. Of course, I get up and my brain is running a million miles an hour, and I cant remember if I clicked on it on Instagram or Facebook. It had been one of those because I didnt get on TikTok this morning. So it had been an Instagram ad, which we do some geotargeting on it as well for my flooring business and also for the photo studio. So I cant remember exactly which one it was on. But I guess your question to me is, would I want to implement that again for another business? Was that the question?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Public speaking is intimidating for a lot of.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I would say YouTube instagram TikTok. Are you talking about as far as reaching customers?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Itd be substantial. It would definitely free up it would definitely free up a lot of the day to day hustle. But I think I would have a hard time with it because Im one of those hands on. When you got two businesses you always want to be in there and watching it out. But if I did start a coaching and consulting then that would be my business. I probably just sell my other two businesses. If I can make more money coaching or consulting then I really wouldnt need both businesses or we hire other people to take care of it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I cant express a concern and I think the concern that I have is this sector kind of is kind of intimidating for me, to be quite honest. Coaching, and I would say like.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}}]