[{"pageContent":"Im doing okay. Who am I speaking with? Its hard to hear you.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, Im still trying to figure out what you are. So what youre selling or what youre wanting to do is help me, for example, get into coaching and being able to sell that. Is that what this is?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"For example, ultimately I want to be in real estate, but Im newer with that. So I dont know if coaching is the way to go being a coach in real estate, because I dont have tons of experience to be a coach. You know what Im saying?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Im just trying to understand exactly what you are to make sure this is a fit for some reason, what youre doing.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, Im taking training to get hired in to do that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Shoot me a quick text. Its going to be easier for me to do it that way than just trying to get off a phone call number. So shoot me a quick text, let me know how it goes.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Okay, so what does this entail? Because Im still trying to figure out exactly whats going on.","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Yes. So basically youre helping businesses use coaching at a bigger scale. I just havent done coaching as a business, no problem.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, just because, like I said, Im still trying to figure out what I guess maybe I was thinking that what you have is something more along the lines of a lead generation AI. Lead generation type thing. I think Im mistaking what you might be. Thats why Im a little confused.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I hear you better.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I am Eastern.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Obviously, either niche Id be happy with. Id be passionate about either niche.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I cant even throw a number at my wife handles most of the numbers on the annual I just get paychecks for and were done.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I am at my shop right now, and actually Im looking for deal work. Im actually training right now for centers and remote clothing, I say that right.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So even if you didnt have coaching experience, if you have a passion about something you can be taught that make it a coaching thing. Is that what youre trying to say?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Definitely. Good setter. Thats what Im practicing right now. So I like your setting ability.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, I am.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Did you shoot an email to me?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Lets do 09:00 A.m..","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I want to get into it as a business. Now, if it came to something more like fitness and health, things like that, I know a lot more there. I dont have certifications, but Ive trained people, Ive taken people to contest, Ive contested things like that. I could do a lot better with in the coaching world, even in church ministry. Im real experienced in that as well. Very experienced in that. So things like that I can do on a coaching level.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Who am I speaking with?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, we moved to Georgia or eight years ago. I just moved them back. Now Im moving up. I dont want to go back and just Im not going to go back and continue to do upholstery. Im not going to go back and get into construction or whatever else. I want to go back. Obviously until real estate is at a much bigger scale, I need to have a job where I can get a little bit more secure type income. And so Im really hoping the remote setting and remote closing can be sort of that temporary. Get me into make that faster security money. And then of course in the meantime work on the real estate business part of it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Would say probably about 45 a month.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I just seen what thats about.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im looking for business, change the business Im in now I do upholstery full time. I just moved my family to Ohio. Im still in Georgia. I want to get back up there. And my ultimate goal is I want to get into real estate and also into a couple of things I want to do. Remote closing. I think thats another good means to get ultimately to the real estate business. I really do enjoy the learning, the sales of setting and closing and that kind of thing. So Im actually going through training on that right now to do that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thank you. Bye now. Bye.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So what exactly are you doing? Is this like AI? Im trying to figure out exactly what you are.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, I get it. Doing a great job on that. I dont mean that. Its just funny. Im hearing this because Im training in what youre doing right now. Even if thats not your job title, that is what youre doing. Youre setting me up a consult with somebody, a closer thats going to really get me a lot more details than what youre doing on, which I appreciate. I mean, thats what I like as part of that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I guess my main question is I could have the resource. I just got to know if thats the route I want to take at the moment.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, I can explore the option. Yeah. And see, I guess I can do that just because I love coaching. Its like discipleship, really, in church. I can do that with Fitness World. I can also do that in the ministry world because Im involved heavy in church. Ive taught, Ive preached, Ive taught classes.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"A month? Yeah. I mean, thats what I bring in. She brings in more and she brings in money too, so theyre technically just more. But 45 is what I do.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Honestly, I enjoy coaching. Its just that I wouldnt coach. What I would be way more passionate about coaching wise would be into health and fitness, because thats what I do. I train guys. I had a guy win a novice competition training him. Im 51. I like to help men that are forty s. Fifty s? Sixty s and be able to train them right. And also train even some younger guys, or at least younger guys say, hey, listen, dont trash your body in your all of a sudden got to wear all these braces and have bad elbows and knees in your because you tried to lift so much stuff. Youre destroying yourself. Just things like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"What email are you sending it to?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, I will say Im pretty strapped at the moment, working, making my switches, working with remote closing and also the startups with real estate right now. So I know its got me pretty strapped there. I have a feeling when I punch your thing in it probably had to do with maybe Im thinking maybe I was thinking it was more for lead generation in real estate. I didnt think of it as for a coaching aspect of real estate.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. Bring home the bacon.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"So it sucks. It wouldnt even be considered. I wouldnt consider it.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Im not sure what all I received. I think I was going through some of it, but I just kind of punched around and see what Im looking at. I didnt know if that was actually going to work in the real estate world.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"It should be Paul at leadpartnersystem. Correct.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, Ill need a few days to probably get to the weekend. At least listen to it. Yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, yes, I can shoot me an email. Ill punch it on the calendar.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, I could probably slip that in then.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"See, the thing is let me just be honest with you. That way I dont waste any more of your time. I just wouldnt have much to put into something else yet. Like I said, Im getting into the real estate. I put some money there. Ive got to save a little capital for that as Im doing that. Plus Im a little bit with the remote closing aspect of it and Im being able to get myself back to Ohio. So I dont want to put my eggs in too many baskets here and not get too many things going on and be a jack of all trades, you know what I mean?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Probably, lets say morning on Saturday morning.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No. Bring home the bacon.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Lets wrap it up here. I got a client showed up.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}}]