[{"pageContent":"I havent done none of that. Thats what I need to do because theres some funding, some grants and some different stuff floating around here, some business plans I could do, but I havent been able to scale that piece because its hard to scale it because I can do clinical stuff and I can do coaching stuff. And so I want to make sure they line up and I dont cheat myself, but Im actually doing it. You do what Im saying?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right, because I have a nonprofit too, and I got a for profit, but Im a lived experience professional. If you see my website, you probably say, oh, man, wow, we need to get to help this guy here. But yeah, Im pretty powerful.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Currently, Im a telehealth provider.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im a practice. Im a masters level mental health condition, substance use disorder, professional.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Hello, how can I help you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, Im not that knowledgeable with the AI. I have AI and I have that apron plug in, but Im still learning how to use that. I just got it in the last week or so, so Im just kind of just trying to need my way into it. And so I was watching some other stuff about content, and Ive seen your stuff come up and so thats where you want to reach.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im at the point, man, where I got to put some money in my pocket, man. Im going to go solo on YouTube tomorrow on my YouTube channel, man, and start beating the drum, man. I know how to beat the drum. I spent 38 years out on the streets before I went and got my masters, man. I swallowed a quarter ounce of crack cocaine and died and was paralyzed, man. So Ive been a lot of things. They had me on the front page of the newspaper, went coast to coast. The Union Gospel Mission here used my picture and raised over a million dollars of picture and bio for a fundraiser I did ten years ago. So Im pretty steep the community here, man. So Im ready to get going. So send me what you got to send me. You could take a look at my website when I respond back to you and you can check me out, man. But Im ready to hit the ground, man. So Im not kidding.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, then. Yeah, thats close.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, Im branching into a coaching model because healthcare isnt Im a black healthcare provider, man. So anyway, I got a whole big old storm to fight with them about that because I got some chronic illnesses and so I see some holes in the curriculum in the program here, so Im launching a whole new program. Got it. So thats coaching.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Not far away. Hes next door to me.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im up in Seattle. Seattle Tacoma.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im trying to do it now, but Im trying to raise revenue and all that kind of stuff, man. I got a platform already, and so I have a YouTube channel and start thinking about just start launching my own content on my YouTube channel until I could build up enough people, man, so I can get some revenue, so I can do some other things with AI.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Bye bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Go ahead, let me dont worry about that part. Im down to the last twelve weeks now. I brought off fibromyalgia, chronic fatigue, IBS, Mthfro, genetic disorder, man, and white matter lesions on my brain, man. So Im doing pretty good, man.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Im in federal way, so if you tell him that Im in federal way, you know exactly where Im at.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Man Im just doing it telehealth, virtually. But what I want to do is open up a clinic, and so thats the reason why I need this funding, so I can get me an office.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Look like, I havent really been doing a lot because I got sick. I was diagnosed that I need a liver transplant in 2018.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, Im looking for that and above. I got some letters of accreditations, Ive created some programs that people was able to access any place they was at in the world, and this was 1012 years ago. Man okay, all right.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats the reason why health care is different. My whole focus is on adverse childhood experiences and transgenerational developmental and early trauma shows because I grew up in the projects as a black man and suffered all those biases, man. It compromised my physiology. And so thats whats going on in the community today, that theres so many people and people dying because they never got the correct information. I understand correct information.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Suite 714-0968.","metadata":{"fillerID":47,"fillerText":"Mhmm","category":"G"}},{"pageContent":"Im pretty sure we can, sir. Thank you.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Im trying to raise a couple of million dollars.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]