[{"pageContent":"Well, agency services, I get local service based and whats the word for it? Local, um, trades, skilled trades folks. And I get them and start them off. Theyre oftentimes very small, and I help them grow.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats it.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Well, I meet somebody and I look at where they are and I look at what theyve got in terms of online presence, in terms of, like, for example, if they happen to be, like, a mobile mechanic, how many people are they seeing a day? I already know roughly how much theyre making per client, so theyre getting, like, getting two new customers a day. And I can get them five. Basically, I talked to them about, well, do you have enough employees to get you to service five? And they may say, no, I got enough to service maybe four right now. Youre two, I can get you to four. Would you like so I can get you to four. Theres an extra $500 a day. Are you interested? And most people are, but I have to guess it. But I have transitioned from where I am to where they are. Im not quite there yet. So some of those people, when I find them, and when we have that conversation, its very appealing to them, but I need to bring in a steady flow, and thats not what I have right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Wednesday or Friday.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"$40,000 a year.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Great. Thank you very much.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No, Im not just starting it. Thatll be a world record if I got to that point within my first few weeks. Thats what I guess what Im getting for people, but Im not getting it for me.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Whats your goal for the well, I would say about 15 to 25. Like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im going to be available. Im going to be available for sure on Wednesday.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, well, thats where Ill be, and if you send me the calendar, I can put myself on. I look forward to finishing up our initial conversation, see if we can work together on this. All right. Possible to help me? Is this the kind of thing you could help me with?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Well, it varies greatly, anywhere from 500 a month to 2000 a month.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I like to get closer to 1525 like that. Im more closer to five to ten. Yeah, right on there.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Over 125.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"You got to do like 700 to 1500, like that. 2000.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes, I did. Yes. That was me.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, thats why Im contacting you. Mines word of mouth is not consistent.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I did not.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Do you think so? I apologize. I got to get going. I got to go do something. But I would like to set up a time. We could finish talking if youd like.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"So I get a lot of they go from, like, $40,000 a year to $400,000 a year. Got you. But I need more of those. People love it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Because once I know the physics are there that this fits what they need. Yes. Go right now if you want. Yeah. Once I know the physics are there that this is going to make them more than they made before or theyve made in the past, its just a matter of time. Unless they dont want to be bigger. I can always get them there.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, I mean, there are some new methods out there that, with AI can be effective. Im not sure exactly what they are, and Ive heard people talk about them, seem like theyre telling what theyre saying is credible, but I have not actually tried it myself, so Im curious to see whats out there that works.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"If I get, for example, ten new customers this month, and each one is going to pay for their visit, for their visit from the AC guy, theyre going to pay $300 for that visit, for that repair or whatever, that diagnosis, thats 300 times ten or an extra $3,000 a month. But oftentimes they get a lot more than that. Thats very conservative. So thats an extra $40,000 a month. If all we did was just that. But we get more than that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, I do, but what Im looking for is I dont mind doing the investing part, but I want to know what tools or resources would be available if I came up with that. So thats what I need. Youre going to ask me, can I afford it? Im going to ask you, can you deliver? So thats where I am. I want to find out tools that are going to help me get rolling up, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"But I would love to. Thats why I contacted you.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So you send me a calendar then?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Sorry, come again?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Well, theyre making more than I am, but I want to move that around a little bit. So theyre making as much as they are.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello? Barry yes. How are you doing?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Oh, yeah. I need to find a better way. I mean, I like to find something that works better. When Ive used in the past. I dont like the results.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ten by the time they seem like were interested in seeing I understand the physics of their particular business. I know I can deliver what it is. I know exactly how much Im going to be able to get for them every month, because I know every person, say, for example, is an air conditioning company. Every customer is paying 275, 300. Then I can get them, say, another $10 a month. So I can get them, like, another ten customers, each one paying $300 each. And I can do that for times every month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, thank you very much. I appreciate it.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I apologize. I got to get going now because I just got the word that I have to do something for the whole family. I have to do it now. So I apologize. But Id love to talk to you again. If you give me your case, send me your calendar, Ill be glad to set up another time to talk, either tomorrow or Monday or probably tomorrow or Wednesday.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Is that what Im no, dont try again. I do this for people. As a free agency, independent agency, I get those kinds of results for people, but I want to get more of those people.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, I have some time available. I want to use it for what is more productive, for things that are I still teach college classes, but I want to get more engagement with potential clients, because once we start making some money for them at lower level, I can usually almost always get them to a higher level. Thats what I want to be spending my time on. Thats what I want to spend my time on.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"We could probably start then. I havent had a chance to talk about our schedule tomorrow, but I think that would work. I just have to double check. Sure.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Eastern time. Thats right. Where are you located?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Over seven.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Eight or nine? More like ten or twelve, like that.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, Im credible. The fact that everything I tell them is true and everything that I tell them, no one ever quits. Once I get started with me, they never quit. And thats because theyre always making more money than theyre paying by a long shot.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, as I said, I have to talk to people and see what theyre going to do tomorrow or Im going to do we havent had that conversation yet. But once Ive had that conversation Ill know, but we just havent talked about what were going to do tomorrow yet.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Oh, no, thats where I want to go. Im not there now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Go ahead, sure, no problem.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Calendar or something like that.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Eventually? Six or seven out of ten.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Thats it.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}}]