[{"pageContent":"Ive created quite a bit of different kind of platforms. Right now, were working on some computer generated things, and like real estate, I have a couple of different businesses. I have an apparel line, and Ive been running a digital agency for over 20 years. And we also do real estate. So I have a lot of clients that Ive been managing for years in the It creative space, internet, web design and stuff like that, and just wanted to take it to the next step and be able to introduce some things to my customers before someone else does.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"With who?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Well, I know that AI is really about AI. Its about putting things in order, getting a good funnel, getting some good information and running it. With AI coming out the way it is and doing all the different things and plugins thats starting to happen. Dont need a big staff to run and do things like we used to do. So want to aggregate what we got going, get real familiar with some value, add with the AI space, and start hitting up my customers. Have some of my agents start hitting customers up. Hey, we got a new program marketing doing this. We have this which just allows me to restructure, get a little closer, and get a tighter bond with my customers in 2023 going into this second quarter. Absolutely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im a little bit older now. I was trying to give it to my daughter. She turned 21, graduated. I dont know whats up with these younger kids. And she was like, I want to do my own thing. So I was like, okay, go ahead and do it. So one of my subcontractors out of India, he wanted to take it over, and I let them kind of work with it for about a year, and it really didnt hit like I wanted it to. I thought it was, but it didnt hit putting them in the front and just rearranged restructure some things and then brought it back down to where we got it now, and its just moving.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Id say some organization phone calls and just hitting it hard when you have people working with you. And Ive had a lot of different employees and really want to get off of the employee thing and maybe an account executive and then streamline what were doing with the AI almost as a virtual assistant type of thing, where we can work together with the AI. And the component where youre talking about, which is the personal human touch, is the part that will accommodate where that part is missing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, I definitely like to be a little more proactive and get the person whos working in there, get them a little bit more proactive, and kind of turn everything up for what we have.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, I dont. Not off the top of my head at the moment.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"AI.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Okay. Ive been working with people. Ive been hosting websites and all that stuff. Lawyers, doctors, attorneys, dentist offices, real estate brokers, stuff like that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Take care. You too. All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, its probably in, like, high six, low seven, somewhere around there.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im not a person to say, oh, I want to make a million dollars because I know what it is. I know how you get taxed on it. So what Im showing what Im making is very minimal, which is how I like it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I have ten minutes. I can just send you a text and say, hey, I didnt get it, for sure.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I dont know. Ive been doing it a long time. I really dont know. I dont look at the sheet and count them all. Id say over 100 clients.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I think it may be less because some clients are off the radar. Some clients arent doing anything. Some clients have come and gone, but theyre still in there, still have their phone numbers and contacts and things like that as the World Turns and were talking 2025 years of business, and then were talking about three or four years of COVID So a lot of people got knocked out the box, a lot of people consolidated, and some people are just swinging back. So what I like to do is just kind of go through all of my resources and really kind of hit them back up. Another thing that Im doing currently right now in our real estate space is were buying a lot of real estate. I have several different investors, and were getting ready to come out with this tokenization platform for Tokenization of real estate. I got a couple of ebooks and things that Ive created already and I want to be one of the experts in that realm of tokenization of the real estate. So I got a platform well be finishing up probably in about 30 days. And we got some properties that weve been working on currently that were going to be putting out. Test market, make sure it works, we have a secured token and then from that point on were going to start expanding and then Im going to take that into my space with my real estate brokers and start hitting up the bigger broker offices. Because whats going to happen is that all the middlemen in these businesses are going to get cut out unless youre tied to some type of technology because people are tired of paying all these extra fees, especially in real estate.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"For a couple of months here, just with that stuff. My real estate stuff is a little bit different because were buying and turning and flipping and building. And I have been working on a model just like you said, the personal touch. When people are in foreclosure, they tend to shut down and get real quiet and they dont really speak about whats going on. So we want to be able to be the blessing and try to help. And if we cant help the people stay in the houses, then we definitely like to take it off of their hands, give them a couple of bucks to get on and save their credit so they can do something different. So Ive been playing with some things. Ive generated different types of letters and stuff like that. I played with a couple of marketing things on Craigslist and a couple of other things just to see how its going and just doing a lot of test modeling right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ive been working with AI. So Ive been working with It and doing some things. And from what I remember, there may have been something on your site or saw an ad that piqued my interest regarding that and expanding business. Okay.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, not at all. But like I just told you, how many people do you know get the phone call and say, hey, you want to go on this tour and film it with all the top rappers from the 90s? Those are all the old school top rappers. If I could take any of those rappers and say, hey, give me five minutes and tell me about this, and I got tons of footage from them, its no telling what can be done. So my focus hasnt been over there because Ive been doing the real estate. But with everything coming on, especially AI and the resources I already have and things that Ive tied into, I need to take a better look at what I got going on and take advantage of the opportunity. Right now that we have with AI, thats what it really is, just taking advantage of the opportunity. When you got people working for you, people get sick or they get problem with their husband or the wife, its always something. When you got AI and you could plug something in, its just going to go, its going to move, its not going to complain, its not going to talk shit. Its just going to do what its supposed to do. And those are the things that I would like to kind of see whats up with that and see what kind of measurements that we could do for progress.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its an average month. It fluctuates, but yeah, its average.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, I am. Got a lot of resources. Where are you located?","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"I am.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Just word of mouth. Just word of mouth.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"So check this out. Have you heard of the Mount Westmore tour? You know what that is?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. If you come from a background like mine and youre hanging out with all these different people, its very easy for me to get work. If I was really focused into the digital space like I was when I was younger, Id be killing it right now because I know everybody. I know youre, your money bag, yos. I know your wiz khalifas. I know those guys. So its very easy for me to say, hey, let me come over here and let me throw up this video, put this T shirt on with my name on it. Its very easy because I already have those relationships and had those relationships. So just looking at what it is and how much money can be made and like I said, you got the AI, man. Its totally different. Im doing test model stuff with chat, GPT and new types of businesses in my real estate and marketing people in foreclosures. Im doing different things and Im seeing the measurements just with that. So in my business, its like, wow, if I took this and put it over here and amplified it, Id be getting that much more. So thats the reason. Thats why I called you guys. I think thats what I saw on your ad or whatever I saw that prompt me to give you guys a phone call.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I want to hit six figures plus period. I was there at one point. Things kind of dwindled down. Like I said, with the economy and the way that things happen, the pandemic, the scarcity of everything. Some people survived, a lot of people got shifted and moved out and I just need to reconnect with my clients and see where everybody is and have some new value add for them. Thats really what it is.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I havent really been focused on that and had somebody running it. Right. And Ive been mostly with the real estate, Id say for the past two years, two and a half years. I do from time to time get in and see whats going on with the agency, make sure that the clients that we do have are being serviced. But no, we havent marketed in quite some time.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"You could text it either way. Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"I didnt get it.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Maybe about 1518 appointments? Yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thats fair. Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Hey, I appreciate it.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I havent ran any ads in a long time, bro.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"To make a move because Im calling people. Im just letting you know. Look up. My name Monk Heinz. Im 2016 United Nations Advisory Council Chair for Entrepreneurship. Im 2019 Entrepreneur of the Year in Los Angeles in several different cities and counties. Ive been running business all my life, since Ive been a teenager. Im not a person thats like, look at me, check me out. And Ive never been that way, which is why I dont like putting all my stuff online and all that stuff. I never liked that. I got started at a very early age in fashion design, and I started back when we had, like, Coral Draw and Illustrator 2.0 and just wrote all those programs all the way out. So when people are asking me for clothing, clothing, designs, layouts, Ive done layouts for different department stores. Like, all kinds of stuff, man. All kinds of stuff. Ive done some things for some movies. I did wardrobes for movies. Ive done custom design for whats the name of that show? Its a dancing show. Whats that dance show?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"No, I said I like doing no, I said I havent done a lot of it in the online space, which is why Im looking.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im not spread at all because I have partnerships and Ive been doing this for a long time. So when you talk to people and some people say, well, its a lot of stuff. No, its not. This is what Ive been doing for over 20 years. Ive been in real estate over 20 years and Ive been doing my agency over 20 years. Id say right now I got about five execs that work with me in the agency. And for real estate I have an account executive and then everybody else are brokers and subcontractors. You dont really need that. Its all about management. Its all about for sure. My thing is getting out there, maybe marketing, because I havent marketed in so long, never had the reason to, because we get so many clients and was getting so many clients and referred. Right now is a little bit different time and I want to turn it up and make a little bit more money and get some things rolling.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats fine. Ill watch it because its business. Its something thats going to open up and give me some more money and hopefully keep my guys a little more happier so they can get more work and move around and do some more things. Just make it more active.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, I dont know what it is.","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"All right, thats cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Okay, so the Mount Westmore tour. Snoop Dogg Ice Cube. E 40, too. Sure. And Warren G. So my company just maybe about six months ago, five months ago, we just finished that tour with them. I was on the bus with Warren G. New dog, was setting up a Netflix documentary, and we filmed the whole concert. So I went to Tennessee and Oklahoma and all these different states on the bus with the cameras. So those are the types of things that we do. And my resources, since Ive been in the game so long, my resources are phenomenal from executive producers and things like that in the industry that I can call and say, hey, man, I got this thing going on. I need you to check this out. And then boom, I can get work just like that. So I have a lot of friends. Im from California, born and raised. I started off in fashion design in my team. I did extremely well. And then as you keep expanding and expanding, you just get well known for certain things, and people just call you out for it. So thats where the agency came from, out of that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I got the resources, I got the people. I got more resources than people that probably in business long time where I can just get on the phone and say, hey, what you guys got going? Oh, I got this album cover. Can you do this? Can you shoot this music video? Can you do this? We get tons of offers for different things. So after me doing it so long, to be honest with you, I just kind of grew out of it, which I was trying to give it to my daughter and kind of moved into the real estate development of everything. And it has allowed me to buy real estate and to do it from what Ive been making and doing. So thats where I take my little pennies and buying real estate and developing and making new houses. Im currently talking to you from Cleveland, Ohio. I bought like twelve houses like three years ago when the pandemic started. And right now were just finishing stuff up and Im going to be selling off a bit of that portfolio and then coming back to California and just doing some different things. Im just an older guy getting a little bit older. I just want to take full advantage of the resources and the relationships I have, including putting in that AI component, which would help tremendously.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. What is air? AI.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"About maybe about 68,000, $70,000.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Its a little bit of both.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Oh, I dont make that much. Trust me. What I make is nothing to write home. Maybe $58,000? I dont make that much. I dont put that on the book so I can get taxed on it. I dont work like that. Okay.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Mobile apps, websites, commercials, videos, anything visual, we do and have been doing. Were out of California, and things have slowed down considerably because of the economy and things that are moving. Some people are just looking for other alternatives to expand what theyre doing and just want to be able to have some cutting edge software information and ideas that I could actually introduce them to and give them some value add on what theyre doing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Dancing with the Stars. So my buddy, hes the stage director, and Ive done costumes for them. I just get all kinds of work, man, like, all kinds of stuff. And when youre in it like this Ive never in my life, to be honest with you. Ive done some marketing and some Google Ads, and those things werent as successful as just me getting down to it, hitting people up, getting in industry, going out, hitting the clubs, doing those things in California, because thats where the money is at. Ive been way more successful that way. And not to say that the online stuff doesnt work. That just hasnt been the way that Ive made my success. And I know because people say, why dont you just get a YouTube channel and do this and do that. Im just not that person. Thats not how I want to make my money. Im sure if I got on YouTube and told people about this and that. I got tons of just good information and ideas from entrepreneurship all the way down to real estate, but thats just not where Im at. I just like to kind of move it, expand it with someone like you, your company, because you guys are doing some phenomenal things, Im sure, with what you have. And then Im sure theres a big learning curve for me because you guys have been doing that and Ive been doing mine in a different way and been out of the space in a little bit.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]