[{"pageContent":"Revenue you want to get to with.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"A month.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Its a lot. Were like over a million.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"With a business like that, 250 is a good number to start with. But I mean, like, eventually, like every business owner, you want to start somewhere, speed grows, like annually. Yeah. Im thinking maybe I could just look into the different services and see what we could potentially offer online. I could even do that for the adult store as well, because theres a lot of people with impotence and stuff like that that we could assist online.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"But I just didnt check because I literally just did it right.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Its a business that Im getting started.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, standard medical pain management, lean patients, wellness issues, Botox, hormone therapy, stuff like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, but we do the Internet in house, right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So I have a medical clinic and a staffing and recruiting firm.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, thats the right email.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im okay. How are you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I didnt get a chance to look at it yet.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Right, right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, ecom.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Its a percentage. So we recruit nurses and we get a percentage once theyre placed in place with employment in hospital nurse in Omar, any facilities.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"But thats obviously, I basically have to see how I could incorporate coaching and consulting into my business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, I do.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay. So its mostly coaching and consulting. I look into the staffing side to see if it will work, but I need to get a better idea of what you do so I could determine if its a good integration with my business.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right, yeah.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No, the lead generation and the back end. The lead generation and the back end. Then Im just kind of figuring out it works. And then also attract the clients that are interested in those sort of things that were offering, like where they are, how do we target them, that kind of stuff.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"When they come in, depending on what services they want, they go to a specific team and they work on converting them.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"You perform services, right, exactly.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, its not the case right now. Let me just look at it somewhere, and Ill get back to you. Right. Im going to rejoin the gang calling for me to come.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"So I have to look at it first.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Theyre not necessarily salespeople, but most of the time they convert because this is what theyre looking for. And the difference between not converting and converting is just a warm, friendly smile or customer service. Great customer service.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Outsource.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yeah, I think thats a great thing. Yeah, but thats something wed have to build that entire program, right. Where they could log in and we talk to them and help them train and stuff like that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, so Im trying to see if I could get it for an adult store. Ecommerce store.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Oh, the majority is online, yeah, online and on the ground too, right? Online and billboard.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"But this business is fairly new, so people dont know. And then theres a lot of competition too, so I need to find a way to ride regardless of the competition.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, Im not going to rule it out yet until I actually have a chance to look at it for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, if you could get to that number, thats a goal. That would be a starting point for a goal if thats the number that you use, because I havent started anything like that. But if you could get to that number, then I know you can do what you said you can do.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So a lot of it is organic. We use the Internet, and we also as people out in the field and word of mouth, I guess were known, so people naturally come to us as well.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes. They speak to someone live, they listen to them, they explain to them and then schedule them.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thats how I am. Im not ready to retire. I just keep going. You keep finding something to do. You sit around for too long, youre bored, right. You just find something to do if the opportunities there do it right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. I just keep going with my mind. I dont stop, I just develop. And if this one becomes successful, Im going to keep going because thats just what I do. So, yes, I probably just look into the idea of doing online courses. Ill probably see how that can help.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. But once I do that and I have a clear idea and I know how you work and how I could possibly use your work, then I could move further. But right now, Im not sure.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Whatever you sent me in my email.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay. All right, then let me do this. We could follow up, or if you send your information to my email, I could follow up. Ill just go over the materials and see which businesses or what products were selling or how we could do it so I could have my thoughts and everything together so when I ready to take advantage of the offer.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Ill have to do some digging to find out. Yeah, Ill have to find out the specifics on that, but I know its probably over 30,000.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. You just have to think about it and see whats the best move or what could we offer.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I have other ventures.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, once a lead comes in, our staff start talking to the lead and they get them to convert over into actual customers, patients or clients. Yeah, right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Billboards and all that stuff.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"We do, but were at a point where a lot of it just come organically, word and Verdom. We still do run ads, but when were bringing new products in, we need to run ads on those so people know we offer those as well, and those are part of us. Yeah, right. So you always need to run ads, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, we do that too. All those traditional stuff.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. But let me look at that too, because I want to know more about you and what you offer too. I want to get an idea of everything. So let me look, and Ill get back to you. Okay.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Out, right, just keep going. Right? Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Just listening to them. Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Not quite, not fully, maybe not the way youre thinking. You mean something where they could call in and we talk to them about the conditions and so forth.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I have three businesses. I need to see exactly what you offer, how I could use, what youre offering to scale my businesses, and I need to see what products in there I could create, like an infrastructure or something for which I could use your business to pivot on. So I need to get all my research and everything together.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, but Im going to look at all the information I get in the mail first, and Im just going to go over everything first because I have to have a plan. I have to have a plan to see how this would work for my type of business.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right. All right, then let me go take a look at it. Right. Im actually in Mexico on vacation with some of my colleagues. Im going to go join them. Yeah, Im going to join them because theyre waiting for me. All right, then.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Not a bad idea for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"A handful of okay. Its just coaching and consulting with different clients.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, I think I could do something like that, but I havent considered it. Yeah, Ill have to talk some more about that with my team. We could help them to lose weight online and so forth.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I was going to say Ill take a look at what you send in the email and Ill explore that idea some more.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, I dont. Id have to see more for you offering than still we could play with it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"For me, Id have to see what you offer and then figure out the services that Im going to offer that would work.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, traditional, which if I could find a better way to do it, I will.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, cool.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yes?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}}]