[{"pageContent":"This is Kaylee.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, sounds good. Actually. Ive been homeschooling my boys for the last four and a half years, and Ive bought a lot of Calebs books and stuff as part of their course studies. I take a very different approach, like basic reading, math and writing skills. And Ive already got my 14 year old take. It like hes watching all the ClickFunnels training. Weve already watched the K video on the ClickFunnels training with my eleven year old, too. So very business minded. And reading books like Alex Moseys Million Dollar Offers and stuff. Curriculum. So I like Caleb, and thats one of the reasons I clicked, is Im not big into like theres just a million things out there. But when I saw that he was part of it, I was like, well, hes obviously figured out marketing and sales at a young age, which is what I want my boys to be able to do. So theres some trust there right off the bat.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yeah, absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, so Ive got two reasons that Im venturing into ClickFunnels and probably even saw the ad in the first place. First, Ive got a personal blog thats a wellness blog that Im wanting to launch a course, like a fitness course. And second, I work full time in solar sales in Oklahoma, and our lead generation sucks. And so I make more money on my own leads. And also, I know I can do better than what were getting because were getting a lot of people that are, like, thinking solar is free or in retirement, and Im like, Whoa, that is not even close to our customer avatar or who we should be targeting, but were buying it from just some random company or whatever. So I wanted to set up funnels. Thats my primary objective first is setting up funnels to get my own solar leads. My secondary objective is once we get to a point where Im ready to launch something, as far as the specific niche that I feel in the health industry, that would be the second reason that Im deep diving ClickFunnels. I know AI is going to be valuable. I dont know a lot about it, but I am interested in learning how its going to fit.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thank you. It was scary years ago to step that far outside of the box of the norm. But the more I stepped away, the more passionate I got about the reasons for it and the more Im like, man, I told them, if youre 18 and youre not at least a solopreneur making six figures, then Im sorry I failed you. Well figure out what you need to go to college and do it the traditional way, but were going to try this way. And theyre like, no, we dont want to get a job. We dont want to work for someone else.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I would say twenty k a month as far as revenue would be kind of where Ive set my intentions, as far as, I dont know, just running numbers. I think thats super conservative still who it targets and what it targets as far as longevity and health go, people are willing to spend a lot of money in those niches, and so I think thats really conservative. But also, Ive never done that before, so it also seems big to me too. So if that makes any sense.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, sounds good.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right? Its really lifestyle coaching, where people I guess long story short, the whole reason I launched my blog, the whole reason I started in the fitness industry, or the health industry would be more appropriate, is to heal my hormones, my autoimmune disease. And I did it successfully, naturally. And as my husband and I approach 40, hes already 47, and Im about to be 40 this year. Another huge wave of hormonal disruption happens to people. And so thats the kind of niche we want to target, is health and longevity for 40 and over fitness and food.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I could be, but Ive pushed off some of my coaching because of the solar and because if Im going to create a course, Ive got to have margins somewhere. So I could be, but havent been actively pursuing right now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay, yeah, that works.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Cool. Well, great talking to you. Im going to send that invite over right now, and Ill check back with you in, like, 30 minutes to make sure you got it.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Yeah, absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"All right, talk to you later.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, thats really my passion, is the fitness side of things. Not really coaching, but courses more for complete, like freedom. And my schedule, because solar takes a lot of time in making calls. Its still dependent on me. Its kind of like being self employed versus an entrepreneur. I cant scale it as much or as fast as I can, of course, but yeah, thats the primary objective, is solar is what makes me money right now, and the course is whats going to give me the freedom, basically.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Lets see, tomorrow Friday or Saturday. Are you talking about this week?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, we have solar ourself. Which makes it easier because as someone who believes in it enough to buy it, I cant believe how many people sell solar that dont have it. And Im like, that just doesnt make any sense. Anyway, and Ive been looking and really focusing my target on corporate solar sales. So thatll be a real pendulum swing.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah. And one big area, too, besides being able to help that niche of 40 and over, is that we weaned our kids three years ago off of all sugar, gluten and dairy, which people think is impossible. Like, your kids havent had processed sugar in three years. And Im like, no. And it healed my oldest son of some things that he had going on that I wasnt even aware. Some things when youre just sick constantly, you dont even notice that its sick until it goes away. And youre like, oh, my gosh. Anyways, its a really cool niche. And it all started with me trying to heal myself. When doctors are like, sorry, youre just stuck on medication your whole life? And Im like, no, thats not going to work. Its not part of my belief system.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Not yet. Im actually just in the part of the course with ClickFunnels where you create your landing page and stuff. So, I mean, Im like right at the beginning.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Terrazas.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, I totally get it.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"The first year, my main focus was consistency on blog content, and I thought I was just going to do one on one. Coaching was really my mindset, and as Ive done that, Ive seen how limited that was and how I can never scale that and help the people I want to help. So as soon as I decided course was my next step and my next big goal, thats kind of what led me to wrestle in the click funnels. Because Im like, okay, I can learn how I know what content I need to create for the course, but I dont even know how to launch a course successfully, especially with little to no social media following and all that. And it doubled for the more immediate pain point of mine, which is getting more quality solar leads, so that it basically would double my commission, making my own leads so I could work smarter, not harder. Do less work for the same pay.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I dont think I did, and Im interested in it, but Im still to a point right now, building my funnels out and stuff that Im not ready to buy it, but I am interested in what it is and how it works.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So I could do Friday morning or then next week I could do like Monday or Tuesday or both. Open.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Central.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I got myself it took me four years of research and testing, removing toxic products, removing foods, but I got weaned completely off the thyroid medication, and I look and feel better than I have even ten years ago. I look younger than I. My husbands the same way, and he actually just started doing what I was doing just because of the research that I was doing. And people all the time when he says hes 47, theyre like, no way. You look like youre in your early 30s or mid 30s. Theres no way youre 47. And hes like, yes.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Both my husband and I have the excellent credit. I dont know if its like 850 or above or whatever. And then as far as income level goes, thats going to change drastically this year because last year I wasnt selling solar, so thatll bump us up a lot. But my husband just on his base salary and commission and his sales role is about, Id say anywhere between 152 hundred by itself. And then I should match that with solar this year. Im already on track too.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Be able to its just a phone call too, right? Not a zoom?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Lets do 11:00 A.m..","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure. Its kaylee klee at. Okie O-K-I-E solar.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Its K apostrophe L-E-E.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"No, I havent launched it. Ive been working the last year on blog content and its just something that Ive been really passionate about. And Ive done one on one coaching and seen peoples diabetes numbers drop and theyre able to get off diabetic medication, which again, its not even in the hormones field, but just doing what I did is healing other people. And so Ive been wanting to start a course for a long time. So its not something I have yet. Its something that Ive been going through, like Russell Brunsons 30 day, or his whole click funnels training, like start to finish. And then Ive read the traffic secrets, expert secrets, everything. If Im not mistaken, this company is owned by Caleb Mattox, or at least hes affiliated, am I right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. What I was thinking was $1,400, and theres three different levels that they would need to go through. Ive got it already. Like, in my mind, its called the Longevity lifestyle blueprint, and it takes the approach of not just healing one person, not just losing weight. Its really like how to integrate your whole family into this lifestyle. And this has been an eight year journey for me. Theres no way I could teach it in one course. So it would need to be like the upsell would be one on one coaching at a really high ticket level, or they would need to keep progressing in the course levels, like foundation, Intermediate, Advanced to get all the way through to what Ive done.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Good. How are you, Sam?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oklahoma.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}}]