[{"pageContent":"Id say five or so. Literally until two months ago when this blip happened, I was doing little, if any, marketing. I had so much business that I was working on the business. I was working in the business, but not on the business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I appreciate Im an N of one. I mean, I was part of a consulting course when I first started, so I would say I have a little bit of insights thats probably 18 months in terms of what other folks were doing, and some of those folks had very mature consultancies. Other people were like 28 year olds were starting to consult with no network. So it was quite variable, as you can imagine.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"The last two months, I would say Ive been probably outreaching to three to five people a week, having oneish calls every week, maybe two calls a week on a good week. And the conversion rate has been pretty good. I would say about 50%. And some of these have been very short term, like one month engagement to help them pull together a grant, things that I was kind of taking in the very short term during my little revenue crunch.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, so Ive been consulting about two years. My focus is fundraising for nonprofits and Id say Im doing more with startups, all healthcare. Ive been in healthcare for 30 years, so I would say thats my chief offering. So Ive done everything from served as a fractional, executive director, profit group, have been very part time fundraiser for other nonprofits. Ive done the same on the startup side, helping advise in terms of tweaking their value proposition, connecting with VCs investors and then part of that as well doing grant writing and kind of grant strategy for government funding like NIH, CDC, et cetera. And then the other two kind of other pieces that I would say are less popular and probably not as much as a focus but definitely an area of expertise. Kind of optimizing multi sector collaborations across biopharma, nonprofit clinicians. And then last thing have done a bit of, I would say mostly focused on scientists kind of public health or excuse me, public speaking, coaching to get them to kind of figure out how to convert their very deep and very technical knowledge into talks as theyre giving pitches to pharma companies, et cetera, where some scientists know their science but cant kind of get it down to more lay, friendly terms. So have taken some scientists kind of through a process to kind of improve their clarity, especially as theyre doing pitches, be more concise and relatable as it relates if theyre in a room with BD folks, non scientists. So I would say those are my three kind of key offerings. I would say probably in order. Fundraising is definitely job one, or at least the one thats been the most popular. Ive had about twelve clients over the two years Ive been working and looking. I would say my first lull, where Ive been really lucky and then Ive been in healthcare for 30 years. I have a really large network. Kind of had my first little famine versus feast where I was really pretty chocolate block for the first two years in terms of generating probably $20,000 to $30,000 a month in revenue. Im kind of building back to that 20K figure, but always looking for ways, especially now that Ive kind of dipped my toe in Chat GPT and some of the AI tools, especially as a solo preneur to see how I can more easily find ideal clients, engage with them. I would say I dont have if.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Got you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yeah, I guess for me, because kind of what happened two months ago was, I would say a primary client that was probably 60, 70% of my revenue that decided that we were kind of our engagement was done. They needed a full time executive director, which totally made sense. So part of it, I think, is just to give me that ten or give so that as a client may stop working with me and Im bringing on other clients. Just give me that little bit of psychological boost. And knowing that also, I think part of it is like, probably in the early days, I kind of took almost anything. So kind of having the ability to be a little more selective. And I think Im really pivoting more towards the startup side of the fence than the nonprofit fundraising side, which I think is a little bit of a challenging space with some of the bank stuff thats happened the last three months. But I think in general is a more dynamic space. And Im learning as I start to work with smaller biotechs and startups, that kind of very basic things that are basic to me are revelatory to them in terms of how they think about articulating their value proposition, how they engage with potential investors or clients. So I feel like Im providing more value for the startups than I would say, some of the nonprofits.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Are you based out of currently in the DC area?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, you mean in terms of them actually showing up?","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I guess. Im just curious in terms of how a solo entrepreneur could get even, lets say $100,000 a month if theyre doing one to one B to B Consulting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I mean, its really just calendar, and Id say mostly email or LinkedIn outreach.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I thought we were going to bump it to the 26th, so I had a week to watch the video.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right, yeah. And I have personal relationships with them before, so theyre not going to blow me off just because we have some kind of personal and professional previous relationship, even if they dont want to hire me, but just want to connect personally. Theres been a few of those that I was hoping was, of course, a business conversation that then was mostly personal, which is all fine, but then theyre always good to at least keep me in mind for referrals.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Half the people that I talked to hired me to do something.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I mean, Im in N of one right now. So, yes, thats the plan. At some point I would like to scale, but I think Im very comfortable in kind of the solopreneur piece and trying to figure out what things I can do.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thats about 650 somewhere around there.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I honestly havent opened it yet, but I know that I have the link.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Although I would say that some things have been my first client is still my client, so Ive been their fractional fundraiser for two years now. And then other clients have been more short term, kind of we three months. Right. I do a fundraising action plan, give them some actionable next steps, and then kind of pitch to them how much or how little they want me to be involved in those next steps.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I think for me it would be them really handling the execution not of everything, but with some kind of more oversight from me as opposed to having to be kind of the nuts to bolts guy for everything.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, especially an extra day before Wednesday. Just a little bit personal. My wife and I just became empty nester. So weve been Nomadding and Airbnb August, so Im taking a stint of bachelor and while shes staying with her mom, so Ive got Im just like, nose to the grindstone together. So its really good time.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And maybe we set up the coaching call for next week so that I have kind of a week to fully absorb the video.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, I think you just asked about 01:00 tomorrow.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, that would be yeah, kind of like what I currently have in my kind of business side of the fence.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So, like I said, Ive been doing this almost two years. I hit a little over revenue last.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im probably back up to 20K, but my goal is probably get more in the 30, 40K range moving forward.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, not at all.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, and like I said, Ive had about a dozen clients in the two years that Ive been doing this.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im not sure what the industry standard is, but I guess because all minor warm leads, I cant think of one time where someone didnt show up for our kind of discovery call or whatever the hell you want to call it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Obviously, its a bit variable, but I would say in general, a given client is probably somewhere between five and 30K, something like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"The 19th now?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"So weve been la. New Orleans, DC. We hit New York City next. Also, it reinforces wanting to make this business success so I can continue to have the flexibility to live where we want to.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I guess like I said, my hit rate has been so high, theres been a few people Ive cant think of anyone that I think I still probably especially compared to the clients that youre talking about, very reasonably priced. So I dont think Im pricing my way out, other than, like, the only one I can think of is a very small nonprofit that literally didnt have two pennies to rub together.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"And I would say even with that little Blip right now, if I worked with no one else, I would be trending in, Id say 250K somewhere around there.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I think 01:00 p.m will be fine.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Lets see. You said it was eight, one and seven.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"I would say in general, most of my clients have been folks that are in my network that Ive worked with in some capacity in previous professional jobs. And then I would say the other half, smaller percentage, but probably referrals from current clients or referrals from colleagues to folks that ended up hiring me to do scope of work.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, got you. Okay.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"For me. Like I said, I havent had any disqualified. And obviously, if I were to change my fee structure to double or triple of what Im asking, then of course, I would have disqualified leads, because I would say the nonprofits that I work with tend to be very small, like less than a million dollars in revenue a year, and some even less than $500,000. So for me, Im just kind of almost like a fractional very part time person at two to $300 an hour. Maybe $3,000 is a monthly retainer rate just to kind of work on behalf of the organization. So I would say theres no way Id be able to get a $50,000 piece of business for an organization that is only generating ten times that much in revenue every year.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I think once I get things more optimized, something Ill think about because my website also is pretty terrible. Im working on revamping it now. I mean, literally, I didnt touch it from the day that I launched, so its like my services are very generic. Theres no listing of my clients, theres no case studies, theres no testimonials. So thats kind of what Im working on now, is just that piece. So kind of until I get it in a place where I feel much better about it, it kind of seems like a waste of money, probably, to run ads.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That sounds good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And I think trying to figure out the things that I can automate through AI or calendar, things like that. Just so it makes it efficient. Yes, exactly.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, I cant imagine Ive ever hardly ever, other than some kind of crazy emergency, especially to be able to schedule a week in advance. Im very confident that this is going.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Have a great rest of your day.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. And then on top of that is the breadwinner. Im the sole income source for my family. So wanting to not have that, I had a little couple of week of freak out a few months ago and then was nose to the grindstone. And like I said, Im kind of back to that minimum base, but I want to keep pushing towards that maximal. And obviously I cant imagine generating a million dollars a month or whatever. Just a question for those folks that are getting to that level, Im assuming they have some kind of courses that are one to many as opposed to one to one. Because obviously one solo consultant, no matter how efficient their processes are, just the number of clients, unless theyre paying big ticket numbers, million dollars seems for me at least in what Ive done so far as a solo entrepreneur, out of reach. If its a one to one model.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And I apologize if I was aged in my comment before about the 28 year old just started consulting.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"What would Friday the 21st look like? Because I know Ive got a couple of deliverables over the next two days, and I want to make sure I carve out the time. So yeah. What would availability on April 21 look like? Just to make sure I have a couple of days.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I have a funeral that midday that day, so Im definitely safe in the morning. And I feel confident that theres no way as long as its in the morning, because in the afternoon, Im a little less confident how long things are going to take.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I guess if, say, I have a fundraising client, that their goal is were going to raise $300,000 from industry for our programs, I would want that person to really lead the execution and kind of the minute details. Of how to make that happen with me kind of in an oversight role, because that would then free up some time for me to do more business development, public speaking. Im doing very little on LinkedIn at all and certainly any social. So I think that would free me up and just all the accounting and all the kind of administrative stuff that comes with one person shop.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, I would say its probably the other direction where there have been a few times where Ive identified something small to start with that they cant afford, like a discovery offer Ive done for a couple of clients that then led to a proposal for kind of three tiers of support that would be at that higher level. But thats probably the only thing in that regard that Ive done. And for people that havent worked with me directly as well. I think that discovery offer is a good approach to kind of they can kind of see your stuff. Its not a big amount of effort on my end. And then I can try to kind of get them hopefully to that middle tier, which would be much more financially impactful for me than the little $5,000?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"If we do the 19th at 08:00 A.m., okay.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, right around yeah, Ive got about five to ten k. Lets say that helps.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Two or one?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Awesome.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"All right. Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I can kind of do what I need to do for the business.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, yeah, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Definitely not at will.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, Ive averaged, I guess through the history of the business, probably 20 to month. I dip kind of below that during my lull, my little mini law a.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Driving goes through one, but itll be a hard stop. So yes, that works.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Is it a full hour? Just so I know how much to block?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"No idea.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Or even, I guess, up or down sell. So do the 5000 piece and then give them three kind of options once weve created this action plan. And then kind of it might be 1025 and $40,000 might be the three kind of tickets. And they decide kind of based on how involved they want me to be or not be, as well as, of course, what budget they would have for this kind of where in those three kind of options they would land.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Id say ideal would be ten to 15.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}}]