[{"pageContent":"Im not selfish. I do charitable things. I do for this organization called Faith Mission. I work behind the scenes. I donate my turkeys on Thanksgiving and Christmas. I like to buy kids in the city toys. But to go back to your click, I do inspire and give inspiration to people. I once met a young lady Im a wife between a divorce. Im back home now and I met a young lady out here on Facebook talking, and she was going to kill herself. I life breathed her with energy for her not to and she was going to do it. And she said, my life is ruined and whatever. And I actually got through to her to not do such a thing. And you dont understand. I said, its just one bad day. Therell be another. But after rain comes sunshine, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"If it was quite late and Ive been quite medicated. I injured my knee.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes, sir.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"And its kind of connected when they say Venturo. But I do want to scale big in that area and get a fleet after a while. I see. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Im actually retired disability from the government, and right now Im dealing with life inflation and every damn thing is high. And I dont know if you know it. Theyre going to be charging for air next week because shit is so bad in America.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"As far as rental car leasing, they said its huge.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, sir.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"And I possibly took a Meniscus, and I hate the fuck I did. Sorry, sir. I screwed up my left knee years ago. Usually when you fuck up a knee, you got to get the second one fixed. Motherfucker. I dont, man. It depressed the fuck out of me. I did some fucking leg presses on that damn weight machine and motherfucker, too much weight. I went behind somebody else. They got fucking Hercules. They fucked me up, and it took days for it to catch over me and hurt. Now Im walking like Fred Samford and shit.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Who knows? I used to work for a rentable guy that made the Ford lift. His name is Steve Germain. And when I no longer work there, they used to ask me to motivate guys for car sales. And people say I had that gift to do. So I tell anybody that your struggle leads to process and your process leads to prosperity. Theres three dimensions of life. And they said, I dont know. I said, Im going to give them to you past, present and future. You know, from what you came from, you know now where you stand, where do you want to go? The most self dedication for yourself, man. I tell him, I said, if you believe you can go through that brick wall, you can go through that brick wall as a foundation. But if I held you back and youre not acting in faith, you have no termination to say what you can do. Youre going to say what you can do. So aint nobody going to stop you but you. And then I hit everybody with this good blind of mine, man. I said, Let me tell you, three commercials thats very interesting in your life. Here it comes. I said, sure, Deodorant, what do it say? Some know and some dont. I said never see sweat. I said, Tony Tiger says what he feels. What? He feels great. I said, Nike says what? When the worlds biggest logo? What do Nike say? Just do it. It didnt say next week, week after next, the day before, two days later. It said, just do it. That means jump. Do it. Act on face. Do it. Make it happen. Do it. Just do it. Thats it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. My goal is to do three or four. Im saying it to believe it, and Im believing what Im saying. I tell folks, Shoot, if you dont believe in you first, how do you expect somebody else to believe in you? And then theyre not? But you must believe in you for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. And whats the name of the company?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, Im driving. I think when I popped on that, I want to know the terminology, interest of what one do was. It a business to be obtained. Now Im trying to get some things together where Im trying to get Im going to do luxury car leasing at some point.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thatd be wonderful. Who dont want success? I tell people its two kind of colognes. Theres LeBroque and its success. Which one fragrance you prefer? Right. I want a bottle of Success.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"All right, you too. All right, bye.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay. Okay, go ahead.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Where I said, from what you obtained from me talking to me in these past maybe ten minutes here, where is the avenue placement for myself?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay? Tell me this, sir. How do I obtain the knowledge? I have the courage. I have mentored people, young people. I got awards and stuff on my job, and I was just a custodian. And how I introvert with young people. Im not afraid to speak. Its the time in my life. I used to be a stutterer. I lived next door to a bully. He used to beat the shadow of me for free. And one day I came in the house. I said, my dad said, Just say he beat your ass. Im going to beat your ass. Youre going to fight him today? He went and asked his mother, can your son and my son fight? She said yeah. Then his mother said, yeah, go beat his ass. Kick his ass. His mother said, this this is in the 70s.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Heard what I said, sir, I said, I dont obtain myself as a selfish person, because I honestly believe theres different levels of wealth, theres different levels of success, that theres plenty in the well. You just got a drill. Thats it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, Im working with certain entities. On one, Im trying to work on what you call it. I forgot the terminology. But actually, three or more incomes. Thats what Im trying to do. I will attain that call sometime today about getting to the Toro financing, leasing. And Im going to call face forward and jump into that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I just want to ask you, sir, how much does something like that cost?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Im telling you. You want to hear the things? Yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. If you can text it to me, because then its just that much more assurance. Could you do that, sir?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Its a possibility. Im not afraid. Its like jumping in a pool. I know its piranhas in there, and Im going to get eaten up, but I know I will have to get polished somewhere. Let me see here. I know how to motivate, and I click words together, and I say dedication equals motivation will change your situation. This is how I talk. Okay. I feel youre coming from and some people get a charge, but for me to you, no, you got to do it by the script. You got to do it this way. I like to be eye level with people. I dont want them think Im beyond their head. I want to be right here with them from eye to eye. You see what Im saying? Im you and youre me, and I want to better you for me. And then Ive gave great thoughts and inspiration to some people said man, I thank you so much man I obtained this blessing, man, for one for you, anything you want for me, you can get it, man, you told me to so and so and so years ago, man. I did exactly what you said man, I thank you for that idea and situation wasting, man, youve been a blessing to me. Im like, wow, thats great to know. And, I mean, I remember people from years back, and its good to know. People say, man, I received what you said, man, you really inspired me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I would like that field, and Im sure I have to get polished some form of training. I dont know every criteria of the language barrier of English, to be precise, for somebody to proceed, to take a message in their head. I got a degree in Charlieology, and I know what works for me. Okay, let me tell you a stupid ass story real quick. When I worked with his main car ship, this gentleman is multi rich. Hes been in Fort Magazine. His name is Steve Jermaine. And a coworker used to ask me and say, hey, man, what kind of car you drive? Oh, I drive a Rose Royce. Well, I havent seen you. I said, oh, yeah, I drive it every day. Somebody else, what kind of car you drive? I drive a Rose Royce. I havent seen it all. Its in my mind. It took me some years. I do own a RollsRoyce now, about a 1991 Silver Spur. Back in 16 with 18,000 miles on it. I was a believer to become an achiever because I saw what others didnt see. And I do drive a RollsRoyce. No, its not a brand new one, but its a pretty motherfucker. I do own a Rolls Royce in Silver Spur. It only got 25,000 miles on it. And its like sometimes your blessings are before you. Sometimes they catch up with you. I kept saying what I want and what I want to drive. I have a premonition, and now I own it. So they asked me today, what do you do? What do you have? I said, Maam. Yeah? Im going to get a Lamborghini. Youre going to get a Lamborghini? I said yeah. I see myself getting lamborghini. I think big. I tell people, if you think big, you are big. If you think small, you are small. You got to think beyond yourself. Taco Bell said, hey, think beyond the box, man. So I think beyond the box. I dont close myself.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. I got a question for you, sir.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I dont know. I dont even know. I didnt get a chance to file my taxes. It went to the wrong address. And theyre supposed to send my stuff out.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"You mentioned about you have somebody within your mainstream that do the auto leasing and all that you were saying?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I was at a 693. Im working with a company in Colorado, and sometimes BS gets all my stuff that shouldnt be there. And theyve been getting stuff moved off and my score is going up. And then it took a little hit and then whatever. But I pay my debtors.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"But thats how Im obtaining my funds right now. Okay. Direction Im going.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Here you go. But the story turns out good, and its ugly. I had to fight the guy in front of me, my dad. I had an ass whooping sandwich. My dad is whipping my ass with a belt in the back, okay? On my ass if I miss, didnt hit or swing. I fought the guy and he beat my ass. And it was almost like a pay per view match. First it was nobody outside. Then it was five. Then it was 20, and everybody got a free entertainment. My father told me this, and I eulogize my father. I lost in 2017 due to cancer. I lost my baby brother about two weeks before my 50th. Im 56 now. And this is what happened. He said, One day youre going to have a family. Motherfuck, Im nine years old. I cant see that part. One day youre going to have a wife. One day youre going to have kids. Well, youre going to have to stand up for yourself. He said, he may have whipped your ass. All I wanted you to fight back. Okay, that was that. Summer, fall, winter came. Me and my brother made a snowman. This motherfucker stole our snowman. After we went out for a family dinner, we went and grabbed our damn snowman back. And we know Frosty didnt have no damn legs. We rolled it back, put him right back where it was. Man, you took my snowman. Now its our snowman. He had the nerd to come in our face, man, my brother beat the fuck out of him. Yeah, you rolled my ass this summer, her, but I beat the fuck out of you came Winter, we beat his ass, throwed his head in the fucking door of my parents park car. Kicked the shit out of him. Stumping we two dog and beat the fuck out of him. We told everybody we whipped his ass. No, they lied. They lie. Never happened. He never put his motherfucking hands on me again. So, yeah, thats the end of that. Great story. Yeah, I took an ass woman that summer, but I fucked you up, King Winter. I got courage, motherfucker. Thats all I got to say.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, Im borrowing off of Bob. Im borrowing from others based upon my credit score. Im in the process of getting things 0% interest or whatever.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Because you get there the same time. You get there the same time. The Lamborghinis you will a pickup truck or hooping or Honda Accord if you want to get to the price. It aint about what you drive. Its the fact that you made it when you got to the party.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yours.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"All right, go ahead.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thats it.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Im disability.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Air AI. Okay. All right. Thank you much.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Probably like 55, 60, somewhere around there.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay. Do we have an appointment?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"About $10,000. Thats my goal.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, I should be about a little greater than 650, maybe 660. The calculation term. I just paid my Rose Royce off three weeks ago. So that should give account. So that should post up. And Im going jump in something and Im going to get all my debt to ratio. Im going to knock them all out in 90 days.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, I havent yet into it, and Im about to get into the Amazon ecommerce industry here.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, so honestly, I didnt give you my whole resume, but where would I sit in what genre? Thats what I would want to know, sir. Im sorry.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"How do you mean?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}}]