[{"pageContent":"The urine again?","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}},{"pageContent":"Okay. So you cant come to my place. Its not a store, its a shop. I dont let anybody come in here. Im always making new stuff, and I dont want anybody seeing what Im developing. But even if I let you in, youd use up all my time and I cant work on other peoples orders. So its a shop, its not a store. You got to use my website. Can you do that?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Is it a gas?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, but you know what you have to sell, and I obviously dont I dont have a clue what youre what you even have. What you even have. Maybe you should tell me. Try to tell me real briefly what you do. Give me an example or something. Real world example. Somebody making money using your services or product or whatever it is.","metadata":{"fillerID":29,"fillerText":"Mhmm","category":"D"}},{"pageContent":"Oh, yeah, you were going to call me first part of this week. Thats right, yeah. You sweet voice. I thought, some girl hitting on me, but I dont think I can do what you all are talking about. I do high dollar stuff, but I sell the carpet cleaners and theyre not easily persuaded with anything but the real deal. So I dont know what youre talking about. Theyre not going to be fooled by any kind of phone message. If I read right what you all are doing, its like this automated thing. It reads the guys voice. If he says hello, you say this. If he doesnt say hello, you say that. You know what I mean? Is that what this is?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I do that basically for free every day when I teach these guys how to be better carpet cleaners. Im an old guy, retired. I know the trade, so they call basically to ask me just a couple of questions. Ive got kind of a reputation as a grouchy old fuck, so they dont want to call me for coaching, and I really dont want to coach them anyway. Id be a damn good one. Im probably the best in the industry. Im definitely the best in a lot of things that I do. But I dont want to deal with carpet cleaners. Please. What I do is be a carpet cleaner. Call me, tell me you want to buy something. Go ahead, say it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"What is your definition of high ticket? That means, like, I got a car to sell, or real estate. What is high ticket? I never even heard of this before. What do you mean?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Ammonia.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Wanders, this Joe. Wanders, this Joe.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"I dont know from their urine.","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}},{"pageContent":"Imagine if youre a real estate agent, this wouldnt really be high dollar, but, boy, itd be a service that is absolutely needed. Lets play like youre a real estate lady. Youre going into this property that you just listed, and you want to show it to your prospective tenants this afternoon. Its like three husband wives coming through there at one at three, one at 4150. Man youre excited, right? Somebodys going to buy this house from you, and you walk in there and the house reeks of ammonia. Okay, youre pissed. Your heart just fell out. You just dont know what to do. This is not a high dollar fix. This is maybe $500. Is that high dollar, in your opinion?","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Say it.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay, right.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"NH three plus one H is NH four. Thats not even chemistry. Thats just logic. Okay. So NH four. Guess what NH Three is? Ammonia thinks like hell. NH four is ammonium salt. Like table salt. It has zero smell, none, zilch, nothing. Take some sodium chloride, dump it in a little tiny glass with water. You dont smell the salt, do you? You smell nothing. You smell water. And thats exactly what this process does. This chemistry. I figured out, which is really I figured this out. Oh, my God. Please. This is like junior high school, freshman chemistry. If you could even imagine that being the case, I guarantee you, after a week, if the professor said, I want to convert ammonia to ammonium, folks, how would I do that? Add h. There you go. Theres your answer. How do you add h? Well, h is an acid. Thats what gets liberated when you put acid in water. Now, I know how to get rid of ammonia. Now, lady, lets go in the living room. I can show you. I can do the same thing for this amount of money. So you can do it. Go to it, man. Now we get rid of the odor. We have a chemical that actually works. There was no fragrance theres, no anything but just getting rid of ammonia. Now, you want to get rid of the stains? Well, thats pretty easy. Thats hydrogen peroxide. But a lot of these products are hydrogen peroxide based. They dont get rid of ammonia. They dont. They only get rid of organic stains. Ammonia is an inorganic chemical. Organic means carbon and hydrogen. Ammonia doesnt have either one carbon or hydrogen. So it cant be organic, right? Its got to be inorganic. To get rid of inorganic, you use inorganic chemistry, which is real simple. So help me sell this to the world. Can you do that with your program?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I could maybe do this, help me figure this out. Okay, Im being honest, okay. Im not even sure I want to do it because Im worried like crazy that everybody else is kind of going to bomb us. Whats going to happen to trade and the cost of everything? Lots of carpet cleaners are really struggling, like more than ever nowadays because people arent spending money. I bet you arent. Maybe keep your looking pretty. Screw the house. Ill do that myself. Im not hiring some guy for $300, and I can kind of ignore that for a while and see whats going to happen. But heres what I want to do. If I had my way, if everything was normal, Id start a referral service, maybe even create contracts where I could start businesses and say, pick the top 20 cities in the states and then start marketing to people like real estate and property managers and apartment managers. Not so much them because theyre very cheap. But the bottom line is theres people that need our services. I know how to sell these services. I have carpet cleaners all over now. Ive been doing this for I just had my 20th anniversary, and its pretty easy to find a list of realtors anyway. Ive already got a pretty massive list, and I was thinking of doing SMS to reach out to them, but I havent even really started. And one of the coolest things I have to maybe break in to get them to listen is a couple of things. One, I got a chemistry background and Ive developed the best urine treatment ever for pets. We need it because everybody says, yeah, the last stuff I used didnt work that good. And Ive been following this for years and there really isnt the answer is not out there, if you can believe that. You go in a pet store, they got nine different pet products for urine and none of them work. Hello. Thats a problem. You go on Amazon and theres like 15 products and none of them work either. Okay, so let me give you the quiz. Ill prove to you that none of them work, okay? How about this quiz real quick? Take 1 minute. You ready?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, I know what windex is.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im selling a car.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Not off the top of my head.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah. See, thats a big turn off, isnt it? But thats the facts. And these guys are way dumber than you would be. And you dont even know the trade. But you know the Internet. These guys are lazy mentally in every way. And so they want me to take order over the phone, which Im not going to do. So I lose a lot of sales that way. If there were some way that you could create an AI that would ask them all the questions and I could give you the answers to anything they responded with. I mean, I could give you the response to anything they answered with. That might be kind of cool because then you know what I mean? Itd be very complicated to do that and probably not worth it. Heres where I need help, though. You ready?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"From just house is high dollars. Shes going to get a $9,000 commission. But to fix it, it may only be $300. It may be as much as $1,000. Is that high dollars? I dont know what youre basing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im good, thank you. Who is this?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}}]