[{"pageContent":"How may I help you?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Like a 580.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Like 600.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"How may I help you?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"No, I havent checked it out yet.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, Im more aggregating content so I can kind of filter through and find the best direction after I have enough info because, you know, the AI is developing very fast and theres a lot of options and everythings happening all at once. Theres so much you cant just go for one thing. So just tell me exactly, like, what do you specialize in?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sounds good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Thats fair.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I said your company was pushy.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"So I think that in todays age, specialists, not salespeople. So I have a lot of problems with marketing companies and social media. I dont know, probably talking to marketing companies or media or something or whatever. You think you got more experience than me?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Probably dont care about the vehicle get there now, but a little bit of both, to be honest with you. But the second 1, second one mainly because thats why Im planning so strategically when I make the jump now, I dont want to wait. I forgot to tell you what will probably be a good fit now. Im Talking To You is a 90 day book that I wrote. Its a rapid brain development. I know it sounds kind of like typical, but its not. Its basically something that I think is going to be monetizable. So Ive been dropping like, little excerpts from the book. Its very different. I think it has a potential of something that maybe we can work with.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, definitely fair. Because I havent done sales, actual cold, call boiler rooms. I havent done that in years. And its kind of interesting because consulting seems to be something that I would be good at. All my friends Im not trying to talk your ear off, but all my friends, they call me for advice all the time. I find myself giving advice. I dont know Im doing it, so I guess I paid for it would be good. But I mean, Id have to hear what youre talking about exactly. And then maybe it makes sense, maybe.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Something like that. You cant really explain it. The main thing that people say when they hear my podcast is they say interesting. And I always say interesting is the gateway to want to know more. And basically thats it. Im just looking for as many interestings as I can get. So I just know that opens peoples minds up and it wakes them up from being drones. So I think the whole point for me is knowing that if I could build the strongest legacy with the strongest content, then I love that. Make me happy, because I dont always have the best quality, but I always say if I cant get the quality that Im looking for visually, I always make up for it in audio wise and content wise. Theres no rival, really. If I really put stuff together, I produce the music, I do the audio podcast, and people are really entertained by it. Now, like you said, I want to make the jump. Im producing more content, like on a superhuman level. Im still figuring out, like I said, AI is just kind of new, figuring out which companies to work with, how to repurpose the content, me right now. So its a lot.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im working on getting funding from everything that Im doing now, so I dont have that capital that youre asking about, Im working on.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"God bless. All right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, exactly. If I die tomorrow, everythings still all good. Exactly.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, of course.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Nothing right now.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah. Im assuming its been going up by itself. So I dont know too much about credit. I dont really work on it. It was like 580 last time I checked. So Im like, Ill make it up again. But I mean between 580 and 600.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I actually have to calculate that because.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I probably dont qualify.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Right, exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"You got my last text.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"What I really want? Im working on building a legacy. Are you familiar with Bob Proctor?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, thats what Im saying. So basically Im trying to determine obviously Im going to use AI. I use it for a lot of stuff, but Im trying to see what is appropriate because everything has to be AI implemented. So Im trying to figure out whats the best way I can streamline everything insofar as repurposing content and monetizing. And Im in the middle of figuring out exactly what I want to actually charge because I dont want to cheapen my brand, because I want to make some money. I want to have something thats sustainable. Im starting to close. I have a hat I designed and a shirt thats really nice that people want thats one thing. But like I said, Im kind of gathering AI companies and seeing what Im going to be actually using.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats funny. I dont know. Like maybe like two, three months ago.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"So basically its a long story, but Im an artist. Ive been an artist and a hip hop artist for like 20 years. And then Im co founder of co founder of a duocoin. Its a cryptocurrency blockchain company. Its the first African American fully owned coin where I own blockchain. Im co founder of that, but thats completely separate from what Im doing, kind of. Ive been studying blockchain for the past, like six, seven years. And Im not a developer, but I already knew where everything was going. But its still fascinating, the technology in Web Three and the podcast is about balance. So its basically unapologetic truth. Its very bold and it brings a balance because I think that the more society progresses with technology, we lose empathy for each other as humans and theres no influencer. Theres no podcast talking about that specific thing. So Im talking about blockchain, Im talking about crypto, but Im still talking about regular lifestyle. People can relate to them just to bring everybody back to a level ground. So I found the balance. I have everything set up. I just have to scale.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You know what? I think that let me think, honestly, maybe to marketing companies, because I noticed that when I actually sold stuff, like I was really good. I can get people to buy anything. But I dont like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Probably like, I have to talk to whats it called, an insurance agent a few days from now asking the same question. I dont even know. I dont have the answers for that right now. I just started doing my condo, and I literally just started Im moving here in January for, like, three, four months. Its up and down. The last few years, I kind of put all my effort and all my focus into building the podcast and building the content. Im literally doing everything myself. Im trying to get everything automated and streamlined, but I need more time before I think about all this.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Maybe like 30,000.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Youre good? Thats so funny. Yeah, basically.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All Im doing is working and making content and establishing relationships at the moment.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So Im in the podcasting.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I dont even have the answer to all the questions. I just work all day. I focus on the podcast. I dont have the answer to that for you right now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Look at whats it called. Goldman Sachs. Theyve been around for 50 years. Even the Chinese, they say you dont have a business if it hasnt been around for 100 years. The whole point for me, honestly, is breaking like a generational curse, because I dont have anything like that. My family doesnt have anything like that. What are you going to do? So basically, I have to start somewhere.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats like a 602.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"It sounds easy, just like the other jobs Ive done in the past. Its been a while, but usually you talk to somebody, listen, identify wants and the needs, teachers, benefits, tie down and a close, which Im never afraid to ask for. Close. Yeah, it sounds like I mean, the last thing I sold that was for a lot was loan modifications when the bubble bursted. But that was like and we changed the price based on what theyre paying on their mortgage. So we would ask for maybe anywhere from five grand to 20 grand. Its just a number, right?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]