[{"pageContent":"Yeah, so Im signed in with Mike Barron, and technically thats like being in this group where I am a part of the high ticket sales, but I have to do the videos again because I was moving and I havent been in it for more than a few months now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. Okay, definitely. And even a nonprofit would be fun as well.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont even know, man. Its less than 20,000, Im sure.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I think thats kind of what theyre teaching people is, look at me, Im making $10,000 a month and its all because of the system. And I know the system must work because hes got lots of people down in his office there in San Diego and they have meetings all the time and everything. Yeah, thats what really got me to interested in your program because it has to do with high ticket and AI.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Basically? Just starting out.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yes, correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, well, Im glad that you say all that because I need to feel inspired and motivated. So I think Im getting closer to that now, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sure, right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I think it was maybe poor. So, yeah, the credit score is not so good. Okay.","metadata":{"fillerID":16,"fillerText":"Ok gotcha","category":"B"}},{"pageContent":"No, I got home a little bit ago.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, it would be thats one of the options with the Mike Barron program, Im assuming, because I havent finished the very last step, which is doing lots of phone calls with people. But anyway, so they give you free leads or whatever of people that are thinking of signing up with him. And to sign up, it costs 5000 to 20,000, who knows? So youre getting, I think, a pretty good percentage of that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, Im good at art and so we could just start there. I mean, I could help people in art because I see people on Facebook all the time that are having art classes and things like that. That would be kind of fun to do something like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Its like 500, whatever, I mean, its been a while since I had checked.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Good, how about you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Its like effortless for me to create art, basically.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I guess 50 is pretty good start, for sure. And I know its doable like that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Are you there?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Basically, whether its the app idea or nonprofit, its kind of a way to just tell people like, hey, heres work here, its easy, anybody can do it type of work. And even if youre homeless and have a cell phone, you can do it. So its basically the idea of telling people that its like a nonprofit to put people to work. And the application is kind of similar where its something that isnt out there yet, and if it is, its probably in an Asian company in a country like that where if it was working there, they would do it here. So, anyway, I just have some ideas that if I can find even like angel investors, then they would like some of my ideas, I think, as well.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Im pretty sure I know which one I used. So m e for echo, t for tom, a for Apple, e for echo, c for cat, t for tom, o for Oscar at gmail. I think thats the one I used.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right, well, thank you so much for your call. It was very interesting. Thank you.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Im just selling cutco and I sell supplements but also beauty products and also Im going to start tomorrow in training to sell wine at costco.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Oh, yeah, I havent gone to my emails yet.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"It yeah, the speaker wasnt working or something.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Is that working there?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah. I have invention ideas, all kinds of even app idea that I think would be as big as, lets say they take TikTok away. Right. I think it could be replaced by other things, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I believe you, man. Because its one of those things where its as simple as saying, you got to find your niche. And now were in the space age, computer age. There are things out there available that people that I think could be very lucrative, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, but theres legal zoom that will apparently can start the nonprofit for around 1200 or something, so thats kind of an interesting deal there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, yeah, the spirituality part is, yeah, I listen to what I would say is, like, the worlds top people in that world, philosophy and all that. So Im pretty clear on that. So that could be an option right there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"But you turn into a coach basically, because you get people to do what youre doing and they have all these people that work with Mike that you can link up with to help grow your businesses or however it works. Basically, they call it giving you a job.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, again, I have app ideas, all kinds of things that would be fun to do. Theres events, Washington, DC. Wherever, just stuff like that that would be fun to go to. And obviously I cant right now, because I have to first make some money to survive. Yeah, basically.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Theres a bunch of reasons, but I am doing different sales stuff and one of them is, which I havent got into is someone named Mike Barron that sells high ticket sales. So I listen to most of his almost all the videos and it sounds really cool as far as how to be the best in sales and marketing. But also I make art. So theres also selling art and I have a program that I got in two months ago I havent started. It is an AI program where the AI creates websites for people. So anyway, I have lots of different directions. I could sell cutco knives and its mostly about sales and art and that kind of thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"For a while. Its more like I have an idea for a nonprofit too, so those can help with fundraising and all that, get the money to start up, do startups and things like that. So thats probably what I should do first, I guess.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, yeah, sure.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}}]