[{"pageContent":"Yes, absolutely. That is correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I havent, but like I said, the ad popped up while I was in the midst of listening to an audiobook. So I havent even had time. Like I was riding my bicycle, getting some cardio in and stuff like that because Im preparing to go into a meeting in a few hours. So I wanted to get that out of the way, but I havent even had a chance to look at anything literally.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You too. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, absolutely. In regards to that, no human being can convince me. In regards to what I have planned, I have a goal. But plans are plans. They go wrong, some things fall short, and you also constantly have to tweak the plan. Any human being that wakes up and says, yes, I developed a great plan and its foolproof, theyre a total idiot because no plan is foolproof, the goal is foolproof, and everything like that. But the plan itself isnt foolproof per se. Theres always going to be changes market. The economy may take another hit. Theres talk about China, Russia and Africa and a few other countries and stuff. I think India or whatever, theyre basically starting to work together and stuff like that. And that can definitely affect the economy as well as the financial structure of America. So theres a lot of things that can change overnight in some instances. So its always a good idea to just keep a goal in mind, have a plan. Of course, because that would be totally idiotic not to have a plan. You have a goal, but no plan. That means its not going to go anywhere, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Poor. I could tell you that I just recently did a check on that. I have a credit card and everything like that. And Im working diligently to make sure that I dont use it as often as possible and stuff. Like that. So that way I can basically use it for paying simple things like my cell phone bill and then just quickly pay it back and stuff like that. So that way, within a few months and stuff like that, Ill be able to when you say poor, you take the 500.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"As far as artificial intelligence. Yeah, Im very familiar with it. I know that there are even some artificial intelligence applications that actually you just tell it what you want illustrated and it could dry it up if you wanted to have it create you a logo of any kind. They could actually get that together for you. Theres the one that Im using right now to build my social presence on social media platforms such as Instagram and Facebook, stuff like that. I even know that they can actually draw up a business plan or a business proposal for you, for the college kids and stuff like that, draw up the essay for you, things of that nature. So Im pretty familiar with it, although Im fairly new at it because what was it? It hasnt even been a month yet, but give or take about two weeks maximum. And like extreme maximum three weeks ago was when I actually stumbled upon it. Im always researching and looking into new things and new methods to get my brand out there, get brand awareness, things of that nature. And also, more importantly, get sales conversions for my brand. So Im always looking into different things, different methods, new strategies and stuff like that. And also I do freelance graphic designs, so I also use it for getting myself out there, finding the right words or the most popular wordings, catchy wordings, most used hashtags, things of that nature to get myself out there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Short term I would prefer to make about twenty k a month. So this way I could take a small percentage of that ten k, five or six k give or take. And thatll be for my monthly expenses, rent, et cetera, et cetera. And then the remainder Ill just be reinvesting into not only my brand in my graphics, my freelance graphics design business, but also looking into other investment avenues and stuff like that. I really dont have agreed, but I also dealt with sales.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, as far as what my heart wants to do, Id like to go ahead and just deliver a positive message to people and stuff because Im sure everyone has a story and stuff like that. And mine is Im a foreigner. I came from Porter Prince, Haiti in the late 80s, grew up in a very rough environment, North Miami, and I pretty much became a product of my environment and I went from that to the person I am today. Its been a lot of hard work, theres been ups and downs, inconsistencies, and then I got to that point in my life where as they say, when the motivation dies, the commitment should be all thats left. And thats what was left for me. And my kids are my motivators. So I just started manning up, basically checking out videos, audios, podcasts and things of that nature as well as reading books that actually helped me to develop the mindset that I have. My latest guy and stuff, as far as podcast is a gentleman by the name of Bedrills coolian, this guys an awesome person and stuff like that. And his history, its not exactly like mine, but its pretty close. So I listen to guys like that and I honestly ever since maybe my mid to late twenty s I was like well I kept hearing yeah, you have a story and your story could actually help change peoples lives. Because youd be surprised how many people are out there thats, like, you made the bad decisions that youve made or about to make the bad decisions that youve made and stuff like that. And a person like yourself could actually help change that. But as far as doing that right now, I dont have the capital to do that, I dont have the network ground to do that and Im pretty much focused on the things on the ventures that Im involved in right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. I thought putting in my email address and everything and clicking the send me the case study was actually going to do that, but you can definitely send it to me again just in case.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Well in regards to what my clothing.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I wouldnt be able to say that because Ive been working for myself for a little while now. I dont make a whole lot of money and stuff like that, but if I had to generate how much I made last year just off of that alone, it would have to be at the minimum between 18 and 25,000.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, Id actually not like to disclose that because like I said all the other times, Im a pretty cut and dry, cut to the chase, straightforward kind of guy. I just want to hear what you have to bring to the table, if any, and see if itll work for me. As far as disclosing how much capital I have put to the side and stuff like that, that would be sales tactic and everything. Like I said, Ive been involved in sales for a very long time, so I really wouldnt want to go into that. I have Google working with me in regards to ads and helping my business scale a bit more with something that we have going on. I have other sources that Ive actually had to work very hard for that will be able to help me out with expanding my brand and helping me gain brand awareness. Because at the end of the day, it would be stupid to expect conversions and stuff like that when people dont know your business and stuff and what your business is offering. Bringing to the table the vision of the business, et cetera.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Its going good. I was actually on a bike ride. I just got the response back from the text message that I replied to. How can I help you?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I did that maybe five or so minutes ago. Like I said, I was on a bike ride and everything, so I didnt even get a chance to look it over or anything. But I am familiar with it all and stuff. I actually have the Chat GTP app and stuff. Its actually helping me out with building my clothing and apparel brand.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]