[{"pageContent":"No, Ive even looked into that, too, because this is where it gets interesting for me, is you can set it up where it can realistically talk back and forth. The problem, though, is just like, the ethics behind the parameters. You set up what it can and cant say. And thats where I get scared of prompt injections and how people push it in there, because Ive personally done this on my own. First quality lead response, like using Synthesia, using the Aid big video maker and stuff like that. You could do some really crazy stuff. But the thing is, what you cant control is that response back if you make it reply back. Thats why Im kind of looking at okay. Above what Chris Thompson could put together. What are some actual software companies or, like, groups making? Because end of the day, every idea is a good idea thats stolen at some point. So if I cant think of a good way to do it, Im going to find someone else that could do it better than me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"What?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"I think I might have put that lead form in my personal email that might work.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello? Hello?","metadata":{"fillerID":33,"fillerText":"Yeah","category":"E"}},{"pageContent":"Its already here. Theres people doing it. Its just a matter of, like, who has the best version of it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Are you able to send like, a link to it via text?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"US millennials, we love our text. The number is 25328.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Is that Roger? Thats my cell phone. So were good.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Received I mean, its probably sitting in there and I havent gotten to it. I have hundreds of unread my company email that I sit through every day.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Whenever youre ready. Are you ready?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I love it. Well, its good speaking with you. Ill take a look at it and sounds like I could just text them back and forth with a little AI. Yeah, no problem, man.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I can send to that right now, too, and you could send it to this number, but thatd be way faster than me sifting through it all.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Perfect. Thank you so much. You have a wonderful day.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"How are you doing? Good. Honestly, I filled out that lead form really late at night and forgot what it is about. Can you give me a quick reminder?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, but the takeaway is just like Im trying to find ways that can make it easier to scale. And Im trying to see whats new. Within the software, Ive built home made prompt response systems, prompt loops and injections. But for me, I wanted to see what else is out there. And people are actually developing software, because Im an amateur at that. I could set up a SQL Server and push data, make arrays, actually push out back into a prompt. But end of the day, how you connect these things together is what makes or breaks it. So thats why I was kind of looking at, okay, what else is out there? What else is everyone building? Because if Im building this in house for the dealers and also for my autoglass stuff hold it. Calling me. Sorry. Always blowing up on my phone. But if Im doing that in house, part of me thinks its a huge waste of labor time and power. If theres something that could do it at a relatively similar level if I was doing it in house yeah, theres labor time involved to setting that shit up.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I mean, shoot. Thats why theyre incorporating barred into it being is too. I was making the joke with my AdWords provider about this. Just like, youre going to be out of a job soon. Its like why? Well, people arent going to go to search anymore. How are ads going to work on there? If you get your answer fast, do you really need Google to tell you the answer or to help find it? Give you a bunch of broken garbage SEO articles of like 5000 characters about whats the best restaurant? Just say it. Whats the best restaurant? Thats where Im excited about. This is just like, its better than when Ive done it for the first quality lead response. This stuff is better than my salespeople at answering the first quality response. This is almost like, well, yeah, no. And Ive actually been doing this for my own reporting grids within the dealership is that I just teach it by tone of voice and have it make the reports out to the owners of the dealerships and stuff like that. So for me, Im trying to find ways to scale too. I look at this and think like, oh, its so possible. I just want to find what the best dang tools to do it are. Everyone says they do. Im just some random guy that just homebrewed some of his stuff together. But thats the takeaway. Its just like, oh, theres someone out there that has the best tool. So Ill demo whatever you guys got. I just need to see it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, no, basically just connecting a lot of marketing operations and whatnot some of those things are. Just like its a lot of piecing stuff together, but I help run and manage an autoglass company, and within that, its just mainly like, okay, what are we doing with their CMS? What are we doing with their CRM? What are we doing with their point of sale and connections and actually come from a background of doing that for dealerships. Right. So the takeaway is that its like, okay, Im used to helping run this stuff with server centers, table centers, et cetera. And this is like a side project I have on the side. I used to do installations with the guy that trained me way back when I was in Auto Glass. And so its kind of one of those opportunities. Like, lets throw some money at it. I got a lot to spend. I have a background in a lot of this and setting up CRM and CMS management systems, it you name it, for large scale, multiple million dollar businesses. I run multiple dealers doing that. So its like this is just shits and giggles, right? Pardon my French. I know its recorded, but no, thats okay.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well just keep it on there if its easier. And then if you send a text with, like a link to the one sheet or whatever it is youre sending.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Oh, my God, Im in love with Zapier and all that stuff. I will spend literally all night looking at that stuff.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Like, I was making the joke with my general manager because we have a dog that works at the dealership. Its the GSMs dog. Make a deep pick of him. Hes the one responding to customers. People would get it immediately, like, oh, that talking dog on a video responding to me. Great. Its like, no gets rid of that weird element of the uncanny valley and makes it a little bit more humanizing without being weird. But Im trying to figure out what this system is because its so new, theres so much opportunity, and were literally at the gold rush of it right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hi. May I ask whos calling?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I mean, I can be Jacob if I need to be, but no.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I get that. How the sausage is made, though, its just a matter of like, okay, I got a huge sausage to make here.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}}]