[{"pageContent":"Im sorry, I cant hear you hardly at all. Youre, like, in a tunnel.","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}},{"pageContent":"Oh, hi, McKenzie. Im fine. How are you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, let me ask you this before I go into all this personal information with somebody I dont even know. What is it that youre selling exactly?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I can multitask. I just didnt want to yell into a pickup window in your ear.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Hello? This is Susan.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Last time I checked, close to 700. But Im sure that theres some things coming on because we just transitioned this past month from the insurance company paying for our temporary housing. And so it was kind of ugly this month. To transition, I had to do some late pay, not on important stuff like rent and mortgages and stuff, but I had to pay late on some of my credit just because we had to tap into our retirement fund and it took a little longer to get the money to come back. So from that perspective, there could be a few things, but in the next few months, then were going to be getting a big windfall and then everything will be paid off because this tornado thing has been quite a ordeal, as you can imagine.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"I will be so ultimately, Im building a list to take people on retreat.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Sorry about that. You kind of caught me on this errand.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Im not sure. I am doing a lot of writing. I decided to go ahead and start a blog and do some ebooks and some things like that. So I know that Ive been on CPT. I believe. Chat is it? I think thats what its called. So Ive been playing around with that a little bit. And so thats what writing is probably. And doing some research is probably what Im mostly focused on. So I dont know if thats something that you all do or not.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I am a very tiny one person shop where I do health coaching and energy medicine.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, I havent had a chance to look at it yet. Im kind of out and about. That was back when I was sitting down in front of a computer. Im driving right now. I wasnt sure if it was software and how that was going to work. What does your software do exactly that you developed?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Sure. I charge 250 as my normal price for a session with me, a 90 minutes session with me. And then so its one on one sessions, the energy medicine sessions, the health coaching sessions are 45 minutes and theyre $100. Since Im just one on one right now, before COVID I did some workshops and some speaking and stuff like that, but Ive had a few deterrence along the way. Our house got hit by a tornado this past year. I know, I mean, theres just always something, right? Thank you. So Im kind of regrouping and I decided Ive just been taking just as they come with just word of mouth and referral right now with the one on one because theres a lot to a one on one. It takes a lot of extra effort and time with one person. So the other thing Im interested in doing is to develop some classes that someone could learn something from me, like some of the energy medicine to do on themselves, for example. And I can also do some other things that I think would be worthwhile for them. Its all about their healing process. So taking people through a process and having a class on some of the processes would probably be helpful. All the processes are ancient modalities, so a lot of people are not familiar with them. And so theres a certain amount of education, but then theres a certain amount that has to be experiential where they have to do the work themselves. Its not an informational type thing. They have some information that comes to them, which is why I want to do the writing and that kind of a thing, ebook type thing. But the main part of it is going to be experiential where theyre doing their own journaling, things like that, where when things come up for them using these ancient ways of healing, then they can resolve a lot of their issues. So it will probably never be a huge business other than as far as the team goes, I dont see any more than some outsourcing happening and some assistance, some things like that. So thats why Im not sure. The internet right now is just bombarding everybody of course with getting involved with the AI for marketing. So Im answering a few of them just to see with the stick and see if its something that I really need or want.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You too.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"You well, its going in a great direction. Just have to be not sidetracked nose to the grindstone right now. But I appreciate the call. Thank you so much.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So my big ticket item is destination Wellness retreat. So Im moving towards joining that industry.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Yeah, theres enough other companies out there right now, I think, that have a little bit more of what Im looking for. So I can just tell by the conversation that Im probably not going to be scaling my business in the next six months.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"The shirts on our back, we lost everything that we owned, everything. We walked out. We went to a hotel. They came and picked up all of our stuff. We havent seen it in over a year. And then we went to a store that they buy some clothes minimally, and then we threw the clothes that we had on away in the trash. Thats my life right now. Okay. So, yes, Im interested in AI. Yes, I want to learn more about it. Yes, I want to do my writing, but thats all I want right now. I just want to write. If theres tools that will help me write a little bit more efficiently, great. If theres not, Im not going to be scaling right now. Its just not going to happen. And thats just real. Im just being real with you.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I understand.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Well, Im going to be building my list, but right now Ive got a house to build. I mean, just to give some context, we walked out of our house injured significantly, seriously, because when the glass exploded throughout the house, my husband and I were sandblasted with micro particles and glass embedded in our skin. Secondly, we dont know when this house is going to be finished. Were looking at the next infusion of the supplement money coming in to finish it sometime in the next eight weeks. When that happens, Im now a contractor working with Subcontractors and the insurance company almost full time. So then after the house is done, then Ive got a move to make and then Ive got to settle in type of a thing. So my time with this whole ordeal does not allow me to work a 40 hours week in my business. Just as an example and really scaling your business, youre looking at a lot more time than that if youre really taking on a full complement of customers. So that is why this year is a chance for me to heal and for me to take myself to a new level of that process. And so the things that Im going to be doing are not necessarily bringing in more customers, but communicating with people that are already on my list. A lot of people that I havent had a chance to communicate with for a while, reconnect with them, find out whats going on with them. Thats why I just want to write. I want to write, and I want to share whats coming, but its not going to be in the next six months that Im going to say, oh, Im scaling my business.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Just a second, if you dont mind. Im picking up lunch for a group of us. Just a second. No worries. Let me see if I can put you on hold or mute. Just second.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}}]