[{"pageContent":"I dont know that Im very good at it. Its something new to me. Ive been running Facebook and Instagram ads. I mean, Im getting a lot of feedback in my inbox and messages. Thats always good questions, so I guess thats a good thing. Its generating some chatter.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hey, how are you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, I think we did about $200. I did 59, I think, on my square. And then whatever I put in the account, I was getting ready actually to go pull all those statements because Ive got to get caught up on everything since the accident that I was lost time. So I dont know that the timing is going to be perfect for me right now, but this sounds like something Id definitely be interested once Im shaped up.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"To build it, and now there are a lot more tools and resources available to people than I paid my designer $3,000 to lay out the magazine. Now I find out that I can do it through Canva or GPT for like, $700 or something. So theres a lot more inexpensive ways to produce and do online digital publications or magazines or whatnot that would really help people be able to tell their own stories, share their own journeys, and help their own communities.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Im just wondering, are you talking about using actual AI? Like the GHP chat, the what is it? GPT chat or something? The new thing thats come out for writing and design and that sort of thing?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im good. How are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah. What is it, a 90 minutes video?","metadata":{"fillerID":33,"fillerText":"Yeah","category":"E"}},{"pageContent":"Yeah, I could do a few of those a week trainings.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, Im doing them right now. Yes.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Eastern.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, I mean, that could definitely help, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I dont know. Maybe they could do something with that. Were getting ready to sell the cabin. Maybe like, ten grand, possibly. I dont know where that would get me.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Well, we do podcasts also that were trying to realize. I want to push the podcast more nationally. Right now, we just have them, like on Instagram and Facebook, and they have small followings. But my daughter is an influencer and she has a lot of I mean, shes got 40,000, I think, or more followers and does a lot of modeling and things like that. So she has a good audience and does a lot of affiliate marketing, mostly for free things, which I told her she needs to take it to the next level.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"My email or through text?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Probably 600, Im thinking.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, a call is fine. I just assumed it might be a zoom, but call is fine. I dont need a zoom. I just thought it might be a zoom.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Lets do a seven tomorrow because Im on deadline and Im going to need to.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"90 days. 90 days to 120. I would say for the $50,000, yeah, three to four months. Just to give them all the information that they need to be successful. But if they wanted me to help them get their business off the ground and work with them to help them make it successful, thats what I did with the other guy, which was 250,000, and he became a partner. I actually became a partner with him to help him build his publication for his market. And he became a 50 50 partner in us doing that in other areas, which is the one that I sold to the guy, the millionaire out of Detroit, the innovative health publication. But just depending on I mean, I dont know. Or maybe theres another package. Maybe we could offer a three month, a six month and a one year program, depending on how long they needed that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I think I only did a couple of hundred thousand this last year, bringing back the magazine. I threw a big launch party, and.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, perfect. All right, sounds good. Thank you.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I dont know. I mean, Id probably get some investment dollars for that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"She looks like a little Kardashian, kind of.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, sold like six magazines.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I mean, Id love to be able to make 50,000 a month, but I would take 20 or 30. Right now, Im barely surviving here. Im in a low survival mode, so I need to bring myself back up to where I need to be. Ive been debating. I had some personal health issues that kind of had held me back, which now Im back on track. And now, of course, the warm weather is starting to come. Were in Michigan where the snow flies and the cold is very cold. So now that the warmer weather is coming and Im feeling better, Ill be able to get back out there and get things moving again. Im working on this issue. Im on deadline for one of my issues right now. Thats probably going to be a 64 page issue that has quite a bit of advertising in it. And I just started the advocacy up again. So Im meeting with General. I have meetings set up with GM and with a lot of the hospitals and the bigger corporations to discuss the corporate responsibility of helping me share stories with some of the nonprofits in the community and individuals that have achieved great goals that are community oriented and that sort of thing, and veterans and all that sort of thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I would say thats true.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"A lot a year. And now Im like Ive fallen down. My vibration has went from the top peaks of traveling everywhere and doing everything I want to. Like, what happened? COVID happened, and I dont know what happened. And then, of course, I had to restart something brand new because they never reopened the publication. And I had negotiated a salary of almost 100 grand plus commissions with him. And then he just froze everything. So then it started over from scratch, and I didnt get any investors or do anything big this time. I just thought, well, what do I really want to do? Let me do this and try to put it together. And really, Im getting older. Maybe this is something that would be good for me to help teach others how to do what I do. Whether I should bring one of the brands, I dont know. I mean, thats something you could tell me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right, right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I still have that page that is up and running. And then a few other pages that Ive had. I still have Radio, which was where we did our podcast. A few different pages like that. Then I have the on the town and the Scream and a few other ones. The veterans, the Freedom ring, things like that. Im an entrepreneur, so I have many ideas.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, this number perfect.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. Maybe we could even do, like, think about the package program. If they thought they could learn enough in 90 days, maybe we could lessen that and we could do more scale more if we did it for less, say if we did it for 25 grand for 90 days. And then if they wanted six months, theyd pay the 50, or they can have a year for 75, and then they learn everything about the business within the year, how to fine tune it, how to go about getting the corporate sponsors. I mean, I can teach them all beginning and give little ideas on how to go in and sell the advocacy part for corporate responsibility because thats a huge thing now, especially the way the world is, and being able to share those stories with your local nonprofits, your local communities, veterans and seniors and youth in education. I mean, these are very important things that need to be featured and highlighted and that can make change and make a difference. The more you educate people and doing it through the digital media platforms and also a small print run in your community really gives you that exposure. And then of course we did on the Spot video. Ive got some young girls that wanted to do street talk, like downtown during the Art Walk and the podcast build their business. They can do all of those add ons in their individual communities to build their business.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"The link that you sent me booked in for the link that you just sent me, is that what youre talking about? Air scaling?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I know that right now. After COVID and then being sick and in and out of the hospital trying to figure out what was going on with me, Ive definitely lost ground. I may even have to do a restart or refresh and build it up and then come back to you guys or I always do have other people that I work with as well. Theres always ways around that. Theres always ways around that. And I can always get money. I can always get investment dollars. I just havent even tried. I mean, Ive gone out and got investment dollars. Every time Ive started something, Ive gotten $100,000. So I know Im capable of going out and finding investment dollars, but Im just trying to decide what I want to do next. Exactly. I think Ive got three more issues upon the town. I was going to finish that up. I had started a new job. I was doing really well with it. And then I got in a car accident and it totaled my vehicle. Yeah.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"One of them for over well, 300, 400,000, quite a bit of money. But actually I probably could have sold some of them. The one because I build an advocacy, a community advocacy where I get the corporations to spend I was getting people to give me 150,000, 50,000. I mean, I had it up to almost a million dollars prior to the pandemic, and it was based on us telling stories about catastrophically injured people that are broken that were my nephew was in a catastrophic car accident. I put him on the COVID of one of the issues. And then I also did a lot of story about our veterans. I had an online digital magazine about different veterans and their stories. I was thinking of continuing that quarterly. So theres just so many different areas. And Ive been a publisher since I was 19 years old. When I started at the newspaper, I was in charge of all the special sections, and then I took it to the next level. I did an in house publication for General Motors, and then I started doing the one offs and did a lot of anniversaries for Ford, GM, and Chrysler. And then I started producing and publishing my own magazines. I had your magazine, the insider on the town Flint revival. I mean, I had a ton of them. And then Innovative Health, of course, which was a really big publication and probably.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"What is it?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, that sounds good.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I said I have like, twelve Facebook pages that I have. I had another company that I had to close during COVID which I had 103 members, actually. It was a talent agency that my daughter was the director of where we did and Photos. And our plan was to share with all the agencies in the United States with people with talent. Anything from writers to authors, videographers, filmmakers, models, actors, actresses, all that type of thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. You want me to just write down some things?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I dont know right now, because Im just starting a business. I dont have a lot everything into this business that I did have, but I could have some dollars available that might put some dollars in my pocket.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im doing it through Zoom and Im teaching them all at once, or am I doing it on a one on one basis? Teaching them for 50?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, Ill be there.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, Id like to do that. I have an online digital magazine that I really want to scale that. Its called Scream, but really its an acronym for social media, community Recreation, entertainment, Arts and mental health. And then I have a magazine that I also print, like in our community. And then we do podcast and all sorts of different things. But at one point I had a publication, it was called Innovative Health Magazine, which I sold to someone and I had already wrote the licensing rights and I had went to Vegas and had a gentleman that was interested in licensing the rights in three states. And then we were going to handle we were going to throw a dropbox or share some kind of drive or something. We were going to share articles that pertained that were either topical or nationwide. Like, we talked about doing Doctors Without Borders and things like that and then like national stories of things that are in the news. And then they would have their own community articles that they could incorporate, that they could use. And then we would charge a fee and a service to do their design and their layout, and it would cost them I dont even remember now Id have to pull it, but I still have the licensing rights that I had written up. And so that was my plan to scale it that way and license other people at other publishers in other states to be able to publish and produce the same type publication using the same type logo. We had certain rules that we were trying to stick with, but it was a guy from Arizona. He was a celebrity chef, if you will, in Lake Havasu or something. Anyway, things didnt work out as planned. He got in a big fight with it the night before he was supposed to come to our big meeting. After Id rented this big suite and everything. And then I had another project that I was doing for the veterans in Areno and I had a group of people over there and it just turned out to be a shit show, basically is what Id like to say. So I kind of gave up on the licensing thing and then COVID happened, and I sold my company right before COVID He did bring on my whole team, but he froze everything during COVID and then we kept waiting for him to unfreeze, and Im like, well, we got to do something else. So I brought back a magazine I had done for years that some people I had worked with had stopped doing, and I still owned the rights to it. So I brought back so I do on the Town, which I did have one in Texas, and I was going to do the same thing with on the town in different towns and scale it. So I dont know if its something I could scale electronically with other towns or how I would do that, but I was just interested. Ive always wanted to learn to scale because I know you can make so much more money by scaling your business, Karen.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Something like that. How long they needed help getting started. But it would teach them and train them how to make half a million dollars to a million dollars a year through the advocacy of community support and running their publications digitally and print if they wanted to. And I have a really good print partner that I use as well thats very reasonable and does perfect binding and looks very close to, like, the enamel. Normally I would pay 12,000, and Ive got a girl now that I can pay for small runs of 1000 or so, just so we have them for sales and to get out to clients in the community mailing list that I can do for much less. For 5000, as opposed to 12,000, I could get 1000 copies.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And theyll call me or what is it?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Well, I had a doctor to give you an example, I had a doctor that was in actually down by Detroit area that wanted me to teach him for his market in the Troy area. And I was going to charge him $50,000 to train him to do everything to run a publication. Or I said, you can give me 250 and come on as a partner. And he ended up coming on as a partner for $250,000.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Michigan.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Do a photo shoot. Okay. Thank you. I appreciate it. I look forward to it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"ThereS always ways around to be able to make this work in some kind of format. That would be because I definitely have the knowledge and I have knowledge that I believe that other people would really want it. That could really help them build a business. Entrepreneurs wanting to start their own businesses in their community, that could stumble into it and see the value and how much they could make. I mean, I have the spreadsheets, I have everything to show them what it would take to produce everything. So all complicated parts that they might be unsure of, I could assure them with the passion and the knowledge they could go out.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I mean, to train someone to do a publication for them, to have one of their very own and to work with them side by side for a period of time, to teach them what they need to do to make it all work, I would say minimum would be $50,000. If they wanted me to hold their hand a little longer, it would be a little more.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, it just gives me some financial freedom to be able to do what I want. Ive been looking to learn to figure out how to make money online. I see people doing it everywhere. I know all the new technology is coming out. I dont want to be left in the dust. I know my daughter works pretty well with it, but Id like to actually help her even do better with it, because I know that she can. It just frees me up, being able to train people and not having the responsibility to have to go out and actually do it all the time. I could finish up with this magazine at the end of the year and then either sell it or get rid of it or whatever. Well probably keep scream. My daughters, and shes got some really good issues with that, and she does a lot with entertainers and actors, and shes been in film, and shes been in Jeep commercials. Shes done a lot of great modeling gigs and deals.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, that seven is perfect tomorrow because tomorrow Im going to be on so tomorrow, lets say training at 07:00 P.m. My time Eastern time. Right?","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"You mean open to coaching and consulting? Yeah, because I have taught others how to publish in the past, and theyve been successful at it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That very good. Shes a beautiful girl.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Something I have a couple of people that do a few sales here and there, but for the majority, I am it. I have one guy whos turning out to be not too bad of a sales guy, but Im doing a lot wearing all of the hats. Like, Im going to do a photo shoot today. Ive got a 40 over 40 with a bunch of women in their forty s, fifty s, sixty s and seventy s on Friday, which takes me away from selling and being able to market and do my emails and all of that sort of thing when Im not sitting at the computer working on sales. So thats kind of been an issue for me because Im kind of the salesperson that builds the companies. Its got to be somebody whos passionate believes in the product that theyre doing. And then also tied with that, of course, is knowing how to sell.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}}]