[{"pageContent":"Its low because I only have a couple of clients. But heres one thing that probably one of the reasons why I bailed out of completing the form. I have a very good friend that runs an agency in Scottsdale, Arizona, and he understands my business, and he said, Steve, and hes doing great for a lot of people. He goes, the problem with your business, for me to deliver ROI for you is your price points are too low. So I sell a few hundred dollars product. Im not selling a 5000 $10,000 product. So whenever I hear people say theyre helping people scale high ticket businesses, that scares me because, okay, if youre expecting me to sell something for 510 grand, you tell me, hey, you get one or two a month and our service is paid for. Well, 510 grand a month for me is a lot of units and I dont know if youre designed for that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats like a long term slow build, so Im not looking to spend a lot of money on that upfront if the payoff is years down the road.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"1 second. Okay.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"It doesnt matter based on the questions Im going to ask you right now. Right. So you put an offer out there. I said, hey, yeah, let me see it. I still havent seen it. I feel especially based on the way youre qualifying me right now, that your solution is probably more than I want to spend. Let me chime in.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, I would say so. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, I do a few things.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right, but then I aborted because you asking me too many questions, too much friction on that intake.","metadata":{"fillerID":38,"fillerText":"Ummm yah","category":"F"}},{"pageContent":"Because I cant. Like, I do an incorporation service for a Florida realtor in the state of Florida for $369. I cant charge $1,000 for it because it wouldnt sell.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Traffic. Getting people to raise their hand and hit my website or inquire via any other format.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, Ill set up, like, a cold emailing platform for them. Sometimes well do ads for them, whether it be Facebook or Google. I outsource that. I dont have many of those clients. Most of my business is the incorporation business right now, and Im going to be starting to dramatically attempt to recruit agents to my team and into my brokerage. Now those theres no money up front.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It could if I got back to it, but its not.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"It depends. Like I said, I have to keep my foot on the pedal, and the last four months in Florida is kind of like Im like an accountant at tax time. My business up until April 30. Ive got about 3000 clients, so a lot of them are doing their annual filings to the state, and I provide a service for that. So a lot of thats been coming in just naturally because Ive incorporated these people over the years. Ill do 40, 50 orders a month when Im working it. Ill do ten to 15 orders a month when Im coasting. And last couple of months Ive been coasting because the annual report business has been coming in. So I havent been pumping for the new business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Just a reliable monthly recurring revenue stream without having to keep my foot on the pedal all the time. And thats kind of my incorporation business.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Its first initial, last name. So its S as in Steve, last name Dahlia, d as in David, Alia@dahliasales.net.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im going to end the call. See you. Hey, Steve.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Let me ask you some questions. Let me ask you some questions. Hold on.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Now.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I didnt, and I already inquired back about that and they told me, check your junk. I checked my junk. I dont have a record of it anywhere. So if you could resend it to me, I would greatly appreciate it. Yeah.","metadata":{"fillerID":39,"fillerText":"Yeah","category":"F"}},{"pageContent":"Okay, dude, I got somebody coming at 12:00. We got to cut to the chase here. I dont know where youre going.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Pretty fantastic. How about you?","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Im a licensed Realtor in Florida and North Carolina. And I recruit Realtors. And I also have a business where I incorporate Realtors, and then I have an actual agency as well where I provide marketing solutions for them and other companies.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Probably ten grand net to me. So thats probably a 15 grand a month top line revenue because the margins are pretty good.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Because Ill put the pedal to the metal for a while and itll be good, and then Ill get bored and tired of hearing my own voice, or I have something thats come up and Ill walk away from it for a while. And thats what Im interested in, keeping the steady stream reliable.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Because Ive got other things. My wife is retired. Shes collecting some money. We have no debt. We bought a new house, and we paid mostly in cash. So Im not looking for a zillion dollars. Im looking for, like, lets just isolate my incorporation business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It goes in spurts?","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]