[{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats fine.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, I get that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"It sounds like a great idea, and it sounds like something that not many people are looking at doing. Like you say with restaurants, you either have this national ad campaign about this restaurant chain thats got, like you say, multiple 45 locations or more, at least one in every state kind of a thing, or you have restaurants that are advertising just locally. Its rare that they combine the two. Like you say, to have an ad campaign to hit every single local market, but you focus on the local market, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"My broader look would probably be I mean, I like to go beyond I like to have it like the mini ad agency. But in this case, Im a one man person. I got a ton of stuff going on in my life, so I do this as a start.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I think it was no, about five minutes ago. Okay. So, no, it has not come yet. Okay, all right.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Let me check. I just submitted it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Because of supply chains, we dont change the restaurant much, but well have a fillet trout, cedar plank salmon, the lamb, sea bass, a lot of flatbreads. Sounds really good. Pork chip. Yeah, no, the food is pretty good. Its not top of the line, but its a good chain restaurant. In fact, theres not like, 900 of them. Like Olive Garden?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Oh, Im great. How are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Im hoping that this would help launch the business. I have a ton of other stuff going on in my life, things that I didnt anticipate right now, so Im just swamped with life issues. But the idea would be, but I dont want to be a waiter. Im 61 years old now. I didnt want to do this at this point in my life. But the idea is running in, say, an ad campaign or training via Zoom or whatnot that probably wont get all 45, but if I charge a certain amount of money per location, how they can do stuff on when people do a search for a restaurant that youll find something. I dont if know you heard of a Google Three Pack or the little blurbs on the side that give you information on a particular restaurant, or it could be whatever. It could be a hardware store. Those are very much used, but greatly underutilized by the public. But underutilized by, in this case, restaurants. Okay. All right. For instance, if we change the menu every three months, but well have as our menu up there from something from three years ago. So well have photos that are horrible because someone took a bad photo.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Here, thats for sure. Exactly.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, like you say, because its more of a local flavor, as opposed to people thinking this is just a national chain and just throwing this out, and it doesnt really appeal to us right. Kind of a thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right, well, Ill tell you. I do two things. Okay. I have a background in digital marketing. Okay. The way things have turned out the past few years, Ive been mostly a waiter. And the thing is, one thing I have fully seen is that the best way to market restaurants online now is not via a corporate presence on Instagram or TikTok or whatnot. Yes, thats necessary, but its more on a local level because people respond to stuff on a lot, especially once the pandemic hit. People seem to be more concerned about local concept of local. Im looking to do three things. The restaurant I work for is called Seasons 52. It is just basically American in that grill. They call it a fresh grill and wine bar. Theres about 40 some odd locations throughout the country, 45 or 46 or something like that. Okay. The good thing, first of all, a couple of years ago, before the pandemic hit, they gave local management the green light to do their own social media, but they didnt give any guidance. So Ive written a 60 page ebook on how to do local marketing. I also want to then I guess you could say coach or act as a consultant to the general managers around the country, how to do things on its no longer called Google My Business, but its the Google business suite, so they can do so because people search now for local information. Blah, blah. Restaurant. The third thing I want to do is contact corporate and run an ad campaign. The slogan. So the tagline for Seasons for you, even though it hasnt been used for a couple of years, is Whats Good Now? Because its a seasonal type restaurant down the road. Fingers crossed. Id like to get that as a client, they often wont listen to someone thats aware. But this is Season 52 as part of the Darden, which is the largest restaurant group company in the country. And what Id like to end up doing is expanding beyond what Im doing, what I would be doing for Seasons 52, and also go to other restaurants or restaurant chains. Okay? What Im saying is this. The corporate people might have an Instagram account, and they might have 50,000 followers. Theyll post something, theyll get 300 or 400 likes, so to speak. Youll have a local influencer who has 15,000, will come into the restaurant and make a video or whatnot, and shell get 700 responses more than the corporate account. So, again, my take is you need to have your local GMs understand the power of local marketing, okay? And they need to be trained. Okay?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"But I thought there was something about five templates or something.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thank you very much. Appreciate that.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, I would tend to agree. I do it all the time, so, yeah, I get it. Okay, cool. Are you looking to start a business of your own, or are you looking at taking this idea to corporate and understanding the tools involved in this type of thing, or whats your thought process?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah. They own Olive Garden. They own Capitol Grill. Where are you located, by the way?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, thats fine. I appreciate that.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay. So my point is, if I get the GMs to understand this, I could use that as, like, a test case scenario to go other restaurants, right? Yeah.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]