[{"pageContent":"How do you know? Because how do you know? Because the thing is, if Im offering my information, which Im Chris Young, bro, Im pretty big. I dont know if you know I am, but Im probably the best rapper alive as far as the Underground, and Im about to come back. I basically am like the next Kendrick or whatever you want to call it, like one of those type of rappers. But the thing is, with what I do, I have multiple things I do. So if I tell you Im a rapper in your head, I dont know what comes to your mind when I tell you Im a rapper? I dont know. What do you think? I dont know. But the thing about what I do is Im a brand and I do multiple things. So when I saw your ad, I was like, oh, this is cool. I want to know what this is because I could use it. And I dont remember everything that I saw, but based on what I saw, I was like I actually had an idea to do, like, a click funnel wrapper thing where it was like a click funnel thing where youre filling out a form. And youre basically like youre seeing my music in the video in some form, like a minute of it, and Im asking if they liked it. They fill out a form, and theres a discussion about basically something surrounding getting equity from my music and investing in my music or something like that. Something like that. And doing something like that. Thats why I was like, I wonder what because its like when you have a major fee being paid and its a click funnel as a rapper, Ive never really seen that. And Mike Baron, whos a coach, me and him were planning to do this for me, so that was why it made sense. Mike Barron, if you dont know who he is. M-I-K-E-B-A-R-R-O-N. Hes like San Diegos best coach.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, so what is it exactly, though?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Put in the thing that I was a rapper, I put it in the fucking form.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"How much is it?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Was this supposed to be a general explanation?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, its new. Okay. Good luck.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Have to sit around and do all of that shit. Thats annoying, right?","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"How long have you guys been around for?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I dont have the ability to sit down and set up the website again. I have a girl who wants to do it, but I dont think she has time. Shes like smart and stuff, and she has great content design. But Im like, okay. And then the ecommerce business is basically the idea is so good that I think it will take off. So Im just like, okay, Ill explain that to you shortly, but I already sell merch and stuff like I sell the way I sell my merch is I dont have a website. I basically post pictures of it and say, if you want it, cash at me and then send me your address sizes and all that. Thats how Ive been doing it, because I need the money right when I need the money. And I dont like when I have to depend on a third party to wait for 48 hours and then you pay for it and then shit happens where sometimes theres mistakes in the process of the money. And some of these at least the ecommerce platform Im using, I was like, I want to get the money first, then I pay for the product as a sample, ship it to them, and then I have the profit already and dont have to wait for the thing. So Ive been doing it like that and making decent amount of money. And then my investor, Ellie, who works for USA Medical supply, he has a lot of opportunity with me. But what we talked about today, which is super random, he talked to me today because today is Sabbath in his custom, so he still talked to me on a Saturday, which is bizarre, and I just talked to him like maybe an hour ago. So financially theres really no issue for me. I just want to know what it is, like exactly an idea before you explain it and then you can go into it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, Im back. Now, Air AI is the form that I filled out, right?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay. Actually, the ad got my attention. I cant remember all the details, but I was like, this AI stuff. Ive been on chat GPT. I have people in my world that have been making a lot of money really fast for recently, and Im like, okay, got to do it like bitcoin type shit, like hop on it now. Its going to be good for like a year or two that everybodys going to do it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"I just want to get to that so I could just give you that first. I know how it works, man. I did sales. But I just want to know that now because Im talking to my investors right now because my capital Im a rapper. And my ecommerce situation that I have the idea that I have, which I know this is recorded, please dont steal my idea. But the thing is, my idea that I have, Ive been sitting on it and I want to execute it myself, but Im good enough to do it myself. But my music situation, Im starting to blow up again. I was bigger in 2011, but now Im even bigger in a way where its kind of like I recreated exactly what I used to do when I was younger, which is making people want you. Making people want you. Right. Okay.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, so I connect you with Mike. Mike Barron is a coach whose program I did. He charges like 50,000 for information, which he hustles, man, but whatever, its cool. And people pay him a lot. And sales team, theyre making a million a month. Some of these kids, theyre like young kids, really driven, maybe they could use it. Mike Barron textures me a lot, so maybe I could present it to Mike. But can you explain it for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. So you called me?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Bit out of seeking investors. Not seeking investors because seeking investors, maybe thats not the term, but sharing equity. So theres a fucking thing where people make NFTs, right? And its like the NFT factor can have a thing where you get the NFT, and if you have the NFT, then you have options and gifts and things like that. And I did that for one song and got a lot of things going on for that one song, and I was like, wow, if youre actually super talented, people go, I want to be a part of this. So thats actually more of like that. And I know that youre probably hearing a lot of money shit coming out of my mouth, but its like, Bro, Im valuable, so Im not trying to same way these coaches are like, these coaches are like, youre paying me $50,000 to talk to you about some shit that you still got to do after Im gone. Right? I dont know, man. But I guess if its not a fit for me, maybe its a fit for Mike if he has to go to your website, fill it out and all that. Okay. Right, man.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Do you know who hold up? Whats his name? Mike Barron. Have you heard of him?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}}]