[{"pageContent":"Yes, sounds good.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Currently, its 3300, because Ive been marketing it as a better test to people in Latin America that wants to relocate to the US in a legal and orderly way. So it is a twelve hour program, and I am selling it for how much did you say? 32,000?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I want two things. First, I want to automate it. And by this, I mean I want to create a program that I can sell online, and then it can produce by itself.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes. So I think I can use this for my recruiting business and then find out some clients for the coaching business because it is the one that is already producing and I would need more like, face to face interviews with potential clients. And thats what I am looking for. How to reach the candidates and how to reach the potential candidates going away from the traditional LinkedIn algorithm that it seems that its changing and its not producing as much as it used to.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It is started during the pandemic because I am also a recruiter and that is producing much more. That is producing about between 30, 40,000 a year a month. Now what is that?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I am starting the coaching business. So its not that I dont have a significant revenue. I would say between 2000 3000 a month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Recruiting a recruiter.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, its revenue and thats my team.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"It is different, and the people will pay for it because they value that insight, because its not like the coaching from the HR perspective. The HR, I respect the profession because I was an HR person before, but its a totally different mindset than the one that we develop as recruiters. Right?","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I do want to see.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes, hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I am in between the first and the second one. Can I put you on hold a second? I have a call that I have to take. Give me just 1 second, please.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I have not given a thought to that question, and I think its important, but I dont know. But I dont know, maybe if I can make it ten times what Im making now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. I want to understand a little bit how it works and of course, everything that entails on my site.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, Im not sure what the okay. Why would that be relevant?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"But as of now, I am selling it for 3300 because I am selling it directly to the people. And again, it was like a beta test or a test. I dont know how to say it, but it was like a pilot for people in Latin America. And even people in Latin America are willing to pay for it, and they are being successful in their job search, and we have extraordinary feedback from the people.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"However, I know there are programs here in the Houston area, for example, that sell for 70, 00, 10,000, even 14,000.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hi Jake. Very well. And you?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I want to help people. Okay. The coaching program is how to find a job. So its interconnected with my recruiting work. Right. So people that may be stuck in a midterm career and doesnt know how to move upward, people that was laid off and doesnt know how to look for employment, with new technologies being out there, its very challenging for people. This is traditional ways to find a job, to actually connect with the employer. Right.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Honestly, I have no idea how much I can make because it is a totally new world for me.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Lets take into consideration the 3000 a month that were making on the profit on the coaching side.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Actually, I misspelled my name. Its Anna.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}}]