[{"pageContent":"Thats right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, to start with, it be 10,000 and up? It would depend on what I was able to take, what I could presumably guarantee. And theres no guarantees, of course, with any one, but members has to be paid back.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"You mean in my industry or across the board or what? I dont think there is a standard. Itd be fairly for call in appointment where you talk with the person on the phone like were talking. I dont know. I could guess, but I dont know if there is. I havent seen any figures on that.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Well, it would depend on what the opportunity allowed for. I mean, I have other funds I can have in hand very shortly, but I dont do that if I have to make payments on them.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"700 and above, depending.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, Im looking for a job for sure. Would those people be working on a commission basis? What do they do?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, it doesnt take much to hire people to give them a running start and find out who can produce and who cant. Thats another matter that takes a little bit longer. But theres no limits what I or anyone can do.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Somewhat. But I know there are some people that spend a whole lot more that spend 30 and $50,000 a month on ads, so Im not there.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"That makes sense, I guess, but I still havent learned anything new. Just optimistic scaling to high ticket individuals. Thats what Ive received so far.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, right now Im in the health arena, and I have a book which Ive written, and Im focusing on three of the very notable studies that have been done that we do not know about. The average person knows nothing about them. And so Im giving a thumbnail to people on what Ive discovered over the past seven years.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont have much set aside. Im pretty much pedal to the metal right now with a secure reserve. I mean, the rest goes into marketing.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, I thought that was going to be something that would be sent out to me.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"In other words, besides software that you have used and that can be used, should be, maybe should be used, you have a program where a person can take part in already established programs that you have that they can acquire more more, I guess responses and interviews.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Most I can pay you 995 right now.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, Ive been doing more study all the time on a one AI, and obviously theres a lot of things that a person can do on the entrepreneurial side to increase their marketing, I guess, their click throughs their orders. So I was interested to see what angle you guys had.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont have any plan as how to deal with disqualified clients in terms of an after sale. I havent gotten to the point, I guess, of putting anything in place.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I have a website and I use their services with the program emails, follow ups, et cetera.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, Ive been working for some time with Kajabi, which is kind of all in one marketing program. Are you familiar with it?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, thats one of them.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Say again?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Thats the next step is to broaden the exposure and to get as many people on board on eating healthy and changing their lifestyle, getting their body healthy enough that these diseases dont affect them and they will be much healthier and live a much longer life.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, I just want to know if that would be one of the paths that I could take or would take if the company and myself, if we were both happy.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Not much right now. I dont know what direction, in addition to go in to expand and to roll out. Yes, but other than that, I dont know. I dont have a plan.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I havent been doing any telephone interviews, so they will probably increase with that. I havent marketed that way, and thats the next step for me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I would say medium to high.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, of course. The people you get what you pay for, you get how you use it, you get your value out of what you believe. Of course. Double or triple that amount.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"They dont receive or there is no requirement for a call. They either take part or they dont take part. Based on the videos that I would send out, which are sales pieces, in essence.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Last year, probably 120,000 myself through this business.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes and no. The yes is that theres potential upside. I see. But no, in the sense that I havent learned anything yet other than what you say in your sales pitch, that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, the first step would be to take a person who would call in to answer the questions, to explain an overall summary of what we offer and why and get them signed on board. After that, they can take part as a coach. Thats one of the options that they would have. Another would be that they would take a class on how to set up a business of their own that would offer the same thing and be able to buy into that business, which is already encapsulated in a separate affiliate type of business. Does that make any sense?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"The number of return calls per month would be about 1000 that I would aim for at this point and be able to close approximately 15, 20% of those.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Not really, but from what you say it does, yes.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No process. Right. Beyond close circle of friends and investors.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"About 2000, 2500.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Have these people who are the executive consultants, have they been with your company for some time? What have they done in their business before and during the time that theyve been with the company? How did they earn position of being the consultants? Was that something I would do at some point?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I have a course that can run anywhere from $300 and higher up in the thousands, whether they want to have added on to it coaching, and if they want to have added on to it a weekly seminar.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"About 4000 to 6000.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I use readily available software metricool, for one, and paid advertising through social media.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right, okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Oh, I do, but itd be a different kind of marketing, I guess. Im ready to expand and to grow, but it depends on what steps there would be, what kind of return I would get by testing out the system.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]