[{"pageContent":"An online store.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"It sounds good, yeah.","metadata":{"fillerID":19,"fillerText":"Yah umm","category":"C"}},{"pageContent":"Well, Im 59, and Im about six years away from official retirement, and I just realized I dont have anything saved up.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"And maybe a couple of hours of work in a day and then at the most. And that sustains me, that kind of thing, since Im this late in the game. Yeah. What were you going to say, I guess since Im this late in the game, I figure I may as well go for the best thing I can imagine, which would be either a passive income or some sort of windfall that makes it unnecessary for me to work. That would be nice.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. The good thing about options though, is.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I will.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"You can be reached at this number you can be reached at this four 80 yeah, thatll be fine.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Failing that, at least, and providing you the most value.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Online you can do? I dont know. Well, actually, I just dont know what kind of business I want to start.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Go ahead and send me that link.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hey, how are you doing?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"You can lose your option premium, but thats the most you can lose on each trade. So its a limited downside, but a relatively unlimited upside. Let me ask you this, but its hard.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Id love to travel. Id love to have enough of an income and preferably a passive income so that I can devote myself to traveling and to exploring the world, appreciating art and seeing other countries, even, and having location freedom where work, quote unquote, consists of logging onto the laptop computer wherever I happen to be in the world.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I havent checked it lately. Im not really sure what it is. That was not good. It was like 480, something like that. Or maybe it was 537 or some number. Like it was not good, let me put it that way. But that was several years ago, so who knows what it is now that makes sense.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Oh, Im thinking about starting a business, an online store or something. So I dont know. What could you do to help me with that?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im not, and I realize I need to do that. And thats part of what this is about.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay, Jake. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"A little bit of both. I want to do something I love and yet at the same time?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"But this situation may not last forever. I need to have a net to jump into, if you get my drift.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, Im looking at futures trading options, and also what is it? Forex? I think I can learn how to trade.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont. Im in an institution right now. Im in a nursing home, so Im not really working at the moment.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"That does sound good.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"I dont have any. The nursing home is the bill, and thats covered by medicaid. So Im just basically here.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I dont have any, but I might be able to borrow some.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}}]