[{"pageContent":"Two years? Yeah, pretty much just kind of holding only so much that we can do. I deal with health issues too, so Im not blasting it 24/7 as I used to be able to as a sick puppy. Were small game, Im afraid.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"No, Ive been dealing with an unwell pet. Yeah, its okay. But lets see here. Yeah, sorry, Im not really prepared to or mentally here. Okay. Yeah. Theres an email with a case study, which just real quick, what is it? I know, I looked at clicks on it and what is it?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Ten years.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, if I can see something, I just need to see it. Yeah, sure.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, of course I would love to pull in like 100 and 5200 a year easy, just keeping it small but growing. But right now thats not Facebook, really. I just want to know what your thing is. Ive got to get running back here. I cant really tell what youre doing on your business here. I cant even tell if anything would fit or even a portion of you would fit. I cant tell what you guys do.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"And a really crappy vet. I mean, my God, they prescribed us three times medication that actually that theyre now telling us. Its, like, double the dosage that he should have gotten. And its like, I know its really bad, and then they overcharged it. Its been really bad. But anywho anywho.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"With ADDish type people, that kind of is a nightmare. Absolutely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"We start at 22, 50 for a build of a website, but its pretty customized. But thats like a corporation, a regular standard, not a small two, three pages. Were talking ten pages or something. We dont really take smaller jobs than that, but a lot of custom work, a lot of custom design on it. So it doesnt look like the templates. We do use templates, but it is too low. But our competition is also out there that hey, does websites like this for like 600, 800? But yeah, our quality is pretty darn good.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"You work late at 07:00 p.m.. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Its minor to compare to what could be going on. So I just need to get them fixed and done and find friggin doctors that pay attention. I have stories worse than the Pet. Im serious. Americas healthcare system, especially in Austin, is really not good. Ive been blown off for four years. Just life. So please. Yeah, if you have that, I promise I will look at it and we will chat. Im curious, and when I do get on my top of my game, if it is a larger package or something larger costing package, I may still be interested, even though because Ill be able to jump in head first and run with it like crazy. Thats what Im hoping to do anyways when I get back out of having a hip replace.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, its not small small, but it keeps us busy. But generally, for most things, whenever a company does not, like, post prices on the website, generally were way too small for them. Looking at your website right now, and Im, like, betting that this is, like, more sweet thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"We are a web design company, but were small, the husband and I. We have 50 customers or so that we manage and pumping out probably two to three websites a month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, we do have a management thats management customers. Yeah. And that we charge way too low on. But its kind of working. It works well. Were gradually eking it up, eking the price up over the years. So its really actually its only like $60 a month for management. Not for hosting, but management. And thats just managing the website and 720 a year per customer.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"You work late.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I guess I dont know that he wants me to scan through everything before he jumps on any calls or anything. Hes not very I go through everything and review and review, review, and then when Im like, okay, we need to do this, I tell him we do this. Hes the design jockey. He designs left and right, and thats what he likes to do. So I do the management and office stuff and the design and SEO and stuff like that. Honestly, Ive got to get going here. Can you please drop me some information and so I can get an understanding? I dont need to learn anything. I just want to understand what you guys do and kind of what is the cost or range of cost or something. Its so ambiguous right now.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Not enough.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"B and I networking group. Yeah, I paid networking group. But its a team of people that its a networking group. Its a paid networking group that you go in, you join, and you got like, a person from each member, a person from each career type and business type, and everybody works together and hires each other from within b and I people, they see our designs and theyre like, okay, we want to work with you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, I think were good. I think were fine then. Okay, so maybe I might reach out again with you guys later.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, and we just need to start charging more for those individual jobs over. We include some updates and stuff like that, but our new customers are like, they know how to use it to the full, so its like, okay, well, now our plan is backfiring. It used to be that most customers dont do updates and we tell them, look at this level of updating means that we are not coming and chasing you down. We do the website updates and protection and all that stuff, and well update content for them. And its really pretty slick, it works pretty well. Most customers, they only come back like, okay, I need a new employee added, I need timings changed, I need things like that. And its pretty easy to do when youre managing that. But our latest ones are kind of like going trying to slip in a lot more complex work. We just need to build for it. We just need to say, okay, that doesnt fit, but we like to give a little slide here and there service. They havent talked to us for a while and its like, okay, we can do that. But yeah, more and more jobs. And Im trying to get I want to get SEO involved because SEO is like where the money is at.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right, exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Oh, I havent checked anything. Hes got a really good one. Hes like, I think top. Top. I havent checked for a while. We dont need to check ever. So were in cash base for anything. What is the budget on this? When your package youre talking about your package, and whats the monthly starting pricing on your stuff?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Well, I mean, basically Im going to need if Im able to get a lot more organized where things are flowing a lot more naturally and customer flow and workflows and stuff like that, Ill be able to do more right now, I cant do more. I cant take on more customers personally. So in that time, yeah, maybe. Finding leads is not our issue right now. We dont need leads. We do need constant flow. But its like, we all were like, a second ago, we were like, I dont know. Ken was like, I dont have any more websites to do. And then he turns around the next day, and hes got two in his mailbox of people, and I still need to send another proposal out. So we just got three in the mailbox, actually, maybe in time, once we run out of these leads and at some point, maybe our local circles will dry up, but two people can only work on so many websites a month, right? For me, hardware that helps me stay directed, organized, closing things out, faster billing, those are the types of things that Im interested in right now. And so leads are not really the issue. At some point, then, if I get those things fixed, yes, leads will be helpful. Im looking at the review on people, but on PC mag right now, Im looking at your review because I still.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay. I dont have anything. You said you texted it or youre going to?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Actually, its a little too busy at the moment.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Can I do it now? Possibly. And take a month break? I could get everything running for him. I dont know.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"The.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"If we close like two to three sites, were looking 5000. And so then add in the maintenance ones, thats about it. Not very much.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"The thing is, I work with B and I, and the clients come to me. It works really well. B and I works really well for web design, and we have, like, agencies, but were not doing any leads or advertisement or anything. People come to us and say, we got a new one for you because we partner with a bunch. Yeah. So were very fortunate in that sense. Really, this issue is managing workload and getting things done faster, charging more and being more organized so we can fly through them faster and have things automated. Thats my issues. Thats whats stopping me personally. And then I could start making some sales calls, but I havent needed to do sales calls for years since I.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im good. How are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Im financially secure. Okay. And thats without my web design. My web design business is something that we do because of love, which I would rather have it do more because I dont like dipping in as a savings. Im not going to be going and spending $1,000 a month on a new package right now. I need to get a smaller package available. So if thats what your product is, we might as well just go ahead and close up.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Have a good day. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"We were 30 minutes in the call here, and I still, like, Im lacking a tangible understanding of the concepts are great, but Im not really wanting to invest a huge amount, like, thousands of dollars in something at this time. I really dont. My dog, I just spent five grand on to get him to fix his mass cell tumor on his tail, and they had to drop his tail off too. Now he probably has kidney failure, but I dont know. We got to put him through chemo, so thats another couple of grand, probably. So right now Im not really flowing on the money, but the cash flow at the moment. So I wish I could understand more or see tangibly. Im a visual person, so I wish I could see a little bit more about what you have, but outside of that, I dont know that thats going to happen. I understand that you guys are clarifying. Its a clarifying call to see if I fit your realm.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah. Were just two of us and the people that our latest customers are getting high maintenance, which is great because that means work and jobs and stuff like that, but its randomizing. So thats actually just kind of our problem right now. So Im looking actually in virtual assistant type work. Maybe you mean hiring some? Yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right, thank you so much.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, but I dont know physically, what you do. Youre like yeah, its like conceptual. Its like, oh, we do this. Were all fabulous. Were like your big helping tool, and we get all these concepts, but I need tangible.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"No. Yeah, we should be charging more. Should be able to be charging more for the website. Ive been trying hard to find a really good customer management portal and that works with us. I wish I could find one that actually has so many pieces in it, like ticket tracking, where they get a customer portal, but then actually helps us with workflow because with our management customers, we have different things that we would do throughout the year. That its. Like, okay, so website updates, lets just say that a couple of times a year, a few times a year were running them reports saying, hey, look, look what your website is doing, right? And we could be charging more per customer if we had a better tracking thing. That where we could actually do more automation of reports and suggestions of, look, you really could use some work here, like SEO type. I dont want to run yet a full SEO business, but I want to do SEO as you go. Most of the people around me and most of our customers, they punch in the gut hard about getting like a $1,500 a month organic SEO platform. But thats the kind of work that they really need to have the longevity of the success of their website. So I want to build them up to that, to where theyre starting to see improvements and then start getting even more and more in that. But most of the guys that are doing SEO at 1500 a month are ripping people off anyways. They run a report, they make the changes, put some blogs out, buy some other backlinks and stuff like that. So, yeah, I kind of want to make a suite that is like, really packages for them. So, yeah, the things that Im looking for are tools that help me stay more organized. I did add okay, so its very hard for me to I always get the shiny object happening, and when I dont have my I want a customer workbase, but also that I dont need anything that manages money because we use QuickBooks, although if it takes away that expense, its too expensive. Thatd be nice, but QuickBooks has ACH Pay and all that. So Ive got some tools. Ive been sitting here looking at, like, sweet dash and agile and flow loo and some other tools that Ive been looking at here. Ive got some even lifetime licenses that everyone is just not making it, and theyre missing some core factor. Its like, well, thats going to put me into having to use three different tools. And I know I can never get my husband to adopt that to manage us. So we need to have a calendar system, a workflow calendar, like brand new customer. Okay, you got a website. Boom. These are our workflow steps that we need to make sure that we cover on every single brand new website. Okay, fine, thats done. All right. The year starts of management, and in that workflow, we assign that workflow to the customer, and that workflow automatically puts in dates in our calendar so that we know, like, we wake up in the morning, oh, we got to run three reports. Those are the kind of things Im looking for at the moment. And I know that when I get all these things more in place, I can start bringing up my pricing even more because were going to be doing more and having more impact on the customer. Do you guys have outsource opportunities too? Offshore outsourcing? Ive seen what is one of the tool that they keep client call me about starts with an end. Its a company that its just a whole dashboard of tools and services that you can resell. Like, you can resell email, you can resell a whole bunch of things like that. I think its been a while since I saw your ad or I put my name in. I was like, I still cant tell what you guys do, if its anything close to anything like that because Im still looking at whats, like, going, is this a dashboard of tools? Is this the dashboard of, like, ideas, software?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I would like to see it and see the video. And I guess maybe I need to look at the case study thing too. It sounds good, honestly. There are some medical procedures Im going to be needing to do. I need to replace the hip. And so I have autoimmune disorder, probably. So Im doing a health issue right now, but after everything gets done, its going to be back to full time running again. So its something in the future maybe possible, yeah, something I might be interested in doing something more in the future. But I would like to see at least understand kind of what you guys do and be able to have a little bit of a thing. And then I could tell you, hey, this isnt for us now, or this is like, hey, lets talk in four or five months when I heal. Okay, sounds good.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, maybe.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]