[{"pageContent":"Well, I know enough of seeing old clients of mine doing it on their own, and maybe because Im older, Im 45 now. A lot of these life coaches are 20, and they just go theyre very confident and all that. And Im like, is this enough? But then when I see one of my clients making it in the meantime, like 50,000, $60,000 in a week, Im like, I maybe actually should be going into this. And I do have the knowledge. I know what to teach, and Im missing out here, and its clearly Im missing out.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"And find it on yelp under Oakland. I have very good reviews there. People love the work that I do, and its what I do. Business has gotten slow since the Pandemic. I lost a lot of clients and moved to Tulum or Texas or wherever they went. I went home to their parents. But I used to do the work a lot in the city, and that, sadly, is no longer a thing. Thats why Im looking at different what I can do. And I want to do more consulting for sure. Want to offer people more of my experience, expertise in a professional manner. I do not know if your technology could help with that, but yeah, that wasnt one of my main questions.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I consult, but I also do hands on. I studied with my great grandmother healing work from the Mayans and a long time ago. Then I also applied that work. She taught me to study massage. So I studied massage and got a massage degree here in California. And since worked at salesforce facebook, all those different tech companies and have been around tech all my life. My dad was one of the first engineers in the Bay Area to help create the Internet back then in the days. So I was around when the Internet was before it was being birthed, when the infrastructure was being made for it. So Ive always been into technology and advancements, and the AI is, for me, what weve been waiting for, for the creatives to finally have a red carpet to enter the tech world. Were no longer in 2014, 2013 where we need engineers from India or whatever now we need to make people come into the AI world to use it so everybody can start using their creative site and leaving their boring jobs behind. Thats how I see the AI.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Whats your name again so I can save the number?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Maybe a grand at the moment.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Bye. God bless.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Hi.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"My uncles offered me a place in his office on the floor at the moment.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Please? Im doing healing work.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"If I have my computer, I have my laptop, I have my iPad, I have my iPhone, I have my Imaging processing power, I have my Words, I have my AI chat bot that helps me make all the text and all the things I can create my program I can get together. And Im going to start working. And as soon as I have my first check, I will have at least a grand to start investing. But I also have to find an apartment. Im looking long term, I cant do something right away but if you can give me a thing, what I know and numbers and stuff I will work and manifest that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I do different things. I do healing work myself. But I know different people who theres one person who I was thinking of that may be interested in your product, who works with contractors here in the Bay Area who all will probably profit off your work to get their last projects going and to get new projects going. I looked at your videos and saw the different tools that youve been creating with AIS, and Im pretty impressed with it. So Im more like AI researcher and research on whats going on in the world right now. And Im a connector, so I connect people ideas of people together. So thats what I do. And so thats why I never responded because I knew like, okay, youre looking for full on clients right now and thats what I am at the moment. Not yet. So thats why I havent responded to emails.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats what I do for now, yes. Thats just what I mainly do since 2009 to study body sciences and its been a pleasure to help the communities around me. And Im also working right now on a project for a temple in Hawaii, the Water Temple, where were going to install some pretty beautiful healing technologies in there. And then I know a lot of people for my work, just like all kinds of people. So Im always interested in whats going on in the AI world. Its like, for me, a very big thing, especially as a person who is dyslexic. Since birth, the AI tools have been helping me get my word and what I think out into the world easier. As you can imagine, just language modules help a lot people to understand what Im talking about. Especially people who do not have access to the memory brain as much as I do, their imagination as I do. So thats kind of who I am. Nice to meet you.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Jake, okay. Thank you so much, Jake. And thank you for doing this work. Its really beautiful. Have a great day.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah. These used to be my students. I just dont know how to get there, to be honest.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"ItS okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yes, of course.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I normally offer pricing like $200 per session if its on hands on or consulting. But I also was thinking of going into more consulting work. What I see right now, theres a lack around all the spas and all the massage places of healers and workers who know what theyre doing. And so what I want to do more is sell more services and training and also products like sound healing tables, and I have an engineer for who makes them and also services. As an education, I feel thats something I would love to do more. I just do not know how technology can help me do it. At so that was another reason I looked you guys up when I found air.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Currently, nothing at the moment. Im looking for jobs and everything. Its been like a struggle. I dont even know how to Im getting a full time job now. Thats going to start helping me. Its a part time job. Im ground zero again. Thats where Im at. But I have all knowledge, and I have this knowledge, and Im still hungry. Of course Im still hungry. I feel its like my responsibility to teach people these things. Thats where Im coming from. A lot of these things like sound healing and how sound works. What is a science? This is a body, how our body works. I feel if people would understand the fascia we would not have wars anymore. Thats how profound this knowledge is. What Ive learned over the last since 2008 Ive been myself in an accident, suffered from worms, from bacteria and just gotten out tumors out of my brain. So I know what Im talking about and Im more than a survivor and Im ready to thrive again. And I just know that Im being put position. There has to be a reason Im not comfortable right now. When youre out of not being comfortable comes hunger, right? And so I am willing to learn what I need to do to get this together. I cant put a program together, all these things that will not take me long. Ive done workshops at Lucidity or other festivals since many years and then the pandemic shut me down. So I want to get back in a saddle and I didnt know if this is a technology that would help me to get back in a settle. Right.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Five AI? The air tools.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Thats where Im at right now, but its also limited. Wow. Im learning how to get out of this situation. Why? I took out a part time job waiting on my background check to go through so I can start working. Im so grateful that Im not on the streets right now. Thats why.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Hello? Hey, who is that?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, you can look up my reviews on Yelp under magical own Mayan body work. Magical and Mayan body work.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Im working on that, for sure. Yeah. And what are the prices? How much is 5000 of us? Or how much does two programs like these cost?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}}]