[{"pageContent":"Im doing pretty good. How about yourself?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Andrew yeah, but really quick, could you explain to me how your system works? Like, just a little bit of it?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Well, with my brothers business and ours and our business over here too, because hes running basically a business where he can run ads for people and everything like that, but its a really specific way. I cant really get into too much detail of it because its also a new way of doing things that I would not just know that hes running ads and everything like that. And so our goal was originally a million in twelve months. Were pretty confident by how much work were putting into this, but from what my brother was saying, what hes going to be putting in for his business, its looking that its going to be much higher than that. So were going to jump off the ball here and say that were going to be a billionaire by the end of this year.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Not accessible right now. And thats why I like to give you a call later on.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I dont think I remember.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Hey. Hows it going?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Ive been running it for about a month and a half now.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, no, because the thing is, its such a high dollar item. I mean, who has ten grand to slap down for that? Who has 15 grand? You know what Im saying?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Oh, yeah, we both do.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, we have a whole bunch of services here, but mainly right now, what Ive been focusing on is brick and mortar businesses. So Id say roughly about for. 2000 is probably on our high end. And 500 is probably on our low end.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, not last month, but this month is looking more promising as I already have a client set up for a client set up for a discovery call where Im going to try and close her. And I also have purchased ads from a different company that theyre going to be running for me here pretty soon, as well as some extra hands through upwork to help us out with reaching out. So with more hands on that, its going to increase our sales. As far as the podcast tour, I havent been really focusing on that right now. Ive been trying to stay a little bit in my niche, which is basically artists, whether it be music artists or painters, and basically entrepreneurs, business owners, et cetera, like that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, its not that very good.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"My annual income, Id say my annual income last month, last year, I put in around $73,000.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And we both working together and everything like that. We just hired on two more people to help us out.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, not yet.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"You have one service that Id like to try and promote. What is called? It makes it different than most marketing agencies is called Podcast Tour. Now, what this is, is they pay us ten grand, and what well go and do is within six months, well get them on like 15 podcasts, which will greatly boost their brand. So whatever theyre trying to sell, whether its their music, whether its their brand, their T shirts, clothing line, makeup, doesnt matter. They can go from barely any views to basically maybe even 20% Im not 200% to around 400% increase in sales and also views of their brand greatly increasing their credibility.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Is its a little side business for him? So I would say that his is a separate entity. Absolutely. But at the same time, he runs this business with me as well. I guess you could say that, yes, were kind of split, but also at the same time, were also together. Hes more focused on that low side business right now and get that up and running and selling that out and everything like that. Wow. Im working really hard on this. And then eventually hell once that because thats going to automate. His business will automate really easily. As for mine, over time, it will automate easily. I just have to get into sales. As for his, he can get in contact with business owners right away.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Billionaire.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Its very unique. Its very unique right there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Easy doing. Easy doing. Automation taught it automation.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I have not received it yet.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, I run a marketing agency, and Im just trying to figure out an easier way to reach out to clients. Is that what you guys do? Right?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, absolutely. Im in small town Salina, so of course were not going to be able to find that much here. And right now Im still trying to build up my brand as well as balancing and reaching out, and I got to say its going good. Pretty far. Sorry about that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, it has not.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, thats my number. However, I havent received your guysmessage yet. Are you able to send it to my email?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"All right. Thank you. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Slowly increasing.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Id say budget wise, maybe about 200 a week.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"When you have a one service Im sorry to interrupt.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Its about 580.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, lets try that. Because sometimes SMS is a little finicky.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I do want to know about this and Im going to give you guys another reach out here in about a couple of weeks once things are going a little better. Because again, its just the start of the month, but Im fully expected that within the next couple of weeks. Were going to be our goal in the next couple of weeks and for the month is to get for my business is to get a total of 30 clients regardless of what theyre reoccurring on. Id like to have them reoccurring, but for podcast tour, thats a one time payment as where maybe SEO. SEO package is a monthly reoccurring thing, depending on what I sign them on per contract.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Were partners.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, let me check my email really quick. Yes, I received it through email.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, Absolutely. The reason why Im always open to new ways is because I know the world is constantly evolving and I know other people arent jumping up on these. So in order for me to get my edge, I got to jump up on these. You know what Im saying?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"What is your credit score? Anthony, what is your credit score? Anthony, what is your credit score? He doesnt know what his credit score is. You need to download credit karma. He doesnt know what his credit score is.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}}]