[{"pageContent":"Hello? This is John.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. So basically, my wife owns a Senior Living in Care referral business and she wanted to teach other living what? Senior living in care. Oh, the website is seniorliving Academy. A-C-A-D-E-M-Y.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, cool. Well, how much is the offer making currently in terms of monthly revenue right now?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Are you okay, John? It sounds like you just got a car accident.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Good. How about yourself, Daniel?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I do not.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"To get to think if we had 30 total appointments, it would be easy, actually, I think if I had 30 total appointments and we were at a ten K ticket price even, I mean, thats what, 150? I guess that would be 150 grand if I did my math rate. So lets call it 40 appointments.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Can tell that youre in the eye of the storm now as it was.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes, I have a 660 with a bankruptcy in the last year, brother. And my wifes score doesnt exist because she didnt have any credit.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So right now, my wife is taking all we have callan Lee set up directly from our course. Theres a couple of different automated emails that go out that offer a one to one call with her if they have not made a decision yet. And then in our course, actually a couple of different places. So when you go into our three free courses, our lead magnet, you can actually view all of the outlines for every course thats there when youre in there. When you go in and look in the actual course descriptions, theres another calendar link everywhere that you can find to set these one to one calls up. My wifes closed percentage at this point. She just had another call this morning, didnt close that one, but shes closed five of six calls. These people were just like, yeah, this makes sense, lets do it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sounds about right.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah. Let me just check that email and see if for some reason it wants to spam. Yeah, no, I did not get that. Sla@patriarchplacement.org. Okay.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay, go ahead.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"We want to be at 25.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"But you dont know how much of its coming from ad spend just versus, like, organic traffic.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats exciting business right there, man.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"For referral business.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, sorry to hear that. My wife owns her own Senior Living in Care referral business and wanted to branch out and teach other people how to do it. So we have this course completely launched. Ive started to play around with some AI tools to help me. A, with virtual assistant stuff, b, with Im an outside sales guy. The creativity for being engaging with posts on a daily basis is I dont want to say fleeting, but Ive been trying to stay relevant in the Facebook world, in the YouTube world. At this point daily, its just not my cup of tea. So Ive been really working with some AI to at least generally get me pointed in the right direction for some quality content thats engaging. So now that Ive been doing that, the algorithms, obviously, when Im scrolling through Facebook are pretty much 80 different AI programs and launch businesses and so on and so forth. And I did see you guys as results and was pretty happy with what I was seeing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"We launched a generally high ticket course in the past. We soft launched and then did drip content from last September onto we just finalized the course with everything up and running in beginning of April, actually, when we got it completely finished. So our pricing is $1,350 a course. Or you could do payment options where it goes to six payments of 275. Those prices are about to go up $300 each. Since the course is no longer drip content and its fully available, I dont know if youre in front of a computer or not that you can get a gist. Okay. So if you go to seniorliving Academy oh, cool.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"He said it again. If we raise the ten grand, do we still have a plan to convert high paying clients?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"When I asked you six months revenue, I meant, like, in six months from now, whats your monthly revenue going to be?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, thats cool. How much are you going to price the new course to the home care target?","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Is the majority of go ahead, John. I heard 30 clients a month and then I didnt hear the part after that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I do not.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I dont.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Got it. So it is super windy on that last whole part. So your bread and butter is going to be the people that come into the original course. Whats the next thing after that? It was like it sounded like this. I didnt really catch that.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, I have not.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"We turn yeah, no, I get you. What type of dealer fee would you guys take for something like that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Oh, yeah, this is awesome. But how much traffic is coming from the ad spend?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Probably about four grand.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, exactly. Okay. Yeah. You know what? Im missing my contractor stuff here. And that makes sense.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So we have and we didnt know where yes. That was actually a discussion my wife and I had last night. Obviously, Im going to be doing pre launch calls starting in probably a week, where were going to have basically another lead magnet up, but then two of the paid course ads up, and then were going to raise the price. Now we started talking about it and my wife actually threw out ten K and five K as numbers, and I just dont know. We want to get money. Ive been unemployed other than doing this now for a year. So we need to have money start coming in. And I dont want to say we want a quick launch, but we want to get some immediate traction. But I also understand that theres obviously, if you put a premium price tag on it, a lot of times that sells a little bit easier because its not every day two grand, its going to separate you just by price.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, we moved to Naples right when I got laid off, and it was just way too far away from family. So we came back, got this launched starting last summer, but we hate Pennsylvania weather in the winter. We want to go back to Naples.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"One? Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay, right.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Correct. Yeah. No, I can talk to talk. And I started a ton of businesses for other people, but for me, this is kind of a new space where I have not factored any of it out yet.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Yeah, I agree.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I would love to be there in six months. If were doing $500 a month, thats great. Realistically, this is going to open us up. We did some quick math, and there is 30,000 home care agencies in the United States. So even at if we can saturate that market and get even 20% of those to purchase this program, were going to be light years ahead. If we did 20%, even at one, were looking at, like, $3 million just on that initial cost, and thats not accounting. Anybody else whos opening? So I want to have that first year. And whats nice is this is going to really open me up to be able to use what my gifts and talents are, because Im going to hit the phones. I dont have to just target market them on Facebook or social media. That being said, thats where we want to make it automated. What I really want in the end is next december. I dont want to be in Pennsylvania. I want to be back in Naples. So we want to work from the beach and have some automations and take some calls if we need to, but thats our goal.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Which is amazing.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"So its a trick question. The right answer is its infinite. Right? Because however many people they place, they get paid. Yes. So the surface number is if they have one person whos working with four clients. Okay. So it depends on their staffing. For every person thats working with four clients, if you place two of those clients, your regular monthly income is going to increase with no additional spend or work on your part. Between 3000 $5,000 a month, thats just with two placements. So if you have a home care agency whos working with 30 clients, if you can place five of those clients a month, youre looking at each placement between 1000 $503,000. So youre easily paying for the course in one placement.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I absolutely can. Okay.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Absolutely. Okay, put it this way. So my wifes senior living in care referral business, when she launched her first six months, she did it basically out of bed sick for six months, hardly tried. She did 20 grand without even working at him.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, Im walking from the store. Back to the car. I dont know why. Out of the store. Is it windy?","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. Im so sorry that its like this. I just didnt want to miss the call.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yeah. Back fresh out of high school, I worked when MCI was cold calling, so it is definitely in my alley. I havent really toyed with the thought much right now for this, but thats not an idea Im necessarily opposed to either.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Next to nothing. I think we had 20 grand. Again, I was unemployed for the year weve been living off of. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"The other or what combination? Yeah. Without selling assets. Im not really interested in selling asset.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So Patriarchplacement.org is my wifes senior living in Carol Perma business. Got it. We own that, and that is her personal site for her. We still get placements without even we havent been marketing that for over a year at this point, but we still get calls weekly for it. So thats what shes teaching other people to do.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Lets do 737, 30.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I get you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right? Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Eastern.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Can we do later than that? So our birthday is probably going to.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Have a good night. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, got it. All right.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"No, not at all.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"So if you piffed it and we get paid in full got you. Yeah. Obviously you guys dont do that for free, right?","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Yeah. Cool. So whats your ultimate goal with this in terms of revenue? Where do you want your revenue? Say, like, six months from now and then in a year from now, do you have a revenue goal that you have in mind?","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"The board right now, if this month reproduces, its going to be about $3,500. But my estimate with what Im seeing traffic wise, if the ticks stayed the same and increase, we should be at about ten grand next month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Were excited for you guys. Its hilarious because people who arent in the space, we try to explain what were doing to family, and they have no clue. They dont get it. And theyre like, So youre training people online? Well, whos going to buy that? They dont get it. Because theyre older, and theyre definitely not our demographic. So were very excited about it, and the feedback were getting from people who are in the space has been very good. Yeah, absolutely. I look forward to it. Did you send me a calendar invite for tomorrow evening?","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Pennsylvania.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah. What Id like to be is by the end of 2023, I want to have both of these between the two courses. I want to be at $200 a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes. Got it.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"How many of the eight came from the paid ad?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"And you said 500, but I was like, okay, because weve taken things to a million dollars a month, six out of the last seven. So I thought thats what you meant.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Through getting paid, its like lead in for operators, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Absolutely. Because theres no such thing as financially disqualified as the value wasnt shown. So the people that we have, were going to have a payment plan again, whether its ten K for the base or 20K, well have a payment plan thats available for them, too. Whats nice is whether or not you have that money in your pocket today and thats all automated set up. I dont even have to manage that, right?","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Ive toyed with it in my space when I was in Naples, I worked a ton with solar guys. So I have a couple of different guys who have launched call centers like that, that I personally know. I actually have their entire operations manual that they charge 30 grand for just for their operations manual.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So tomorrow morning I have my granddaughters birthday.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Awesome. Im pumped straight up, see what we could do.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, Im down with that. I mean, its something that I think would be a good investment of time, because, again, I know that Im driving traffic, but right now, with the analytic space Im in and the amount of numbers that I can see, I can only know that I have the traffic. I dont necessarily know if its the right person. Wrong time, wrong time, wrong person. I dont know any of that. So theres a lot that I need to my wife is a very instant gratification person. So Ive been in the marketing and launching new business space for a long, long time. And shes saying, well, why arent these people buying? And Im sitting here saying, we dont have enough data to make these knee jerk decisions or knowledge we have to keep just plugging away.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Not a ton. If I have this regular automated at 20 grand a month, thats more than enough. Thats not where I want to be. I want to be much higher than that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Not like setting up a care home.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I did not. I got a text message last night from somebody at Air AI offering for one to one.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Youre talking about monthly, right?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}}]