[{"pageContent":"Want to all three of those. My ultimate goal is financial freedom so I can travel and everythings basically integrated. So that way, all I have to do is go on my laptop and do whatever I have to do, enjoy time with my family and kids, you know what Im saying? Thats my ultimate goal. If its through cannabis, its through selling toilet paper, hand sanitizer. I dont give shit at this point, you know what I mean? Im just trying to create generational wealth for my family, you know what I mean? And then the people who are with me, around me now, who see the vision that I have, you know what I mean?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So Im basically in that mode to where its like, okay, I got to figure out what Im going to do. Hopefully Im staying in cannabis. If not, then, you know what I mean? I got to pivot, you know what I mean? Regardless. Yeah, because I want something thats going to bring money in monthly, like four something. Its garbage right now. Yeah, Im behind. Its been a rough year.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Right now, I have a cannabis brand thats a startup. I took augmented reality and added it to the packaging to make a unique experience for the customer and for post marketing sales. So thats more or less our niche, is post market sales. We use cannabis just because its a new industry and its something that hasnt really cannabis in its infancy right now. You know what I mean? So basically what we did is Im trying to integrate multiple different things into being able to utilize the packaging once it gets into the consumers hands, to be able to sell merchandise, services and other things like that, because were also creating a streaming service through NFT.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right now, were selling cannabis, and were setting up the process to offer the augmented reality as a service to other brands.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"My kids, show my kids and my wife yeah, exactly. And not having to worry about, you know what I mean? Like, that kind of crap.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Right now, when I say Im starting from scratch, even my credit, you know what I mean? Everything got messed up over the last couple. I got in a separation, and so when I got in the separation, it put me in depression, and now Im finally out of depression. So Im like, starting to move again, you know what I mean?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I appreciate your time, man.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No, Im really blunt, bro, if you havent noticed.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah. To me, its fun. Like, that aspect of its fun, you know what I mean? Like getting instagram, the content, you know what I mean? Stuff like that youre going to excel with.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Good. Jake from State Farm. No, Im playing. You knew that was coming. You dont hear that 100 times a day.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im do it now, you know what I mean? Thats something that I think thats cool because it helps people out. And that was something that I was trying to do through the cannabis, was create jobs and create stuff like that. Because thats something thats my question is.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And maybe you want to think about that, bro.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"But right now, Im not cash heavy. I have, like, maybe a couple of $100, you know what I mean? Thats what it is.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"So thats what Im saying. Im just looking right now to kind of see what I would need to make, you know what I mean? Im trying to figure out a strategy to be able to transition into other type of business, you know what I mean?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Do you guys do anything with cannabis at all?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"What sucks is I dont even have any of that right now. A lot of that stuff got messed up last year when I went into depression.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right now, maybe to be a little.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I think it was like 60 or something like that. Im not sure because I had somebody do my taxes, and they messed my taxes up and tried to do identities, so Im not even sure what yeah, I have to go to the IRS and get a bunch of stuff done with that.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Exactly. Thats where Im at. Thats where Im at. You dont even have to go anymore. Thats where Im at. My wifes big into ecommerce. Shes got a bunch of ecommerce sites. So thats why I was looking. Also, if I have the information, I can also give it to her to be able to scale her businesses, you know what I mean?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im giving you.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Hey, hows it going?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, exactly. To be honest, Im not even sure how much I made last year. I think its like 65 or 70. I was making a lot more than that prior when our brand was doing better and I was doing other things. I was making, like, close to 100 to 151.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ive done marketing, a lot of marketing throughout the past, marketing and branding is what I did. I was involved with creating a cannabis brand with artists, with a rap artist, and it ended up taking off in Vegas, and it ended up selling for like, two point something million, from what I heard. I dont know how accurate that was, but thats what he told me. He was like, yeah, you know that we sold the thing for $2 million. And Ive done that with even my brand that I have now. It got acquisition last in July, so I have like, stock and stuff like that in the company. But were in what you call a process right now, audit and all that other stuff. And theyre talking about, I think they said a year to five. I dont know how long thats going to even take to be able to start generating income.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Do you guys use that kind of software for cannabis and scaling cannabis businesses?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right now, Im basically starting over and trying to figure out a lot of stuff. Right now, my business, we had to shut it down because of COVID because things got slow. So right now, Im just kind of, like, revamping, looking at different opportunities, looking at different stuff. To be able to figure out what can provide that, I would say 20 minimum, you know what I mean? To be comfortable, to be able to close to 250,000 a year. I would love to make half a million a year. Thats, like, my ultimate goal, but you know what I mean? But I could live comfortably with my kids, take them to school, do the stuff I need to do with them, travel, all that kind of stuff, you know what I mean? With that amount of money, thats like a three year go perspective. I havent really looked at stuff since inflation and everything thats going on, you know what I mean? Actually, really, actually stop and think about it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"See, thats what Im saying. How the hell do that? Lets go, bro. You know what I mean? I think thats what I saw on Instagram, and I was like, dude, even.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its not. Its fucked.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Or just any kind of thing to be able to create that kind of opportunity.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Close to, like, 20 a month from how Ive lived in the past to now. Like, 20 is a cool number, you know what I mean? Because Im in Southern California, so stuffs really expensive, you know what I mean? Like, making ten grand a month. You cant even really buy a house out here. Its hard to take when my sons in private school, you know what I mean? Theres a lot of bills, you know what I mean? So, like, minimum, like, 15 to skys the limit, you know what I mean? Thats how I look at it?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"To say the least.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Dude, right now Im so negative that its hard to even put a dollar into a business because Im literally in survival mode, you know what Im saying? So thats the situation Im in right now. You know what I mean? When I say Im starting fresh? Thats where Im kind of at right now. Starting fresh.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay, yeah, that makes sense.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right now? This last year, its garbage. This last year, its been not like I cant not even close to that. This last year, Im talking about what.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Right. Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, cool. Whats the usual cost for what youre.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"All right. Thank you. Thank you. You too. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]