[{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"The same thing about it. These were from existing customers. So it kind of shows you they dont understand what you do for them and the benefit of the service that I provide right now, I get a lot of referrals from existing customers, and I get people that tell me, I hope you never leave the industry, because Id be totally lost without you. Very nice to hear. I appreciate that. But by the same token, if its not financially successful for me, why do I want to stay in it? Why shouldnt I try something different? Why shouldnt I go into another realm? I mean, its all about having multiple sources of income at this point in time.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I used to do annuity spend down seminars back early. Two thousand s. And the concept at the time was to do a meal and bring everybody and do a presentation during the meal and then work with those individuals who were interested, having heard something that they liked. But very soon it became a very common feature. Everybody and their brother was doing that. And then it got to the point where people were going around for the free steak dinners and never really actually interested in a product or purchasing a service or anything of that nature. So something online would prevent that. Theoretically, only those individuals who would be interested would be participating, and there isnt the cost of a meal associated with it. So thats always positive and there was always a very heavy mail out campaign in order to bring people to the so thats the old school way of doing the annuity seminar presentations. Ive embraced and been utilizing Zoom this past open enrollment period. I have been using a calendar service to book appointments for my existing customers to talk with me and then bringing them into a Zoom presentation and conducting the sale in that respect. So Im catching up okay myself, but realizing theres capabilities, theres other aspects. Where can I take this to? So thats the research that Im doing right now and trying to see whats going to be the best potential outcome vehicle for me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, especially because a lot of my customers passed away during COVID Jesus. Dealing with seniors and individuals in their sixty s, seventy s and eighty s. They were one of the ones that were primarily affected by that. So we lost a lot of income as a result of what transpired. We had one insurance company that closed its doors and gave us like a months notification. And of course, it was in the middle of COVID so no one was conducting business, people were working from home. We lost an entire block of business that was generating about $25,000 a year for us when they closed the doors and just no capacity to respond. The industry had just closed down. So its been an interesting time trying to get some of my agents reactivated. Now, some people it took longer to come out of underneath the rocks than others.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Help by customers, I understand well, but.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, I apologize. I was thinking while you were talking, so trying to digest it, I suppose. Mine is a regulated industry, so individuals have to go through a pre licensing course, and they have to take a test in order to be able to operate as an insurance agent. So thats a parameter that we would have to work around or I would have to work around in designing some sort of course like that. But one of the things that kind of comes to mind is going to consumers instead of going to potential salespeople.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes. 700.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Conversation.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"30 plus years.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"It poses challenges that are always changing, so you have to react and stay on top of your toes. Got to be ahead of the competition.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I apologize. Hold on a second. It was air. AI.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Were trying to recover from COVID that really hit us hard. And the insurance industry isnt necessarily the most forward looking industry, so the adaptation of social media, marketing, and things of that nature have become more important now post COVID than pre COVID. So doing some research and trying to educate myself in regards to what all is available, resources that are available, what can be done. So thats kind of where Im at right now. Okay.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So 10:00. I dont know what zone youre in.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Oh, good. How about yourself?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"In on Friday and then I can study it over the weekend and then wed be ready on Monday, how does.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im out of the office on customer appointments on Friday. Monday really would be the best day. So if you want to have everything geared for that, monday would be a better day for me.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, I mean, I probably got about eight or ten responses, but it was completely on a different product line that I couldnt even do anything or assist them with. Some of them were calling, asking for a specific insurance company, and Im like, Im not an insurance company. Im insurance agency. Why are you calling looking for allstate? Im not an allstate agent. It was very strange. I didnt understand still dont understand the disconnect there. But my industry is rife with before the Internet, there was telemarketing and leads and things of that nature, and one of the things that certain competitors do to poach salespeople away from an existing sales organization is to promise them leads and to make it sound so great. And the line that I used to use is, you know why the grass is greener on the other side? Because theres more bullshit over there. Thats what it would turn out to. People would get an impression, oh, these leads are so great. Theyre going to sell themselves. The people are going to write the business. Im not going to have to do anything. Remember, salespeople are very lazy, and then when they get over, they find out, well, theyre just reselling the same list to 50 different agents because they know some of them wont call. But when you buy a list and you start calling them and then youre the 25th person to call that individual, and they hang up and cuss you out on the phone beforehand, you get a little upset with the organization that set the appointments or set the leads. Appointments were rather interesting too, because there are organizations that they considered a good lead or an appointment set, and then youd follow up and they go, I told that telemarketer I didnt want to have an appointment. Well, he had it listed here that you wanted to speak to an agent. And I had to be careful because I was buying leads for my agents and appointments for my agents as well. So that can have a negative impact on myself if Im giving them appointments and opportunities and then they turn out not to be the case. Its been an interesting 30 years, my friend.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Appreciate it.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"You did great stuff. Thank you very much for taking the time.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yellow.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"140. Somewhere around there.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"I mean, again, I know that its big to think about.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That sounds really good.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I do need to tell you that I am in the process of doing some certification, which means Im doing online modules and testing currently for another product line. Its a requirement before I can even sell the product. So I need to complete that first. But I would be jumping on your information right after I complete that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Excellent. Now, you said you got it.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Well, now youve piqued my interest, so Im really interested to see whats in there.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Not really, but thats an interesting concept. I really havent thought about that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. Sorry, Im downloading on you guys.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Just kind of thinking this through.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Oh, Im always at work. If a customer is calling, I respond to them because I have to give that level of service at this point in time. Its been rather interesting. Customers can be rather fickle, at least in my industry. I havent shared 100%. I also had an accident during COVID so Ive been dealing with some medical issues as well. But in just trying to take care of my existing customers during the last three years, individuals telling me, well, for example, one gentleman tells me, dont worry, dont rush. Im not in a hurry. So I get back to him a week later, and he tells me, I already made a decision. I already bought something. But you told me that you didnt. And he knew that I was in a wheelchair during that time period because he had been a previous customer of mine. What Im seeing in my industry right now in certain segments of it is that the customers dont appreciate the experience of a longtime agent or an individual who has my background. Ill give you another example. I had one customer call me and said, hey, Robert, do you mind? Weve been client relationship for many years. My neighbors kids gotten in the insurance industry. Do you mind if I take my business over to him? Can he handle service issues? Can he strategize with you? Youre just doing it to help him out. I understand that, but what are you going to suffer because now youre with someone who doesnt have the expertise or knowledge to take care of your account. This is something recently that Ive been noticing thats been going on. So Ive got that in the back of my mind as well that going forward, I need to be in a position where I can actually monetize the knowledge that I have so that Im not giving out free knowledge to individuals. And then they act upon it, but they dont do it through myself.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Probably $2,000.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So there are certain types of advertising that I would be skeptical about utilizing. I even understand that LinkedIn now is in its waning days, and theres other formats, but Im trying to find out what those are at this point in time. Lucky for you, funnel building. But I still have questions about that. Anyway, like I said, Ive been doing research here. I didnt really answer your question. I would start out small because I want to make sure that it is generating responses, and then after that, I would scale up.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im doing the research because I know thats the route that the industry is going or I need to go in advance of the industry to be successful. So any knowledge that you guys can provide, that would be very helpful.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I run the brokerage.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So one would obviously have to somehow attract the individuals to want to sign up to participate in an online webinar or a one on one, depending upon the situation. Are those capabilities and services that you guys bring to the table?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Sorry, I bootstrapped it.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Well, obviously one would be more successful in regards to that. Im trying to piece this all together as were talking. So forgive me. I sound disappointed how I can actually make this work. And Im going to have to put some more thought and probably investigate some things and see what the industry is doing. If there is a hole and no one is doing this, then, yeah, Im known for thinking outside the box. Okay. This is an industry where you have to constantly it ebbs and flows, and so you have to constantly stay on top of things. And this potentially could be something unique. I have not seen anyone else doing something like that, but I needed to investigate it to see whether or not its a viable situation. It might be a possibility.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Divorced. Two grown children?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Two different jobs. While I was trying to get this one off the ground, I did it with no funding, no capital.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, thank you. I appreciate yes. Youve given me some new ideas that brand new that I hadnt really thought about. Ive watched other people with their coaching sessions and whatnot that they have online, but never thought to put something together like that myself.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sounds good. Thank you much.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"So it would depend upon the advertising. I have tried to use Google advertising. Ive tried to use Facebook advertising, and I became pretty adept at setting them up. I use Geofencing, and despite the fact that I indicated that I did not do any automobile insurance or homeowners, that was the only calls that I got. So I got calls for a completely different product line, even though it was not indicated anywhere in any of my literature, its not on my Facebook page website, and I specifically indicated it wasnt, that we dont do that on the Google ad. So that was rather interesting. I was wondering, why are these people even responding? Do they even know what theyre responding to? So in pay per click, we know of scenarios where a competitor will get onto someones ad and drive up their cost so that theres little nasty tricks that some competitors have done in the past in this industry.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im motivated.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And Im like, well, this is incredible. Thank you. Thats very rewarding. And if I didnt have to have money to live on, that would be enough. But no one has to have funds. One has to pay bills. Im not sure if I answered your question.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Almost definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"You too. Take care. Bye.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"So I enjoy what Im doing, and I really like the fact that every day is completely different and another opportunity presents itself. So that is kind of what motivates me. I know its a scaling process. Wed love to say $10,000 a month starting tomorrow, but realistically, I know its going to take a while to scale up. How long, I have no idea. I would be relying on you guys in regards to that capabilities. Potentially $100,000 a month or more. But it depends upon the volume of leads and interested people that I can close in a sales process.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, certainly the satisfaction of having helped someone, whether its to protect their finances, to ensure the future of their grandchildren or children, to make sure that theyre in a good policy thats going to protect their health or their life, something of that nature. I do get a lot, and there are certain industry types that the customers are more appreciative than others. So I can tell you, in the corporate world, when I was active in It, I never had an employee of XYZ Insurance Company come. Up to me and go, thank you very much for this policy. But Ive had seniors be extremely appreciative, and Ive had them go into their backyard and give me a handful of vegetables. Theyve totally floored me. They were so appreciative. They went into their garden and they picked a basket full of vegetables and gave them to me. Fresh vegetables.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Eastern.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Sure. Im in the insurance and retirement planning world.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So I know what you have to go through. Its similar to what I do when I talk to customers. I appreciate your time and your interest that youre taking even to learn about my situation. So dont mind answering questions for you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Sounds great. Im all about learning.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]