[{"pageContent":"Hang on 1 second, because I want to make sure that Im remembering everything. Okay. I know what youre talking about now.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"A little bit over two years now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"We dont have a monthly average right now because we put everything on hold while we built out the training platform and all of our programs, those are all going to be finished by the end of April. So were turning on trainings as of next month. And now its just a matter of being able to fill those classes.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"What does that look like? People pay to attend the training themselves, or an agency, like a law enforcement agency or healthcare provider would pay for the training, so right. Its fee for service.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Good question. The goals that we have for 2023 are to generate 250,000 in revenue and to be able to train at least 1000 people.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Personal or personal?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"We teach people how to call an angry person in 90 seconds or less.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I would agree.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Do you have a bulb?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Two things. One is having the product to be able to scale, to sell. We can serve one school district at a time, but unless its something like Los Angeles or San Diego or Chicago, new York school District, the dollar numbers are not significant enough. So we need to be able to do it at scale. Thats number one. Thats why were building all of that out. We have a hybrid delivery method, which is some of it will be live, some will be live and online, and some will be evergreen online, which is going to be thats what were rolling out first is the evergreen online because that can just generate sales and everythings automated for that. So the first is having the product to sell on a scalable basis. The second then is weve got lots of leads. Its just a matter of reaching back out to them in an effective manner and converting them.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"1000.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Correct. We have a core course. So theres a core course that everybody would get. And then if youre a firefighter, you would get the firefighter course. If youre a cop, you get the cop course. If youre a flight attendant, you get the flight attendant course. Because sure, firefighter has different tools available to them and limitations than a flight attendant does at 37,000ft.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im looking at. What can I project? That well be able to bring in either through one of those three revenue streams and still be able to cover our payroll and all of our other expenses and still be able to do ad? Spend to reach out to people to generate. As an example, the Evergreen online, which is what I anticipate is going to any ad spend that we do is probably where thats going to benefit. So Im looking at the ROI for that segment of what we can do. So once thats built out, we turn on the ads, then everything gets driven to that. Any overflow from that in the sense of, well, we want to train our entire school district, that becomes a personal conversation about how were going to deliver that training versus somebody logging into Kajabi and doing an online course on their own time.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im sorry, which company?","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Im not taking a payroll personally. Weve got people that work for us, and other than that, its a volunteer organization. So I have my retirement pension and everything else is based off of those three revenue streams.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I literally have a support team calling me that Ive been waiting for four days.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"As being able to do ad spend? Im not worried about that. Were going to be able to do ad spend when were ready to turn that on. And we already have ads that are being created right now. So Im not sure if you guys do ad creation or Im not even sure exactly what you do. Yeah, were obsessed with helping business owners.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, but I feel totally comfortable with my personal credit.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Whats that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"All right, brother.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So I run a nonprofit organization.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, it varies based on if were doing a school as an example, then we have one set of pricing. If we are doing a if were doing a law enforcement agency, it might be a different set of pricing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, awesome.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"So we do do some high ticket stuff. If youre going to be yourself rolling through the course, generally its about $300 to come through the course. $297?","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}},{"pageContent":"Its low right now because we are finishing building out the courses and we are getting ready to do a rollout. So last year our revenue was 50 grand, almost 60 grand. And then right now, were behind on where we expected to be since were basically middle of April. So I dont know if were going to hit our revenue goal this year.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So let me answer your question in a different way. Im looking at ad spend of roughly 2000 a month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You hang on 1 second for me?","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, we have the board, but.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Got you. Thank you. So tell me about Air AI. What do you guys do?","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Typically targeted towards school teachers and first responders.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Background in law enforcement and just the belief that there could be more done in the area, that there had to be better answers.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, be able to train as many people in our target markets as possible.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im not your standard entrepreneur that is reaching into their own credit card or wallet to be able to fund what theyre going to grow as a business. Im not in that space.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes. So what were doing is in essence, what were doing is weve got set pricing as an example for a school district. If we train their administrators, they come to San Diego and they do a retreat, then thats priced between 1000, $502,000 a person, depending on their schools budget. If theyre freaking out and theyre like, oh, no, we cant afford that, then well work with them on the training aspect, or Im sorry, on the pricing aspect for the training. But generally that would be example of a high ticket offer. We have another high ticket offer where we teach people how to teach, and theres a leadership component involved in that and communication skills component involved in that, and that is $2,500.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats what I projected as our budget. Because what I joyfully struggle with is its not about my wallet. Its about what the nonprofit is going to be able to support. And theres a limit to what I put into it on a personal level. And the goal of getting grants or donations is ultimately in fees for service. Those are the three revenue streams for the nonprofit. That ultimately is what matters.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]