[{"pageContent":"Yeah, I havent had time to probably wont have time until tomorrow or something to check it out. But yeah, I saw it online and thought Id just sign up for a little info and check it out when I get a shot.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So you have an evergreen kind of thing?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So kind of rebuilding. Basically my thing is rebuilding and renewing whether its a person business or even an entire town. So thats kind of my little thing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Ill put that in the calendar, give you a call then. For now, safe drive. Sounds like you just got in the car. And safe travels as well to the key, and I hope that trip gives.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sorry, Im running to a lunch thing and I got all kinds of stuff happening here.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Let me jump to my calendar. Im usually not this getter scatter, but.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Sorry, Im in the middle of about three things here.","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}},{"pageContent":"And Ive done a lot of stuff ministry wise too, with guys. Like Im being asked to speak at a mens group for the second time where theres over 80 to 100 guys. And all that stuff is of course, free and just trying to encourage guys.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, so thats probably the best. So I toyed around with coaching. I dont have anything launched. I dont even know how legit coaching is as a profession. Theres tons of people flooding the market where, come and be a coach, youll make, whatever, $100,000 a month, whatever. Theres just all this hype about it. So how real is it?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Hey Paul. Yes.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Awesome.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Faith, masculinity, things of that nature is.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right, yeah. Now when you guys are saying that and Im just going to kind of keep moving here and get ready for my lunch thing but when youre saying cash collected, are you guys building programs and selling programs?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I mean, this isnt like one on one coaching or is it?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Ive got a lot of personal convictions.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Lot of passion in.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Would nine work for you?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Like Monday morning.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"And then the other thing is Im a real estate broker in Florida and I wondered is any of the stuff that you guys do, does it cross over from that? Is there any opportunity to use right.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im in my mid fifty s and.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay, Im going to answer. Im going to be on these calls. I dont ditch people. If I say Im going to be on the call, Im going to be there. But thats right, Im not going to be around. So yes, Monday looks good for me.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thats, again, something I have a lot of personal convictions in and just a.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Sure. So group coaching. How about I thought about building out because Ive run companies, whatever.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Awesome. Talk to you Monday. I appreciate it. Thanks, sir.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"This is Paul.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Of build out maybe what that would.","metadata":{"fillerID":29,"fillerText":"Mhmm","category":"D"}},{"pageContent":"Their power and having that be grounded in their faith and things of that nature.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ive done a whole lot of things run companies and been mayor of a town and did a lot of corporate turnarounds and turned around the entire town when I was mayor. Massive kind of change in stuff like that. And then Ive also done thats.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Would you want to call it nine?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"And then Ill also send you the.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Theres another alarm.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Oh, good.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Me jump over here. Let me look at my calendar.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, you definitely preach to the choir. Like I said, when it comes to.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And actually Im going to take a little time. The reason Im going to the Keys. Weve been just running hard and fast and all these different things, and I just need and my kids need that time just to kind of reflect. And Im going to just want to just map out for real, like, okay, am I all in in real estate or all in in coaching? And I got to pick a path and I got to run down it because Ive actually been trying to go down two paths at once and we all know that doesnt work right anyway, right? You can always have a side hustle. But I want to have a big vision because again Ive structured huge projects and huge this and huge that. And then our thing was just kind of got, we kind of knew it was our season to move from Colorado. Ive been there for a long time, built all kinds of businesses, did all kinds of things and even was the mayor of the town and did all that fun stuff and very successful. That was all great. But then when I was done with all that it felt like, okay, weve kind of been there and done that in every area and always kind of felt that call to come to Florida and weve been down here. Thats where Im at in a way. But when I jump I want to kind of map out a bigger picture because I dont want something thats not scalable. I dont want it that. Its 100% dependent on me to work with each individual client. But I know theres a ton of coaches out there looking for clients, right? So if I could build a focused coaching company thats focused on renewal, restoration, Im talking about kind of spiritually, right, helping guys get their action again, rebuild their life, get stuff going. And I could bring in coaches, I already have a source for that. Then to me thats a scalable business and I might only start with three or four coaches that I have access to. And its a private contractor thing and maybe its a per hour thing, I could set it up. But the idea is that that way I could scale it from two coaches to four coaches to twelve coaches to 30 coaches and then I would run that company thats what Im looking, that would light my fire. And were serving a greater purpose, like the mission of the company. And what were doing is were affecting a lot of people and helping a lot of people out. Because in the crazy world were in right now, theres no sure shortage of brokenness or confusion or people needing to reset.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So tomorrow were talking about shooting to the we live in Florida, shooting to the Keys. Weve never even been down there. Weve only been here two years. But we talked about going to the Keys tomorrow and Thursday and Friday and then Saturday maybe we set up a formal kind of thing.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"So Ill text it over to you.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"How we could actually set that up.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes, sir. Lets do that.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Specifically helping men, when it comes to.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, when you say Monday morning, were.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Is it? Hi.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I want to talk while I have the moment.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"So Im super excited to actually walk through kind of your vision there and.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"A time for maybe tomorrow, kind of.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So we just put it in there and then were all set up.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So, yeah, lets do this.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Because I just think its super important and something I even see myself doing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"What time works for you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Really kind of finding their base and.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]