[{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im on the videos with Learn Academy and Onyx and Gall and all those guys all the time. I know theyre spending 100 grand month. I know the Sam Cart guys are spending at least 100 grand on Facebook. I dont manage numbers like that. I havent Im not afraid of it, but I just havent done it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And then Im going to have to run this. I typically wouldnt take a call beyond this long but yeah, I just got to get going here.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, I mean, I teach digital marketing classes for Rice University for a contract at Rice University. And Im also going to start a gig in May and June with a company called NIIT, which specifically targets business professionals. Im teaching everything from the history of the Internet going back to the ARPANET and the defense contractors using copper lines. Copper lines to talk to NASA. Im teaching people about that. And I have to go through all the Facebook things and I have to talk about the lookalike audiences and how much they can expect to get return, what the return on ad spend is going to be, blah, blah, blah, blah. So I dont know what the current actual I cant give you a specific number in the past of what I spent on any one of those mediums because I havent spent any money. But Im very familiar and I understand how it all works and how its all integrated.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Can we look at something like Thursday, Friday around 11:00 A.m., 12:00 P.m., something like that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, Im with you.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Oh, man, Im loving it. Thatd be fantastic.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Saw it, it made sense. Shes like, Hell yeah, thats what you need to be doing. Thats great.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, but I havent been successful in getting a clientele. I mean, Im more of what I call a clearing coach. So trying to get executives and business owners who have high stress positions, giving them a weekly, two or three times a week phone call to let them vent their frustrations and basically let them get whatevers on their mind so they can clear it up and move on and be productive. Thats a short version of it, yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, man, I want to see $150,000 drafts every month coming into my bank account like they used to. Thats what I want to Ive seen it.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I have nothing. Im not even going to pretend that I mean, I spend my time in the gym looking at stuff online. Thats how you got me. Okay? Because Im online looking at stuff to be productive. I dont sit around and listen to watch the gym monitors and crap. Im online looking for opportunities. We found something. Maybe she might be open, but its one of the things where shes going to have to see it, know it, and understand it or dead in the water.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"600 and something.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Honestly, my first question is which industry are we talking about and whats the price?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Shes a professor in psychology at the University of Houston, and shes a person, and all she does is grind the hell out of numbers to prove people wrong all day. So thats what Ive got working on my end.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont cash invest in anything.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, that helps. When I showed her the program at UT to go back and get the certification, she was all in immediately.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I get it. I just want to be completely transparent with you because I dont want to waste if youre still willing to continue, then great. And if not, I get it. Ive had people that already hung up the phone with me by now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Hey, man, Im good, man. Im in the car right now. I cant talk.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Man, I cant speak for her. Let me see.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"The house holds probably around 150 grand right now.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Honestly, I dont even have a client, man. I havent even really got it together. But thats the goal of one of the things I want to do. But like I said, my focus right now is on the artificial intelligence and the nuts and bolts and learning it and getting a certification in it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Typically, shes on web time all day. Let me see here. Thatd be the 18th.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, yeah, and I suspect its going to cost me a hell of a lot of money to do that with you guys. Im being honest with you. Ive invested a lot of money in grant cardone programs in the past, and honestly, without a business, it didnt do shit for me. So Im in situations where its like you can spell me all day long. But honestly, my personal experience thus far is that not having a product is a major hindrance. Even if I want to do, Im the next affiliate marketer. I was doing spam before the can spam act. I know how much money is available even in an affiliate standpoint. But the problem is you got to have traffic. Without traffic, youre dead in the water. I dont care what program it is. So those are some of the things I have going on in my mind. Im always open to looking, but Im not going to drop 20 grand, 15 grand into another program if I dont have a product.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Lets talk about maybe can we do Tuesday? Whats the latest time you have on Tuesday?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Well, yeah, I dont want to have the call unless Ive done that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, Ive had money coming in like that on a month. That had fucking sucks. I had to share it with some of the partners. But yeah, man, when I was doing data list, I was a list broker back before things got really weird with all the new platforms, we were farming out over a million 500 records a day to emailers, and, man, they were just pumping money to us. It was like a cash register. And thats before Facebook and Instagram and TikTok even really had any traction. So now a million 500 records is like 30 minutes worth of data, whereas it used to be 24 hours. So I know whats out there. I know whats available. Im just looking for ways to tap back into it where Im not going to. I wasted a lot of money getting there, but in the end, I made the money back.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Honestly, Im currently at the University of Texas School of Business doing artificial intelligence certification. So thats what when I saw AI and I was like, okay, let me see what else other people are doing. Honestly, I dont even have a business right now. Im a contract part time photographer and I do personal coaching, but right now I dont really have any business thats up and running.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I mean, heres the deal. Ive been in sales on and off all my life, so its not like I cant close high ticket. Why do you think Im grant cardone programs, man? I can go log in right now and watch the guy for 3 hours straight, but I would prefer to focus on the tech side and the side rather than be the guy thats got to do the calling.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Oh, dude, Im at poverty level right now. I mean, thank God my wife makes a buttload of money. Not a buttload, but I mean, shes carrying us right now. I havent shot a photo in two weeks at this point. Right. Yeah. Im basically unemployed.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, stuff like that makes sense.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Honestly, I prefer not to even have to do that, to be honest with you. I really dont like having to get on the phone and close people. But if I did, Id want ten a day at least.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Plan at all, man.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"They would be a partner. They would be someone who well, I dont know. Id have to think about that. Id want somebody in the past, Ive had people that I worked really well with. They did the things I didnt necessarily want to. They were really good, actually. I used to be the guy that come on after all the other stuff was done, and I would close them and things like that, where we had to actually get in there and ink it. I had guys that were partners that would go out, they talk to people all day long, set appointments, talk to them, pre qualify them, find out what they got, and then Id schedule appointment, we get on a conference call and then I would close them. And I did all the tech stuff behind the scenes, and they were kind of like the guys that were out there talking to people and mingling. And I do all the trade shows and all that, but I did a lot of business development for tech companies. Everything but the prospecting. I want somebody that could prospect and be good with administrative tasks and be able to be detail oriented.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. And Ive never really partnered with anybody like that. Most of the people Ive worked with have been there was a synergy. We knew it and we ran with it. I say someone whos willing to talk to people. Not necessarily any kind of high pressure thing, but just, hey, man, reach you. I call it Discovery. Someone whos ready to do the discovery conversations to find out whats up and then to be able to organize that, book it, keep it online, follow up, keep a calendar, understand whats going on. That would probably be the person Id be looking for.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, so personally, zero. And that would be I dont know what she would be willing to put out there. Shes pretty set up. My business ventures at this point, so honestly, I dont think I have any resources and I have no friends or family. Theyre going to loan me money, and Im being realistic. As far as her willingness to put money into something, I mean, if it was something where it was like, oh, my God, this is the next bitcoin, she still knows what bitcoin is. Shes a tech tard.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Oh, man, nothing really. I mean, $1,000 maybe.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"You know what? I dont think we can do it on the 18th, honestly.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, Im in.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, man, I mean, Im frustrated and at the same time Im still balls in the wall, ready to go, but my wife ready to kill me over credit card debt right now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I have not looked, man.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I need to make it quick. Im in the driveway and theyre waiting on me.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Id love to talk to somebody. I want to make sure before I got on the phone with an hour with one of your guys that I truly have absorbed all the information, able to look at it from something I want to do, and be able to ask really good, educated, directed, specific questions with them to really utilize the time. So, yeah, I think thats a fantastic idea.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Accurate.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Id probably say about 50%, if that okay.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Right now what Im focusing on is being able to put content available for YouTube and being able to create the textual content to go with the video content and specifically target different areas, whether its photography, content creation, artificial intelligence, able to be the guy who prompts for people or for the coaching. So Ive had an aversion to be on camera. Im not really feeling about being on camera right now. So thats the one that kept me back. Instagram, YouTube. But steps right now are going to put slide deck things together that are tailored to graph closing sales through YouTube and maybe Instagram and Facebook if I have to. And the other thing is, with the coaching, LinkedIn is like a major source right now and content creation on LinkedIn for professionals. If I could set myself apart, those are the directions I would go just right off the top of my head.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Talking to myself in the car right now and everybodys looking at me. So anyway, so the first thing youre.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Are you talking about the people that you actually get on the phone with after you book an appointment.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Until I talk to her, I cant guarantee anything with her or commit because her calendar is full. So Monday, Tuesday, maybe later in the week, I could get her nailed down and get something. But Monday, tuesday is really I dont think I can make that happen.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. Does she have $2,000 worth of credit available? Yeah, that helps.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Houston.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Nothings 100% with her. Its just not with yes, I can be there 100%. Having her on that call is like pulling teeth.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Youre talking about on a phone call. Close. You talk about like you got it.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Nice, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im sorry, man. You were cutting out there? Yeah, I was online and yeah, I think I was just looking to find out more about what you guys do.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yeah. Its probably between 625 and 650 right now.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"To go, brother, I dont have anything in place, man.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"My first thought was it may be the greatest thing since sliced bread. And exactly what it would be perfect right now. It could be perfect and Im still going to have to talk to my wife about it. Thats the first thing that comes to my mind 100%.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Something else that I forgot to mention is since Im interested in the AI intelligence and you know how everybodys talking about chat GPT and thats only one of the technologies thats out there. I mean, theres a lot of different OpenAI, obviously is a major player, but theres a lot of different technologies out there. But one of the things that I have started doing is writing content. So yeah, I guess you could say I want to build a content creation business also. I love that. Yeah, I know its all about the prompt engineering and knowing how to interface with the artificial intelligence. So Im looking to really get highly tuned in that area, which is part of the reason I meant Im going back to school. I just want to mention that content creation having been a web guy for Lead generation for the last 20 years, off and on, and building sales pages on email and Ive got a grip for what works online, so I dont know if thats something you guys could help me with too. Thats one of the things Im looking to do is build a content creation clientele, whether its with agencies, whether its freelance, whether its even a part time gig somewhere. So I just thought Id bring that up.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Im not looking for I dont know, Ive just never been the guy that I had to call. I didnt have to call myself at nine in the morning to see if Im at work.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I dont. I mean, I have a vision, but.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"We should look at extension of that, being able to put it in play. Yeah. She might be open and she might not. I mean, thats the thing.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Now, I just dont. I go in debt to Grant cardone and Im paying that off. Honestly, if thats a deal killer, I get it. But yeah, thats why I want to be completely upfront. Ive spent so much money on pine the Sky BS that Im not going to say Im tainted against it because Im still ready to kick something really hard.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"On Tuesday?","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Thank you, sir.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Or available capital, honestly, its pretty horrible and its taken some balls for me to even tell you that, to be frank with you.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yeah, its right in line with what Im having to do right now. Im having to slow down and look at everything, really understand it and absorb excellent.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, tuesday at seven. And if theres a problem with her, Im going to communicate with you first thing. Am I going to have your email or do I just text?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Whats the price of the product? Because I think all those are going to factor in, but Id say probably 40, 50% maybe.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, that sounds fantastic.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}}]