[{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, really my day to day is very easy because its already established. So pretty much I just show up to the office or at my house and Im on call. Obviously the difference would be physical contact in an office where if Im away from the office, Ill do the phone call with my cell phone. So I could always be reached from 08:00 in the morning to 06:00 P.m. And thats my cut off time. But after that I have managers. And pretty much Ive got three managers. And each manager takes a turn every day and they do their switch arounds and whatever. As long as I have somebody there thats able to answer the agents question from 06:00 to 10:00. And during the day as well, because I only deal with administrative and agent issue problems. I dont deal with the day to day operations. Thats the managers responsibility. I would like to have this obviously more with my managers, of course, because youre always going to need people to help people, right. But pretty much the marketing aspect where you could go out there and be able to get sellers that want to sell and buyers that want to buy in the whole state of California. Imagine I could have agents not just in Southern California, because I think we could do all of California through the Internet or through this new marketing system. I dont have to be no longer regionalized, you know, be in a local marketplace. I can be in the whole place. And my agents could be all over California, but we supply information as well as, I guess, problem solving with my managers day to day. And they would seem like they would have a big giant organization. But realistically were like in 1000 square foot building, but taking care of all of California. I dont know if thats making any sense.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"But its an old fashioned you advertise. Obviously in real estate the listing, which is the sign, is the one that attracts buyers because you put one of those colonial signs, golden post up in the front street and whoevers driving, they see it. So thats the old fashioned. We do doorknock and telemarketing, but thats again the old fashioned way.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Not this Wednesday, but next Wednesday would be definitely available. Next Wednesday?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Were licensed for the state of California. So if were licensed in the state of California, why is it that I could only do a 50 miles radius? Because obviously thats where I have my agent population. But we go in the Internet and do all of California, we could run it out of my office. As long as you have managers available to answer these people questions and they dont physically have to be there. Now, if we could do the training online or zoom or anything like that, as long as we have people available to answer these peoples questions and do everything else through the Internet, I think thats the wave of the future. At least thats what Im seeing. But I need you guys to help me figure this stuff out.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, of course.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Exactly. This organization, instead of being like city or region or county, it could be statewide. We only meet 50 individuals that have my same mindset, and they could buy the state. Right. We could just market it for them.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Please?","metadata":{"fillerID":33,"fillerText":"Yeah","category":"E"}},{"pageContent":"Exactly. I really have not seen a real estate company, mortgage company do things different. And Im amazed that they havent used this technology. So I guess I want to be the first one, that type of thing. Ive seen some individual agents and real estate companies using some of the ads, like in YouTube, Facebook, Twitter, you name it. But individual agents, but nobody as a whole as the owners, the management company, the management people of that company.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Personally, what I recorded is like 252. 80.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Well, obviously to start with, 10,000, 20,000 is a perfect number in our heyday, we were making but we had a real estate company ourselves, so we had a lot of people. We had over 150 people in my organization. But I pretty much gave it away to that guy that Im telling you about, Jovi Esguza. Hes the broker owner of Century One All Stars. And I know that I could do something more with all the new technology thats available right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Take care. Bye.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yeah. Weve grown maybe like 2030 different real estate companies. Weve had 500 to 1000 agents go through our training, and a lot of them have their own offices now. Matter of fact, the number one central 21 office in the country, which is Central and All Stars, he was one of my pupils, but Ive got a lot of people like that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. Where are you from?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, thats why Im making these phone calls or these meetings. So that way I could see whats out there, whats available, and how we can use the new technology, the new AIS that are out there. And which ones? Obviously are the best ones and how to produce something that will capture the real estate audience, whether it be buyers, sellers, agents and agents in real estate as well, agents in mortgage, obtaining loans and everything thats required. In between, youve got Escrow Title, youve got a lot of people. This is a huge industry, and I dont think nobody has really done anything big, if you will, because its all by, I guess, some sort of agreements that you have. Like, I have agreements with an insurance company, a construction company, a termite company, a title company, but theyre not mine. Those are just partnerships that you have.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, thats what we do in our training, so, yeah, it should be pretty much pretty easy to come up with things to do, especially with all this AI that we have available to come up with programs and ways of teaching, because thats what I do. I actually am the teacher, and my brother teaches on loans. I teach real estate and he teaches loans.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, yeah, of course. I dont know how many presentations I think I watch. Maybe like I would say easily, easily 20 presentations a day.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So far, it does.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. The potential of this is just like theres no telling where it could go, really.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Exactly. Definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats it. Thats it. But I want to jump to higher and bigger.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, this is where real estate is so interesting. Like I was saying, there are some agents out there that are doing exactly what Im telling you individually for themselves because they dont want to take on the extra liability and headaches that is dealing with a bunch of people and trying to grow a company. So they do it individually for themselves. They actually do what Im saying. They market themselves. They do create ads, theyre on Facebook, theyre on YouTube, theyre Twitter, Instagram, theyre all over the place. And I see these guys and obviously theyre pretty good. I mean, I have maybe five of those guys that are doing it themselves. But I want to do it as a company and get those leads to come into that certain number where we know were going to be taking care of them. Because this is the other issue. The issue is that you need to make sure that that phone call gets taken care of and that phone call gets sent to the right person. Now those agents, they could be getting a lot of phone calls, but they could only handle so much. They cant handle everything for themselves as an individual. And I want to capture 100% if I could. So I know that its a growing thing, but I want to get as many phone calls to come to my number and give it to the proper agent and get a cut out of every transaction.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I have a question, though. What is, like, the investment involved? What are we talking about?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Exactly. Very keen. Exactly. Thats what Im talking about.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Sounds good. Sounds good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And obviously you got it. You got it. Well, thank you very much. Appreciate your time.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Right, okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Im Pacific.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"780.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Of course. Thats why Im calling and trying to get you some information.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Because now whats going on is the only time they go is if they have a meeting. But you could also zoom it, though now theres so many ways that the only ones that are going to show up are obviously the broker, the managers, the people that take care of the transaction. But even transaction coordinators, they could do it from their comfort of their own house, their homes, so they really dont need to show up. Like in my own office, I sold my building and Im renting right now. I had a 20,000 square foot building and right now Im doing everything out of 1000 sqft.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right now, kind of like I mean, I just trying to get information. It would have to be within a week or two weeks max, because Im already set up for this whole month of April, and right now Im just entertaining all this information to see which program will fit our needs more. So thats why I asked you, what would something like this what Im saying to you, what would the investment be approximately?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Ill do the 02:00 P.m. Wednesday. On Wednesday.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Exactly. And I mean the whole spectrum, because theres so many things we want to grow into a real estate company. I know that everythings going to go. Nobody wants to be in an office anymore. They want to work out of their home or anywhere, any place. And marketing is everything, obviously, to try to find out where were going to get sellers that want to sell their properties and buyers that want to buy the properties and for us to be in the seller market and the buyer market and the people actually wanting to sell their properties, of course. And then were in the loan business, so were pretty much investment commercial all types of the real estate, even investment opportunities.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Almost every county, all the different cities I mentioned, theyre all different. Yes.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Ive ran ads on local magazines and paper and even radio. Thats what Ive done. And Ive done local theater, like movie theaters, like when they have a rental space. So Ive done kind of commercials like that. Ive never done it on the Internet. Never. This would be like my first time. I believe that that would be more bigger, but also less costly, I believe. So I want to find out.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right? Yeah. And the only reason why Im doing that right now is because, again, I want to move on this as quickly as possible because I do think that this window is open right now and other people are going to jump in it. So the fastest I can do it, the fastest its going to take hold in the marketplace. So we dont have a long time for that. A lot of things are changing and happening really quick.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, realistically, what Im looking for is how to use AI, get more knowledge about it. Thats what Im interested in learning. Im in the real estate business, so Im just trying to figure out this new technology here, how we could use it to our advantage.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, I understand that. I understand that. Lets say we go forward. What do you think I would be? What type of investment are we talking about? Because it kind of like, reminds me again, Im not a franchise anymore. I left my Century 21 and Remax offices, so Im independent. But, I mean, I remember paying for the franchise fee, so I want to see what the fees would be or what would the investment be approximately. What do you guys look at? What do you guys typically see in your organization?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Right. Yes, I did.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im in greater Los Angeles.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Definitely, yeah. Especially if I have this week. Yes.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, this week? Ive already have my whole week planned out. I planned my week, not my month.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Good, how are you doing?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sounds good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Because theyre old fashioned. Typically theyre all fashion, they dont want to change. But COVID has changed a lot of things. I look at a lot of real estate companies right now that have invested a lot in brick and mortar and theyve got beautiful offices, but nobodys going to the offices anymore.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. Can I help you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Texas. Yeah. San Antonio. Who. Houston, Paso, all the big ones. Big cities.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]