[{"pageContent":"1230 works best.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Sounds good? Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"12:00.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"They would work side by side with me, and they would accomplish all their dreams as well as mine. I feel like when you have the ability to influence a person and change their life while changing yours, its the best feeling ever.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"You scale your business.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Not on the coach. Hello?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Give me 1 second tomorrow. Twelve to two. So 1230 does work.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Twelve. What?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"640, I think.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"1130 to 130.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, absolutely. Ill watch it tonight after I put the kids to bed.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"YouD want to be a consultant? Okay, Id want to be a consultant because thats usually what Im good at. I mean, a coach too, because I can coach people.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, so beachbody influencers, I paid $8,600, and then I thought I was taking Bridget Bradys courses, and like, no, I was taking her free courses. I wasnt even taking the training courses. And at the end shes like, well, arent you going to sign up for the rest of it? And I said, Im already signed up. I cant wait. Im excited, blah, blah, blah, blah. Shes like, no, you didnt sign up for my courses. Im like, yes I did. I paid you the money. Well, what happened was someone else called me at the same time and I paid them instead of paying her. And Im just like, Shit, yes, I havent had a real good two weeks.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Minnesota.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Okay, so I didnt get the email yet.","metadata":{"fillerID":16,"fillerText":"Ok gotcha","category":"B"}},{"pageContent":"Yes, theyre picking her up at 1130 and dropping her back off at 130.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I make commission off of them and then I recruit and I make commissions off of that and my team and everything else. Got you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yes. Marijuana, CBD, gummies, hard rock, candies, stuff like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, it does. Fairly clear.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I mean, a lot of people wont invest in themselves. A lot of people wont invest in their business. They wont get to that level where, oh, you guys should just give me this, give me this, give me this. No, thats not how the world works. You want something, get off your ass and earn it. A, B, its just like going to college. Instead of going to college, you need to pay for mentors, and you need to pay for tools. Yeah.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay? Thank you.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"It is 636 30 perfect.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, absolutely. I dont even know. This whole last two weeks, three weeks have been just kind of crazy for me. I signed up for a course that I didnt know that I signed up for, and then the course that I thought I signed up for, shes like, no, you didnt sign up for that. And Im like, I just paid you eight grand. Shes like, no you didnt. And Im like, well, I got the receipt right here. And I look at the receipt and theyre like, no, that wasnt our company. And Im like, well, shit. And then I havent even really started into that other company, but I paid for the training for from them. And Im just like, okay. And they wont even return a phone call right now. And Im just like, this is ridiculous. I just paid you $8,000.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"No, I dont. 1230 Central. Ill be there.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes. Wheres this email coming?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, absolutely, because, I mean, I even have this baby. Like, this baby Ive had in my care for well, shes nine months. Ive had her for eight. You do what you got to do, but the love you get from these kids is nothing a paycheck could ever give you. But at the same time, thats why Im doing what Im doing on the other end, is because I want to be able to do more than what Im possibly able to do right now for these little people. Exactly right. I want to have that big old pool in the backyard, so Im motivated to get to wherever I got to get to and learn wherever I got to learn to be able to get there. So thats where that is.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"But I did file bankruptcy a year ago.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Hi, Jake. I can hear you. What do you want?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"All right, thanks. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Perfect.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Well, Ive been kind of diddled daddling in this company. This company? This company. And now Im just getting to the point where I like my new business and I want to persuade going far in it, and thats where its at.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. Whats the name on it going to be? Sorry, I should have been more clear.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah. Im on a mission because I want the lifestyle of some of the people that I know. Im tired of being broke. Im tired of living month to month. Im tired of doing what I need to do to make money right now. I mean, I do foster care too.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"MLM and affiliate sales. Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, because I just want to make sure that my baby is gone and I can focus because I like to focus when I have a conversation.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, its already affected my credit. Like, Im building it back up now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, no, I mean, its a waste of time if Im not going to consume the information. Its stupid. Its a waste of your time and mine.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"It sounds great.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Im not making much. I mean, with everything I do, Im probably bringing in ten grand a month, but I want to triple that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Network marketing.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"It on what?","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Depending on what the cost is.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"My goal is I want to be able to find a company. Yes. But I want to find a company that I can put on autopilot. Like, I never really did funnel systems and all that stuff before, and now Im to that point where I want to utilize tools and work smarter, not harder.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im open to consulting, be around?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, Ive been in business my whole life. I really have brick and mortar business, online business. I know how to build a company from the bottom up. Been around sales my whole life. My sister, she does rodeos. She does events. Weve done tables. Weve done everything. Recruiting wise, theres a whole process involved. Theres so many network marketers out there, and a lot of them are just lost. They dont know where to go. They dont know that, hey, you need this. You need this, you need this. Theyre just kind of throwing their money away, getting into a program and grasping at straws. And I guess, in itself, that would be rewarding, too, is helping other people not have to fail as many times, as a lot of people do.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, I dont. Im just a little girl.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Youre going up.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I have four fosters right now. I had six for, like, eight months, and now Im down to four. So I got five kids now that I deal with on a daily basis, and I just Im tired of having to rely on people yeah, well, hey.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, anything. Im well rounded. Yeah. Ive done so much right now. Im promoting an online dispensary. Okay.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"20 years.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right. You cant make a horse drink water. If its going to die, its going to die. Dehydration right.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]