[{"pageContent":"Well, Im in music, movies, distribution, marketing. Marketing company? Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"What can I help you with?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, I could be set up like that easily.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sounds like a winner.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I was supposed to do some of that Final Four stuff, but I didnt get a chance to do it. But we are interviewing on our television network station. Were interviewing some of those people, I think, tomorrow.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I think one of the guys on my team build courses for a living, so maybe I could talk to him and tell him what kind of course we need to build. And then once we build a course.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So this is weird. So you have experience with working with people, with getting funding? I mean for marketing funding companies.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. A lot of these churches need consultant right now. Everybodys trying to get more business and they have to do things differently now than they used to. So you got to look at these churches thats trying to get people and then a lot of them are trying to get in the music business, get their music ministry going. The music thing is what I do, but basically Im a sales guy. I do music, I create platforms and we do this and we do that. But at the end of the day, were just salespeople. I mean, were trying to market our product services and goods and services. Pretty much. Yeah. They sell in the word every Sunday.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Everything to make product sales. Im in the sales business at the.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, I think before I could do that, Id really have to tailor down what product Im really trying or what service Im really trying to give someone. So Id really have to give that some thought to understand what am I trying to do? Yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"The music industry.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im a serial entrepreneur, probably, and thats my thing, is doing business. So my thing is that and it all ties into the same thing. It all ties into together. Everything that I do complements the next thing that I do. So when I tell you that I built a record company and of course, were trying to get more streams for our music, I so decided to put OTT television network together and create faith based movies that I play. My music in and get people to subscribe to the channel for the faith based entertainment part of it. That they want, positive television that they want its all the same thing. Were still trying to get Apple to stream the movies. Were trying to get Apple to sell the music. Were trying to get itunes. Its all the same stuff. Its all in the umbrella of entertainment marketing is what I look at it as. Now my niche market is religion, our faith based. Its faith based, but now Im trying to make it inspirational because more inspirational people are the same people that listen to R and B and all that good stuff. So were just trying to reach people and change peoples lives, and thats it. So if its a movie that we can cross promote our catalog, our movie with putting our catalog music into it, and also we put that platform together. So Fortune 500 companies who want to reach an African American market, they might want to spend some money on advertising so we can advertise their soap, their hair products, their cars and all that good stuff on the OTT channel. Music streaming is not making a whole hell of a lot of money now. Its basically, to me, its like a business card, and you use your business card. And at the end of the day, Im trying to really get to Fortune 500 companies, equipment companies, car companies, detergent companies, cereal companies. Im trying to get those guys to spend money on the OTT platform. Or even if we teach more people about this too, because I think those platforms are the future. When I grew up in this world, it was ABC, NBC and CBS. And one day we looked up, theres a cable networks here. And now all of a sudden, I woke up. All these damn apps. Nothing on my TV but apps. I dont know how to get to the local channel no more. I just flip on direct streams or Hulu or whatever. You know what I mean? I dont even know how this happened. Its kind of like AI.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Because I have a brand out here, I think the things thats in my head would be sexy to people whos in my industries, everybodys trying to figure out how to market themselves, their product, services and goods. And I think I have a pretty good idea about how it can be done. I see this AI stuff is really banging. Ill tell you what we did. So one of our features that we have, we have a little thing called breaking news, and we blast it out. We have a guy sitting on a news desk, and its breaking news, whatevers happening in the industry. And then with in that five minute thing, we might have three commercials that we charge people to put their commercials in there. We blast it to our database. And its pretty neat because its like AI is talking to regular people, like, hey, this is Canton Jones. And then canton. Jones. Come in. And Im excited, but its kind of cool.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I do radio consulting.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I have a small label. We do about 1.5 million a year in revenues on the label. We just launched a television OTT channel that we probably can blow everything out the water. I am dealing with a niche market. Im dealing with the faith based community. I can sell other churches, things like that. So its a lot of things that we can accomplish with this. I dont even know what Im not even technically inclined. But I have a team of people around me that work for me that we are. I got some sharp guys with me, and I think I could do something that the industry and people definitely could need.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Really?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure. Because you know you better than I do. And I just tell you a little bit about me.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. It seems at the beginning you didnt feel like I had the money to afford the services. Possibly, but no, I call you because Im not money.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I would say this, let me say this to you. Weve been putting like, I just moved back to Texas here about six months ago, and in six months again, I put together the network, shot a movie, have a kids, animated kids series that were working.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. For instance, I could combine a couple of things. I usually talk about the record business or record companies or distributors as basically were actually a bank. And just like, when you go to purchase your house, you go to your house to purchase your house. First thing you do is you go to a banker. Banker. The first thing theyre going to ask you is your credit score and your income or whatever, whats your net worth? So as an artist, you come to a record label. We want to know what your artist score is. We base things on your artist score and a part of that process. As an independent, I also have a solution where I bill business credits down in Brads and all that stuff. They help you get funding. So nobodys really packaging the record business with the funding in order to make the business work. So a lot of people have the talent, and theyre just sitting around these days waiting on record labels to pick them up, and thats not happening these days. You got to almost know how to do it yourself, how to get your funding, how to get your record produced, how to put your record to Radio and get it into distribution. And a lot of things, you can distribute it directly to the consumer, because now the consumers the product is going directly to the consumers now. Yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Good, how are you doing, Carrie?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, probably about 800 of my business score is probably about 89, 98. We already talked about this. So you already know Im qualified with the funding or getting money or whatever I need to do. I tell you, Im trying to teach.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, Im an influencer, I coach. Im very successful in the business of marketing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Just everything thats inclusive of the music industry. Marketing, distribution. You might want to go on my go, look at my Instagram and see kind of who I am and maybe check out my I just launched OTT channel. That our first three weeks, we probably downloaded over 12,000 apps. Just stuff like that. Yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. We also do a lot of marketing with active campaign, email marketing with active campaign. Right now, we kind of just sell our T shirts or CDs because CDs kind of some people want them as just vintage type stuff. Some people just hadnt gotten, especially in my market in the gospel, I do gospel music, so they want to hold on to something tangible. So that market is here for a little bit. But at the end of the day, again, like I said, I do distribution. I have music. We send it out to the radio stations. We send it to all the DSPs, the Spotify, and itunes and all that stuff. And I probably have about probably have taken about maybe 50 artists to number one on Billboard. So theres something with that being an influence on people in this industry know me as being the guy to get your music number one at Billboard. And then, of course, the other solution that I have, I just kind of understood how to build my business credit, and then I just kind of flipped it and say, hey, man, a lot of these guys out here they just take the time, they could get their own funding. They dont have to worry about trying to get funding from someone else if they believe in themselves. So its like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sounds like valuable. Yeah, it just sounds to me like I would probably put someone on my team to do that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"We woke up.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah. Well, people call me right now and pay me like anywhere between 25 and $30,000 just to get their music played on the radio.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Houston, Texas.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"For businesses, no, Im a record company, but I do records. I have a TV network, television network products, that kind of stuff.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So were really just working on a lot of stuff now. When we were trying to do the Active campaign type stuff, we would spend $5,000. Back then, I just turned it off. I turned active campaign off. I got all these little products. I got all these little things kind of together. And I had to get to an area where I can have the right people around me because, again, Im not a technical guy at all. I am not turned on the computer. I own $100,000 cameras and I open the case. But its cool. I guess I said that to say this. Once the product is created, theres not a problem with me doing what I need to do to make the business work. I do understand marketing, so I understand ad buys and all that stuff. I dont even know what it is that you do. And it might be something that can work once I look at it, read it. And I have to really understand what you do and then facilitate what I do to see if we can make it work. So you wouldnt know everything that I do or all the assets that I have to make it work, but I know all the little things that I got that okay. Now that were talking. So it seems like right now that your product would pretty much work with the Credit BIS solution. And the Credit BIS solution is building business credit. Thats not a niche market, thats just a general market. But I decided to make it something thats nicheable. You know what I mean?","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"I would really have to get with my team before I can make that decision because I have to talk to them and see how we can schedule.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"These are more technical guys. So I would think what we would have to do first of all, Id have to try to figure out how to formulate the idea that I have. How do I put all this together so we would have the course to sell? We still got to go back to get the course to sell. Yeah. So I would have to figure out the conversation piece to put together on me.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"This from yeah, I dont know what you call a high ticket scale, so I dont know what that is.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"If Im trying to teach people how to do it, how would I know how to do it? Whats wrong with you man?","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Qualify me so I can make sure you send me the right stuff. So I love the way you qualifications, I love the way you target basically me, Ill be like whats your budget? Straight up. But youre like whats the most? But people buy me because Im straightforward, just like were talking. Thats how some people buy me. And I have the credentials to back up what I say.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I got you now. Okay. So that will help me be able to create the course if I understand what were doing. Right.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Hey, hold on for a second. Is that tree actually dead? Okay, this guys taking my trees up and I dont know if theyre dead or not, but.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, Im going to talk to them. Ill talk to them here a little bit. I dont know if you did you send me something? Yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, I dont know. All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I like to stay around, like to start off my first year doing anything. I like to at least be at a couple of million dollars year mark.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"So give me an example of a client.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. And I still dont know what it is that you do. So I havent even looked at your brochure yet to even put in my mind, how can this work for me and what Im doing? How can I develop something for this.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay, thats what it sounds like, which is cool. I think all those work, but it sounds like I dont know. Are you familiar with Active Campaign?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I would probably pay one of my team members to sit down there and do that for 2 hours.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, you can. I have to make a decision. I have to get with my people and schedule it, but yeah, lets get on this.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Yeah, give me a ring.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"For sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, give me a ring.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right, cool. Thank you.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"I have about eight people thats on my team right now. Theyre more technical people. Like I said, Im not technical. These guys are, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. For instance, we have a solution where we sell the experience of knowing how to build your business credit. And that ticket is about $3,500. Right. And what that is, when you get on that course, you get on there and we have a little website and it walks you through making sure your eni number is set up, making sure your address is matching that, making sure your phone number, making sure all this done. Then it gives you the first five people that were pretty much going to give you some funding from thirty dollars to one hundred dollars, five hundred dollars, whatever. And what that does those accounts get on your experience and equifax and all that. And then that starts the whole funding process. Then you might go to the next level, which might get you a BP credit card or something like that for your business. So these are some of the things that I have in place and Im just trying to figure out how to combine them kind of all together. Its a little weird. I dont know if it could work or not.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Is that high ticket or not? I dont know.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, we do active campaign right now. We probably have about 100,000 people in our database. Text messages and emails and things like that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, thats what I think. I would like to do something like that, because a lot of people have these LLCs. They dont have them set up right. A lot of the producers or their artists, they got LLCs. They dont even have a diamond brand number. They dont know how to get their first five or ten initial companies that give them they dont know all that stuff in this industry very valuable. Yeah. They just think they produce a record and want a record company to come and sign them. Thats not happening anymore. You got to pretty much do it yourself, get the funding so you could build your social media, get the funding.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. I got to really? Yeah, because I have a lot of good products here. I have products.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. And then Im also looking at the future. The OTT channel, I think, is going to be an amazing product. We just shot a movie. We just bought 30 movies to put on the platform. We have shows that we produce, video shows, talk shows, health and wellness shows that we shoot on a weekly basis. Were out here just shaking the trees, trying to make some stuff happen. And my guy was telling me, man, we should do some kind of a course. And we never really talked about it. And then I dont know which ad you were, but anything with AI, Im like, okay, actually, I was looking to trying to find something to spend some money on, investing some AI. Right. Now, its like in the last 90 days, it just went crazy. Or really about four months went crazy. I think its moving so fast, the government probably dont even know. Do we want this right now? Youre an AI company, right? You use AI or something like that, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It sounds like active campaign. Sounds like Active Campaign or a higher level to me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]