[{"pageContent":"So we dont really have a massive overhead for the online stuff, obviously.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Not anymore. So we did do that last year, and we have already done that this year, but by the end of this year, well have coaches there. So speaking of which, Im headed to Italy on the 20th of this month, and weve got our coaches from Spain coming to meet us, and then once they get certified, theyll kind of take over the reins there in their country.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im not even too sure which one it is. What do you guys do again?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thats a good question. I think the margins are generally good. Could the prices be higher? Yes, but our overhead is nil and void at the moment, minus a website subscription to the Wix.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"For the online program? We probably do anywhere. Id say on average, five grand. A good month would be eight, a shitty month would be two. So somewhere in there? Yeah. Same April. Notoriously April is a bad month in the fitness industry all across the board for gym memberships, personal training, et cetera. The Hype of the new year fizzles. People finish their initial programs and then go back to their regular life. And then theres a slight uptick in the summer, a big fall in the fall, and then back again late winter, new Years resolution time.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hey, whats up, Rick? How are you doing?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yes, we have I should probably also let you know that its a dual system, so we have the online virtual system, and then we have an in person coaching certification course that is, generally speaking, our bread and butter. So we do about one or two certification courses somewhere in the world every month, and those usually the revenue there is anywhere between ten to 20 grand.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"What do you attribute that, the exponential growth of our system? I think our product itself resonates with our niche. We dont really have a hard time marketing because we know exactly where were going. We do weight training for weight training coaches, and so it makes it very simple. So Ive put my ear to the grindstone the last year and a half, two years, and lived on emails and phone calls and called every gym in the country twice, set up meetings and set up certification courses. And now were kind of floating nicely. So looking to scale worldwide, which is what we were talking about earlier.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Correct. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"The first goal is to hit the quarter million dollar mark and then the end of 2023. Id love to do a million.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, sure.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Nothing, really?","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, definitely not like the guys you see on TV, but I partake.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Whenever were up in the mainland and we go get the pineapple somewhere, or its at a house party and I eat it and its like a sour kind of orange, and Im like, what the hell is? Im like, no wonder people dont eat pineapple up here, because its like eating.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, we have a few of those systems set up through Facebook already. Like the Cart bounces and the screen. Exeters, weve got, like, a little email funnel already working to recapture those guys, and then we have an automated email system that will send something out, like monthly or quarterly.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats correct. Generally speaking, these are already coaches in the business that are looking to add another notch in their belt. So some coaches are running coaches, some guys do kettlebells. So our system is an addition to those.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I would like to be sitting at 250,000 at the end of this year as far as a net revenue, and Id like to see that number hit 1 million net revenue at the end of 2024.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, yeah. I mean, that part sometimes well have people asking questions. So, yeah, thatd be me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"A weekday is better because weekends Ive got my sons sporting events.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Candy.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Lets do that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"We work mainly with coaches. We work with clients in person a lot. So if you have something there, Id be interested.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, man. Here. Its buttery. Its juicy. You can eat that thing, man. Yeah, its nice here.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Say that one more time.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"We use none. We use whatevers on the back end of Wix.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Alex.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"What works best for you Monday? Here? Monday. I could do 08:30 a.m. My time is about the earliest I could do.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I mean, like on a monthly basis, we could probably do $1,000 a month or something if it was towards marketing and advertising and increasing sales.","metadata":{"fillerID":7,"fillerText":"Yah totally","category":"A"}},{"pageContent":"I appreciate the call, my friend. You take care.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"That is right, that sounds good.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I dont even know yet. Id love to do that next year.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Tony Robbins?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"No, its definitely grew the last year probably by 95%, including income and visibility. So, as an example, our social media page in 2021 had about 750 followers. Beginning of 2022 had about 2000 followers, and today were sitting at somewhere closer to 70,000.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Air AI. No? Nothing.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes, per certification.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I mean, the big bulk of our stuff comes from the in person. So in a perfect world, Id love to be able to do in person courses every month. That would be ideal. Obviously, if youre in a state like me in Hawaii, you run out of gyms in two months, right. So theres not a ton that we could do here because lets say you hosted a course in Honolulu. All the trainers from the outer islands, which isnt many, are just going to fly to that one certification.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Here. Another thing is papayas. When I go to the mainland, I cant touch a papaya. It smells funny. It looks funny here. Theyre sitting in my backyard. I pick one in the morning. I eat one every day. Beautiful.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im from here.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats awesome, man.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Maui.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"So that gets exponentially better if you go to La. But now we start incurring those costs. So, yes, the bulk is better. I would love to have it set up all the time each month, and Id love to have it at capacity, lets say 30 to 40 participants at every event. That would be beautiful.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I have an eight year old son. Im taking him to Italy with me this month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Take care. You too. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, thats right.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"We got it right.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"So right now we have the automation for the certification online. So I dont really have a lot of hands in that people go through the funnels, click their way through, and end up buying the cert for the in person stuff. Thats a lot of me calling gyms and setting up certification courses. And then we run marketing in that city and state for 90 days or so out before the cert. And then the closing process is also very easy. The guys who are going through that funnel are coaches who are looking to get better.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Ive been going down the rabbit hole on this like everybody else for six months. Which one is this?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I just have one business partner.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No doubt. I love it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I grew up on Maui.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I will tell you, this is usually my realm, and he usually does the service stuff. So if he doesnt, its not that big of a deal. I make all the final decisions on this aspect of the business, so I can surely offer him an opportunity to join the call. And if he can, great. If he can, its okay.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I dont. And my business partner moved home to raise a little family, so were in two separate states, so we can definitely try to coordinate something.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Ill tell you what, Im at my computer now. Let me see whos it going to be coming from.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"The business itself should be just fine. We have one credit card, were financially stable, we dont really have a bunch of expenses and we pay that thing off all the time.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes. So this is my passion project, is to get this company up and running full speed ahead. But until that allows us to do that, then yes, I do the daily grind. I train clients in person. I work for the marketing company to allow me to have a paycheck, but thats definitely not what I want to do forever.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Absolutely. Hell yeah.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"If there was to be somebody, itd be me, but Im not involved that much. Its pretty automated.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"It makes you wonder like, what are we doing here?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I mean, thats probably it. I own a very small two man operation fitness, online fitness program, and were always looking to scale and grab people there. I also work in the marketing department for a marketing agency that I struggle with, finding connections to the B to B portion of the deal. So Im probably looking for those two things.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats the best. Where are you located?","metadata":{"fillerID":7,"fillerText":"Yah totally","category":"A"}},{"pageContent":"It is a quarter to 09:00 A.m.. Yes.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"We actually worked together in California and then yeah, we went different ways this past year.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"I would say so, yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, this business has been active for two and a half years.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, were pretty basic there. So its an online training program that people can either buy a workout or they can buy the coaches certification course, which is kind of our bread and butter. So theres no physical products yet, although we will do that later this year. Thats the goal. But currently its just a virtual certification.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So far so good. I love it.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"This point for our business credit?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"That sounds about right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Currently three. Were 2 hours most of the year or 2 hours? Half the year, 3 hours, the other half 3 hours.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"When we do it globally, we do it in person. So, for example, well go to a gym in your state, and then a gym host us there, and we pack 1020, 30, 40 people in there. Retail for that is $700 for the in person certification, and then we teach a two day certification and head home.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, man, hang out with my kid every day and not have to open a computer or laptop.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Were doing some very basic Facebook marketing. We run some ads and kind of keep a slow drip going through Facebook. And I would say that a good bulk of our clients come from there. Our social media presence is pretty strong, and so in our niche with other string coaches, were pretty visible.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sounds great.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, we have coaches all over the world. Europe, Asia, Australia, Canada, Mexico.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Lets see 1224? Id say about 30% of that.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"And wheres that video?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"No, I dont. Not at the top of my head.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}}]