[{"pageContent":"Yeah, it would be something Id be worthy to listen to, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, whos calling, please?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right. Thanks so much.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Got it.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"How are you? Oh, good. Okay, just so you know, your pages are not loading properly when I enter the information. Theres broken links internally on the pages. The sequence that I worked with when I sent you my information, it didnt acknowledge receipt. It kept going in an endless loop, asking me for the same information to be reentered again and again and again.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yeah, I would say so. Well, thats amazing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, but were not doing a lot. You got to understand something. This is a much needed service if you know poison ivy. Okay, no one wants poison ivy for obvious reasons. And when you think about kids having a pet or grandchildren. So those are the driving factors to keep everybody safe.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Theyre the ones that are contacting us.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. And thats really where Im at. So we specialize. Weve been doing it for 50 years. Ive got a good track record and we guarantee our work against results. And we dont use chemicals, so everything we do is entirely safe. Thats awesome. Yeah.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"I dont have anybody dialing out. Everyone calls in and either speaks online with someone when they call in as intake or theres a lead gen form. I guess its the website, I think its where its at. And theyll fill it out and get forwarded to us with CRM, and then we follow up by calling them back just to verify and validate their information and make sure they have something that we qualify.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, were not. Its called finger dial out. One at a time. Yeah. No, theres no auto dialing here.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I just came back from a three day seminar by Harry Belcher on AI.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Is as far as people answering the phone?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Just one.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Is, by the way? I understand the value of auto dialers, but I really dislike them myself, and Im not a proponent, Im not an advocate of that.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"The only reason they wouldnt pick up is theyre either not home or theyre not sure of who the calling number is since they dont recognize it. But we end up leaving them a voicemail and then theyll respond back. Or sometimes theyll pick up in the middle while the voicemail picks up.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Bye bye.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"08:45 P.m tonight. Yeah, that works.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"845 tonight? Sure.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I want to simplify or streamline the process to require stronger adherence to a system. Whats happening now is phone calls come in. Sometimes people dont answer the phone. And then that phone call that came in, maybe they left a message. Maybe as soon as they heard the voicemail, they hung up and didnt leave a message. And that happens more frequently now than ever before, where people will get a voicemail and, fuck it, Im not leaving that message. They hang up. And then here we are then tracing the phone numbers that came in where no message was recorded, and then trying to call these people back apologetically, saying, oh, sorry we missed your call. How can we help you? Thats a stupid way of doing business. Yeah.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay. No, did not get okay, no worries.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah. Give me 1 second. I got a knucklehead here trying to cut me off. What I do is Im a service company. Im in the green industry, green space. But we dont do landscaping, per se. So specifically, we specialize in removal of invasive and poisonous forms of vegetation. Primarily invasive vines, poison ivy, Kudzoo, and bamboo. Thats my take. And we service a large metropolitan area. Connecticut, Long Island, New York, and New Jersey. We have about a 300 miles radius radius area for about, I think we say about 20 to 30 million people reside within our service area. Im one of the few guys that does this as a full time business in my region, and there isnt a lot of professional competition. There are a lot of landscapers who think they can do the work, but theyre really not qualified once you attempt to do it, usually end up watching up the job. So you wouldnt bring a transmission repair to a guy who does flat tires just because youre in a car?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I see it on Ill let you know. Thats part of what I was talking about, so hang on a second. Give me a minute.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Whats the title of the caption on the email?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Its probably idle. We dont track it that way, but I would venture to say its up in the 90 percentile.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I appreciate you for that.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}}]