[{"pageContent":"This is my web designer with me. His name is Jamel.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"This is Alex. Hes with AI. They do all kinds of things with their websites, with our websites and so forth. Okay, so tell me a little bit about what you guys do and how long you been doing it and whats going on.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Follow the money trail.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, were doing a couple of things. Okay. Im setting up a website for the poor, the widow and orphan. Its called Powfoundation, and well have that up today if you want to check it out. Once again, thats POW Foundation. Okay, perfect info.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, how many people do you think you could get on that bandwagon?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, you did. Good. Im going to give you award for that. Most people dont get it, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, yeah, hold on a minute. I got my web designer here with me, so I want him to hear this, too. Come on in and show the door.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And youre not going to be on the line, am I correct?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, send one to Jamels website, too. Give me a website. Jamel email.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I feel that Im at all above. In other words, depending upon the people, the quality, obviously theyre expecting something great, no doubt. But this is back in the 70s, we were collecting $5,000 a seminar, and that was kind of like a four pack seminar. I dont know if you ever heard of a company called Dare to Be Great.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont think so. Ive been busy all afternoon doing banking and all kinds of different things. And actually it said 30 minutes on the thing there and I wasnt sure if it was the day, but your title couldnt be perfect.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I like that. Go where the money is.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"How would we get into it? Im not sure what youre saying there.","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"But what we do no, youre not going to do that. Im one of these type of people that get things done with groups of people, with multiple people and what have you. Let me tell you as much as Ive learned from Glenn W. Turner, which had 78 corporations. Ziggler Ziggler and Tom Hapkins didnt have that much going on, even though Tom had the motivational and the sales train. And that was pretty much it where Glenn Turner had 78 corporations. So Ive kind of learned to grasp on whos your leaders and who can do this and that and so forth. And obviously the right people do come attracting in my sequence of things of the way I do things. Ive had a few people go, but they werent right for me at the time.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You bet.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Really.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I know theres a lot of people out there that are looking to become entrepreneurs, are looking to start their own business, have a business already. So Im not afraid to tackle anything that people want to do. And obviously I will definitely make sure that they get the right materials. This thing just on the motivational side and the sales training side. I am excited about this. Ill put something back on the shelf if it was coming forward. But the reality Im not worried about the time or the sequence of all this.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, give you a little bit of my background. I dont know if youre familiar with some of these names. Zig. Ziggler. The great Tom Hopkins, Anthony Robbins, or what they call Tony Robbins. And also the great Glenn W Turner. So my background is very extensive. I worked with Megan Multimillionaires and those type of people and what have you. A few years back, I was thinking about retiring, but I cant handle that. Im 70 years old. I dont sound like it. Ive got a lot of energy, and Im going to be living to be 107. So Ive got a lot of things that I can still do now that with the technology the way it is and what have you, you can do it right from your own office. Ill fly to a destination if theyre going to pay me $25,000 for the day to speak or whatever. But Im one of these type of people that, you know, like to do multiple things. I worked under Glenn W. Turner, who did multiple things. He had 78 corporations. I was one of the presidents of one of his corporations in the motivational training and what have you area. So you never lose that. Its always there. Its amazing how to get people off their assets and get going. But Im glad you mentioned that, because thats possibly going to be one of.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Youre going to send it today so we can both see it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"How much would you need?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"No, I do not.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im in the great state of Florida. Okay, cool. Oh, Donald Trump and Ron DeSantis.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"We did seminars all over the United States with the great Tom Hopkins, where wed have 2000, 2500 people there at the seminar for the day. I think we pulled in a quarter of a million dollars just for those days. And we did those every five weeks and then all over the country. I know the business, obviously, what youre thinking of. What Im thinking that youre thinking is that youre looking at more on a coaching. We can do both, even high ticket coaching, as well as maybe some group session. You tell me what you guys feel that you can do.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, I dont tell this to everybody. Okay. I definitely want to be in the mega multimillion range and then of course with a few other different things that Im dealing with, especially with the crypto coin down the road here that would like to be in the billion dollar range. Okay. Now, of course, Im ready to launch that any day, pretty much. But youve been trading me to get me actually motivated because I think I found somebody here that can definitely do the motivation on the coaching side of things with me. This is fantastic.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Thats Glenn W. Turner, and I was one of his presidents of his motivational companies. And like I said, he had 78 corporations in 13 countries. So obviously this would be looking at different countries as well. Or because of the Internet is worldwide now. Right. Are you just looking local here for the United States? Are you looking at possibly doing other countries as well?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure, no problem.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right, my friend. Tell them Ill be ready at 07:00. And I do appreciate your work today, setting this all up.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No problem.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"That sounds real great. And make sure you send one to Jamel there.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"A seven is going to be better. Thats my number anyway.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"As a now, tomorrow might be a challenge. Tomorrow might be a challenge. Ive already got tomorrow pretty well booked up. How does Tuesday look for you guys?","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}},{"pageContent":"Going to call me, correct?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Really? Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Seven is my number. Theres no doubt about it. And I believe in perfection. All the good stuff that goes with seven.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Just basically 07:00 P.m. And on the telephone. I dont want to be on zoom or anything. I just want to be on the telephone, and we go from there.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, loop them together there with me.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, Im looking at anywhere from 50,000 to 100,000 opening, so I dont know, it sounds like you sound a little bit smaller than my thinking. I think big. Im sorry? Thats the way I think. If you go big, you get big.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Im in the Eastern time zone.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I saved. I saved. Tom hopkins $50,000,000.01 day. He came to me and he had what they call a luncheon session during the seminar. And he said, Would you come and sit with me? I got to ask you something. He said, I know youre a minister. And he says, My wife is getting ready to divorce me. And I said, Tom, because he was worth $100 million at that time, thats $50 million out of your pocket. And he says, yeah, I dont know what to do. He says, Im confused. Im bewildered, obviously, Im not doing things right, apparently. I says, well, your wife should be and your family should be before even the business. And I said, Listen, what have you taught us? And he said, Well, I really dont know. You always taught us, get back to the basics. Get back to the basics. Get back to the basics. And I said, thats all you need to do with your wife is get back to the basics. Remember when you first met her? You were google eyed. You wrote her notes. You brought her flowers and candy. I said, thats all you got to do again. And shell remember all that and itll come flooding into her brain and shell have endorphins and shell be all giddy again. And he says, Im going to do it. Im going to do it. He went home and he did just what I told him to do. And I saved him $50 million that day. Now, I didnt get a reward for it, but my reward was even greater because I taught the teacher.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And I have all of the material, so Im not worried about gathering up material for you all.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, I seven. Yeah, my number too, as well. Im the seven son of seven sisters, born on 7th street in California. My name Paul Ezekiel Coffin, has seven letters in each of my name. Seven letters. There we go. Im just a child of seven, and Im actually the seven, like I said, the 7th.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, definitely. And another thing that Im looking into is theres a company out in, I believe its San Francisco. They actually called me the other day, and I told them what we were doing and so forth, but they get you on ABC, NBC, all these different newscast and information and so forth. So if Im not well known, I will be well known, and I know thats a benefit for what were doing too, as well. And I wanted to let you know whats going on there too, as well. I know that after people hear me and Im questioned and so forth what Im doing, Im a regular Joe guy, but at the same time, Im a very high end person at the same time.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Itd be on the motivational sales training site.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Paul, obviously, I will call you Ezekiel Kaufmans name, whatever we call our company and what have you at that time. Now, my one company before the Pandemic was called Top SWAT. Which stands for SWAT stands for successful winning, attitude training. And I would wear my Top SWAT hat when I went out in the audience and spoke to them. Back then, we had seminars at hotels and stuff like that. Obviously, were looking at a whole different ballpark with the Internet and so forth. So you tell me what you guys can do. I love to look at your video, meet with your people, and then we can go from there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And then weve got another website that Im opening up, like a bitcoin, but what they call a crypto coin. And Ive had some advice, wait till the middle of the year and so forth, but I kind of want to get it started as soon as possible. Now, the website for the POW is getting ready to go ASAP, so we definitely need to get people donating money for that. Right now, were looking at $100,000 to accumulate there, and were routing that right now through GoFundMe, and then eventually well have our own room and a little bit more organized on that. But it all takes money, right. The main thing right now is what were doing is the POW. Im a minister, what they call a rabbi in Africa. Even though Im in America today. We had Zoom. WhatsApp? And all that stuff. So it makes it much easier to instead of flying there and organizing it, Ive got pastors directors over there in Africa. Africa is going through some make. We think were going through tough times. Not even close to what Africa is going through. And my goal is to bless them. Like I said, well have that website up. We have programs where we teach them how to grow gardens and all kinds of different things. And Ive got a lot of projects. Its just that I got to get one of them one out at a time. Im an inventor, motivational speaker. I want to get back into the motivational speaking as well, like coaching and what have you. And then I have a product that I invented that I want to get out there as well. Its called the rake hole. Combination of a rake and a hole. But whats unique about it? Were the only one that has a patent that has a handle that never breaks. In other words, the handle is always attached. If you do run over it and break it, well, now its replaceable. In other words, were the only company that can replace the handle with all the pandemic and all that crap and everything. Everythings been kind of on a standstill. Go ahead.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Whos this?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"All right, Shalom. Take care. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"What time do you think in Eastern time?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I never let credit score stop me from doing anything. I know you guys look at different things, but I never let anything actually stop me from going forward with anything, depending upon the money. And of course, we want to obviously check your side of things out, too, as well. You mentioned some good names there, Anthony Robbins and so forth and so on, but Im looking at different things, too, as well.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im sorry, this is who?","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Do you know that persons name?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"That would have to be delegated because Ive got, like I say, other things going on in my life as well as the companys life. Ive got kids, Ive got grandkids. Im not putting them to the side. Obviously, theres room there, but at the same time, I am a family man.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]