[{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Not really. Im kind of bootstrapping myself at this point with the jobs that my clinic and just working other jobs to supplement my income, but Im trying to bring all of that in. How does your program work for like, do you guys work from loans and things like that?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Im a nurse practitioner.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"We were last year we were thinking dropped last year, so I think we were like around 221 to 25 or something like that somewhere.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, Im getting ready to apply for a grant that I could potentially get some funding from for this because Im thinking the majority of the money is going to be spent on, like you said, ad spend and marketing and things like that. So as far as you said, do I have a budget?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"That Im going to charge for it. I would like to do this in a group coaching format. The whole point is so I can kind of replicate myself without having to be there all the time. But if I can do it in a group coaching format, that would be what Im looking for and as my primary way of doing it. Now I can do one on one too, but I need to figure out a way to make some money and have it residually coming in. So I know they have some of these coaching offers that are out there that people are doing. So some of the higher ticket coaching programs tend to do better or people tend to commit to it a little bit easier, but I dont have a clear path just yet on it. Do you work with other coaches?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right, right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Because I know with these mentorships and things like that, these programs usually have a high ticket attached to them as well in order to get the results and things that people are looking for.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Thank you so much.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"We might be able to work? We can try it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Texas.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"By myself.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I dont know what his score is right now. Okay. It was high. I dont know what it is at the moment. We havent talked about it in a while.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thank you so much. I appreciate it.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Six looks fine.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Sure, well add value.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hes always working on in terms of time wise. Again, we can set something up. I dont know if hell be able to hop on or not. Bill it.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right? Yeah. So you said you have your last few clients have scaled up to a million dollars, and thats what you guys do? I would like to do something where I could do this repetitively and still be able to have a life without working all the time. Im working, but at least Ill have the flexibility.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Meaning so I know with some of these group calls, you do, like cohorts where you might have so many enrolled at one time. And I dont know if thats the suggestion to do or if it should be just an ongoing thing without grouping people into separate groups, I guess.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, sometimes.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Some of it just networking. Been in this space for a while, and Im in Houston, so I could attend some of the networking events that they have for different things just to get my name out there a little bit more and utilize the contacts that I have to let them know what Im doing in this space.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I have a spouse.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Something like this. If I could bring in, of course, if I can get a million dollars a month, that would be amazing. But I was looking at something like anywhere from $30 to $40,000 a month would be awesome as well.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Six would be okay.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"The most daunting aspect right now is just getting started. Like finding time to do what I want to do. Its a certain thing that I want to do. I know I have to have a target audience. The social media aspect is like a dog eat dog world in terms of advertising and marketing and getting out there for people to recognize and get to know you. So thats daunting for me because I could go without being online. That doesnt have to be my first thing that I do, but I need a message.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Honestly, Im going after clients. I probably will do some business to business marketing for, like, clients that are in doctors offices and things like that that may or may not be getting that extra piece. So thats where my thought was. That would be the most inexpensive thing I can do to get started.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, that will allow me to utilize some of those resources to do something, do a different business with it, ultimately what I would like to do. So itll open up some doors, perhaps pay off some debt or get out of debt. It would allow me to do that part for sure, and then be able to take the extra to do other things.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, sure. Sounds like it.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay. And tell me the name of the company again. I know its something AI I thought I remember its.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Now, I think so, yeah.","metadata":{"fillerID":19,"fillerText":"Yah umm","category":"C"}},{"pageContent":"Its Trevor Treva.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"It varies. It could be 05:00, it can be 08:00. It just depends on whats going on for him. It just depends on whats going on. So tomorrow probably would be too soon, especially for him. And I dont know about Friday either. I can do Friday during the day, but I dont know about my husband. I know you wont be available at that time, not during the day.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, let me double check for that time.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Probably in the evening. But my husband is a wild card because his work days varies sometimes and all whats going on at work. So I dont know if I want to necessarily base it around his time frame only because I know of his availability. Sometimes it changes.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im great, how are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Trevor hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I know that its a high ticket offer. I dont know if in terms of time framing, if thats a ticket offer for three months or four months or weeks time frame wise.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"My credit score has dropped significantly since I have been doing this other business because I went from working full time to not working full time. So I think the last time I checked, my credit score might have been from like 800 to 650. It dropped significantly. So I am trying to, like I said, get back to not where I was, but do something differently and have a different outcome.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"In Houston.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, me, my husband somebody, hes more of a salesman than I am, more into marketing. Thats all a new space for me. So it takes a little bit more time, but Ive gotten a lot better at it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Like I said, my husband, sometimes hes here and sometimes hes not. I dont know if he regardless of which day we choose, depends on whats going on at his job. So if I set the time, I just wont be able to guarantee hell be on the call, thats all.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. All right. Ill watch the video and its okay. All right, I got it.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay, cool. Im in Houston.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Well, I have a weight loss practice, but Im looking to have with a partner. So were still pretty new up and running, but in the meantime finding something else I can do to bring in some extra money. So I want to do like a health coaching business that I can do online for clients.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]