[{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Up in the summer and then they tell me, oh, I cant do this or I cant do that. They said within six weeks to eight weeks I get my hands back in my eye, get my lens back. Right. But depends on my redness thats going to be, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im all right right now. Well see. I hurt my back, but I also busted my eye, cut my eye in half. Put that way, a bunch of coals came up and sliced my eye, my eye in half.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Cant get mad at that. But yeah, thats the stuff I like to do.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, my grandson plays with them. Hes already what? Hes been on there going on four years now, right now. So my daughter, shes fine, and then my son from there, hes the middle one, he dont know what he wants to do. And then my daughters a nurse, my next one, and then my son, hes 24, so 23, and he works for Amazon. He likes what he does.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, it was just that quick, too. The hook went into my just sliced my eye all the way through. Busted my lands, my retina, everythings gone. I cant see nothing on my left right now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Everything else falls there. So thats from there, I dont know. For now, I guess that like youre saying. And then I could teach them into financing other stuff like that. I mean, I know pretty much a lot.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I guess I actually want to build it. I want to build my own where I can just be on top and just help them, train them, everything. I mean, whatever they need to get to make it for themselves. Coaching is awesome. Training what they want, how far do they want to go. Thats why I want to help them. I want to be there with them.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I will. So youre saying all that stuff, I buy houses. You right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. Yeah, I was with him then. I went through a lot of stuff with my family and stuff, so I was going through a divorce now and everything else everything went downhill when everything started going good, but I was still doing it. And then just a lot of things are just stressing. I cant do anything anymore because of fighting and stuff with the lawyer, stuff like that. So Ive had a rough six months a year now, going through all that and just basically surviving, just doing what I can right now. Im trying to get back into the high ticket sales because Ive always liked it, because I like training people, doing it. And I like I used to love to do it. I did it back in the 90s in a sense that I didnt even know high ticket, but I did it.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"They have to understand themselves. Things aint happening for no reason. Theres reasons for everything, and they just got to understand why, for me, this is happening to me, Im mad, this and that. But theres a reason for everything.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, because I wasnt focused what I should be doing, and Mike kept begging me out and everything else. I mean, hes a different of mine, but I couldnt focus right. And I was letting down I dont like to let people down. So I basically gave up my position, where I was at, and told me, let me go on my own right now and Im going to do credit repair too. So I was doing that by the side just to do something to get my focus, and I want her to know how much I would be making and this and that, start taking everything from me. Thats another reason I stopped, too.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yes. Pull him up later. Tom Hopkins. Youll see. Yeah, he has a house out there, so we used to go he did training and I worked under him for a while and then Grant Cardano, I helped him out training him. I worked with him for a little bit, just to steve people, just to understand, but I can work with them, but study them and talk to them. Little things here and there. I love to talk to people that have knowledge. Right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I do the same thing when Im talking to people. Im trying to set up appointments and do everything else. And if they ghost me, Im like, oh, really? I could have did something else. Come on. I understand because Ive done it even before the computer stuff back in the 90s, we had to go out there, go out there, hit the pavement, basically get our leads and stuff like that. And I did it, and I did it live. People didnt show or they gave me the wrong numbers and theyre like, come on, why?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, thats going to be mine right now because I dont know if Im going to be able to do too much on the computer yet. I think thats what I got to figure out. What am I going to be able to do? How long can I stay on a computer? I mean, we could do zoom calls and but how long am I going to be able to do that? What can I do? What can I not do? You know what Im saying?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im all right. I just hurt, no big deal. But my friends, they saw me and theyre like, no, you got to go. And when they told me the hospital, they took me into surgery within 4 hours.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"A couple like about a month or so so I can get myself together with all the surgeries and all the stuff theyre going to be going through in the next few weeks, thatll be great. If you can help me out there.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I got cash in a box in my bank. I got that. And then my brother has some in his accounts and stuff, and I got like six different prepaid cards and stuff and six, seven of them. And then I got some other little online banks that I just throw something in there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And then him and his mom, they bought us a five bedroom house because he got three grandkids altogether with my daughter, and they got a five bedroom house with my grandson. He just turned 19. And then still I dont know if you heard of State of brothers. Sponsored him. Hes sponsored by State of brothers homegrown kid. I watch him on TV now, its like, wow, I saw this little punk when he was a kid over here. Now I see my baby.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah. And thats the way Im going to tell most of the script is going to be the way I did it. That way I know it works. Does that make sense?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"All right, bye.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Mine? Mines about 820. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Tom Hopkins is one of the number one sales master in the world for years and years. He has like so many books in different languages now. One of the sales trainers, Tom Hopkins, if his sales number one sales trainer, long time, I used to meet him. Good friends out there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"There my kids to follow, my grandkids be all set, everyone, all my cat, one of my kids to be right. Life changes so fast. Its hard. Its hard for them. I feel bad for them.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"That sounds good, too. I never thought about like that. But yeah, I guess because Ive struggled a lot in my life, too, and Im there again, so I know what I got to do to get out of it. So thats what Im doing, and thats what I want other people to do. Because other people lost their jobs when the 2020 wasnt their fault.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right now, because of the court today, I think was going on, I didnt bring much. I didnt want to show too much. So I will say 50, 60. But I mean, I did a lot of stuff on the side, too.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Yeah, I got five kids, and theyre older. I mean, my oldest is a sheriff. Hes 40 years old. And then my daughter next to them, shes a soccer mom. Shes well, my grandson is a professional soccer player. Lets go. Yeah, he plays for LAFC. I dont know if you heard of them.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I love to talk to people. Theres always somebody thats better than the person. Theres always somebody better than me. So why not learn from people? Because they might know something I dont know, I have no clue of, and its good to know. I like to know everything. Im one of those people want to know everything. And just like I was saying earlier, I like to help them out, the credit, their house, cars, whatever they want. So Im going to have a company where does all that not just worry like, oh, were one stop shop basically. Thats what I want to do.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I can print all this stuff.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Within a year.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"My daughter like to do things, so I know theyll probably take it over. I want to build my own repair thing, and then if they see me doing it right, I think theyll follow me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"He lives down the street from here. People think he lives so far. Im like, no, hes just telling him hes over here. I mean, six years old, signed contract, bought himself a brand new BMW, didnt even have a license yet.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I got a half a million dollars put away.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"I want to go back to high tickets. I mean, I want to do the credit repair, and Ill probably just give to my daughter or something, let her run it after, Im saying, but if I can get focused on something, I like big things. I like to dream big, but my wife never did, so I basically stepped out of that for 20 years and stuff, and now I got tired of it working, and then I get laid off after 15 years in a warehouse Im done. And then she goes up and goes there where hes like, I give up a lot, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Because thats how you get to the high ticket sales. Theyre asking for information, and all you got to do is give it to them and then reel them in, close it, get out of there, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Nothing yet.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Thats why I went to the credit, because everybody had problems with credit, right? So why not help them with their first thing they got to do anyways, understand what theyre doing with their money, then from there, go from there, right, okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Whos this?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"For the court, it was not that Im not going to give my wife something and everybody else, but its not that. Its just that I dont like when someones going to sit there and tell you how you got to pay this and this. Why you dont know what we went through. Just because were not together doesnt mean you have to give up everything.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Right, be grateful, like you said, to.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"When I was young, I dont know how old you are, but in the 80s was the best to me. In the early 90s was the funnest. It was life. But things are changing so fast in life now. Everybodys depending on their phone, their computer. We never had all that before. We had to work our asses off. But now these kids, people shooting for nothing. Now people are going to going places. You cant even do anything, go to work and not be scared if somethings going to go wrong. You know what Im saying? So I want them to have a life to where they can not stress out on money, dont stress out on bills. I want them to live a life, do your work, do a good job and do whatever, but still you have something to fall back on because Grandpa took care of it.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"No, it all makes sense, because if it wasnt for you calling me I trust you. The way youre talking with me, I dont trust everybody. Its just people are fake. So fake right now. Its like, oh, but I could talk to you, right? Youre there. Why not? You help me. You help me start walking. Hey, now Im going to run. Im going to tell you right? Yeah, Im glad you told me about I was going to ask you for your number. You send me the number. Your number on there.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats the way I am.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Friend, Hopkins, lives out there. You heard Tom Hopkins?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Stuff like that. I want to build things. The credit repair is a big deal because a lot of people have problems with that, but they dont work from there. I want to go help them go get a house, go help them get a car. I just think big. I just think like I can help people if youre going to be in front of them, give them everything you got.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I used to work with my friend out there in San Diego. Mike Barron. You were his? Yeah. Interesting. Are you with them?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im one of those people. I like to be hands on first, feel it, understand it. Because if they say it, Im not going to understand it because its something I didnt do. You know what Im saying?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats the first.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I used to be a pitcher, so back in the had a 96 miles per hour fastball. I went to the show like, 1617 different times, but I never made it on the field.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Okay, that sounds good. Right now they just want me to rest for the first week. For the next eight days they want me to rest, make sure I dont stress myself, dont over push me. Right now with the stitches and stuff. Again, they dont want me to strain anything. So the next eight days Im just going to try to relax, which havent done that in a long time anyway, so feels funny, right? But then from there theyre going to start checking my a lot more and making sure everythings good. It looks good. They said so far right now, so a lot better than they expected, which is good. I can feel the pressure in my head right now. I guess its just because its new and I get really bad headaches and get tired real quick. Im not used to not having my eye open.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Im 56 this year, but I want more. I want more. I got my kids, I got four grandkids. Its like Im going to give them everything before I go.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"No, I could just go through the phone, through the computer stuff and then just make stuff so I can read it. No, I just thought it print up or stuff. But no, its all good. And if I stuff I would need to know, Ill probably just print whatever I can.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I dont want it to push over to Im going to stress myself out because, oh, my God, somethings wrong, somethings wrong, you know what Im saying? So I got to try to figure it out and try to understand it, right?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I dont like to waste peoples time. I know how this works, so I hate when people do.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, thats what Im saying now. Ill just say for the first week, for this next eight days, because Ill be going in and out of the doctors, and theyre going to be doing a lot of stuff in my eye and stuff in my head and stuff, right. And then after that, Ill have to go see them once a week. But right now it just happened, basically. So Im trying to figure out Im tired right now. I got to get used to just laying here and I cant even sleep because Im afraid when I move. Well, I did the first I hurt myself because Im not used to it.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, okay, sounds good. Awesome.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Well, thats another thing I was just going to say, too. I got to figure out. I got a couple of people that I was talking to already about it if they wanted to jump in with me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Actually. Yeah. Im north of San Diego. East of La?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, because Ill probably out of it, because if theyre going to do all that, then I aint got to see that.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"So I mean, nobodys been around. Ive always been around a lot of famous people a lot of rich people, but rich people are just as dumb as we are. But they just do their business differently.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"What do you think you can learn? But Ive always done pretty much a variety of things, actually, from car sales to anything else. I mean, anything that can help you better. But I like to find focus on things that are beneficial, where people need it for reals, not just want it. I dont know whats out there these days. Things are changing so fast. You dont know whats what anymore.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, no. Like I said, time is money to me. People that are going out of their way to help you out, you shouldnt wasting their time, because if they did to you, how would you feel?","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Youll get there. If you can give me about a week or so, if you can send me anything, any information, but give me about a week or so, that way I can adjust to whats really going on with my knot, my head, and whats hurting me, for what reason. In my head, my eyes still, in a sense, in the beginning stages of hurting, and I get used to that, and I got to understand it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Obviously I have to do it first before I can build the business, so I can build it myself, but I want to build the business for myself and be able to give to my boys or something. I got five kids.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I want to just do what I was going out to do. I want to make an average 50,000 a month. I want to go build a business. I want to refocus on doing everything else. I want to do it myself. I mean, I can go back to Mike, but if I could do it myself, why not? If I get the right information again and get my head back on straight because I got it right. Ive done it before. Ive done it for a long time. I mean, I was in the financial field for a lot of years back.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Three is good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont know yet. I had envisioned before, but its like a million dollars. Aint nothing anymore. I just want them to be able to where their school is going to be. Residual income, always something coming all the time. I mean Im thinking about buying apartments and stuff like that and then give that to one of my grandkids or whoever wants it, go from there. Theyll have money coming in, stuff like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats adjusted for everything else. But the next eight days is going to be the hardest. Thats it, I think, right. Ill be going to the doctors pretty much every other day, and theyre going to be checking and poking and checking everything out. See, we go from there, I guess. But after the days, if you give me a call or send me some stuff so I can start getting to that, get to that next four weeks, after that, start doing what I got to do. And also I can try to talk to one of my daughters or my buddys Wiser stuff, see if they want to help me out. Maybe they could talk with us, with me and you and her so they know what were doing, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, Im outside in the empire where upland is, ontario Airport is I dont know if you know the area.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Not yet. I hurt myself. Ive been in the hospital for the last few hours. Basically. I got off this morning.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, this is being recorded, right?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, it might, because I got an undergraduate in the morning about nine or ten in the morning on Thursday. But I dont think theyre going to do anything. But if something changes, Ill let you know. But no, that sounds right. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I was just doing credit repairs. I started business with credit repairing because a lot of people are having problems a lot of people have problems with the credit since 2020. So basically I got into that. So I have something where the judges say, okay, youre doing something, because I didnt want them to know I was making I was going to be making 2030, 40,000 a month and stuff with high tickets over there. Its like, oh, you have to pay this much. 25 years of marriage. And I didnt want to get hung with everything. Like, fuck that. I worked hard. She didnt help me. Right now, that all thats pretty much done right now. Im just trying to give focus, and then this happens to my eyes. Okay, lords telling me something. What my bodys like? Well, but I dont know. Life is light and got to wake up every day, right? I cant complain if I didnt wake up.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I want to be showing them before they dont have to follow it, but at least theyll have an idea. Show them what we do, what I do and make it fun. Because if it aint funny and going.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Tomorrow theyre going to be checking out my eye about ten in the morning and they dont know how long its going to be. It depends on what theyre going to do. Theyre going to check it. I know theyre going to have to figure out the stitching part, making sure thats going to be and they have to take out a piece of I have a little piece of my lens that they couldnt get out because my eyes too swollen. So they have to figure out when theyre going to do that, if they could do it tomorrow.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Once I get something going, I know what Ive got. Ill be able to offer it to the right people, you know what Im saying? So I dont want to say something to one person they dont fit right. You know what Im saying?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Do you think you get an LLC or what?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"All right, great. Thank you so much. And I will talk to you soon.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"I got off this morning, yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. My other daughter, shes good at talking with people and friendly with people, and she knows shes always around me the most, so shes always around me. She knows what we got to do and stuff. I love talking to people and helping them out. People dont know what they dont know. People dont know what they dont know. You got to guide them to that point because theyre the ones that theyre asking for the information. Just you got to make sure they get it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Where are you guys at? Where are you at?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Im not going to tell them, read the script, it works and it doesnt. I want to make sure everything I say, I must be recording everything I do. I know Im going to be saying something different every time, but I want the same concept at the end, you know what Im saying? Dont overdo it, but dont change it up too much either.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thank you. I appreciate that so much.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. Because most of its going to be pretty much me. Im sure Im going to have to bring somebody, one of my daughters, or go find me a person that can help me out right away to get me started with that. And then from there build, I guess I got a couple of people in mind, them. Theres a lot of friends of mine that their wives are looking for something to do at home. More at home than anything else.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh yeah, and watch? Yeah, thatd be perfect. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im trying to get used to it, but that way its hard. Its hard to wrap my head around it. And I was like, oh, Im so used to having it. Give me a week or so, and then from there we can start everything else. That way I can relax more and I can get my head what I got to do and what can I do, because I cant really see too much with the one eye right now because Im trying to get used to it. I dont know. Just weird. You never know what you lose until you lose it.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"So thats another thing. And then you really dont have to drive as much, but I got to get enough what do you call it, online stuff so I can people check out your website or.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Right now? Well, before this, no, I didnt have nothing. I dont care, whatever. I was going to go ahead just straight on whatever I need to know. Ill learn from what Im doing as I go. Ill learn what to do better at just starting anything and everything else. Just trying to build and try to get a good website up or whatever we got to do. Who do we got to talk to? We could get people that are interested so they can sign up and get whatever. Right now what I can do is you sign up and get this information, Ill give you a free something with their credit or something. People will sign up just to get that for free evaluation or whatever or something. So I need just builds where I get enough leads. My thing, I guess, right now. Because I dont know if Im going to be able to drive yet. I still got to get used to that now.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So if I can hear people that you have that they started theirs, they helped out and they were there from the beginning, why not listen to them, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats on them. Not me. I like to talk to people that teach them, and I like to teach the people, dont be afraid to talk to them and ask them questions about them. Dont talk about you.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I had a lot of people.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I know my dad did that when we were younger, me and my brother. I made it to the minor leagues in baseball with AAA. So with San Diego. That was great. I loved it. I hung out with the Dodgers back in the 70s on the field with it before a game. I hung out with all the Dodgers and stuff. To me theres nothing like, oh my God, you use this to me.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"I want to watch it because youre never going to get everything right away. So I mean, Ill catch something every time I do it. I mean, I used to watch things and read things, whatever, three or four different times, ten times. Im happy because you want to catch everything you can, right? Thats the way I am.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Youre not going to watch it more than once, right?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I got a lot of friends of mine.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I was just trying to see if I get some information. I could just try not to overthink it right now, whats going on to me, but what is that trying to do? What was it again?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"My grandson, he followed me at the end. I got him started when he was three years old. Soccer.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I got friends of mine that make 11 million, 12 million, 20 million, I dont care. Theyre people. Were all scared to talk to them. Like, why? All they can say is, no, I dont want to talk to you. Okay, cool.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. My challenge right now is I know I went through surgery for my eye. They put 16 stitches in my eye, and thats going to take like, weeks for me to have to go back every other day so they could check and see if its all right. And then Im hoping to pray. I need to see my site back, something. So thats my only challenge right now. They said the next four or five weeks are going to be well, the first 14 days are most important, which thank God I went in and everything else. But theres no blood. Thats what tripped me out. I didnt even want to go because theres no blood. There was all water.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah. So I dont care about people are people. They dont scare me. I dont care who you are. I dont care how much money you are. You still got to talk, you still got to eat. You still can be an asshole, you can be a good person.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, I mean, after I get into it more and more, I get more confident. I get more and I want more and more. Its like Im one of those people where I always want more.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Both at first. That way I know I could do it. And when people say, well, no, you cant do that. I can do it, you can do it. Heres how you do it and see what youre doing. Because I dont like to tell people, hey, go swimming, and Ive never swim.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. I do a lot of little things here. I do tax liens here, and I try to do different things here that I can do. I try to do everything. I dont like to just sit around and do nothing. Now that I got my freedom, I havent had freedom for 25 years, and I finally got it a year ago, so I can do it. And Im doing things. Im just going, Im running. I want things. Im going to do something.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]