[{"pageContent":"Yeah, not only that, nowadays Ive noticed that a lot of people are leveraging not so much doing the service themselves, but accessing, getting paid to have others do it for them. So there are things within the nonprofit world that even if I cant personally do, I have access to a whole team of people that can.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. And then one of the things I was looking at also was this chat GPT, something that I hear is awesome to help scale business. Are you familiar with it?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Man, Ill roll with you all the way to the end and Ill bring people on board too.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I thought you asked about the English classes. I understand now.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Absolutely, yeah. Listen, I just recently got a job in life insurance. Just Im totally new at this. Im just learning as far as getting leads or getting clients or potential clients or something. Just wanted to look into that, see how that works and see if well be a match of what Im doing.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"So now I translate that into what Im doing now. You go to your nine to five. Youre getting a paycheck. Youre doing this, youre doing that. Okay. Whereas its been shown where most people that are and when I say successful, because thats relative to the main success is relative, but most people that have that acquire, right. A sense of freedom and financial stability. Theyve been in positions where its like theyre swimming upstream the Niagara. Its like shit, Im about to drown. I really hear smooth sailing stories transition all the way, but Ive noticed that the ones that stick that out that Im almost drowning. Oh, my God. But its like, keep on getting and then they just flows. Its like they go afterwards because they stuck with that. Let me push. So its like that kind of way I see it, its like, let me see what I really am about. Im taken out of my comfort zone. Im like, Jeez, what am I doing?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"This is what I would say to you as far as that, since youre saying you want to give me this opportunity and you really think I can do well and so forth, if Im able to see that clear path too. Because unfortunately, sometimes we cant see things like others can. Because maybe Kristen gets not exposed to that sort of way of thinking.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You know what I mean? So it takes time. It takes time for you to really get it right. Im interested, and if you put me in a situation where I see which, like you said, a clear path, like yes. All you have to do is do my part. Like, I have to do my part.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Actually, shortly because I got to start getting clients and make some money. The tutoring is pretty much like I said, Im in the beginning stages. The more certifications you get, the more classes you have right now between my trainings and product knowledge and marketing and all these things they need for you to down as far as know how to PROCEED. A lot of time. Then the rest of the time youre trying to get clients right time to do anything else because even they say, okay, you have the weekends, but then the weekends youre out trying to go to events to try to get clients, try to network with other entities that will give you access to people.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"I dont know, between 701,000 maybe? Between those numbers, maybe. Yeah, but what does it take though? How much does it take? What does it take to be effective? What can you tell me in that respect?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I dont know. Okay. I see a lot of things now, especially after the pandemic, all these opportunities that there are for people to better the situation. Right. Economically. Work nine to five, you pay your bills. If you have a few bucks, you go out with your family, whatever. Its like the kind of routine, like almost paycheck to paycheck kind of life. And Ive been there, done that plenty of years and a lot. So I figured, hey, you know what? Why not try to change that? This is the time where theres just so many opportunities, if you know which one, how to go about it online and all these other things. So I figure, you know, what? If I dont have problems dealing with people, talking to people, and I enjoy it, actually. So life insurance, its a way to do that and a way to where you can make a nice amount of money within a months time, legally, correctly, and at the same time, you have people because Im from a social work background, so thats not a money background. Social work is not a place where you right.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Life insurance is basically gives you the most money because like I said before this, I was unemployed, so the interest passes was just something, right? Yeah. But now my main source of income will be the life insurance I need to make the most out of that actually.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Made it on my way? Really turning route or doing better?","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, be a little setback, buddy. You figure it out. You continue. Yeah, I think I can, mostly. So youre saying its my risk level? More or less. Its like investments. If youre going to stock, you got to be able to know that you can lose whatever it is youre going to invest thinking that way, that it wont affect you that drastically, that youre in a position where I lost this amount, but I can still continue operating or whatever I have to do.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, but I need to make it my full time thing because they push towards that. Thats the best way to get the most out of it, I guess. Dedicated time to it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, I need to make this happen. This is my main gig, and like you said, I need to learn how to maximize getting business going. Like I said, the company definitely supports you as far as showing you different types of ways of doing this. But I know if they allow you flexibility to go out on your own and try to, you know you know, and they encourage that, of course, within the limits and protocols and so forth.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, because I think I can do actually both I can work on my life insurance business and still do that, because its not something where I need to be in a place for a lengthy period of time. I mean, I can go in a few hours or whatever, a few days out of the week if need to, for guidance. And if not, within the scaling, Ill have people I know to go in for me that I can pay to go ahead and do it the time.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Theres a scale of ways to okay, I got you.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"I guess I just need to get some more money up and call you back and see how that works.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Not a registered rep. To be a registered rep you have to take these industries essentials and a series six. So right now Im studying for that I pass my life and annuities and accident and health insurance.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"A rough it all depends on how long I would have to come up with the two K before I can come up.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"That doesnt attract me, honestly, to say what attracts me is the freedom that having a good income gives you. Spend time with family, do this, help out here, fund the program to help this, give to an organization to do that, the freedom that a family member needs. This here, something comes up and expected, okay, I can take care of it. That kind of deal.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Maybe I talk more of them, but thats just to give you a perspective, no?","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Also promote what youre doing, your company, basically. And thats where I contacted you because thats what I was doing. I was trying to find research as to how can I myself help promote what Im doing besides what the company is helping me with.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"The business a month? Honestly, like maybe 500, $400 a month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That can happen. And I have no problems with that happening either.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"My background is mostly in politics and social work, so I know a lot of ways to get assistance from the program, from the government and different types of avenues of help. And as far as how to run also a nonprofit organization, just like in politics as far as campaigning and hitting certain zones and how to go about it and time frames and so forth.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Point is find a time, and hopefully if it works out, well be working.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Myself. Like I said, you go with the flow, you tend to go with what you know, and before you know, youre like, wait a minute, have I challenged myself? Can I do better? Or how would I know if I can do better? If I dont put myself in a situation thats awkward for me, how can I get over that? Do I have the UMP in me to do it and the curiosity to find that out too? Im curious to find that out about myself. Yeah. Thats, I guess, the reason that drives me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Believe me, I have people that I know if I do well in this, theyll follow suit. Yeah, whatever I can. Please. I appreciate that. Definitely. Whatever you put me on to do, I would take it very seriously and really seriously into consideration and try to follow through all the way. Yes, sir.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"It.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay, Im going to give you another number that you can use. Also let me know when youre ready.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Thank you. Yeah, I could imagine everyone that calls you has the same attitude, because I figured they call you for that because they want to try something. So I figure thats what gets it to that. Because if youre not, why would you AI for what? Why would I call that for? And I said, you know what? Ive heard of it, but never heard much of it. I said, why not? Let me see. You never know, right. What can come of it, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im not looking to be, like, a millionaire in the next few years or anything like that, but I know sometimes, depending on your efforts, things happen without you even wanting them. Its just result of your efforts. Right. What you apply yourself to.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I was trying to figure out ways.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right. Yeah. So yeah. Its just figuring out a way, hey, how can I do better? Why not? Why not myself? Why not see what Im capable of as opposed to just going with the flow? Yeah.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Let me see right. What I can do.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, do on my own tutoring thing. Yeah, doing my own.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure. Basically is knowledge on what the AI tools can do for you, basically. Is that what it is?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, good Matthew, how are you doing?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah. So this year would be the year where I can have the opportunity. And thats why I thought of the AI to really make some money. Really make some money. And life insurance business allows you to do that if you can scale it, like you said, get the clients. And thats where I am, like, okay, what can I do to get clients? As opposed to calling people, you know, and you start off that way, going through the sources that you know, but how can I get new sources? And how can I be consistent in being out there? You do your LinkedIns, you do your Facebook business. But I was thinking, what else can I add to this? One of the other things I was looking at was I saw this offer. This dude says magazines. Like, theyll put you on a magazine and theyll circulate the magazines to other business owners that you may have some kind of relationship where they can refer to you because their clientele is apt for what youre offering and vice versa. I thought ad was dead. I thought paper ads were dead. Guy was like, no, the use of it that has changed people in order where to use it, how to use it. It changed.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Im actually starting right now to give English classes, so Im getting that together. Yeah.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, please. Absolutely.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right, okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, actually. What am I looking into more? I mean, its something I didnt, like I said originally, think about. But yeah, it sounds interesting. In order for me to start finding out more about this, I would have to come up with the money first, start finding out about this.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. Where Ive been at.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Awesome.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"All right, hold on. Can I value at this number, the nine eight nine number that just came out?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"I was saying I could tell you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Right now, if I keep a steady stream, I can about three grand a month maybe thats without really hitting it hard and getting clients in really hard guess minimal. Three grand a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thank you so much. Thats awesome.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I wouldnt want to do that. Yeah, no, actually, if it is working, then I would be in a great spot, because then its just a matter of waiting for that investment to start flourishing, right, exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Everything is kooky crunch. Right. You know the character of a person on what they do when things are not going well. Thats who you know whos who. Right. And thats who you know what theyre really about, like what their Earth is about. Right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, not too long ago. It was at 649. Its not that high, 650, something like that.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"I think your story is but using what platform? It wouldnt be any life insurance, though. You say you said something else?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Am I what?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"First meeting. Take how long?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Like one k. Yeah, absolutely. So I understand that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"How about now? Can you hear me?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"This is what Im super excited about. Pretty much, yes.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I just started this job, and this is my main income now. So before I wasnt really making much money. That I can really say.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"But I just know I got to keep doing that. I think more or less describes what Im feeling.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I want to see what Im good for. If thats the right way of saying its just that, like you said, I think Martin Luther King I read a long time ago, and I think Martin Luther King wrote down or said I dont know if it was his quote or he quoted someone else, but he said, you dont know the character of a person. Dont take it verbatim, but basically this was the message. You dont truly know the character of a person when things are going well, things are going well.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure. Can you explain that? Elaborate more on that just so I can get a better understanding?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"If I can pull in ten K a month, I think I would feel like, okay, Im moving towards the direction. And let me tell you this when I say ten k, right. A month, I want you to know this, because you have people who are more, for lack of a better word, more ambitious right. In the sense that they want more. Right. I never been looking for a lot money and material things has never been a driving factor for me to do it. And maybe thats where the situation that might be not such a good thing. Right. Because thats what gets people get successful, because of that drive to want that want I want. Right. So that I want to want make me do all kinds of things to get, but I never was one of wanting. Ive always been okay, all right. And deal with what I have, and Im able to make it and keep up with my responsibilities. When I tell you this amount, its not a matter of because I want to get this, and I want this huge house, and I want this car, and I want this.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, you know what? Because this is my WiFi number. Can you hear me?","metadata":{"fillerID":33,"fillerText":"Yeah","category":"E"}},{"pageContent":"Thats ultimately what in my way been in my way the most?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Can I value at this nine eight nine number? Now? That came out from a different phone number.","metadata":{"fillerID":33,"fillerText":"Yeah","category":"E"}},{"pageContent":"No, actually Im in New Jersey, but I use New York. Yeah. Can you hear me?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]