[{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Lets say that usually some products I take thing, like their services. The knock service that we take is going to be based on how many appliances you have and sorry, thats my kids in the background.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"No, definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"It depends on the project. Usually my smallest project is like $20,000 or $10,000.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I think thats based on what Im seeing on the word. Its easily achievable.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im telling you, it depends who is giving me the project, but on average its around that much, 10,000 or $20,000.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"It depends. Last year I made like 60K, this year I made like 30K till now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Mostly the consultancy and the automation one, the network assessment. I dont know if you checked my website.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"For what?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Oh, hey, Jake, how are you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I could I could put if you if youre telling me I could make, like I dont know if youre telling me I could get, like it depends how much is going to I could put 50K easily.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Thank you. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"It depends. Like some project, I take it as a bulk. Some project I take per hour, we charge $250 per hour. Usually thats our hourly rate. Its less than the market. The market is 350.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"If it starts making a million, I would be able to take it there because I love what I do. Its fun for me. Im sure from the way youre speaking, you love what you do and when.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Its an it consultancy firm.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Exactly. The only thing that Im worried about is just the consultancy part is not constant. What I need to do is but Im making a million a year. Im not complaining, like you said. Exactly, Mike.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"If youre that confident that youre guaranteed could we set up a call some at different time? Could we set up a call, like, maybe any day after 03:00 P.m. Pacific?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Its pretty good. Its up there. Im making good amount of money.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im sorry, but I need to drop off. My wife needs to go back to work and I need to take the kids. So if we could set up a call around three, that would be great. Any day.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I just didnt want to share so much information like those personal yeah, I get it.","metadata":{"fillerID":16,"fillerText":"Ok gotcha","category":"B"}},{"pageContent":"What do you mean that cost service that cost $3,000 and above?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Exactly what Im trying to do.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, a year. 400,000.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Realistically, I could make a million easily. But the problem is with just if Im able to get recurring customers, like if I get ten NOC services, I could make at least three or 4 million a year.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, my business is still very mall. Most of my clients are acquaintances. Its relatively small. So I wanted to see if you guys could help me. You sounded really confident on the ad.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, minimum.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"It services. So our field is mostly acquaintances. More than actual or thats what I think. I dont know.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im trying not to give you the number. Okay. Around maybe 400,000.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Is like last time you checked its in? The 800.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im the top 5%.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"ThatS after tax.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Do you have a team thats helping me out? Its not only me.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Realistically, my network assessment is basically a consulting service. So the network assessment is dedicated to network to like, come in. So thats what my biggest I told you the two that Im really my niches, my expertise are the network assessment one and the network automation and the automation assessment. So what Ill do, Ill come to a company thats around, I would say between 100 till 10,000 users. Ive worked with even companies bigger or university, and I come in, I check the network from the wireless to the switches to the routers of the firewalls, and I end up by creating a report for them. So this assessment, usually it depends on the size. My first project was around 5000 users. I charged them, like, I would say around 15K. All right, so thats one of them. And then I work now Im working for a retirement institution, I charge them 20K. Their network is a little bit more complex. So I do have those niches, like those consultancy packages that youre talking about. Im already doing that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Mostly, if you want to say that. Yeah, Im starting to working on my marketing funnel, but yeah. So mostly its friends. Yes, youre right.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And what Im really interested on, and what Im really interested on is the NOC services. If youll be able to help me with the NOC services, Ill be able to like my plan. I have a couple of colleagues in the Middle East and a couple in India, so Im able to set up a support network operation center, like 24/7 monitoring for a customers network. So that also I like to grow or get customer for. But also that service is also hard to get into. Right.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Before tax.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"That sounds great. Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, it takes longer because I have plenty of questions myself.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Like the thing that Im worried about, dude, Ive been trying it well, Im not an expert. Ive taken multiple courses now and I just dont want to lose money and dont see results. But the way you write your videos, it was pretty reassuring. So I dont mind spending more on marketing.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"This month approximately like 30, I said. So its like maybe ten grand.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Business, I have more, but thats how much Im willing to right, like bare minimum?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"It wouldnt change a lot. Im pretty well off, but it will change for sure. The important part is I love what I do. No, its definitely Im making a good amount. The business is something on the side that I would like to make it more a full time thing. So its not something that its just something Im spending not a crazy amount of time on.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Of them are my friends or people Ive worked with that need some help with a particular niche that they dont know how to do. So they reach out to me.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay. So on my website theres like the network assessment one and the network automation one are the one that mostly that generating the most. The consultancy part is the one thats mostly hourly and its somewhat small, relatively.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, this year Im making but thats just because I got a project from the beginning of the year. Next month I have nothing. I may have something in July thats coming in. So I just want it depends.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]