[{"pageContent":"I was actually destitute and uneducated, and I used the very tiny resources I had to buy a semi truck, and I just named it and I figured it out. Yeah. So thats how I got that is crazy.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Im sure one of my VA done this. Im sure it wouldnt have me.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"In the morning?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Of course I know who doesnt know who Tony Robbins is?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Ive never heard of this person.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay, thank you. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Or how my team doing?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, thats fine.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Unless hes your dad. Unless hes your dad and hes going to be at the dinner table with you on Easter Sunday, it doesnt matter. Im telling you. Ive been in business 30 years. You know what Im saying? You got to hear me on this. Ive been in business 30 years. I started my business with a welfare check. My welfare check was $440. I used a $400 and put down on the truck for $1,000 down payment. You cant just tell me anything. Of course I know who these people are. I havent been under a roll. Ive been building a business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont know.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, its not. I had a girl, she actually just quit last week where I paid her a heap shit of money to start running ads for me quit. And so Im sending messaging her saying, okay, I gave you money for the ads, and Im looking at my Facebook ad manager. Theres nothing scheduled. Nothing. And now, of course, you wont talk to me. I had two people do that. No, Im not kidding.","metadata":{"fillerID":39,"fillerText":"Yeah","category":"F"}},{"pageContent":"You giving me resources has nothing to do with nothing its something that you want to do. I dont feel like you need to probe any further than what you have. I think I gave you more than enough information. But whatever you want to do from this point is fine, but I am getting ready to exit the call.","metadata":{"fillerID":38,"fillerText":"Ummm yah","category":"F"}},{"pageContent":"I was having so many freaking calls. I think thats what Burke me. But I know what youre saying. When theyre not really qualified, 1 million%. Then youre right. Its going to be the wrong type of people on the phone. Sure. I dont know. Ten would be max that I would even want to deal with. I just dont like people dumping their shit on me. And when women get on the phone with each other, they dump their shit on them. And Im a trucking business owner. I dont want to hear female shit dumped on me. Im still running the trucking business. You see what Im saying?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Texas. I live in Texas, and I live in Maryland. Ill be in Maryland on Monday.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, perfect.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Im good. From where?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Ive never ran ads before in my life.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So I hire millennials in the shoes of you, right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hi.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, absolutely. Its automatic. Yeah. But anyway, you go ahead and continue.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Like I said, Im sure it was somebody on my team, because we sell online courses, so Im quite sure theyre trying to figure out how to use AI to help us with more sales.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I really lost a passion for it last year. I took a year off from the teaching aspect of it because I kind of lost the passion because it was just so heavy with so many peoples issues and stuff like that. And so Im just now coming back into it, and so I just tried to start rebuilding a team, and its just makes sense. Getting all the wrong damn people. I tell you where Im at.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I teach women how to start their own trucking business.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, Im here. Im going to have to get off the call though.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Ive been doing it my whole life, but its had a huge demand. Ive been teaching this for three years, but Ive been in the industry for almost 30. Wow. Yeah. Lets see here. So, currently Im in the middle of a launch, but anyway, if you want to call it that, our class starts on April 15, so thats a $30,000 mentorship that I have. But like I said, its not going nearly as great as I would because I end up switching out some team members that werent working out. So it was the wrong timing. But anyway, it just is what it is.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Hopefully that makes sense right now problem? Yes. Something I do want to solve right now. Yes. Because I would like to get more people enrolled into my course for next week. Yes.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"On the phone with me and say that youre a sweet guy. But I hear this 25 times a day. We do a million dollars a month. No, at least 25 times a day, everyone tells me the same fucking story until I can go into your bank and sit down with your banker and look at all your fucking statements. I cant fucking believe that shit. And people are more than welcome to do that with me, with my trucking business. But everyone says this. Everyone has the same skill. Everybody. Show me something different. Ive been in business for 30 years. Show me something different. Nobodys showing me nothing different. Everyones saying the same thing with nothing to back it up other than a great personality. Thats the reality.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, Ive changed the price on it more than once. Like I said, I had a mentor when I first started, so we had a smaller price point of like 29 95. Then I ended up doubling it to like 7000 699, 95, but that was for its called my 90 Days to Trucking Program. But what I learned at the end of the 90 days, yes, they have a trucking business, but they still need so much more help, and I didnt have a real way to support them. So when I restarted this time in January, I put together a whole new plan where I want to have a twelve month mentorship. And so thats how I ended up at that point.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, I still have my Facebook group, so Ive always popped in there every blue moon, and everybodys still there, so it still kept enough momentum, I feel like. So since Ive been back trying to say, hey, jumping in or give a free training, right? I did a free training and quite a few people signed up for it. And everyones like, are you bringing back the 90 Day to Trucking program? Im ready now. I still get those kind of so when I first started at January, I took a retreat, and I went to a retreat and got all my thoughts together. And so then I came back. So in February, I started having someone just start posting again, putting stuff out there. And so the people whove been following me. Theyre like, oh, my God. Welcome back. Do you still offer this program or that program? So Ive done nothing other than just kind of start back, just putting posts out there, and then I did one free training.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"From Monday. Okay, well, anytime for ten minutes.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Basically, I set up a social media and all that kind of stuff, started hiring people really quickly. So thats how I got going with the teaching aspect of it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, Ill most definitely try to get around to it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats funny, because during the Pandemic, everyone was home, and I was, like, the only person that was still running my business every day. And everybodys like, what do you do? Again, can you show me how to do it? Of course I can. And literally the first week of the Pandemic, when everyones home, I literally took on, like, 17 ladies that one week. And I helped everybody start their trucking businesses and just started just kind of getting wind. I didnt even have a social media platform. That was the crazy part.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I got something just came up. Im going to have to go ahead and get off the call anyway though.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}}]