[{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And it just crashes.","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}},{"pageContent":"Decent credit score, so we can probably secure it. Im fixing mine back up. I dont know where his is, but if we probably could do you guys already have a list of people that you guys usually recommend for financing or do you guys have a creditor, non credit investors that might invest? A lot of times there might be a non accredited lane that you guys might have for people who are interested in this type of startup type of stuff. Do you guys have lanes that we would need to find our own lane?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I know you said youre now heres the other way. Would they take the credit from another business? So like the deposits from another business that were running, could you run it something like that too?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, we can definitely put that together.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Got you. Thats dope. Im sure the more help you guys are providing private, the more you guys want on the back end for your services type of thing. No, this is definitely interesting and hold on, I was thinking of something else when youre talking. Sorry. Yeah. So what would you guys like to see somebody have? Do you have a script of things or a goal sheet? Like I said, Im not from the coaching business. I do service, but Im looking to get into the coaching business. We have an idea that I have an idea. I would like to bring a life with a partner. Do you guys have a set of goals that, hey, get these things done and back to us and then once you have this, we can talk and we can help you out a lot better.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Can you send us the video?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"You guys are flexible.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, I didnt really know what you guys did. I dont know you Im saying, if you guys are providing services, thats basically in our business, but were kind of tapping into the AI thing, and you guys had a pretty good marketing ad that kind of caught my attention. So thats why I filled it out and was seeing what you guys did.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yes, I definitely would.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. Work that out.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So it sounds like you guys are working on some type of it sounds like its going to be some type of percentage in the play.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I have a moving business, and then were opening up our freight and logistics site.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Im not going to say the name of it, its a really strong brand, but what were calling it is basically hold on 1 second. Sorry man, I got a call coming in. Yeah, but were calling it like a lifestyle coaching brand which will cover a couple of different things. Its an idea basically. Like we would like to draw on a network of people that need help in array of different things within this area. And we would allow people to either cross market their brand on there once we have a big enough database of customers. Like, lets say if somebodys not too strong on a YouTube or Instagram or Facebook channel, but they want to start off to get a following to come to us, they can be able to come to us and position themselves to sell their product in the area that were coaching in. And then we would also have our own tutorials and stuff like that in these areas. And we would also be able to maybe tap in at times once we get more established to have people who are already veterans or well experienced or masters in these areas. Be able to come on and give little seminars or coaching programs, which of course we would probably have to pay them out, but then they can get a return based on trying to say, like the royalties or from the views and stuff like that or whatever percentage of the subscriptions or something. So it would definitely be subscription based.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hold on, I lost you a little bit. Go ahead. Now youre there.","metadata":{"fillerID":33,"fillerText":"Yeah","category":"E"}},{"pageContent":"Yeah, we can definitely put that. Now whats usually the startup costs on things like this? 5100?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hes wanting to do whatever.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And I dont want to get too much into it right now, but you dont see it because really the only.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Got you. Okay. Got you. And then after the twelve months, do we decide if we want to come back and go into a higher pack or thats just what it is, twelve months.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Would you say your top guy was making what, a million?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right? Work that out, and then Ill let Vince do his thing based on trying to figure out what this family if we can make it happen for 01:00 P.m. And then if not, then what well do is well schedule for a later day, maybe later on that week or early next week.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I got to see whats up with the misses because I cant do anything in the morning. I cant do anything, actually, all the way up until noon, for sure.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Should be able to run on our own.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No. Contracted with you guys?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay, I get it. Im not going to push you to go down the line if you dont want to.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"But bringing it to life bringing it to life is wed probably need some help bringing it to life.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Hold on. Merge.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"If it doesnt cost us anything. Like I said, this wasnt like we were planning to kind of put this into play maybe six to eight months from now, but like I said, because I have something else going on. But at the end of the day, if this makes sense, were going to start moving on the opportunity now. Even if it takes us a month or two months to start, were going to start rolling it and putting this into play.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And you dont know, on average, how much does this cost a year for some people?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Thats easy, right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Now let me ask you something. When were working with you guys, we would be contracted in with you guys for, like, a year or two or whatever like that, and you guys are, like, holding our hands through the way?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"We definitely have. Thats something thats something we definitely want to get into. And were actually trying to master and perfect a couple of different skills right now to start to do that. But that is definitely something were interested in, that is on the bucket list of goals to get going.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I already have another business. So if I took the funding, if I got fund, I can use the business numbers like were investing and starting a new business or something like that or have to go from a personal.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hey, whats up, buddy? How are you doing, man?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I would definitely be interested.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"T-R-U-K-T. Yes.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"We have something, its a lifestyle coaching program.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sounds good, man. I appreciate your time, Jackson. Hopefully you can make it work on Wednesday.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I guess that would be the solid. All right. And then, worst case scenario, can we call you Jackson and then reschedule it?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right? Okay. Yeah, lets do that. Just because I would like to just take action to get the ball roll, but I dont want to get charged $100, right?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Whats the name of the company?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, dude.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yo. Hey, how are you doing? Whats your name again? Vince. I just merged you on a call. Whats your name again, bro?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"All right, thanks, man.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Its hard for me to arrange. Yeah, lets just say somebody like, we have an idea and were starting it off and were like, hey, can you guys let us know if this is a good idea? And we would like to partner with you guys to help us grow this and scale it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Jackson. Vince, do you have Wednesday available? I basically started reading some stuff about some AI, but anyways, this company called me back, and what they do is they help basically, companies get off the ground. They try to start coaching programs and give him a quick little spill real quick, Jackson, if you can. And theyre trying to schedule a meeting with us on Wednesday. This will be my partner, Vince. Like I said, this was something we kind of was going to slow out do and can still, but it was a little bit further down the line. But this dude called me and he started talking about a bunch of stuff and it sounded good. And they want to schedule a meeting with us. Can I give him a rundown?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You kind of call it on time like I said.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I think its only like a 620 or 600 or something like that. I got to do some repairs on it right now. But see, the thing is what happened is why they probably wont touch me right now too much is because I know the credit market is a little bit tight. Is that before about three or four months, I went through a hardship with my other business. So Im relaunching that and then starting a freight side. I already have a moving business in San Francisco and then were starting a freight broker business right now, so thats all kind of in the works. The coaching thing was something on the side, so I went through a hardship. So my personal credit, I know, has some dings on it. Thats within the last six months, and a lot of times lenders want to see things as clean over the past twelve months, but its a little different on business credit.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hold on. Im going to call him on three right now.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Got you. Okay, so what he wanted to do was basically Ill run through some more of the stuff we spoke about. He said its about a two hour video and then we can basically understand what they do a little bit more in the industry and basically what they would be providing to us. And then we would have like an hour long conversation with one of their people to discuss what our plans is and if. We can put something together right now. Like I told them, basically, this was something that we were probably thinking about. We were slowly going to build out, probably thinking about launching a little bit later on down the line, but its something we definitely committed to. But if it makes sense and you guys can definitely provide a faster lane for us to get off the ground, Im sure it will help us put some more focus and energy and attention towards it all. He said they can have a call for us on Wednesday. At what time, Jackson?","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"We schedule out for a later? You want to just schedule it out for a later?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Send me that to me too. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"You know what we should do? I was nowhere near expecting this, but like I said, Im really interested in this conversation because this is something we want to do. The guy who Im starting it with, maybe we should get him on the phone and we can just have a brief conversation like were having. Because if he hears this too, then well probably put some more fire behind it and we can see how we can actually get it going because we would definitely, probably want to partner and do something with somebody like you guys because you guys already have the experience. And we would want to work with professionals that can help bring it to life. We dont know what the fuck were doing at this point. We have an idea. You know what Im saying?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Got you. Now what do they like to see? Do you know what they like to see? Like 680. Twelve months? No. 30 day lates, no NSFs. Whats the criteria? Thats kind of like what I was asking you for saying. Do you guys have a build out sheet to say, hey, look, this is what you need? Because if we dont have it right now, I would keep your contact and say, okay, look, I spoke to this guy, this is what they do. Lets get here and contact him back in the next six months or whatever, or lets get somebody that we can put on the business.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Weve never been in this business. We see it happening a lot and I just have some people that are very passionate about what theyre doing and theyre mastering their skill right now to basically be able to coach and educate people on how to do to be as good as them or get them off the ground.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right. So question. You guys help give basically the map and a plan, or do you guys partner and come in and how does that work with you guys? Because that is something I definitely want to do. We actually already have a name and somewhat of an idea for our coaching business, and it started to get off the ground a little bit, but give me a little bit more insight. It might put some energy into it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Up, they can fall off. Right.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"04:00 p.m would be 11:00 p.m would be.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"After they pay the 3000, if they fall off, thats on them. We already got our money.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hold on. All right, so you can go there with me. I kind of understand business a little bit. What do you guys take? Because if youre saying we can start with like $1,500, thats nothing. You know, Im what saying that can be put together quick and easy. So at the end of the day, I would like to just know some real numbers so I can go back to my partner and say, look, this guy says if we had six months of 2000 or fifteen hundred dollars a month, which would equate to this, lets get this and then we can work with them. What does the number somewhat kind of like look like? Yeah, because I would be interested in speeding up the process.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im in San Francisco. Hes in Hawaii.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Results like what youre talking about. Typically the biggest now youre speaking business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, I got your text.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"The sky is a limit. Lets do that. Real life perspective. We wasnt thinking that much, but you know what Im saying? I dont want to cut myself short, but if we could make a couple of hundred thousand dollars a month, that would be great. $100,000 a month would be great. Lets say 300,000.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"You want to pick a time? V can you do it Wednesday? I got to check first, man.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right. No, this is interesting. This is actually good. Were not there right now, so I wouldnt probably waste your time too much on that. But for the fact that I just had this conversation with you, like I said, its probably going to allow me to put some more energy into it. What were thinking now, you guys basically like, nurse the situation. You guys are providing your AI systems and success plan. What is all this type of stuff? Usually run a company and do you guys prefer to work with startups or people that are already established and running and been through some kinks and bumps and stuff?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}}]