[{"pageContent":"You say you are with Air, right? Air AI?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, I dont.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So I also offer notary services. So I notarize documents for people, people who are buying houses. I can help them with their package from the title company. So one of my idea is to turn that into a business where I can add all kinds of forms on the forms that people will be using to notarize documents. So the idea is to help somebody who is new, lets say, in the notary, to help them take care of any customer they have. So I would have the course to show them how to do everything from A to Z and every form. Lets say they have a form for someone that, lets say, somebody wants to divorce. They want to get to know how to do it, what form to get, where to place the stuff. As far as notarizing the document, I want to show any new person, I want to show them how to do it. The idea is to sell like, a bundle for an amount, and they have access to the whole course. Whenever they need any explanation, they get access to it. Lets say they get a customer for Form A, and two months down the line, they need help with that, theyll get access to it, or they need Form B or Form C. So my idea is to put all kinds of customers and circumstances as part of the course. And if you need help, just go on the course and search for the form. They find it. I wanted to make it like a business in a box so they just have access to it. And whenever they need to get certain information, they go to it. So thats one way I want to do it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, I dont have that. And thats part of the idea. Thats why I wanted to offer that service, because that way, lets say somebody who is new, they should not face a challenge of not knowing what to do or being scared that theres no one walking them through. I want to offer that to them as an option, making it easier to get into the business. I dont have that yet, but with that kind of idea, I should be able to generate some kind of income fairly easily. I just have to put the stuff together and then start offering it. But with enough capital backing me, that would be faster booster to get to the goal.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"That sounds good. So whats the minimum credit score to have to be eligible for service?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Course I want to because, for instance, I see certain courses what Ive done is Ive looked around and I said, theres no one offering that. And some people, they actually create certain forms. They create videos on YouTube and show how to do it, but they dont have everything together. My idea is to just which Ive done so far, Ive gathered about over 50 forms, videos about them, so I can look at how they do it and do something similar. Yeah, Ill be very interested into doing that because its not yet available. I want to make it affordable. That way I can draw the highest amount of where I can initially so I can be profitable and then slowly increase it to a high ticket item. Thats the goal.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"If someone needs to do background check, we can do that. And Im looking to scale because there are two ways to do fingerprint. You can either use the card, use the old way by using ank and card, and somebody you can use their fingers to just put the ank on it and then transfer it to a card. Or you can use a machine to do it electronically, which does it faster. If someone needs, lets say, more than one card, I can just do it once and then print it all times with the machine. But if Im doing it the old way, I have to do to put ink on the fingers for each card. So lets say they want seven cards, I have to do it seven times. If they want ten cards, I have to do it ten times. Like ten cards. Thats with the old way. But using the machine, I can do it once and reprint it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"What got me interested in Air, you say?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I offer fingerprint services.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"How much charge for that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"All right, you too. Thanks. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, I see. So youre just part of the marketing aspect of things.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"All right, that sounds good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I forgot when I saw it, but its either the special that you had or some kind of feature that youre offering that Im interested in.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right. Whats the percentage you get once you invest?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"How to do the business?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, us.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Into the business? Meaning if you were to invest into the business.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay. All right.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, I know its low right now.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}}]