[{"pageContent":"No, because we operate on contingency, which is that we only get paid if we win. So when people hire me, they pay nothing, and then I only make money after Im able to get the recover for them.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Absolutely. I operate a portfolio of companies, but the first company that Im looking to really invest heavily into getting AI built in is a law firm. So I operate a law firm here in Florida, and we have 48 employees. We handle whats called property insurance litigation. So we basically just sue insurance companies left and right. Whenever an insurance company does something that is inappropriate, that affects the company. Were like the consumer protection. We go after big companies for humans. But what that requires is we have a lot of paperwork, a lot of analysis, a lot of client updating, a lot of information that is nitty gritty and that is systemizable, but its a little bit too complex for automation. But it is not so complex for AI. Wouldnt be able to figure it out. And what Id like to do is incorporate AI into as much of it as possible. So when I ran into your ad, your ad was about a lifelike AI speaking model. And that was interesting because I watched the videos that Google put out of their AI google bot, and it was fantastic. It was speaking as if it was a regular human being. Like you couldnt distinguish reality from you couldnt distinguish whos the human, whos the AI. So Im curious to see if thats kind of like the integration that you guys offer, because Im certainly interested in getting lifelike sounding AIS that can help me relay information to my clients.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No ads.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"At will? Well, its very simple.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Absolutely. Thank you for calling.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Well, I mean, its hard to answer. I dont really have a number. I have capital, lots of capital. As far as how much Im able to put in, it really depends. It depends on what the purpose is, because even if theres, like, a project that goes beyond the capital reserve, I know Im able to get it. My capital reserves, Im able to put in a pretty significant amount. But it kind of all depends. It depends on what it is that Im getting back, like, offhand right now, how much I would feel comfortable investing. Its too open ended for me to even give you a realistic answer. It would totally depend. If you guys can generate something that can help me accomplish all my goals, itll be an infinite amount of capital. If I have to put millions down, well find it. But it just completely depends what Im able to locate and find and invest. Depends on what kind of return I can get and what you guys can develop.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I am. Im in Florida.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah. Client acquisition perhaps one of the few businesses where client acquisition is not an issue, its fulfillment that is at the core of my issue.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, go ahead.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, for that, its Tedious, because we have a referral based business. Give me 1 second. Im going to give you that answer in 1 minute. Hold on. Give me 1 minute. And, like, you know all right, so sorry about that. So in terms of sourcing organic leads that are at will, its complex. We do very little of that. We basically do none of that. What is it? She did have an issue in terms of generating Adwell contracts, it really depends on I mean, it is dependent. Its completely referral based. So my entire business is referral based. So we create B, two B relationships with locals in our industry that do what we do, that deal with property damage and whatnot, and then we have them refer business to us. So we will generally create those strategic relationships, bring them value of some sort. I will either assist them with training their staff, with support, back office support, et cetera, and in return, they will begin to refer all of their clients to me. And that is how we basically acquire 100% of our business. We do no marketing right now, and part of the reason is because were so saturated some clients coming in that format that we are unable to market. I have beautiful commercials Ive made, I cant publish. I have so many seminars that Im invited to speak to that I dont go to, and its all because I cant bring in more business. If I bring in more business, we crumble. I need to be able to fulfill the responsibilities of our service quicker, more efficiently, so that I can scale it to the level that I know we can get to.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Just give me 1 minute. Dont hang up. Give me one. Im so sorry about that. You were saying that when I meet with them and you were going there when I cut you off, go right ahead.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Oh, yeah, I definitely want to. That sounds like exactly what I want to do.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Absolutely. We are trying to integrate AI everywhere we can.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Because thats an interesting question. Theres so many facets to it, because I could either tell you how we acquire them, or I could tell you what we do when we have them. What are you most interested in learning about.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Did I receive a copy? I actually dont know because I have not checked my email, and I know that I submitted my request perhaps a couple of hours ago, and Ive not gone back to my email, but I may have. Im looking at it right now, and I see Paulina request for information, but this isnt you guys would like to request? No, I did not receive anything.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, my credit score is usually like around 767 70. But I just had a small issue where I had a vehicle that was stolen from one of my properties, and the vehicle was the people who stole it crashed the vehicle, and then the vehicle needed to be replaced. And it was a lease. The lease expired and the repairs werent complete. And it sounds like there was just an issue because this happened maybe eight months ago. And just last month, I go in and my credit score drops to like a 696, 80. And Im like, what the hell happened? And for some reason, the bank, they recalled the vehicle and sent it to collections, even though I gave them the vehicle. And my insurance company covered all of the damages to it from the theft. So I dont know, but its like a minor fix. I already hired a company whos doing whos fixing my credit, and I expect that to be addressed in the next 30 days. But absent that, I have good credit, I have good 787, probably 757, 60 has been my typical credit score. And then as far as securing capital, Ive never worked off debt. I probably spent 400 grand a month on my Amex, and I pay it off every month. I pay it off weekly. So I dont accumulate debt, but for the most part, Ive not been big on using debt, but Im certainly able to access capital and access funding if I needed it for a project.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"So in terms of if I have to relate that to our business, because what we do is well usually get a request for service and we make contact with the client, and then we usually convert them. I would say theres about out of ten people, nine of them convert you gave me, and theres one that doesnt. Since everything is referral, once it gets to me, these people are ready to sign up. They want to sign up. Its very rare that they dont sign up by the time they get to me.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, I have two dogs. I have a Chihuahua. And I have a Maltese. Theyre like my daughters Chihuahua. Yeah, and shes like the sweetest chihuahua in the world. Oh my God. Shes like my wife had a Chihuahua when we were just dating and that Chihuahua was like, vicious. My chihuahua is literally the sweetest Chihuahua. Shell never bite you, shell bark at you, but shes so sweet and ridiculous. But my date tomorrow, Im looking at it and my day is like nonexistent. Its jam packed. I dont have any availability until Monday, May 8. That is my next available day.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"A lot of people are like, okay.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Strictly referral. I run no ads.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"My income is probably shy of well, in terms of reported income, probably five or $600,000 a year. In terms of, like, actual net income is probably close to a million dollars is what Im taking home per year.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So heres really my thought process and you can give me your raw feedback on this. Please do. Actually, I can set you up with a full 60 minutes long consulting session with one of these executive consultants, completely complimentary of Air. So Ill waive all the initial entry fees that come along with it. And then after you watch the training, you can just really pick their brain on the questions that you have and truly just understand how to implement these systems into your business so that you can get to that $2 million net revenue faster than you ever thought. But thats really as long as you truly see it being a needle for you, do you see that being a net positive if you were able to sit down with one of these experts?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, 06:00 P.m., lets do it. No, that sounds fantastic. What are you doing? Get inside. No, that sounds fantastic. If we could do 06:00 P.m., thatd be great.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Okay. So that actually might be an issue because as I look at my schedule for tomorrow, Im basically booked from 09:00 A.m. Through 05:00 P.m., so Im only going to have about an hour between my last meeting and meeting with the executive. Should we book it for later in the week so that I can watch the video first?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Okay, perfect.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"My last meeting tomorrow starts at three. Itll be done by five. So 530 tomorrow. Im ready to go.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Oh. Hey, McKinsey. How are you doing?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"You know peril.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No. I agree with it, and I consent to it.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Theres never enough minutes in the day.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Hi. Whos this?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I am Eastern, correct? Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Tomorrow? Tomorrow is MRT. What is this linguini? Who are you barking at? Hey, Alex.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"See Caleb and Ryan in meetings with them, sometimes just for hours, just really pouring into them. And I even often see Caleb and Ryan go directly to them, even when theres constraints for our own internal projects, which is you dont see that often whatsoever.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Awesome. Well, Im very excited for you and definitely keep me updated tomorrow night, okay. Because I will 100% still. Be working.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"We are in Florida. Im sorry. Monthly revenue. Im so sorry. We do about 800 to 900 a month in revenue, as low as perhaps 450. Some months, 450 to 550. But on average, were doing, I would say $600,000 a month is our average.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"I definitely want to watch it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, we want to be doing 100 million a year in gross revenue, you get me? So that we can be taking home an average $20 million in net profits per year. So divided that into twelve, then I would call it probably shy of 2 million a month in net revenue, and then about 12 million a month in gross revenue. And I can do that. I have the network to produce the business that could get us to those numbers. What I dont have is the ability to execute and to fulfill the requirements associated with bringing that much clientele. We have access to an endless pot of clients based on the years of experience weve had and the network created, but we dont have the ability to fulfill those services. But AI creates a possibility where if I can get AI into every facet of my business, well, I think I can. I think with my same team, I can probably do double the amount. So if I double my team and I can quadruple the amount of business were able to service, then well, I mean, that is a tremendous value add.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes. So I operate another company. One of them is a real estate investment company, and that company is focused on finding off market and motivated seller leads. We vet them, we acquire them, and then we use some format of creative finance for acquisition, and then we move on to an exit strategy. So it is a buy and hold business. All we do is buy real estate for the purpose of holding real estate. And for there, theres definitely some integration that Im looking to there, but its not as prevalent as my law firm right now in terms of demand, but that would be a next step. I would be looking to integrate solutions into my real estate business. And then after that, I have a restoration company. This is a company that focuses on providing post emergency restoration services. So we do tarping water extraction, mold remediation, mold assessment. We offer that across to all clients across state of Florida, which is a big business down here in Florida because we get a lot of storms and a lot of floods. So that company I have is constantly busy. Yeah, theres a lot of AI there thats necessary. And then my other company goes by the name Guardian, and its a subscription software where we essentially offer bundle subscription packages to homeowners. So here in Florida, for instance, if a storm hits, if a hurricane hits, you end up having to hire a team of people to back you up. You end up having to hire Mitigation providers, attorneys, public adjusters. You need to because if you dont, youre not going to get the money that you really need to fix your house because insurance companies are constantly trying to kind of rip people off and pay as little as possible. So you need a team of people behind you to get you what you really deserve. But the laws just changed in Florida January of 22, and it made it so that whole process became extremely expensive for Florida homeowners. So my company, Guardian, will offer a basic subscription package where you pay a monthly fee. It ranges between 79 a month to 129 a month. And if something ever happened to your house, you ever have a damage, a hurricane, a storm, a flood, an issue, then our product is called Claim Guard. We come in and we guard your claim. We do everything necessary in order for your insurance company to issue max payout. If the insurance company is not issuing max payout, our lawyers go after the insurance company, force them to issue payment. And then once that is done and we collect money for the client, the money goes 100% to the client. We take nothing. So that is my Guardian business, which is perhaps my second biggest business in the portfolio. And then thats it. We do Rentals, our acquisitions company, our real estate acquisitions company has a subsidiary that deals with just the actual properties that we rent on airbnb. And those are basically all my portfolio companies. And I have a boat chartering company, very minor boat charting company with a small fleet.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. How about we do APS? Thatll give me some time to be able to watch this video.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"There you go. Its 10:00 here. But I never stopped working, so this works for me. Love it.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Okay, awesome. So heres kind of how the call will go for you. I just kind of want to give you a quick breakdown of it. Theyre basically just going to dive deeper into your business.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Love it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sorry about that. I had my dog here barking at my name.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Not at all.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Excellent. No, Im just curious to see, Im curious to know what is the specific AI integration that your company can affect? Shui and then once I understand that, itll be very easy for me to identify the different elements in my business where you guys could add value, and then thats where Im looking to start from, figure out where I can plug you in and then get a proposal going for that kind of integration.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Let me know. Yeah, because I definitely would love to do that. Okay.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Awesome. Have a great night.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Love it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, I believe it definitely can be done.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, I do everything myself. We can do it all together. I dont have any partners. I usually just run everything myself. Always.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"But Im also available weekends. I dont know if you guys are available weekends and Im also available late. So today is the second tomorrow I am available, but its like late. Like after 05:00 P.m., Im available.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, I would say 600 is average. Yeah. And were aiming to really increase that across the board. And AI is a big part of that because our inability to do more is not because of a lack of clients, its because of a lack of ability to digest the work. Thats why AI is so important, because if I can get this work done faster, I can double my business because I have clients waiting at the door that I have to say no to.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Because youre hour ahead of me. Correct. Okay. All right, so I did lock in that 08:00 P.m. Tomorrow night, and honestly, these conversations are really life altering. So if you just can please do me a favor and just keep me updated and let me know how this call goes, see what we can do for you. I definitely want to be the first person to know how it goes because it really just makes my job as a client success manager just really fulfilling and gratifying. And I will definitely be sure to share all my notes with your executive consultant. Other than that, do you have questions for me right now?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]