[{"pageContent":"So he defined that in greater detail. Im somewhat naive to it, so my brother and I are both working finance. Were pretty busy. Hes the CFO of a public trade about tech company, so hes got very limited amount of time. So thats part of the reason we thought about this almost five years ago in Amazon FBA, and that would have been a good idea because one of our friends did it and believe it or not, he started with a bedbugs product and he scaled it to about a $10 million business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, it really is. I just moved here, like, a year ago, and its been the best decision of my life, especially.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. So we dont have any of that. So I was watching a YouTube video and I put in my email and then I was getting calls, so I wasnt quite sure really what it was.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I started my career and thinking I was more on the side of, look, Im really passionate about real estate finance because thats what I do. So I started in investment banking on hospitality, sector debt and equity placement and was thinking, Im really passionate about that because I am, very oddly enough, its actually my entire family is this way. My uncles a CFO, my brothers a CFO. My father, he died when I was young. My father was the CFO of Adobe, so it runs in the family. But now I found myself, and I think my brother, too, hes CFO of a publicly traded company. If you said, Will you ever be the CFO of publicity again? He goes, oh, definitely not terrible. And so he does get paid well, but he hates it. I think as I start to think about what I get paid, and in real estate finance, in working long hours that Im more of, look, I want to do something else to make more money that I enjoy more because what I get paid is decent. But I think I dont get paid certainly what a CFO makes or something of that, where Ill just do anything to make a good amount of money. So for the hours, to answer your question, that was kind of a loaded answer. But I work a lot of hours and it pays well, but theres a lot of ways to make a whole lot more money and not working that amount of hours. But Id rather just have a vehicle that makes the same amount or more without having to work the hours that I do, because I can work as many as 16 70 hours.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"He started about ten years ago. He was a lawyer and he just hated the life of writing law papers. Hes very smart. I mean, he went to Harvard Law School and thought he had this whole law thing of writing law papers until 11:00 at night. Hes an outdoorsy guy. Hes very smart, of course, but he just spends a lot of time outside and his wife thought, any fun? I dont like what Im doing. I dont care that theyre paying me a lot to be Harvard lawyer, but its not any fun. So he quit and then got into FBA as much as ten years ago. And so he was very early on where five years ago we met with him and hes a friend of ours, my school, and he thought about, you guys need to do this, man. Find a product and give it a go. And we didnt do it then. Probably should have.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. 70. Okay.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"And I think if you go to my brother, like I said, were so close, we do a lot of stuff together in terms of what we want to do as a we have a younger brother also, but hes only 25 and 26. And at some point, hes going to leave being the CFO of a public traded company because thats just a high demand job and its stressful, it pays well. But hes more of like, lets buy a business. Lets start an FBA business. Lets do something else. He was thinking about just like, lets just go buy a company thats already profitable. Scale the business. Lets do something else. So I think if you look at my brother, whos wildly smart, he got MB at Wharton and thinks, I dont really care what the vehicle is. I just want to make a lot of money doing something. And not necessarily hes not tied to biotech, and Im not tied to real estate on the finance side just because I did enjoy it for a long time. But its working 14, 15 hours on an Excel spreadsheet, Im like, no, theres a lot of ways in this world to make a lot of money, especially with the technologies that we have now. So were thinking of FBA. Were thinking of buying a business. Were thinking of its interesting you mentioned a course because you may not have ever heard of him, but his name is Peter Linneman. Peter Linmanmans got a PhD in finance from Harvard, and he may have a PhD in real estate, too, but hes got an MBA in real estate, too. Hes got MB in real estate from Wharton and then a PhD in finance from Harvard. And hes a Harvard professor and Wharton professor. And hes interesting because hes got a course that is a its similar to Wall Street prep. Not sure if youve heard of it. Its interesting. You can graduate from some of the best business schools in the country, and really not even business schools. Undergraduate and have almost no modeling experience at all. Zero financial modeling skills. Your first part of investment banking is sitting and just learning how to financial model. So Wall Street prep was made by a bunch of Wall Street guys years ago, probably as many as like 20 years ago that thought, look, people leave some of the best schools in the country, undergraduate. They might have gone to Harvard or Stanford, but they cant model at all. They understand finance, but they have no idea how to use Excel. And the same is for real estate. It doesnt matter where you go to school. If you go to a community college, if you went to Harvard, youre going to have no idea how to financial model in your first couple of years of real estate. So Peter Lindeman made a course that follows the textbook. Actually, him and Bruce Kersh wrote a textbook that they use, I think, in most of the business schools across the country. And he has a really well put together Excel course thats quite expensive, but its a couple of its interesting. I thought I could make one that was less expensive than that and somewhat comparable. My little brother is in real estate finance too. And we thought of like, if you can make a course very similar to what Pete, Bruce Kersh and Peter Lindeman did to teach people how to financial model, then thats a business that you could scale very well because you can graduate. Like I said, you could have studied finance and real estate at Harvard, but youd have no idea how to finance model with a double nested if statement. Youre not going to know how to do or put together a waterfall model in the capital stack thats got a mezzanine loan and a senior loan and two equity partners. Youll have no idea how to do the draws of the meaning the draws of the senior debt and the mezzanine loan and the equity partners. You have no idea what are the distributions and promote structures, and people have no idea to do that. And I had no idea when I first read, Im like, Well, I studied this, but I have absolutely no idea how to model this. I thought about actually making that. If I could just sit down for it would take a lot of time. Id probably bring my brother in too, because hes wildly smart. And if not, my uncle also, my uncle was in lending, and we should make a course and charge, say, $3,000, because people will buy it, because these people that graduate from I have a friend that just graduated. Im a little older than he is, but I met him in business, and hes worked for same way that I did, and he went back to NYU and got his Masters of Development degree, but he still doesnt really know how to model all that well. Hes learned quite a bit, and hes like, yeah, Ive still got a lot to learn on the modeling side. And Im like, this is a huge opportunity to do what Bruce Kersh has done. But its not a very saturated market. Its not one where people have spent the many hours of putting together a huge, say, 20 hours of videos of modeling and explaining it as youre modeling it, it would take a very long time, maybe take as long as a year. But in terms of scaling it and having it as a resource, that a lot of people that graduate from undergraduate or graduate school, like, I need to know how to model before I go to it helps to have an extra name, too. Some sort of certificate, for sure.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"New York.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yeah, I did a I was just curious more about it. My brother and I are starting an FBA business, but we havent even launched it yet. Were a little late to the party, one would say, but its still a huge opportunity. So both of us have been very busy. At this point, we dont really need your services, but what all scaling do you do? Yeah, we work with FBA, first of all.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That depends entirely what we plan on doing. If this was a course, which is an idea Ive had, but I havent had the time to do it, and if it was a course, then of course it just make it as I could hire somebody to do part of it. It depends on what Im doing. Because if I still have a full time job and thats not my full time job, then I want some of it to be hands off, a lot of it to be hands off. Just going to have a lot of time. And I think that if that was something that more my little brother, who is my younger brother, whos in the real estate finance business, its also he and I to put the course together. So he and I would put the time. But with my older brother, who just loves building things, he just loves working. And I think he doesnt see himself working as a CFO of a public company for more than another however long. Hes only 37 and Im only 35. So were going to start something. And if were starting something, whether that be buying a business or successful FBA business, although thats automated to the point that you dont really need to spend much hands on that we would be doing, I see us doing, for lack of a term, almost like a holdings company that owns quite a few businesses, whether its buying a business, starting something else. I look to buy two different properties to airbnb in markets that are the best markets. I mean, the Poconos, you can buy a single family home for $240,000 and charge $700 a night. Theres a lake area in the Poconos where you can buy a single family home for $240,000 and your mortgage cost not right now, but would be $1,200 instead. You only need three nights an entire month to cover the mortgage cost and your expenses. And I still have a friend, believe it or not. His name is Michael Bolton and hes in real estate, private equity, where I worked for a while, and hes a 69 Australian. His name is Michael Bolton. But Michael has four properties in the Airbnb and makes some passive income close to after his expenses are paid of $200,000 or $150,000 a year. Hes just living extremely fluggly inside of a married and him and his wife live in a small one bedroom in Manhattan where he just keeps on buying houses in the Poconos because theyre so cheap. So were going to be buying, doing a lot of different things. So to answer your question again, loaded answer, but it depends on what all were doing, because I see its doing a lot of stuff. Ive been.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Scottsdale is awesome.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thats excellent. Well, I lived Frugally until my student loans were paid off, and my brothers been the same way, so hes looking to buy a house. Not right now, though.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I think my mom would have bought about 14 houses if she could have well before, said know that it was going to grow to this big. She would have, because you could have bought a house. You could have bought land on Lake Austin for $100,000. Theres almost no land left where theres roads that go to it. Theres a piece of land on the lake thats $12 million just for the land, just enough for only several acres, two acres just for a house. And its only a lot for a single family house, just with a pool, maybe, but youre on the water, and so its in a very nice area. But the land itself is $12 million, because its interesting there arent any roads, that theres limited availability. Now Austin is populated so quickly that there arent any roads to get down to the water. Eventually theyll build more and more roads, of course, as Austin continues to grow down to the access to the water, but thats one of the last remaining lots on the water. So that lot itself is $12 million. And theyll be down the road from not far from where Matthew McConaughey lives. And I dont know if you like basketball, but JJ. Reddick lives on the lake, and so does Joe Rogan. He live down the street from them. Wow. Yeah, its a very nice part of Austin. Its out of my budget, man. You ever been Austin? Where do you live?","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"I was in upstate. You know where Poughkeepsie is? Yeah, I was in, like, kepsey area.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Big difference there.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"How are you doing, brother? Im sorry, with what?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"So Im a debt and equity placements. A lot of we do is commission, so I can tell you what it was before 2021. And 22 has been a bad time to be in the business. Okay. I was somewhere between 120 to 200 and almost 300,000 before the Pandemic. And now the Pandemic, its been somewhere hovering, if were lucky, to even make 100 and 5000 because they stopped all building. I did hospitality for a long time, and then on the debt and equity side, and then the real estate market has been a mess. Its been a very bad time to be in almost any part of real estate. Got you residential. Not as much just as in a salary. Commission based business has been a rough business for a lot. I even know when a broker is from in New York that have been in the business for, say, 35 years, and theyve quit in New York because New York has just been in Scottsdale, and New York has not recovered at all, really. And a lot of these brokers have said well be lucky if we make $75,000 this year. So they just quit, moved, even ones that have been in business for 25 years. I mean, my boss has been in the business for 42 years, and he lives in New York still. And I talked to Tom, and he was a broker at Cushion Wakefield, and Im not sure Tom has made over $150,000 in the last three years. Collectively. I mean, not collectively, but every year. And hes been a broker for 42 years. The deal volume has just collapsed, and you have so many sub leases on the market. I mean, Moodys has a giant sublease in One World Trade, which is a $75 building, and theyll do a deal at kind of a Belt. Rob Lau is probably the best tenant rep broker in the business. In New York anyway. And he said, look, he just sends it a flyer and says, well do a deal at $25. They just want to get rid of it and they cant. Theres nobody to take the space. So youve got a One World Trade Center space that will do a deal at $30 and an impeccable space because its moodys and they cant get rid of it theres. Nobody will come and take it, not even for $30.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Very should have done it then, because five years ago, we sat down with our friend Kemper kemper. And he said, look, weve known him since high school and even middle school. Hes between the age my older brother is 21 months older than I am by grades two years apart, and Kemper is right between us. So weve played sports with them since second grade. Weve all lived in Austin since Austin was a tiny town. Its not anymore. We all live in Austin, Texas, which now has 1.5 million people. But when my family moved here, it had 200,000 people.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats a shitload of hours.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}}]