[{"pageContent":"I know consultant is always so broad.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Still the same? Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I would almost call it defensively to build up war chests while they dont need it. And so were trying to figure out what that means for money available for money available for our services from other clients.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im fascinated by AI. Were starting to use Chat GBT quite a bit as an assistant, so to speak, to writing and research, and just very interested to see kind of what AI can do. So your video, I kind of dont know what you guys do. So it just was interesting. I was like, lets see what it is. So at this point, we are just massively interested generally in how AI is used to optimize businesses.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Our clients are pretty high ticket, so if we get a client a year that that is actually like, our our retainers run in the five digit ranges starting okay. All right. We dont do a lot of small ticket kind of a grand here or there kind of stuff.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"The most of what we have done for our business, because its a very high touch business with a lot of trust, because we touched some extremely sensitive topics of some very large companies. For us, its really been two areas. One of them is word of mouth. We work for great clients, and those great clients then either refer us with the same kind of, hey, those guys would be good, they work in that space, or folks see us present at conferences about the work that we can present on. So that has been the majority. The tricky piece for us has been figuring out how to publicize it, because a lot of the work we do, the same as you said, youre like, I dont fully understand what it is. Part of what we do is a lot of the work we do is not in the shadows. That sounds wrong, but its not very public facing. It is, especially when you look into legislative and public policy work. Its kind of how the sausage is made. And so you dont advertise a lot of that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Good year. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"But so a lot of it for us is just exposure to the business community. We go to a lot of conferences. We give concerts, talks. We talk about our business, our approach, and that has been the majority of business. And then just word of mouth. And again, when somebody gets referred to us with a, oh, you have this issue. I know somebody. The contract normally goes within one to three months. Goes very quick. When people dont understand that theres an Iceberg coming, thats the hardest thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Guys are at least good at what you do. Were very good at what we do because when we say stuff will happen, 90% likelihood what we forecast will happen will happen. Got it. And again, because of the confidentiality. But it would be interesting to figure out how to talk about that in a better way so people can understand it without feeling inclined. Where we saw something coming, we could avoid it and all of that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"The reason why kind of AI is popping into my mind is, again, the whales that we work on, right, the Fortune 500, the large folks, I dont know how much AI will help with that to kind of get those folks in because their processes are just long, and those are all the kind of things that are there. Having said that, theres a smaller market under it, which is basically every firm under it, fortune 5000 or middle market, a couple of hundred million dollar companies that probably have some very similar issues and thinking that they would need but that they dont have and cant access. And so my deal goal would be to figure out how to develop and sell marketing in a product that can get to a much broader base. Again, thats why I meant lower touch. That allows us to diversify our business stream into a much larger set of clients. Like our clients normally range somewhere in around a dozen range, but if one of the dozen goes away, it is normally a significant revenue hit because theyre all large versus if you have a dozen large ones but then you have 1000 small ones, its easier to buffer stuff out. So that would be my goal with anything that is AI based. The reason why with AI, because it allows you to do a lot manual things faster and more efficiently that for us, with our structure right now, might not be profitable if we try to do them manually. But again, I dont know everything you do. I might be wrong, but thats what caught my eye.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ten years.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"But it has been a challenging year so far.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Thats why we do it. And the clients we have the longest term client we had for eight years, the second longest client has been six. The shortest term client just resigned and was a client before that for five years. Took a quick hiatus for their budget cuts, but returned. So think of it like McKinsey, right? Very large. Very large, very lucrative contracts that we dont have to scale right now to and thats another piece for me, trying to figure out how to properly always scale it because its a difficult infrastructure to maintain because its expensive.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Extremely confidential.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Some berkman.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay. You just know how it happened.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Its advocacy, so its kind of the PR is not the right thing either, because thats not what it is. But thats what you might know. The most part, advocacy is communications you send to communication strategies that you develop to influence public policy, the public space legislation. So it can be lobbying. Sometimes its just advocacy. Oftentimes its coalition development. And a lot of that is also just advising the companies on how they internally should do it and how they should communicate about it. Okay. And so all of that is wrapped in it together. But were not lawyers, so we dont provide, any of us.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Were in the middle of that right now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"How are you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I had not started to develop it. Im just 48.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"We fluctuate between three quarter mil to a mil. Okay.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Well, I wont bring my credit score to you because thats information Im shared with a third party that Ive never met. Just trust me, its very good. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Like, we will be disclosed with the client if theres a lobbying requirement, which makes a public record. But short of that, the work we do for various reasons is very confidential.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"You can say many clauses in the contracts that were not even allowed to disclose their name.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Last year was a really good growth year. We grew, like, 25%, and then this year, just with folks not being in a recession, but folks starting to be panicked about a recession, just clients are cutting budgets.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"The folks need to have abort.","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thats what I thought.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Ryan is not my cup of soup.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Only half. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So. Let me just try to explain quickly again, if you can hear it. Our business cycle, like the full development of a relationship could be years, which means the company we start to not work with the company. The company we are generally aware of what they should be working on. The example I gave is clients think of the movie Titanic. Clients should hire us when they get on the ship and plot the course so we can help them avoid the Icebergs we know they will be hitting. Clients normally call us. They can see the iceberg.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Big you want to grow? Have not done goal building. 2023 is shaping up to be a difficult year because a bunch of companies are slashing budgets, and so we dont know if this will be a growth year or just a maintenance year.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I got to see a bit more perspective or kind of what it is at this point. Its too amorphous for me. It really is. So I dont know, but maybe okay.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Is it still bad?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thats what we actually discussed, so youre fine.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"09:00 A.m., what time?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"What you will see is public on my LinkedIn. I used to work for Philip Morris, which is a large tobacco company.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And I think you have my email, right?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thats basically the question. Yeah. In a second company I own, also on LinkedIn, Not Hidden, we just did a very sizable investment to make sure we can scale that, which is publicly going to hit in about two years.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hi. Hey.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Proactive business management on how to not hit the iceberg is really the key to that business. In short, that company is extremely good at it. Developing five year plans, even ten year plans. The five year plans are pretty firm. The ten year plans are just like thinking out, doing extremely good contingency planning, scenario planning, kind of thinking the future out and through and then preparing for all of it. The best, most likely and the worst. And then within that, I got pulled into the corporate affairs, government affairs world and actually ran part of their brand production unit for a couple of years. And so that set me on that course. My general education has nothing to do with it. Im a marketing sales major. So thats how I ended up there, by training, by work. And I enjoy what I really enjoy is exactly what we do, which is thinking stuff through, where we tell people this is what will happen in four years, and if they listen to us and then four years later we sit down, theyre like, thats exactly what you said would happen. And so we have it with clients right now. We broke a lot in the political space, and so we forecasted a lot what will happen in certain elections. And its great for clients when we say, this is what will happen, this happens. This is what this means to you, and we arrived very often. They like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I think I saw you at something like four digit.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"But I can pause the video and return to it, right?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"This was en route. I dont do weekends on my business. I dont. I do have a really healthy work life balance, which actually has to do with what I did with Tony coaching. So I work heavy. Monday, Monday, Friday. I dont do weekend work things unless they are complete fire drills I have to do. But yours does.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And capital, like, what range are we talking about? Five digits? Six digits? Seven digits.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Try.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Appreciate that. And I just got to wrap up because I have a meeting at three that I have to quickly.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"You should bring us in as you make sure we help figure out which work. And we dont do work after people hit the iceberg. Thats a different kind of business. So therefore our sales cycle from beginning of relationship build to year, but we can do one.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, and its also not in our junk. I just looked.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, that prompt didnt work, and its not in my email, so I actually noticed that maybe it comes later, but I sent you guys my email, so.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Everybody like this now. Were currently a Tony Robbins.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Maybe my biggest thing is I dont know what you guys do yet, to be quite honest. Youre talking good generalities and I hear all that, but I dont know what you guys do yet.","metadata":{"fillerID":29,"fillerText":"Mhmm","category":"D"}},{"pageContent":"I heard I dont like Dean. Im a current Tony Robbins client, but I dont like Dean.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im a morning guy because it helps me to get thinking in the morning before my day runs away. So I can do 09:00 if you want to.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im the sole owner, and then we have a bunch of subcontractors.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Eastern.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Appreciate it.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yes. I dont use pen and paper. Electronic.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"We get brought in, then you hit the Iceberg. We dont help you with that. So we dont do like a BP Exxon Valdez kind of cleanup job. We dont do that. If you complete bullshit, we dont do that. But we will figure out, as you have something approaching like this, well try to make sure you dont hit the Iceberg full on, or were trying to mitigate it in a way that you can avoid it. So the really good, smart clients brought us on board to chart the course. The majority of clients have known us. We have known them. They kind of know our work, but they will bring us on when they see an Iceberg. From the moment they see an Iceberg, to contract goes quick. Its normally like, should we have an issue? We know you just do. Well, thats a month, so I dont know if that helps you, but thats normally it its hard for us to sell to clients that, hey, you have to show you about the Icebergs because most companies are just not built that way. And I can take you through a long list of companies in the press, not our clients, where youre like, yes, we saw that coming, and they just dont want to. So theres a mix between public literacy strategy how do you do it? Internal, external, and align, all of that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, were last there. Eastern.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Or the oh, my God. But it all depends. Far out. We sort of give, like let me give you an example. Right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"We have been clocking somewhere around ten to 15% growth year over year and sometimes even more. Like, there were some years where it was less and sometimes it was more. Ever since the Pandemic, it got weird.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Columbus, Ohio.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Philip Morris is in Virginia, but I work for them in New York and then Virginia and wife is from Ohio. So we went back to Ohio. Got it.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"So I love his coaching.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"We could take on more, but to a degree, as I said, we have been going to the higher clip before the pandemic and pandemic came, they kind of became hold and maintained. Kind of picked up a little bit last year when people came back out of their holes, and this year well see how it shapes up. So, again, different kind of business. Were kind of a small firm with pretty large clients. And so as we add them right now, in percentage, theyre very large. But, yes, we would like to get to a point where we can add four or five of these a year or figure out a way where we can and thats actually the bigger piece that I havent figured out. Is how to take our very high touch, very expensive business into a business niche where we can charge less people into a broad audience. But I havent figured it out yet.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Or is there a normal yeah, Im just trying to think. Yes, there are some folks with whom we have been talking about what they probably should be working on for years, and then it becomes an issue for them, for the kind of work we do, which is really managing a public policy issue for them. Issue that told them they were facing imminent.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Depends for what?","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}},{"pageContent":"We can do without thinking five digit. We want to make sure we have a proper ROI on six digit. That would need to be a really good plan to do.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Fine. Ill gladly watch that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Lets do that.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"The large amount of business we do is public policy and advocacy. So we advise Fortune 500 companies on public policy. A large aspect that we focus on is anything thats anti illicit trade related. So we work with a lot of companies that experience kind of fitting contraband smuggling issues, and we work with them on a brand protection side and be the public policy and advocacy side on how to mitigate those. So most of our clients are either large Fortune 500 or large trade associations made up of those large Fortune 500.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Columbus, Ohio.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I do. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}}]