[{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, basically well, the agency to me is not really much coaching as it is more of an agency. So you had mentioned doing coaching.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Youre like an agency for agents.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"But Ive known Caleb for a really long time. I know Matt Maddox really well, so Im curious always to see what hes up to, what hes working on, and if its making sense to integrate with some of the stuff Im doing with an agency right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I see. Okay. Whats the name of your coaching company?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I can totally go into that, but theres like, five different directions I could go with it based on. So maybe its more effective and efficient for you if you tell me exactly the ideal client youre looking for and the result you get them.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Central.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im open to having it within the context of one of those categories. For example, like the agency.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, and that ones still running today?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, thats perfect. And I have a coaching business too. So with the agency space, specifically, the unique problem that you solve or the modality that you use to help them grow is.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. All right. And how do you know Caleb, by the way? How do you know him?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay. All right. And as far as revenue from your consulting business, has that been pretty steady?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, Im going to walk into my chiropractor appointment now. Okay. So Im going to be distracted.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay. What is your clientele niche? Is it pretty broad or you pretty narrow as far as the niche go after as far as consulting?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"No, within the next 90 days.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, I would say Im the primary influencer on it, not the decision maker.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, got it. Yeah. I was just curious as far as what you personally have as far as coaching or consulting.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Thats correct.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. Basically it doesnt sound like you have a specific tool. Its more of just youre doing similarly to what Im doing just on a larger scale for this particular yeah, well.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I know that I can tell you how much money they manage an ad. Yeah. I can say that our next target is 100,000 a month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I havent, and its been a major thats why Im on these calls with AI people now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Time in business to start off with, yeah. How long ago did you start your 1st?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay. It sounds like youve got a couple of different things going on. What is the most mature business that you have.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Ill dig into that. Does that make sense that you already know that I know? Whatever, I thought it was interesting enough for me to opt in. Right, okay, right. Ill dig back into the case study. Yeah, go ahead.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Got it. Seriously?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I dont know what the model exactly is going to look like yet in terms of with our partners and stuff. And so, like, right now, we have a couple of clients and were figuring out what our frameworks are that were going to work people through to be able to deliver consistent results. So Im looking for what are the resources with the teams, with the tools that I want to make sure that I build those frameworks around to be able to get consistent results.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I would love to do that with you. Im walking in a chiropractor right now. I just wanted to make sure I got this call with you and I pushed a little late. So is it where I can look at the case studies and I can send me a link or something and we can follow up at a time I can focus?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"That sounds great. Thanks so much. You have a good day.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hey, whos this?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I have probably seen it, but I havent looked at it. I think I opted in for probably, like, 50 things over the last week, so just watching how the follow ups.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. And then your agency has many different names online.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Hey, Rick. Im going. Well how are you doing?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"And which one is that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, thats a good question to me. In my head, theyre all stacked. Like, one thing serves the next, serves the next. So my stuff that Im doing in youth leadership, Im going to make Digital Addicts. Theyre going to start running my marketing. Right. So what happened with my client? I was like, okay, well, how about we start a new entity together? So instead just the agency. Now we have Digital Addicts Consulting. This is not official yet. Its what were planning on. So we will then be a consulting company. So when Chris and I can go out and do business consulting for people, if the lead is appropriate, well bring it back to Digital Addicts. Thats a new thing, right. Just in the last couple of weeks that we decided were going to do that. So my focus is building that digital Consulting and putting everything else I have under there. Like everything else Im running, I want it all to function by the team that I build underneath Digitalized Consulting that will build the network, like the marketing department and the sales teams to be able to fill those services that Ive already developed and built. So right now, what Im doing is Im hiring project managers to take the lead on each of my individual projects that Im like. I cant continue to go at this pace or I dont want to putting project managers in place of each of those. So right now Im looking for resources that Im going to put under digital artist consulting to basically streamline all of this into one business building system consistently that we can then rinse and duplicate.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]