[{"pageContent":"Thats fair.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, Ive been kind of looking into getting into affiliate marketing, and I know that this AI is really taking off right now. And I know theres a form of using AI to basically turbocharge affiliate marketing. So from what I understood in your ad, thats basically you guys are doing is using AI to accentuate affiliate marketing, which is something Im interested in doing. Basically, Im getting into it now. Ive never done it before, and if theres process or systems that I can use to accelerate my growth, thats definitely what I do.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. So I dont work nine to five for me, its seven to seven, depending on the severity of storms that are out there. Seven to seven? Six or seven days a week?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"All right. I wish you guys luck. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, when Im working I make about 3000 a week. So Id like to be minimum at 10,000 a month. Basically is what my initial goal will be, 10,000 a month. But honestly, if I can make more than that, if I can make six figures right, of course.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"That is the exact goal. Im here, Im in Chicago currently basically convalescing while I get better and my parents, but I live in Texas, so I want to be able to go back to Texas, but do be able to do affiliate marketing and live an easier lifestyle. Because Im getting older, Im 55. Its hard to be jumping up on roofs and crawling in the crawl spaces and things like that. To do that kind of work, I need a change, basically.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I have to honestly think about coaching other people. Im kind of back nine of my life, so to speak. Starting the back nine of my life, I dont know if I want to coaching others into it. Im looking for something that I dont have to work extended hours. I have a surgery coming up in the summer for spinal surgery for my neck and my lower back. Because its like right now I cant even type because I have numbness in my like I said, its something that I look at affiliate marketing. I can kind of let run like an autopilot where I dont have to physically be there all the time. I can check it from my phone, I can check it from my laptop or my tablet and then keep moving on with my day. Because my thing that thinking about my life moving forward at my age, I want to make as much money as possible now so that then I can take that money. Let me simplify this conversation. I want to be able to make some money in affiliate marketing that then I can take and invest into real estate and grow the real estate as a way to as another form of income. I want to have multiple streams of income. Ive thought about, okay, 50,000. Then you can start one of those automated online stores. So have one through Walmart, have another one through Amazon, maybe have one through Shopify, and then have the affiliate marketing continuing on, and then having real estate investments from that money so that I can grow that in that manner. Right now, most of the money I have is tied into crypto. Ive been lucky. Ive lost some money, but Ive researched a lot of my cryptocurrency that I do still have. And I always went for cryptos that had plenty of utilities, so I knew they werent just a meme coin. Theyd have some value to them. So Im kind of waiting for that to really take off so I can have even more money. But like I said, right now my whole thing is Im starting out. So as far as going into coaching, I dont know, Im at that level or at that point. And youre basically talking about me being a coach. Like, I see all these people online in order to yeah, and if I.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its really not what Im looking for. I understand. Big thing right now, but for me, honestly, I dont want to have a full friend. Like when I talk about the affiliate marketing and I thought about doing some other things, like on YouTube, I dont want to show my face. I dont want to talk.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I was curious as to what exactly actually was. It okay, awesome.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"I want to make as much money as possible so that I can live a life that Im able to help my family, but then Im able to live my life on my terms instead of on a company terms.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im actually not working at all. I had a health problem with my heart, and I had to take time off of work. But when I am a catastrophe adjuster sorry, you broke.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay, good, brother.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Catastrophe.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Hello, Alex.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right. God bless you too.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}}]