[{"pageContent":"I did.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, thats why I said its the base entry level, minimum floor, definitely not a ceiling by any stretch of the imagination.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. So when I think of serving virtually, I can do that, but it also feels like the way that I would be serving virtually would be more product selection. Theres quite a bit of things that we could do remotely, but it feels like if I was serving virtually, my efforts would be maybe more spent turning those virtual processes into a course so that theres more scale behind it. Right. But I can do it virtually. Absolutely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I guess for me, it would really depend on how compelling the offer is. I still dont know what you do and I have a couple of options that Im considering in terms of pathways forward. So it really depends on what youre saying you can deliver and I guess the level of confidence that I have in what youre selling. So in terms of what I can into my business, I can go as high as 20K. But again, I have offers for people who are making very promising claims that are willing to do it for a lot less than that, which I would also be happy to explore.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, so youre just getting them on the phone right away?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hi.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Honestly, I guess I feel like this is going to be super pivotal and I want to understand how I can better incorporate technology into my current business, which is still super new. And to me, that feels like a really good habit and organic part of how we operate and maximize.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"When you look at, I guess, that first initial, Im kind of going to break down that process a little bit more to see where we can maybe help you out. Whats the, I guess, the conversion rate from when you first get that lead to when you actually get them on that on your calendar to get a call with them?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Its not a matter of is it? Like, to me, its a matter of time because I currently do everything, and my schedule is really I can get a call in the morning being like, hey, actually, are you available today? Im absolutely going to book that client onto my calendar if its open. Right. And I already know my day tomorrow is completely jammed. I know I have an evening project Im about to head out to. So really, Im looking at Sunday, which I try not to do any work on because its the only day that I can kind of give myself a second to breathe. But then if were saying we want to schedule this call for Monday, I want to watch the video before the call. Right. So Im kind of thinking backwards from there. Like, when am I watching this video so that I can come to the call locked and ready to go with as much information that I can already milk from the video, and then I can also maximize my time on this call with your team. So its not, oh, I dont want to do it. Its more so like, can we stagger it? So can I watch the video on Monday and then reach out and say, okay, I watched the video. Yay. When can you get me on a call?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, no, Georgia the state.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"So Im new here in Georgia. I actually had a business, it was based in Toronto. I did decorating exclusively, but I recently moved and Im starting over again and its very hyper local, word of mouth, being connected to community kind of business, typically. Obviously Im here talking to you because Id love to use technology to accelerate that process. But right now Im doing between six and ten a month and its more minor decor. Its not really full scale design project. Its more like redesign, organizing its piecemeal, it feels like. And it also doesnt feel like I have a lot of the lead generation kind of like locked down and automated. So Im still currently paying per lead.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I think Im good at doing it, and this is where that, like, I can do it better than every other person, which I know is not true, but I find Im able to really listen to the client and provide a solution. Its the same thing were doing, but being able to pitch it in a way that sounds like its going to be exactly what they need. Right. So I think thats the thing that I do that I dont know that other people do. Everyones just like, oh, this is what I do, take it or leave it. But my pitch sounds different every time, even though its the exact same service, because Im really trying to make whoever is across from me on the line hear what they need and what Im saying, and it becomes a no brainer that way. So I like taking the field call, I guess, is what Im saying. Okay. Yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, so I work with a lead gen service and I pay per lead, and thats my current system. I dont have a lot of the other very basic infrastructure. Like, we dont even have a website. Its just been legion and word of mouth and local community groups. So, like I said, theres still a ton of space for growth. Its just a matter of making sure that I also have the capacity for that. Because that was something I ran into in my previous business or in my previous location where we got the Legion. I guess it was doing what it was supposed to do, but I literally didnt have the capacity and we had to turn away leads or we werent able to fulfill the commitments that we were taking on because it was so hands on intensive.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. So I dont have a digital product yet, but it is something that I know Im going to be delivering or creating in the near future. So I work in home improvement. I help people organize, design, and decorate. I also partner with people who help with boxing, on boxing, moving. And Im looking to partner with a couple of cleaners so that we become a really kind of robust suite of offerings. And the goal is A, to have a very strong real estate arm where were partnering with Realtors because essentially what we offer takes a buyer or seller, mostly a seller from start to finish. We can offer all those services in house and then I also work one on one with just clients. More so on the design and decorating side. And I think thats more so where the digital product or course offering is going to come from. Its just helping people do it themselves as opposed to doing it for them.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. Home improvement is a huge space. Right. Its not an insignificant industry. And I know that I do good work and I know that I take good care of my clients. So I really want to build this into a six figure a month operation. And I see the potential and I feel like the vision is living in my head. And so thats why I see the six to ten is fine because it feels like, okay, step one, thats stable, its enough income for me to live on comfortably. But then step two is going to be like, how do I create that capacity for growth and scale to happen without necessarily working 24 hours a day?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I mean, its just so much more exciting. Isnt that the whole point? I could get a job making AK month? I dont know. The point is that you play the game, you do it better and better, and the rewards get higher and higher. So its fun, its exciting, and its what I want.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I need to regroup. Yeah. And now Im back, and Im like, okay, I think I know how to do it. I just need to work the time.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, Im very local right now. There is a way for me to do what I do more remotely. And this is where that course piece comes in because it feels like I could guide people through the same processes that I use and kind of help them make decisions remotely, but have them feel empowered and really more of an educational piece so that they can go forward and do it. Whether its in different spaces in their home or if they take on a new home, they will have more of those skills for themselves. But yeah, right now if Im doing it for a client, it tends to be local. Obviously I would be happy to travel, but then were talking about a very different service level and Chrysler package, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, for sure.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Excellent question. I plan on not doing everything myself moving forward. So my goal is to kind of assemble a team, an Avengers, really. So bringing on subcontractors that are good at what they do on that level as well, and then focusing on so that way, instead of just dealing with 15 calls a week, I could do 15 calls a day right. And subcontract out, do just a straight percentage split of the revenue generated. And then once I have that tightly assembled team of Avengers, I want to take that package and move over to real estate servicing, because that way its going to be more relationship based, and I dont have to generate every appointment through a sales call. So if I have a couple of strong realtor partners, then theyre sending me all of this work. And its the same work, its just in different contexts. Right. So if somebody is selling a house, they have to organize, they have to declutter, they have to pack and move. They have to redesign minimally. So staging so its the same offering, just packaging it for real estate and then having that kind of so thats the pathway that I see most clearly is a, get a team behind me, b, move over from residential directly, or at least like if residential knocks in our door, obviously were not turning them back. But in terms of my lead, generity, move those selling efforts into that corporate real estate space, allow kind of more so, like SEO service. I dont know that I necessarily have to close every organizer thats currently the process in place. But I think if I had more robust infrastructure behind me, like, right now, I dont even have a website. If I had more robust infrastructure behind me, then those can flow more organically and I can be focused more. So Im building those corporate partnerships that will be where the big money is.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"CanT fulfill them on the back end, absolutely. I have lifted that story so Im not just like, oh, six figure, I know it needs thats actually, maybe the easier part, the next part of the story is can you fulfill that and can you do it sustainably month after month?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im getting on about 15 of those a week. Yeah. Between twelve to 15 a week. Sometimes higher, sometimes lower, and about 60% of those choose to move forward with a project. And then in kind of like an hourly spend, Im typically looking at I mean, Im about to raise my rates again, but prior to this, we were doing $75 an hour for four hour minimum. And most projects are not 4 hours per lead. Im looking at about an average of like a $500 revenue generated.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im a very lazy human being. I dont believe I was created to work. So I do what I can and I do what I must, but the goal is to really do as little as possible while being of service and being helpful. I enjoy what I do, so a lot of the time, it doesnt feel like work, which is good, because it felt like work. That was a whole different ballgame. But, yeah, just create space for more of the living things that I would like to do more of.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Osage, you absolutely are.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, it totally is. Thats kind of where I would want to eventually, because I know that thats where the scalability really lives.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Midday.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Oh, hi. Its going well.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Will honestly, you know what it sounds like. What would make the most sense is for me to watch the video first and then come because I dont even see where on my schedule Im going to be because you said its 2 hours, right. So I dont see where Im going to be watching that in time. And then once I do that and I have my notes because I also want to make sure that Im coming to the call prepared, then can I reach out to you or someone on your team to just confirm that? Yes, I will. Absolutely. Hell or high water, Im ready. I have notes. I have questions. Lets go. Is that possible?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I dont know that anythings really been slowing me down, to be honest. Like I said, I recently moved here, so Im in a new territory, a new city, a new country. So getting to six to ten this quickly has been very validating. I think it validates all the experience I bring into the space. And it tells me that I know because when I started my first interior decorating business before, it took me a very long time to get to six to ten consistently. So its like, okay, if I can ramp up this quickly, then Im doing something right. So I dont know that theres anything thats been slowing me down. I think its just Im here now, and Im like, okay, whats next?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats the one.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I didnt work most of 2022. I actually spent most of 2022 traveling.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"What are you trying to assess here exactly? Are you looking for a monthly, like, a commitment for your coach? I really still dont have super clarity on what youre offering, and I dont know if I see an email from you yet. I know you said you sent I.","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Yeah, for sure. Id be interested in learning more. Like I said, Im exploring different pathways and avenues and yeah, I feel very confident in my plan. Its just a matter of how do I want to execute it and what are the systems that are going to support in getting that faster. So Im really intrigued by what you guys offer.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, Im working all day tomorrow.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Two projects that Im overseeing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, so far so good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I absolutely am. Im doing all of my sales calls, and it doesnt matter where I am. It doesnt matter what Im doing. If that lead pops up, Im picking up my phone that Im calling. So I would like to be able to just not be so attached to my phone. But, yeah, Im just right now, is.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"That sounds like a perfect plan. I love the slide.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, that sounds good. Have you worked with, I guess, businesses like mine that are more so like service, delivery, home improvement? Or are you more focused on digital? I actually dont know. Who are you typically serving?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Oh, I said thats amazing. Thats perfect.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I guess it would make sense for me to watch the video first, the master class. It sounds like that would give me a better sense of whether this is a good fit, but absolutely. If I watch that and it resonates and I can kind of see pathways or parallels with what Im looking to create, then absolutely, I would love that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I would feel more comfortable outsourcing the product delivery than the sales call. Thats how attached I am to this part of the process. Yeah. Right now, theres many ways we can niche these down. Say I was already at the stage where I was courting that real estate business. I feel like I feel more comfortable passing that on to a sales team. Although even thats relationship based. If a single mom calls, hes like, oh, Im super overwhelmed, my kid. That pitch is going to be different from my parents are moving into their home, and they need support, and thats going to be different from, like, my garage is a hot mess, and we have nowhere to put our car. Right. So I would need somebody who understands how to even create a solution that sounds like its speaking exactly to what they need. Although I guess I could just come up with different I guess I dont know how to train a sales. Youre stressing me out. Now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay. Im really excited. Thank you so much, all.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Oh, my credit score is zero because I just moved here. Yeah. So thats something that I guess will come with time. Ive been in the country for four.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Absolutely. Please. Go ahead.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"They feel fine. Im like, okay, there is a little bit of traction. Its a good enough space for me to work from. Yeah. So its fine. Its fine.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, God. Are there other options here that we could explore?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Well, then I took 2022 off because I was like, well, this goal is really overwhelming. My current structure is not working, and.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Six is kind of like things are a little slow. Theres a little bit of seasonality with what I do. So right now everyones like, oh my God, I live in a house and I dont like how it looks. And in the winter, everyones just trying to survive.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I dont know if I will have watched the video before that. Its not just like, oh, am I making to the call or not. Its just I also want to come to the call daily prepared. I dont know if that makes sense.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"First popped into my head, like, literally a very random moment. I want to say March 17, 2020.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You know what? I dont even think Ive prioritized that. So tell me what Im looking for in my email and Ill see if its there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"For one on one work. When it comes to design, I would want my basic design fee to start at $5,000 and then go up from there.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I dont know that theres really like I said to me, its really kind of just a game, and this is how you know that youre playing the game well. Right? I was very intentional. I had a corporate job, a very kind of, like, comfortable, cushy, non high stress, well paying corporate job. And I was really bored and kind of losing my mind a little, so I took this path, which is insanely difficult. Its been you know, you talk to people who run their own businesses all the time. So part of why I did it was because I knew if I could get good at delivering results and putting in processes and systems, then the reward should be higher. And it literally is just what I want. Obviously, itll be meaningful for me, and itll be meaningful for my family, but the real honest to God reason is like, it is literally what I want.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Spring cleaning is a real thing. Everybody does seem to kind of wake up and take on all of these projects all at the same time. So were definitely getting into that high season space right now.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"What do you guys recommend on your end? Like, what do you typically like to see before you partner with somebody, just out of curiosity?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, I mean, if something comes up, if I end up with a last minute project or lead, I think I will prioritize that, but other than that, I cant foresee why I wouldnt. Theres currently nothing on my scalp on my calendar that would get in the way.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I think what I would like to do is not have the call on Monday and then reach out to confirm that Im ready to move forward with a call because I have completed the video, because I dont just want to listen to the content. Like I said, I want to pause, I want to take notes. I really want to be present for that conversation.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]