[{"pageContent":"Let me see, what was your company? Because I went through a lot of air.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Well, we usually are kind of aggressive because a lot of people over here where we are in Jersey, usually we in places thats needed like say we might go to a meeting, we might go to its usually a network. We usually just do word of mouth, you know what Im trying to say. They look at us online, you know what Im trying to say. My son does the emails and stuff like that. But over here in Jersey its a different kind of animal. Theyre egomaniacs and we kind of go on the ego as opposed to New York where my wife stores that we got to like marketing, you know what Im trying to say. Over there, a lot of people pretty much knows us for being in the years of building apps. Many years ago with the app where I came out and have this, we still have a lot of our old clients refer to us through a whole lot of clients. When my wife places out we have an office over here, my son and I. But when my wife is at, its like a melted pot for business. Got it. Every business you could possibly from political standpoint come to my wifes store, you know what Im trying to say? And sometimes she just say, hey, my son does a little bit of this or what we do in the back if we go with her. But other than that its seriously like word of mouth and reputation, you know what Im trying to say?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Thank you so much for calling me. Take care. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Who, my son?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Well, I kind of like him a little bit, although hes 30 something years old, he tells me what to do. We have a lot of doctors and lawyers, but we also in the beauty market. My wife has a beauty salon, but she does a lot of high profile clients in the fashion industry over here in New York. Okay. One of the things that were doing is building a platform for the models and the back end of production. More of a branding solution. Build platform. Thats what were doing now. Sure. Okay. But one of the last shows was that a company from over there in Asia somewhere south Asia, around there, jakara. They have a marketing not marketing company. They have a product line that they have they want to introduce in New York. So I want to come back with a different pitch, but I got to see exactly which company.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes, good afternoon.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"It could be over 50 and better. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right, pull me up right now. Yeah.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Something like that. Sometimes we go from depending on what we do, we try to go for 5000 and up, you know what Im trying to say?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Its pretty good. You know what it is that were not trying to go across the world, but let me be a specific. Were not trying to broadcast all over for what we do for the entire spectrum of business. We like that. When you kind of monetize what you do best, its a lot more effective. You know what Im trying to say. I drive truck. Im in the trucking world. But at night, in the weekends, I work with my son in the office and him and his crew just to tighten up what they need to do. Or basically he tells me what to do. So we are to the lawyers medical field and the beauty aspect in the teacher world. My son built quite a couple of platforms for quite a few people who were schools in the south. But we did all that, and its too broad. We realize over the years that you got to focus what you do best or know best, or the fields that we are in, which helps out a lot, which keep a precise point of profitability. You know what Im trying to say? We dont spend that much all across. It becomes too much. Its not that we cant handle it. Its just this is a little more effective. When you talk to Lingo, whatever those arenas of expertise that theyre in, its more effective. Does that make sense?","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Well, a company like that, were looking for more of a long term on a steady income flow, you know what Im trying to say? So I give them a presentation in a few weeks. What did you say? Air AI?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"He does a little bit.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, Im partnering with my son marketing company and with the graphics part. My son has a few clients thats overseas that might be interested in some services, and I really forgot what Air AI was. Let me pull it up real quick. Im sorry. So we can get right on the same page. Yeah. Thank you for calling me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, we try to go for a six month contract because it always take no matter what you do and how you do it always take two months to get the rhythm or whatever. What you trying to sell to? Not trying to sell to. After you, soldier, then four months. They believe in what youre offering to enhance whatever they need. What we do, let us say what were offering. We call the people to see what they need. Thats what my son does. It which is quite effective, what you have everything to do, because they cant absorb that with clients at all. It will sound like youre bragging. Its always sound like its going to be too much for us because they sound like they know everything. So we change our technique in the last two years. Actually, you know what Im trying to say, to see what they need, what they want. We give them some visuals where they could go, and then from there, thats how we get them in. Just got to be just a spoken there. Like I said, well over the baby. Theres so many tools companies such as Self who comes in, who really enhanced, but you cant really tell them what you have in your arsenal. What do you need, how can we help? And we start with that first and then we upscale later on after they believe in us. So we start with a four to six month contract, you know what Im saying?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And then after the six months, then we start hitting with the 10,000 and better, you know what Im trying to say? So its not one technique that we do. We do everything, but we just have to hear first what they need.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Actually trying to look for a comfortable 350 after everything is paid out.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, it depends on the contract. We have the high scale and the lower scale or medium scale, because dealing with companies, first of all, dealing with lawyers and doctors, they think they know everything. And then the egos from a lawyer because they get quite comfortable just by the clients that they have. A lot of times we have to update the website, and then we have to speak to the we call it the Gatekeeper, which is the receptionist who thinks they know everything. Theyre not marketers. They think they know what that for? So its a whole lot of time to get through. Then you got to speak to the tech guy who is not a marketer, and you got to kind of stroke the ego, say, hey, were not here to take your job. Were trying to assist you in terms of what you already got going on. So after we get through all that, we already know were going to charge the money for them.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, on.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. I appreciate your info with that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]