[{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im in Mountain time zone. Can you call me around one or two in the afternoon?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Alex. Alex, Im going to have to cut this call off. Im sitting down with my family. Were getting ready to eat some dinner, my friend. But Ive enjoyed this conversation. Can we pick this up tomorrow?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"It opened up the whole it opened up so many opportunities because I would be able to hire staff, Id be able to scale out. It would look fantastic.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"COVID has been very stifling to me, and I actually got into debt. A lot of what I was doing was final expense, direct mail. But when COVID hit, all that dried up, and so my revenue plummeted. However, here we are in 2023, and Im off to a fantastic start, and I should easily do 100K this year.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"675. Ive had it as high as 810, but Ive got like I said, COVID stifled me, and Ive had to get into some utilization price, 60% of my credit. But its good. I have good credit.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im not in real estate.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay. Yeah, thats five.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, Id like to hit 5 million and be done. Okay, yeah, 5 million. And Michael, listen, next year, 2024. I really believe that in 2024, I believe I can do 350.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Probably five grand. Five to ten.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Go into it.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I dont know. I guess I havent thought of it in that sense. I was kind of looking to I think I would see what the software could do as far as bringing in customers to me, and then at that point maybe saying, hey, Ive used AI to generate high intent quality, high intention, high quality leads, and this is the AI system I utilize to do that. And then I could scale that way and recruit that way. Thats kind of along the way. I was thinking, because let me elaborate. Sure. When you talk to agents, thats by far and away the hardest thing to find is good quality, high intent, good quality, high intent leads. So by, you know, there are different programs out there, different platforms that are out there that are pretty good. But I have yet to find the Ferrari of lead generation out there. I know that with AI, I think that there is the potential of finding that missing piece of the puzzle or that missing piece of this link that once an agent, whether it be me or somebody else, finds it through AI can then duplicate and scale out. And thats kind of what I was thinking.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats for my time?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Because some people are young. Lets say a married couple just getting out of college, and they have a couple of kids. Theyre not making a lot of money yet, and they just bought a house, and they need to have a lot of insurance. So Ill sell them term insurance, which is your cheapest insurance out there. But theres a 97% chance that that policy will never pay, and hopefully it doesnt. Its there to have a lot of insurance to cover the mortgage should the husband or the wife die, the mortgage is paid off. Its there to cover income replacement. Should one of the young couples pass away prematurely at a young age, then youre losing your husband or your wifes income. So Ill sell them that. And then you want to take care of the kids college tuition. So you add it in there, you can get into a two $3 million policy for 30, $40 a month for 20 years. And then on the other flip side of that, theres a lot of people that make a lot of money, and they maxed out their qualified plans, their IRAs or 403 Bs or 401, and theyre looking for an additional vehicle or chassis to put their money into to grow it. And so thats tax free retirement via using life insurance with little to no insurance, but a whole bunch of opportunity to have cash value in there. And then the other thing is to protect one asset for the people that are 50 plus years of age, and theyve accumulated all their assets, and they need long term care insurance, because if you know how expensive going to a nursing home is, thats $10,000 a month. And if you dont have a long term care policy, you will easily absorb your assets should that happen. So those are all the verticals that I do.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, Ive thought about scaling like that, but I have thought about that. But I dont think that would really be my niche right now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I guess, how involved it really is. All these verticals that were out there had really no idea in that its a lifetime career field.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I do. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Sure. Well, direct mail has always been static in the industry. And then when COVID hit, obviously Facebook, LinkedIn, and Ive tried a couple of those with different firms, but again, it was just data. I wasnt getting the high intent quality that I particularly wanted.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I would like to see, obviously I would like to see, if I had to picture that I would like to see, obviously, digital marketing be in place that drives people down a funnel, that educates and qualifies them and they book onto my calendar link for whatever need theyre wanting to fulfill, whether that be like we talked about mortgage protection, long term care planning, tax free retirement, final expense planning. And that would be what I would like to see so that I could scale that out.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"15 years.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"We got.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Well, just based on where Im at this year and the momentum I got, Im easily one hundred k. And then on top of that, leverage just scaling out a little bit, then I should easily be able to triple that the next year. Thats why I picked 350.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"40 plus 50.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thank you, my friend.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Sure. Just AI in general is out there, and I think I could probably implement it into what I do as far as a living. Im an insurance agent and real curious about how I could leverage that to help my clients out better and make more money for myself, my family. I dont recall getting the email, though.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Were to start I did not make 100K last year. I did not 40 last year.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, I think a combination of that. I like where youre headed with that. What was your name again?","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Insurance. Yeah. I do primarily life insurance. Im licensed to do all lines of authority like property, casualty, life and health. But I primarily concentrate on just everything you can do with life insurance, retirement planning, mortgage protection planning, final expense planning, long term care planning, et cetera, et cetera.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]