[{"pageContent":"I am an analyst at the Food and Drug Administration.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, Im kind of more in a preliminary I havent launched it. Okay. I saw that on Facebook.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hello? Hey.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I know what my pricing structure is as far as creating the assets and the funnels and all that stuff. I havent done it yet. Okay. I did sort of a pilot with a small group at my church to kind of test it in the real world and how to go pretty well. Good. Im like, okay, its time to pivot and start creating the assets and doing this online. Okay.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, thats the one.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So my plan is to be up and running on tell you exactly May 29.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Not that Im aware, actually. All right. Yeah, the way it went was when I opted in, I got prompted to schedule a call. And Im not sure if it was designed that way, but yeah, I dont.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im launching, like, a membership site and building some small courses around helping entrepreneurs that have ADHD or executive dysfunction be more successful in managing their day to day. I myself have somebody that had some executive function challenges and worked through those and kind of created some material that I want to share with other people regarding that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Pretty good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, as far as what platform that Im going to focus on for getting my content and running ad campaigns, Im going to focus on YouTube. Okay. Ive used what is the name of that software, the one that I think Frank Kern started? I cant think of the name of it right now. Okay. But its like all in one, right? Course marketing, email marketing, all that stuff kind of roll into one. And they have like pre made campaigns where you can do webinars or whatever the case may be. Thats the high level thing that Im focused on right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"We were together in the beginning and then he ended up kind of on a parallel track, but we were never in the same place at the same time. That makes sense. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, that is the question. If the products that is good and demand is high, then obviously, like, I want to put as push it as far as I can take it. Hopefully I can separate from my nine to five and just focus on that. Okay.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So Im a disabled vet, and so between my job and my VA benefit, 138.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Yeah, this is not a forgiving situation.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"It was definitely a challenge, but like everything in the military, they give you all the equipment, books, and training that you need, and if you just buckle down, eventually you get there. Okay. It was definitely expanded my conception of what I was capable of. But they make it doable, right? If youre committed, yeah.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Coast Guard.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello? Hello?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"So over the last three or four months, Ive been working with about twelve people from my church. And its been an eye opening thing. And then its helpful because for free because its from a church. But the flip side is people that are enthusiastic about it are willing to provide the social proof. Right. And so I think thats one of the key components when youre trying to convince people that youre not doing the snake oil thing right. Yeah. Its been about three or four months Ive been working with these folks.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, sure.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, sounds good.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"All right. I appreciate it.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Joe.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, so Im like a person that was not aware of some of my executive dysfunction until my adulthood, really recently, within the last year. And then I was like, well, what am I going to do about this? Then I just opened up this whole world of information and Im like, I feel like theres more people that probably could identify with this, but they dont know. Right. And then it was like, well, youre close to this space. A lot of times the best way to validate is just to do it for nothing right. And see if theres something of value there before you try to slap a price tag on something that you havent even done.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, so I secured like 40K, just basically line of credit. And then Ive got a few other alternative sources of funding, business, credit cards, stuff like that, just so I have some flexibility as Im cashing up to be able to work that I can pour into it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I wanted to serve, but I didnt want to do army. So I was like, well, let me explore what these other options are. And I had zero information about Coast Guard, and my best friend from high school was also kind of in the same frame of mind. And so he applied to the Air Force Academy and Coast Guard was his backup, and we ended up doing the same thing. So we both got into Coast Guard and then were like, well go together and the rest is history. Nice.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, no worries. I just want to make sure that while I had you on here that I didnt miss it or something.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"All right, cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Thats correct.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, right now Im solopreneur, so I kind of got to do the Evergreen situation, which I know kind of caps like, how much the odds of closing certain dollar amount of sales. Right now, my objective is to create a membership portal where I offer five sort of mini classes that could eventually be rolled into like a master class and to cap those at about a 10th of what I would send. So if I did a master class of like 29 97, these courses are going to be around about $300. Right. My model in the beginning will be that people can pay for individual courses. They can do a membership where they get access to all the courses. Right, right. Im just trying to build revenue and then kind of like perfect, see what people gravitate to and what I need to perfect. And then Im going to Pivot, and Ill still have the membership, but then Ill offer like a master class and I may modify the course material for the mini courses and then have the master class. And thatll be like my high ticket offer. But thats the six month mark that Im talking about. Okay. All right.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, he was on a polar roller.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right, I look forward to it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont hate it, but it definitely is not, I dont think, the fullest use of my skill set and potential. Yeah, it does, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, Im familiar. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, that sounds good.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"You too. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well. So Im an army brat.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"12:00. Okay. All right. On Friday.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, I want to ramp up to ten K a month over six months, assuming that I get traction and marketing goes well and all that kind of thing, to go from somewhere around with the small ticket. Plus the big ticket offer to start somewhere in the ballpark of like 2000 and then add another 2000 or so each month until Im above ten. K with the six month timeline is sort of my vision for what I think is realistic based on my experience.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Maybe like top line things. Are theres certain schools and activities and things that I want for my six year old whos now kind of at that stage where the quality of his experiences are going to be in his memory and Im trying to make sure that Im doing those things that I would like for him. And then in terms of just sort of separating from like a straight nine to five situation, this is kind of important to me. And then possibly par land into real estate later or after I kind of get to the place that I want this business to go. I want to do real estate investment.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right, cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"So far so good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im married. My wife. Shes a little more focused on kind of helping keep the household in order. Okay. She works too, but its just kind of like my thing.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, sounds great. I just hope you see the video, but yeah, exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I did a little bit of everything. I was on Qatar, Kushner, Ketchkan, Alaska. I did some law enforcement stuff out of Virginia, and I did flight school, and I flew H 65 Dolphin for a few years and then started having some health issues and then to get out. Okay.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Terrific.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Absolutely. Okay. Yeah, I mean, Im not super materialistic in that sense. Its just more about setting my son up, take care of my wife, that kind of thing.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"What? Do you go by joseph.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"No. Did you send the video already?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"What that yeah, my median score is, like, 700. Okay.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Sure thing.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"How?","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I am.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I am in Maryland.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I think maybe like Friday 01:00 or Friday eleven.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]