[{"pageContent":"Yeah, thats a summary of it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes. I studied with some good people when I was in La. As well, so I learned some good things from some good people.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"That would be a good thing. Yeah, that would be a good thing, yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Good. Air. AI. Whats that about?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Were going to unify everybody in the global community drum circle and music unifies people, and were all grooving on the same groove. Itll be a miraculous moment.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Not as good as we want, actually. Weve got a website. We got GoDaddy building us a website now, so we have something official other than the one I built, which is digitally challenged website, but the new website should be a little more effective, were hoping. Ive been grooving every day for the last four or five years, and its slowly been getting more and more. I added shorts, which had a lot of new views, and were just doing just now getting a little busy with it, hoping to.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Let me set my watch here. I have no idea what it costs to go to Jamaica, because I know it was good. We went for ten days to get five, six grand. That was a couple of years ago as well.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"We hope to save humanity.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, gosh. Anything would be better than making now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Another question for you. If you know how to get us back on the free ad cycle with YouTube and Facebook, thatd be great.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"My point was, Im trying to get 1000 subscribers on YouTube and more YouTube views. And like I said, the money Im not really concerned about. I want to get the views and people moving. Thats much more important.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So far so good. Yeah. I want to wipe out the competition. I forgot who my competition is. I dont want to go there. But actually, every religion leaders were groovous after the Last Supper. Jesus held hands and they sang hello in the Quran. They talked about the first sense you have of the world is hearing and music and sound, and thats the most important part of your life.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. So were mountain time.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im being realistic. I say 10,000 months would be a good month.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Until now? How about that? I havent thought that far ahead. Lets just say that.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, I know Facebook and YouTube. We used to have their nonprofit status. Ad Works gave us 10,000 a month. Thats Google. Ad Works give us 10,000 a month in advertising, its free. Facebook, I dont remember how much they gave us, but we had all that. And then somehow we didnt file taxes for three years, some crazy shit like that. We revoked our nonprofit status. Weve gotten it back, but they never gave us our status on Facebook nor YouTube to acquire those free advertising.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"The main thing is get a bit of groove.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I teach drum some, but Ive never really thought about how to get people to facilitate. If I were to do coaching, it would be as a drum circle facilitator. Ive never coached that, but I know people whove gotten coached, and I know how to teach drums.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello? Whats going on? Whos this?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Im sorry. What were the times?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Like I said, I do a daily stream. Daily groove stream. Ive been trying to get a hold of them. Like I said, I want to GoDaddy building a website. I havent spent much time doing that, but that should be my next goal. And establishing other with remo might give us drums. Theyve given us Timbali, theyve given me a Gembe. And theres many things we have a pretty good set up for drum circle facilitation they may want to give us as a substantial amount of drums. It would be a good thing to get them to back us up, or any drum company for that matter. Remo is really big on it. Maybe theres others there should be there better be.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. Hopefully video watched.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"That would be a good thing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Can only get bigger.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Ive just been known to miss calls for some reason. I dont know why.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Forever. Im an old man now, and I started when I was, like, eight or nine years old.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Marketing some promotional material. All that kind of good stuff. Its probably not enough. It probably should be close to 30. Good marketing and traveling and promotional stuff.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Im sorry.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"If you can come up with a $3,000 offer for us to offer, thatd be a good thing. If we can make it nonprofit even better. Exactly. We cant charge for a service. We give somebody something, they want to give us money. Such a cool nonprofit.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hopefully Ill hear my phone ringing when theyre going to call me. Correct?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Not much. Im probably doing maybe 2500, maybe now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"One of those basics I need to have here.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Other than the meaning of life? No, I think we got to figure it out.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Definitely sounds like I got a lot of work to do, which Im almost ready to do it, but Im looking forward to figuring out what Im supposed to do.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Proliferating humanity, like its said to do, and then were all grooving healing powers of music which are known and proven, should help our planet some.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, it kind of depends when we offer something. The thing I would primarily think of offering would be to facilitate or have a drum circle happen within their organization. If we could do that once a week, or once a month for so long, or that kind of thing. That might be the offer we want to give. Thats the only offer I can say. Coaching is that when people are drumming, its not a coaching thing. Its a moment of drum. Moment of being one, actually. So its performing the music and being one, and the unifying factor of it and all that. Its not even a money thing. If it feels good for them and they feel so good they want to give us money, all the better. The goal, though, is to unify humanity. If we get a couple of billion of us as one, I think that would be the ultimate nonprofit. Our mission accomplished, so to speak. Its nice to be to get all the advertising and marketing and traveling and things like that included.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Since I dont know, I havent really figured out how to go about it. And then once YouTube or GoDaddy is setting up our new website, Im hoping theyll be able to get us that nonprofit status. Maybe thats something you guys would want to do. Im not sure how that all works.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ken, I had a chance to really look at my emails lately, so whatever you sent me, I probably havent seen anything else you want to know about the business? Were nonprofit, and we hope to proliferate humanity.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"So what do we do to make this happen?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"We got our nonprofit verification 13 years ago.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Make a good year.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Although the traveling around the world would probably be a little more expensive. I dont know, 10,000 a month is a good jump off point. We got to 100, then we get started. I took a vacation in Jamaica. That would be the good place to get the groove happening, get all the facilities. Help me out there. Im sorry.","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}},{"pageContent":"I cant see, but I think it says 750.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"A nonprofit? I needed a name. Was it ten executives? All these executives on my board, thats the only team I got. Drum circle facilitators and friends and people, musicians I know and people like thats.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure. Right now, I dont have a lot of time right at the moment, but still not too sure. What 82 concepts have you got?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"People find value in that, then I feel they can contribute. Its not really a sales thing for me. Im sorry.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"My name is Alex.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"What I have handy, like I said, Im putting away a little bit every month. I got about two, three grand right now. And I do have my wife is pretty well off. I could probably bank a couple of hundred up for her if we had some reasonable begging ground.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Been a long day.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"What are your concepts youre speaking of?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yes, Ill find a way to do that.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Sounds about right. I dont recall, but all right, what do you got? Awesome.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Sounds good. If we get my I got a story to kind of how this whole thing began from a near death experience that I had as well. Good thing to have incorporated in the story.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Would that be such the video? Yeah, watch the video intent and see if theres anything that making sense to me discuss with these guys our consultation. Sounds right. Sounds good. Awesome.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Groovism.org.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Arizona Mountain. Okay, sounds its almost 07:00 here. I think it is 07:00. 07:00 here now, I think double check myself.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Very.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Awesome.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Well, then Ill have to go with the trip to Jamaica is about five grand. I want to do that for five, six months out of you to say, I dont know, whats, ten grand a month? I said that before tonight. So lets make it 20. Thats 240 a year. Afford us a trip or two to Jamaica and the Caribbean to get the drum circles happening.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I was just wondering, because when Im putting out the groove and Im facilitating the streaming, the circle, its not anybody specific. Although if we make it to I dont know how we could make it specifically to a company or somebody willing to pay for it. Its basically out there now for free. Its the one its there for everybody to be with.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So actually, the resort should pay for us to be there since were entertaining their guests with the drum circle. Thats one other story. They could pay for our ways and write it all off so we could go there and groove their residential guests.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I believe I want to say 680, but it sounds a little high. 600.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Tomorrows Thursday. Yeah. No. Todays Wednesday. Please. No. What is todays? Tuesday. Tomorrows Wednesday. Yeah, 400. Perfect. Im sorry.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Every religion has some musical connection. Sound is the ultimate reason I love.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, gosh, Ive been dashing those eating times. Actually, lets do 04:00 P.m just before I start dashing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, it definitely needs to save humanity. I dont see any other hope for us, but who knows? Maybe Im wrong. I hope I get proven wrong.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. Half of it is disability.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Lets go. I love it. All right, Ken, I hope you have a good one.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah. Or not even go, just to be safe. 650. I honestly dont recall.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"On the second, can you send that to my phone? Can you send because I dont have access to my email account these days.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}}]