[{"pageContent":"Well, I like both categories who dont want to travel, but I want to be able to work from anywhere. But Ive really been looking at choice one there. I want to teach people. I want to learn to do this, and I want to be able to teach people.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, Im not ready to go yet.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, thatd be real nice. Well, $100,000, thats a bar. Ive seen people reach it. Yeah, 50,000 would be nice. And even if I got 50,000, that would just be a summit for my next goal.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, I dont.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Real estate was my first investing, but, God, theres so many people doing that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Are you looking at yeah, coaching.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And I had it set in my head that I would get going good enough that I would start a construction company and do my own flips and stuff, too.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I imagine its going to take some work. I mean, these moms are crushing it on here. I know Im not pretty like that, and I cant put out content like they do.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"And she said, well, its not for sale. And then she hung up on me. Im like, okay, well, Im explaining to when he gets home.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Two or three things I checked my credit on. I got experian.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Not very long ago.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Still working on it. Hanging up and stuff.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Teach people how to set up the online affiliates, marketing, that type of thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I mean, I havent really spent anything on it yet.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I really dont got a business right now working on.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"My family is in the Philippines, and Ive been over there twice. My fiance and our daughter is over there, and its taken so long because I met her during the pandemic. And weve done everything Ive done backflips for these. Its been three years in the making, and were still waiting on MCIS to give us the go ahead.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Especially my kids and stuff. Thats the main focus. Because getting a job, even if its a good job, I had a good job. And that company I was with, theyre slowing down, and its a food company, and theyre slowing down so bad. The drivers, I was a truck driver, drivers arent getting no miles. They put up all these terminals everywhere, and now the drivers from the distribution centers, theyre just going to the terminals. Theyre not going from point a to point b anymore. Theyre just like transfer drivers now, and theyre not really making any money. That was a really good job, too. I was making one hundred k a year, easy.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Im thinking about doing affiliate affiliate marketing? Yes.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, it was almost 800, but I took out a bunch of credit cards to pay for a lot of that real estate stuff.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, it dropped, like, 100 points. Easy.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"It would be nice to do it now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"As.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"He knew what he was talking about.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Once you get them to click, you got their email, and now thats a potential customer.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No. Online thing right now. Im reading about the funnels right now.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"It should be sometime this year. Ive been over there twice, and Ive never seen more poverty stricken area. But at the same time, you would go to a place like that here in the United States, and that would be the most depressing place youd ever been. But over there, they celebrate everything. No matter they celebrate death, birthdays. I mean, it doesnt matter if somebodys having a birthday party. They all go over there because theres a roast pig for one. Yeah, but it really made me look through a different lens. Ive adopted so many kids over there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I got that vibe from him.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yes, Im good.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"All right. Ive got enough brains. I dont need to do that anymore. I can get to do it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Know, I never really looked at it like that because I dont want to retire.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, never. I felt that way for a long time. I havent wanted anybody to give me anything since I was a teenager. Its all about the kids. It always has been. For me to see a little kid smile. Nothing crushes me more than to hear it choking me up now. Nothing chokes me up more than a little girl crying. I mean, I cant take it.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"And, dude, it was awful. You got to get out of the truck to actually make a cup of coffee or to even make you something to eat. I was like, man, I got to stop. I did it for four months, and I made $70,000. But I filed my loss, and I got back, like, $25,000 from the IRS.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Denver is hot, man. Colorado Springs. Yeah, I was just up there not long ago.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im eventually, especially if I get some money in my hand, Im going to get some houses.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah. I spent that on one course. I spent more on another one. I spent more on another one. I spent 30 on 30 is the most I spent on one on one.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Theres lots of run down houses out there and vacant houses. You can get them, but you got to have the money to put in them, and you got to have the correct time. Once I get that going. I used to flip houses, but I wasnt the one collecting the check. I used to be the one doing all the work.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"February.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Well, I mean, not officially adopted, just from seeing how they live. I want to help them. I want to buy these kids clothes. I want to get them shoes. And last Christmas, these kids werent expecting anything for Christmas. And I mean, the only thing they did get was from me, which really brought tears to my eyes.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"All right, I appreciate it, Rick.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"This is huge.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, yeah, theres army guys. Theyre everywhere because every time somebody sees me, they say, are you in the army? And Im like, no.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right. You too, man.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im 56.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I spent thousands on real estate, and like I said, I bought five different courses and I mean, theyre pretty much all the same.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Possible, right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, yeah, Ive seen that video. Thats where I put my information on.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Its everywhere. Everywhere you go. AI. Its crazy running it. And Im an older guy. I want in.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont have any income. I filed a huge loss because I started a hot shop business. It was doing really well, but, man, I havent sleep in the back of that pickup, and I really didnt think that part through. I was making twice as much as I did in the big truck, but the whole sleeping in the back seat, man, and, I mean, it was fine as long as the weather was not bad. But I got caught up in Wyoming, and thats one of the worst snowstorms theyve seen in freaking 30 years.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes, actually, I did. I applied at Benny Keith. They got a shuttle truck that just goes back and forth to Fort Worth from Sherman over there, and I applied for that. And a friend of mine, his neighbor, drives for them, and hes in with the supervisor, so I might be able to get into that job.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"AI is not taking over the world. Somebodys always going to be telling AI. Somebodys going to be running it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"My neighbor, he retired from the electric company and I mean, I hardly ever see him. Hes like 68. Never see him. He never comes out.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, if I can get those pay off those credit cards, itll come back up.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well walk you through your first deal as little as 30 days, and I get a coaching call, and hes like, all right, Ill call you in 30 days. Heres a list. Call all these people on this list. If you cant get a hold of them, go knock on their doors. I did all that. One lady, just the other day, I left a note on this ladys door, and she called me as soon as I left. Im like, why answer the door? And she says, I just want you to know theres no soliciting sign out there. I said, maam, Im not trying to sell you anything. Im trying to buy your house. Oh, its not for sale.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Thats how they get their clientele. They get their emails.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im taking a beating on that thing, and I just cant get anybody to buy it. Well, might want it.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"668.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Is that what youre going to send me?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"But yeah, it was never an option for me, and I didnt want to be because being in the truck, you see a lot of old truckers. I mean, even old women, Im like.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah. With the homeowners, bless their heart, man. As soon as their house gets on a list, theyre just bombarded with calls. Its so hard to even get somebody to pick up the phone, let alone convince them that youre the one that they need to be talking to.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"No, you said youre going to send it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"And the reason theyre still doing it is because if they retire, they just get a little bitty check and theyre used to that. Big check. Sure. Truckers dont plan well.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And thats what Ive been living on. I thought by now I would have a house I could sell. Even to top that off, I got this 40 foot trailer. I cant sell either. I mean, Ive marked that thing down the next to nothing.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I have no desire to swing a hammer again. I promise.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, thats what I clicked on.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. I want to be able to make a difference.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Time youre trying to put money back so when it is slow that you can make it through a month that you dont get nothing.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, that wasnt my first choice. Real estate.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, they do TikTok and stuff to get people to get the followers.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Department the 30 I spent, Im in Im a lifetime member.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, I dropped below 700. Let me look on my phone.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Well, I had my own trucking company, but being on the road, I wasnt able to really focus on this real estate stuff. I couldnt do my calling and go doorknocking and stuff like that. If I got a client, I would have to wait until I got back in off the road to go and got it, meet with them. I expected a lot more than I got out of that.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"So I probably got her husband in trouble because a lot of times the wife dont know. Shes pissed me off. So I said, well, youre on the foreclosure list.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}}]