[{"pageContent":"Honestly, though, to see, Ill say this for whatever its worth. Thousands come in and thousands go into investments like crypto and then into the kingdom. Crypto and the kingdom, the kingdom being thousands. So Im not one to hold on to a whole bunch and very frugal about where else it goes to because those are the two biggest priorities in my life yet. I am open minded to AI, but if its going to entail, which it may be, and it doesnt surprise me, 5000 or more to be involved, I may have to say thanks, but no thanks at this. Because whats more of a priority and more of a more massive return that I see and understand is eternal rewards with the Kingdom of God and with the right cryptos.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont want to talk on the phone about it. Its something I dont want to discuss on the phone.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"No, I dont think so. But was it supposed to have been emailed out?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I have a couple of businesses involved. Crypto also. Number one most important lord Jesus Christ. Evangelizing spreading the gospel Twenty four seven. And what Im saying is all real deal for you to know and for it to be recorded worldwide. If we gave a quick message, billionaire to bum, murderer to drug dealer to doctor attorney, doesnt matter. We come in with nothing, we leave with nothing. Only that which you do for Christ. Everyone sends before the boss. One day and near death experiences. If you never met, check into it. I met 70 up heaven, I met seven down the hill, came back, so just caught me in the middle. Evangelizing now we got a major event happening, 350,000 people this weekend as we go to the Cello Fest. So were doing a big outreach right now to that. And next week is the same and its following subsequent week is again 150,000 with Stagecoach. So busy, busy serving the master and so everything else. As you know, we take nothing with us and our lives are vain without God, correct? Right.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Caleb. Is that who this is with?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Whos calling? Hello? I cant hear you.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"When they were mentoring him before then he was been on with Tony Robbins and all those guys and Graziosi and all them how long have you been working with him?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Say that again now?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Honestly, this is different. Its a different game. My credit is the pits. I dont go with credit. Everything I have been paid often, so its a different Im definitely out of the system, dont play the world system. And I do it Gods way and my life is abundantly blessed. My credit, 400. I dont know, to me it doesnt matter.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Thanks and.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. This with whats his name, the young kid? I dont know his name.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Always be learning, right? And AI is the next big massive trend. Its been pretty much on for about 70 years. Been out currently, as you know, the deal, since about November. Correct. And so if we dont get involved, dont want to be what it could have, should have. Correct. Are you there?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hi, whos speaking?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, Im not sure I understand, but just what comes in and goes into investments. So Im very meticulous and very frugal with what Im not about things. I dont invest in having big massive homes and properties. I invest in the kingdom of God. I invest in soul winning. I invest in supporting the gospel. I invest in helping the poor, the homeless, and hundreds and thousands of dollars goes out to different ministries that way. Does that make sense?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its seven. Evangelize. V-A-N-G-L-I-Z. No e seven at Gmail. Is that where yes, I got it.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, I do better than that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Um, well, Im just Im actually retired, so its not like Im really trying to grow the company too much as I used to. I have my nephews and such that are real go getters and asserted not that Im not, but Im just saying my focus is now is the Kingdom of God. And so the more that comes in, the more it goes out. So Im going back on the goal scenario. I could use another, say, half a million or million a month. That would be great. To do more, to have more, to do more.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Caleb is highly respect and saluting for success. And hes obviously the 4 million, as he says, a month with his partner were probably looking at to get into his package of 5000 or more, whatever it might be. I do have some other avenues too, Im looking at, so I may not go this route, but AI is a big ticket and Im certainly not going to let it pass me by. So if you want to send that info to me, Ive got to continue evangelizing. Theres masses of people coming in. I appreciate your call and your questions.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im actually retired with crypto and I just have other businesses, I do, and good question, and thank you for asking, but its just sitting on things I have for the right times to come and then itll manifest. But it wouldnt hurt to make another 50 or $100,000 a month or more, half a million, a million a month, no problem. But with crypto, its going to be way beyond that, but just sitting on certain ones before until that manifests comes to fruition. And yourself, how are you doing?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Awesome. Happy, free and blessed. Thank you. From where?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]