[{"pageContent":"Then I was going to turn around and talk to whoever you have to about reentry. Then youre talking to the workers, like the workforce or the agencies that give you jobs be tied in with youre helping out the county, and youre also helping out out people, and then thats helping out people.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Id have to find out. I dont really know a lot about marketing, so Id have to get somebody that knows about it, figure it out.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Well, I see a lot of peoples abilities, like drawing and painting and stuff like that, and I would like to sell their work and, I dont know, be helping out, helping me sell it. But I want to sell it to try and sell it close to a higher scale of income. Some ugly to some is expensive to another because theyre all one of a kind. So thats why I like it. Ive seen a lot of pretty art out there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Just starting at the bottom. But I dont mind, because for a long time, I just secluded myself, and now I want to get out, get used to people again and chat around. And so I thought, the best place to start. Absolutely. I tried. IHOP one time, they were all, like, really young. I would mention, like, actors. They wouldnt even know who they were. I gave up too much of a young atmosphere here. I usually driving a truck for a long time, and then not long, eight years. And then I quote a DUI. So thats what was my career. And then I love cooking, so Ive been doing dip on damn cooking.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"How are you doing?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"For you to be just seeing people do the right thing. I want another project though. But I dont think it has anything to do with you can do but where I stay at theres a lot of unwanted homeless people and I wanted to build a shelter not like to wear any shelter but when they come home, they have a job waiting for them and they have a little place loft like artist loft. Those buildings are real small. Theyre real small rooms.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I appreciate it.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"It sounds like a lot, but I mean, it sounds like a little bit.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thats my idea.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont even know. I never had that much. I was, like, driving a truck, and I was close to not that much, but I dont know. I have no idea yet. Theres a lot of things. I would have a house paid. Bought and paid. Car, bought and paid. My sons house, bought and paid. His wedding. You know what I mean? Like that. And then on a long vacation. I havent been on a vacation a minute, really.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"If I made $20,000 a month?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure. Have a good night.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, thats fine. That would be good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Otherwise what do you think something like that will cost, though?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Its about 30 hours. No, he just found out if I knew how to cook, so I came in with my chef jacket on yesterday, and he said, you got to cook. Yes, I dont mind cooking.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, yeah, I mean, theres a lot I remember being on those dating sites, and I was always giving advice or texting other people and giving advice, and thats pretty good advice. Kind of like an advice, like a relationship coach. Yes, thats what I want. A long time ago.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"But its just that Im brainstorming if one fails, then I have something else to jump to. Thats why Im like that.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I just got a job at Sumos.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I lost you.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"None at all. But its just that I dont know. I think I can help. I share a lot.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"What else can I do with it?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Thats fine. Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I did see when I was unemployed, and then I tried oh, last year I worked for my ex girlfriend for we were together 13 months, so she owned a bakery. So I just worked for her for free. So I didnt really make any money. I mean, I had a house and stuff because I live with her, so.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Potentially to start something.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"With this job? Very light. Its only like I think its like, 1115 an hour.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im not really sure. Yeah, I wasnt having really paid attention to it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Its a steak restaurant.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Its been a minute now. It was like, six. It was really low. Six. Okay. Probably like, maybe a little bit. Maybe five. Like 590, I think.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, itd kind of be like an art gallery almost. Kind of, sort of online, like an art reseller, basically.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}}]