[{"pageContent":"Morales.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"AI.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, and I lost my dad during COVID as well. I took care of him 16 hours a day for a year before he passed. And Im so sorry for the loss of your father, because I can tell you this, as a soldier in three wars and as a paramedic and working in operating rooms, Ive seen more people die than any man should have to. And I kind of thought I was prepared, but its totally different. Theres nothing that equals losing a parent. Its just a completely different dynamic. What you feel like you lose as a part of yourself versus grandmas or grandpas passing or other things, you know, thats tough. But right now, looking at my mother having to bury one of her own children before she dies. Its heart wrenching, man. So thats the other thing for me, is financially, my family, we dont come from money, but I was very fortunate. I built an eight figure business early in my life in my 20s. Im 52 now. And so, again, I used to be an international public speaker, and Ive done a lot of very big things in my life and been very blessed. But right now, these last couple of years since COVID they took a really big toll financially on myself. And then I had to have open heart surgery. Matter of fact, I hold the world record for the longest open heart surgery in history. So, unfortunately, that cost me several million dollars because insurance wouldnt cover anything. Yeah, its a hell of a story. When you got time more, well get to know each other. Is this your number, or is this one of your systems numbers thats generated?","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Hello? Yes.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"You know, Im dealing with some family stuff right now. I was telling Donna that my man.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"ItS my sister. She died at 40 of cancer. Its very sad.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, yeah, I had a family member pass away, so Im trying to deal with that and handle a sick mom. But what I was telling Donna there is that Im working on developing some coaching content, and so Im not ready yet, but I did want to get the case study, and I like what I see with your company. Its just a little premature for me to be talking turkey right now. And Ive been a coach for many years, but right now, Im right in the crux of dealing with the avatars and the pain points and putting that content together so that then it could be something that I would be able to maybe look at a lot more serious.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Where are you from?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah. Okay. Well, and thats where some of my family was, too. My dad actually growing up there, he used to be a surfer, so he would surf Newport or Huntington Beach and go out to some of those places. I had cousins that lived in Brea and stuff like that. But being that I grew up where I grew up, naturally, I have, like, my sister, she lives in Ceres, and thats largely its predominantly Mexican people. Thats who all of her neighbors are and who her kids go to school with. Same as we did when we were younger. Very diverse. So its kind of different here in whitebread, Minnesota, but it helps to travel around the world, too, so that didnt hurt me. Okay, man. Well, I appreciate it. I will go ahead and add you, man. And thank you again for your call and your time there. So now I know Donna is an AI piece there. That helps. All right. Thanks, brother. Appreciate it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"My mom and dad were Greece lightning kids from Los Angeles and SoCal. But when I was very young, we moved to the Vario. We moved to the ghetto, you know what I mean? So we were in places like Modesto, Stockton okay. Some of those areas. And then later on into the Bay Area. How about.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. All right. Its up there with the big digital marketing agency fees. A lot of them are 15 to 25 grand. You step up to 40 when you start dealing, 45 when youre dealing with Russ Rafinos and that but, hey, if timing is right and things are good, then there you go. Is 30 grand the only program that you guys are pushing? You only have the one high ticket program, or do you have levels at all?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Take care. You too. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Well, I was too. Ive won a lot of Morales.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Okay. Its his program right now that Im working with his team of coaches to help me flesh out my program because of everything thats been going on, because its so freaking emotional of a time in my life, I needed to pretty much kind of check the ego as well, you know what I mean? Because Ive done so many things from performance coaching to mindset training to all kinds of other different things remote, closers things that youre doing now that are awesome. But the bottom line is that right now Im also looking to find out, okay, well, what is the market hungry for? So were going to start with a $5,000 ticket and then raise it later to ten grand. And then hes got Apex programs and other things. But Ive watched the AI revolution myself, and I know that some people are just absolutely crushing it with that stuff. And I saw the numbers that your team and those people are making some kick ass money and smoking. Bottom line, I guess, is what is your pay to play type of fee? Is this a $5,000 program? Ten. What?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah. And Im trying to deal with my mom because I have two kids, Alex, and I cannot imagine if one of my sons died and one of them is actually in the military, like, I was I was a three tour war vet, special forces, combat flight paramedic. And now my son is over in the war, and every time the phone rings, you know what I mean, you just get that little god, please dont let it be the Department of Defense calling me, telling me my son is dead.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Interesting. All right, well, I appreciate you shooting me straight. Im being in the business myself. Thats not something that scares me, you know what I mean? So thats cool. I appreciate you leveling with me, because it honestly helps me make sure that Im not wasting your time. Even if we continue to communicate, then when things are at a point where Ive got shit ready and I think that that would be the right time to pull the trigger, then absolutely. We need to do some discovery on that, for sure. No doubt about it. So, anyway, thank you for the condolences on the family thing. And again, Im sorry to hear about your father there. So I will add you to my database here. What do you want me to use for your last name? Alex?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Im dealing with three babies, man, and I dont know if youre daddy, but.","metadata":{"fillerID":13,"fillerText":"Uh-huh","category":"A"}},{"pageContent":"All right. Yeah. Well, like I said. Are you familiar with Richard Vu?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}}]