[{"pageContent":"Well, theres my core business from a background. Im an ex Wall Street executive.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. As far as volume is concerned, like, say you want to scale this and grow this. What is your Saturation point as far as number of clients in a month?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, I was not interested.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I dont use any CRM. Im a CRM.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"01:00. Okay. 11:00 a.m for me. Okay. All right, Ill do that. Hey, Bob, its great talking to you, man.","metadata":{"fillerID":8,"fillerText":"Yeah","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Hold on. Ill tell you in a second. I have not.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I do. I have a few minutes.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Every time I see that, it looks like its just thats why I got out of it. But I started young, too. I started in the 80s. My core business is I have a separate business where Im a small business advisor. Basically, Im what youd call a liquidity advisor. So I deal with Small businesses that generally the Sweet Spots are about 15 million in revenue, 20 million in revenue, though I have clients that Ive got One client thats 100 million, and I advise them on liquidity, and then I go raise. I put them into programs that give them liquidity, whether Its Your equipment, finance, commercial real estate. I get paid by fees. I get paid on commission.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. We moved down here about a year and a half from the Northeast new York New Jersey area, and I would not live in mainland Florida. I got to be on a coastline. You got it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Lets see.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"So I was on Wall Street for 30 years.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I got to the end and it just didnt okay. The calendar didnt come up.","metadata":{"fillerID":38,"fillerText":"Ummm yah","category":"F"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Be nice. Itd be nice to do that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, there you go.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, yeah. Makes sense. Heck yeah, makes sense. Okay. I wanted to find out, as far as what youre doing on a monthly basis, what has been a good month and when has been a great month for you?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"What, a month?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Yeah, I did. I was blessed. I was definitely blessed. But yeah, it really is just improving on the quality of life I have now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im not really too concerned about the case study. I want to learn more about what you guys do.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So the other thing, Rick, is I generally tell my reps because I spend time training them. They dont know what I know because they dont have my background, but I give them enough information to be a little bit dangerous. And then I tell them, look, dont go canvas. Go specific. Go after manufacturers, go after distributors, go after this industry or that industry, whatever they seem more suited for rather than just canvassing. So I spent a lot of time with reps on the phone, and I dont know where these kids got educated from, but theyre not that smart. They dont know the products as well as they should, and its not rocket science. But I get a lot of funky calls on shit that I just if I could eliminate that, thats probably 20% of my day. Okay.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"You know what I mean?","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, this is going to be a simple one. Ready?","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I have reps around the country, and it varies depending on what day of the week it is. Some are good, some are bad, and they go out and they find clients that are in need of capital, and then they bring them to me. And once they bring them to me, I handle them from start to finish. Okay. And then I say, Go out and go get more. Okay. It works pretty good. It works pretty good, but it could work better. And if I did something, heres the key. The ROI for me is better without a rep. So when I get a deal direct, I get paid more because I dont have to pay somebody.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Doing nice things with the wife, which we already kind of do. We go out to dinner three or four times a week. We drink good wine. We can go anywhere we want, really. I just dont feel like traveling anymore. Im sick of it.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Alexander. Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Absolutely. Ill talk to you on Monday. Have a great weekend. All right, be safe.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right, yeah, I figured it would be pretty high.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Got it. Okay. All right. What has your revenue been on average? It sounds like you say some months, you get more clients than other months. So what is your revenue generally?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"It is kind of a consulting business. But I Dont charge fees for my advice. I only get paid If I raise money for you. So, hypothetically, say youre a manufacturer of widgets. I dont really care what the product is, okay? Im going to look at your financials, your PNL, your balance sheet. Im going to see what kind of assets you have that can be leveraged. Im going to advise you on how to use that to obtain working capital and ongoing liquidity.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"But ideally, its more stability for the kids and things like that, leaving them a little bit more. I wasnt left anything.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Its more getting them on, setting up a meeting, getting them in a meeting with me. And then once that happens, its all down to me. Thats the only job, you know what I mean?","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, thats a difficult one, Rick, because I live a pretty damn good life right now. I did make good money on Wall Street. I lived all around the world, so I dont want to travel anymore. Im quite happy just being here and doing nice things with the wife. Okay. We do, like, two, three day trips, that type of thing. Well get on a boat and go down to Key West for two days. Shit like that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I lived in London twice, and I lived in Hong Kong, and Ive seen the world, and the worlds getting uglier, so I really dont have any desire to go back to Europe or anything like that. Its more just hanging around the US now and doing nice things, buying my wife another newer car, shit like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ambitious young men?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I get paid on results. Call it old school, right? Yeah. So thats the core business. I have the other thing now that you say, Ecommerce, I set up for my wife. I hired this company to do a funnel for us, and were selling some pet dog products, like water bowls and shit like that. Theyre doing a lot of Facebook advertising and some TikTok, Et cetera. But to be honest with you, its not really taking off. And Im not sure if its because of the pricing or if its just because the ads are So shit that they did. And Ive thrown, I dont know, probably about 15 grand into it already. So that might be another good one for you guys too.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"30 years? Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"50 grand a month in revenue, because, do the math, thats 600 grand. What is it, 540,000 net?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"30 grand a month, okay. And how much of that, realistically, is profit.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I would recommend that you look at my website because itll give you idea of the products that we do, background, things like that. Its Alexander. Its my name. Alexanderfs.com Fs.com Financialsolutions.com.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And where do you want that to go, ideally, if you had ten paying clients a month? Well, I guess it kind of differs on the amount that you get.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"A business, I could easily put 20K in, yes.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"But no, look, pigs get slaughtered, and Im never going to be a pig, so Im quite content with what we have right now, but if I can make it better and not have to deal with some of these reps, thats the ideal goal. Right? Okay. And then as far as that other business goes, that ecommerce, just scale it because it pretty much runs itself.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Mine? I have no idea. I would imagine its probably around there.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, well, I am within a mile.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats just flow and advertising on social media type shit.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I think so. That ones not as familiar as Tony.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And then When I document everything, and then I review the contracts, Et cetera, I bring the lenders in, Et cetera. And then Once that closes, I get paid. Okay? So it is kind of a business advisory, but the advice I Give is free, so I dont charge for my advice.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, you have to share it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"It can collect clients, but Its more of an advice for information. Okay. It does have on It things like articles Ive written over the years, and its got a contact sheet. Its got a pre qualification form. Its got stuff about me, my background, Et cetera.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"So I do various different things. You can check my website out, Alexanderfs.com, and itll tell you the whole thing. Thats one business, and thats the core business that pays all the bills.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, its interesting, actually. And over the years, Ive spent a lot of money on different things. SEO, pay per click, shit like that. And they generally didnt work. They generally didnt work. And Ill explain why. Its more of getting the client on the phone with me, and when I get on the phone with them and I explain to them options and my background and things like Im then selling me rather than products. These are products out there that banks can advertise for, and they could spend 5100 grand a month. So Im competing against actual lenders out there. Some of them are big. I dont typically deal with the big money center banks, but I do deal with the mid tier banks, and I do deal with the smaller banks, and I definitely deal with alternative investment lenders. So its not necessarily driving them to my website. The website is a resource for information, but it just hasnt worked in the last 13 years Ive been doing it. You know what I mean?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure. Absolutely. And that would be ideal because its more than enough. Im not working like I did on Wall Street, et cetera. Okay. And I could still have a quality time of life.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Im on the west coast. Im in a town called Cape Coral.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im good. How are you? Good. I was trying to set up an appointment in the system. It didnt give me a date.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"They want to just be able to somethings in their face and they need it that type. And maybe that is social media or something like that. I found that most of my business, and I would say 95% of my business is relationships and people being introduced to me referrals. I get referrals from lenders because they know my background. They know I give good files. Weve got a good process. Its a real simple process. Somebody gets identified, whether its through a rep or somebody got a referral and they called me or whatever, get on the phone with me. Im going to ask you a series of questions about your business, general stuff. If theyre lying to me, once I see the financials, Im going to see it real quick. So I then give them offers, options that are available to them in their industry or specific, or I tell them right then and theres no, I dont have any programs for them. So its a real quick, easy type thing. Its probably a half hour conversation. If theyre interested, then I follow up and I say, okay, I explain the process to them. And then I say, Im going to need a series of documentation. And boom. Then I send them out an email list out what documents I need, applications, whatever it may be, financials, tax returns, whatever it may be. And they send it to me. And I keep everything. Nobody on the team has access to it but me. Its all in my Google drives, so Im the admin over it. And then once that happens, I then identify the best programs I have for them and I go down. If one doesnt work, I go to the next one, but I dont canvas and just send it out. Thats what a lot of those morons in that product I told you about do. And it kills a credit, it kills clients credit. Thats our process. And its real simple. Its real simple and it works. And Im making good money. I want to make it easier, streamlined, and Id love to get rid of reps because reps waste a lot of my time.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, no.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"It depends, because you got to remember who Im dealing with on a client. Right. So Im not dealing with like a brick and mortar type shop. Im not dealing with pizza places. Im not dealing with restaurants I have, but Im more or less dealing with sea level either CFOs or the business owner themselves. Understand? And when you look at what those guys use, yeah, they may use like, Facebook or Instagram personally, like I do, or even maybe even LinkedIn. So social media advertising hasnt really paid off in this field for me anyway, unless you tell me something different. But when you get to this AI shit, and I dont know enough about it yet, but Im starting to learn more, theres some unbelievably creative stuff that can be done there. Correct. My thought process was, okay, well, how do you leverage AI to identify people that are searching for it? So what do I mean by that? Theres firms out there, like salesforce, for example, where theyre using AI in their CRMs to generate other clients and seeing and then theres ways where you could see in the web where people are searching for certain things. So, like, if somebody typed in in Google or even in AI or Chat, GBT, whatever, receivable financing. Theyre looking for something. So how do you got to drill into the people looking for it rather than just do a broad canvassing? Does that make sense? Yeah. So thats why I suspect Ive had a lot of different marketing firms that Ive used. And I used to have cold callers years ago when I had my office up in New Jersey. It generally didnt work. It generally didnt work because sea level executives dont want to be bothered with cold calls.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It all depends on ROI. If you guys can show me that Im getting a return on the investment, I dont really have a limit on what I can invest because Ill throw the money back into it if its generating ROI for me.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, you may make a real good money.","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}},{"pageContent":"Bob, are you the one that was in the video?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}}]