[{"pageContent":"Yeah, Id like to look into it and see what resources you had to send me so I can read and do a little bit of independent research before I make a final decision.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, I dont really have the answer to that question. I dont think work is work, but yeah, I dont know if Id want to be coaching or teaching people how to do stuff. I wouldnt say that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"When you say coaching business, what do you mean by that?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Annual income? Man, I prefer not to answer that.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Got you. So I would just be sharing basically what Im doing and how to build a business and how to do similar things that Ive done with my business. Id be sharing that with other people, and then they would be paying me.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Like I said, I dont have a certain number in my head. It would really depend, like input, output. I just have to look at it to see what would make sense. Because I dont want to just throw a number out there. Just to throw a number out there.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, Im just going to throw a number out there. Im just going to give you a number here. Lets just say $2,000.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Okay, yeah, send me your website and Ill Ill let you know what I think. Like I said. Yeah, no worries.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Got you. So Im in the real estate business. I buy land, I buy houses, I buy mobile homes, and then I sell everything. Sometimes Ill sell it cash, but typically were selling it bread. I got confused there. Typically were selling it owner financed, but I would say our real bread and butter is just selling land, buying raw land, clearing it, and then selling raw land.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Got you. Okay. Whatever it is that youre trying to get me doing, like I said, I want to see the big picture. How everythings working. Im on the road right now, so I cant really look at everything and type everything out so I can see the bigger picture here. So if you could just text me exactly what the end goal of this conversation would be, Id be more than happy to move forward with this conversation with you. Come later next week, monday, Tuesday, Wednesday, Thursday, whatever day it might be. I just like to sit down with my team, look at everything, if it makes sense. Okay. Lets dive everything into it. I dont want to give you half ass answers here.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Good, how are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Real estate sure is great. Help people. At the end of the day, Im here to make money, provide to my family.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. Got you. Yeah. If you want to email me some stuff over or text me some stuff over, Ill look at it later and I can get back to you if Im interested in it.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Yeah, I can see that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"If I could be making, Id say $20 to $30,000 a month. Thatd be a starting point. But I would just like to be making that in notes and stuff Ive sold previously.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"A month yeah, that makes sense.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, what was the last question?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Right now? I mean, just on payments, its not too high. Its somewhere around $2,000 a month. Thats just, like, monthly payments on down payments. Probably anywhere from, like, ten to 50 grand?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, I dont think Ive seen a case study.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Like I said, I need to do a little bit more independent research and see what I can do. Ive started a bunch of businesses before and put a bunch of time and effort into a lot of things that didnt end up working out. So Id like to make sure this is something that completely makes sense. And if it makes sense, Ill be able to allocate a certain amount of money towards it. So like you said, theres not really a right or wrong answer. I can think of whatever I need to put into it. I can figure out how to get everything lined up for it, but I just need to make sure it makes sense.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"I dont know if that was me or if that was a while back, but I havent opted in for anything recently. But what all do you all do interesting?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It really depends just on what were selling. So I dont have an exact number.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im not really sure, to be honest. Most of it comes home to me, but, I mean, I throw it back in the business.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah. Ten to 50, thats down payments.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, its not crazy high. Its like 750 or something.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"God bless AI. Okay.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"What I could be helpful with? Thats a great question. I mean, Ive started so many businesses, and it all landed at real estate, so Im sure I could be helpful in creating systems to create an efficient business. Like I said, were kind of shooting in the dark here. Theres all sorts of little skills that you need to be, and Im now where I want to be, but somewhat successful. You got to have all sorts of different little things. So Im really not sure exactly what I could offer to the table. Thats something I would need to find out.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I mean, Im already giving you a lot of information. Like I said, I want to do some more research and see where Im at if this makes sense. So I dont want to use up too much of your time if I dont end up doing it. But at the same time, I dont want to go ahead and dive a bunch of my time and energy into this. If it doesnt end up making sense for my business, Id like to do it for sure. Its just an idea.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"A few years now.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Dont get me wrong. Theres nothing fast about it, sadly.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Im not sure if Im on that coin, but I dont give a shit about the business. All I care about is making money.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}}]