[{"pageContent":"Is that the 58 75 number?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah. Whos this?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No. And thats a great question because theres semi cold or even warm leads that will come in that whoever fields those calls or has that first point of engagement needs to be able to move it down into the funnel or say, gosh, you know what, Dana? Youre really not a good fit for what were trying to do here, and thats okay. But those are educated people, even for short term themselves, that can be trained how to do that. The other perspective is that he probably would bark at the fact of hes gone through a bad time with not the recession, just a couple. Were in Detroit, so its still called the Rust Belt because weve lost billions of dollars of revenue in hundreds of companies that have either tier one, tier two, or tier three suppliers to the automotive companies. Because its branched out and its whatever. We lost the opportunity base. So where I was going with that is hes probably going to say, well, no, I need to talk to him because I have the expertise and want to kind of if you dont have a pot to piss in, everything you see is a pot to piss in. So Im trying to give you a good answer. The real answer is I dont know. I would like to let him make the decision of being able to let go. He understands the process, but I think if he finds the right people and the right process that he would be able to say, sure, I can do that. Let them handle it until I keep inspecting and then it becomes a problem. If its not a problem, then I can just let it go.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hang on.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, I already thought this.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Which is what?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Ive been social media surfing and seen all the different opportunities, and I know that 90% of them are full of crap. Theyre basically just they are providing a service in some instances, but a lot of times theyre not. And its the whole click, funnel, clickbait kind of thing. I understand that. I get it. Its the nature of some of todays sales world. Are you basically an affiliate for the program yourself?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I did. It was, um sorry, I woke up from a nap. Im getting over pneumonia, so I catch sleep when I can because I cant sleep laying down. Yeah. I was actually investigating it for a good friend of mine whos an attorney. He doesnt necessarily have high ticket items. I was going to investigate putting together an advert for him with a click funnel and a follow up system so he can get some more customers for his target audience and beginning stages. So, yeah, thats what I was most interested in it for. Are you familiar with I forget what Robbies last name? Is theres somebody else in your business as well? I was following him for a while. Anyway, let me ask you a situational question. If Im an attorney and I have a strategy of trying to acquire more clients, consulting clients, where Im their attorney, Im their CFO, and I also have experience doing Im paraphrasing because its not me, its him. I also have experience doing mergers and acquisitions in the smaller market, SMB market, less than 50 million. Would this be a fit for that?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. I have another question for you. Yeah. I know youre as excited about this as I am. Ive always believed this, but theres opportunities where and this might only happen to you once a day or twice a day, maybe once a week. Twice a week is that you find the one person thats I call it a harmonic point of convergence that you are meant to talk to. So youre my phone call today that I was meant to talk with somebody. I love them. Yeah, seriously. And you can use that phrase, Ill let you have it for a dollar harmonic. So what I was going to say is, right before I went in there, I was dabbling in trading options. And well just call it generic trading for now. I got hooked up with a couple of really great discords. Not that I want them to be the target client, but another guy that I got in touch with, put in touch with, whos kind of a mentor, a younger kid on the West Coast is making thousands of he trades with a portfolio, even though its small, of like 45 or $50,000 a day. So hes making two 3510 grand here and there. But he wants a way to monetize the process, which Ive already found someone else whos done a whole click funnel on it. And you know what they say imitation is the best form of flattery. Your system, I think, would be ideal for finding new clients for that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, shit happens. But people still have dreams that they want to turn into reality with actions. Exactly.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes. The gear started turning as soon as you were describing the process and high ticket sales. This could be an offering I could do myself.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Youre going to say that to anybody? Because youre going to want to split it up into individual silos and then take your blueprint and lay it on top of his business, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I said youre part of the family.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, most definitely. Okay. All right, Alex, I will definitely get back. Lets pause for the weekend. Im going to get to this stuff today. But in terms of next steps, getting back in contact with you and to start putting the foot on the gas.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im going to tell you the absolute honest truth. I didnt have a lied to you yet, and Im not going to start. I unfortunately, when I go out drinking, like, to drive myself home, and I just got out of jail after being in there for ten months, Ive had multiple DUIs, but in Michigan, they go back like 20 something years. So the judge didnt like me this time, and thats why I got the sentence that I got. So Im not employed. Im working on small projects for my buddy like this while Im actually looking for a new opportunity straight up. Thats where Im at.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, most definitely will, because after the whole trading opportunity or whatever that morphs into, even though I do have Add, I try to rein it in and find specific opportunities to work on, and my mind is flooded with them right now. Okay.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Good. How are you doing?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. How long have you been with there?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"A lot of people tell you a story, and then next thing you know, you thought you had a hot lead, all they would do was lie to you to try to bleed you for information.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Okay. All right.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"All right, fantastic. Have a great holiday. Have a good one.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Be straight up with you so you.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Exactly. I love him like a brother. Hes a tremendous businessman. Hes accomplished outside of business as far as not philanthropically, but yeah, philanthropically and just having a good heart and always being there to support organizations and such. So I want the best for him, and it almost scares me about the opportunity thats there and will he be able to wrap his mind around it, if that makes sense. Because I know that I have a loose understanding I wont even say what I was going to say. I have a loose understanding of the opportunity with engaging with something like your service I wouldnt even call it product. He could go from three or four clients or four or five clients now to 50 clients in nine months. Twelve months. Notice how I didnt say 30 days? Yeah. No, I like the practicality of your approach very much.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. The long and short of it is Ive been friends with him for 30 years and have always seen since hes broken off on his own in the last ten or twelve years, has seen more potential. But its the classic I wont even call him a sole proprietor because hes got employees, but it is kind of like the sole proprietorship challenge of Im working on my clients. Oh, shit, Im not generating new sales. Im generating new sales. Oh, shit. Im not working for my clients. Right, so when youre working for your clients and you have I wont even call your system a passive but a proactive opportunity generator, then thats phenomenal. You can take your time out of your day and deal with targeted prospects instead of having to do any cold calling or anything. So thats where Im at, and thats where I kind of fit in the puzzle. Like I said from the very beginning, its more of an educational investigative process that Im in trying to find something for him. And hes not technical, and he hasnt really done marketing in the past. And my background has been sales and marketing for like 30 years, but Im not a master of it. Trust me, Im not. Especially in the digital world.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its like a 450 something. I lost everything when I was in there before I got out of there. It still wasnt like, perfect, but it was around the low 700.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah. Well, every day is a new beginning. I dont mean to belittle what you said, but its true. The other perspective is that Ive been in software sales when you were talking about Twilio and the spam filters and understanding and being able to utilize AI. And Ive been in the AI space for prior seven years. Even before, AI was like a buzzword. So Ive sold all that software and the supporting software to have a true AI system. So Ive been selling software for 30 years.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]