[{"pageContent":"Youre in Texas so youre in Central Standard Time, right?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Do you have that open?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"If you guys have, like, one of your you guys could start to pay it forward. Like, you have a client thats scaled into the millions, be like, hey, dude, could you maybe fund or sponsor someone? And then when my business gets up there, I can pay it forward or pay it back or whatever.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I do, yeah. I work part time for a friend of mine that has a home health aid, private home health aid company. So I work with older couples and my studio, whatever money that makes. And I am actually currently looking for a job. Ive had a couple of interviews this week.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So I would say probably here for Eastern Standard 01:00 p.m.. 01:00 p.m.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Awesome.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Right? Because I would do that if I was definitely to go through your program and I reached ultimate success. Id be like, hey, who can I sponsor that may not have the capital or the money? Like, if this is a proven flight path to success and its a no brainer and you guys stand behind it 1000% and you have all these successful clients, well, then I would love to hop on that bandwagon and then pay it forward once I made my hundreds of thousands of millions of whatever I would make.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"All right, thanks so much.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, that would be great.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Oh, definitely. I made it in Google drive. Its called the Triple Moon Goddess, and it teaches you how to utilize the energy cycles of the moon, and it teaches you how to inscribe on candles and what crystals to use to help manifest and bring things into your life. But I kind of threw, like, spaghetti at the wall and nothing stuck. So I already have a class like that already composed it. Definitely could use some tweaking if I was to relaunch it and send it out there. Im always coaching people with the stuff that I post, and I could definitely put together something to help people on their spiritual path, help manifest and just kind of destress and let go of things that no longer serve you and all that stuff.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. Like whats a funnel and how do you build it? And why does it seem so impossible to figure out?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Oh, its shit. Since the Pandemic, I had a housekeeping business that I went under during the Pandemic, and Ive been crawling my way back.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Its going good. Can we schedule a phone call at a later date and time? Im literally just stepping out right now.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Probably, I would say tomorrow.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, I do have a course that I made, but then I put it out there and with lack of knowledge of how to advertise, I didnt get any bites. Like for a tarot card reading, its 55 for half hour, its 80 for an hour, which that can be done in person or online. When it comes down to coaching, I have looked into the Accelerator Authority program that Sonny Leonard Doozy does. So I am in that program right now trying to figure it out. But its kind of a foreign language to me. I mean, I am 46, so I dont know if that has anything to do with it or if Im just reaching like a mental block or whatever.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, thats the hope, right? I mean, Ive been pounding the pavement and just really trying to get into the momentum of manifesting this. And like I said, I dont know if its just lack of knowledge and its like you can search and everybody has their own two cent to put into it, and you try to apply everything and its just like I just need a clear flight path as to what will bring me to success.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. Somebody emailed me. I get emailed all the time. Like, youre not using the proper hashtags. Im like, Im using everything that when you do the hash. I do keyword search everywhere, and these are the ones that the computer told me would, and I see other channels using. So its just like, I guess theres an exact science. Or is there or is it just like, whatever is trending then? I dont really know.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"No, I have not. Because Ive been Robin Peter to pay Paul. With the economy, electricity, like, everything going up. Its just crazy.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Right. Like, I paused my YouTube videos just because Im like, okay, Im in this coaching program, and its like, you need to put out there what your ideal client would want. I dont even know who that is. You know what I mean? Its like my niche is spirituality, and its like I have practiced many different paths, and Ive taken a piece of each and put it into my business. Its not just like Buddhism or witchcraft or meditation. Its kind of like a mixed soup, like a ratatouille of spirituality, do you know what I mean? And whatever works. Everybodys different as to what theyre going to I always say follow your intuition when youre trying to find your path. So your intuition what you need and what youre going to follow is going to be different from the person sitting next to you. Right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So I have a spiritual healing coaching business. I have an online store website. I have YouTube, TikTok, Instagram, all that great stuff. Hoopla. But Im having an issue with attracting clients to me. I do have a brick and mortar that I practice out of as well. And I share the space with two of my friends, ones a masseuse, ones an acupuncturist. So I do well there with my energy healing and whatnot, but its still not enough. I just want to kind of reach out more.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]