[{"pageContent":"Yeah, I would say its probably like around between 700 and 750.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I dont think so. Within less than five minutes, I would say I just submitted the information into the system and you just called me. I havent even looked at any type of correspondence since I submitted my information.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes, everything, because Im at scratch level right now. I just got done putting a majority of my business plan, ideas and everything together in a way to where I can kind of follow these steps so that I can get the things that I need accomplished in the midst of actually setting up a revolving line of credit, which I feel like I need in order to basically do transactions in the way that most merchant services are performed. Like, you guys are probably using the merchant servicer in order to receive your payments for the services that you provide. And I dont have a merchant servicer that I use at the moment. In order to do a transfer of funds, Id have to do a wire transfer to some degree. But instead of me just doing a wire transfer, I want to be able to have the money thats secured for me to continue the circulation of the money and its usage so that I can continue to progress and perform the way that Im having an expectation.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right now, how I secretize my credit information is I put a freeze on it through Nexus. Lexus, I was just in the midst of doing an additional freeze through Metro too. In order to assess what it is, what I need to do is release the freeze pertaining to the inquirer. So if its Equifax or any one of those different agencies or data reporting agencies thats going to be utilizing my credit score rating, then I would release the hold the freeze for that to be available. But my score is pretty high. I dont have any debt.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its A-C-O-R-S-I-C-A-N-B-E-R-B.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Whats up?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, Im doing good. I wasnt expecting your call. Thats serious business. No worries.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I got interested because of the fact that I see what the AI technology is doing right now. Im not trying to, but Im expecting on putting myself into the space of using the algorithm and also using various different components of what the AI is capable of being able to do. If you have a system already thats producing, then thats even better because youre ahead of the game. I wont have to necessarily spend my time trying to innovate anything or trying to go through the ropes of figuring out anything necessarily besides exactly what youre doing thats producing the results. So Im looking at being in that space to be able to manipulate what is already being manipulated by the AI technology and also being able to generate significant margins of profit from being in that space.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Totally. I already see it. If you guys are utilizing the AI in any way, its going to quantum sphere everything 100%.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Oregon. I mean Oregon.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"No, I dont. Thats what I need.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Pacific.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im helping somebody? No, youre fine. Im multi casting right now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay, so my nonprofit is to help, but the new LLC, yeah, the LLC, they got to kind of work in unison to a certain degree because the nonprofit is for the purposes of assisting the homeless with being able to become more financially literate. The LLC will be my consulting agency that Ill be utilizing in order to also generate the credit necessities as well as the space for me to initiate because Im going to be doing consulting. Consulting is pretty much primarily my field in financial literacy. So I will be providing services for various different kinds of filings that you can utilize in order to get significant returns for the value of assets and securities that are created that are utilized normally by agencies or various different businesses in the creation of contracts that we use on a pretty predominant basis whether it be our cell phone service contract or utility bill contract or our car payment contract, even for our mortgages and so on. So thats kind of what I do as a consultant. It fits into the category of tax credits, tax credit classifications.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Totally. Yes. Itll be all open.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I have a nonprofit, and Im getting ready to create an LLC thats besides my nonprofit, but my nonprofit, because I created a nonprofit last year, and it was in the process of me developing or setting up my estate. Trust that I was going to utilize to circulate funds from the trust into my nonprofit, which I was going to pay myself through my nonprofit. But I see that theres these phenomenal benefits from creating an LLC, being able to utilize the space for manipulating the credit, one for the LLC, and then also being able to generate significant margins utilizing that credit. And then as Im paying myself, I can make accommodations for the credit that I use and so on. So Im just thinking about an ecosystem thats going to be the best to sustain and keep on generating significant margins. Thats my goal.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Because right now I dont have a team. Right now its just me, and I have a lot of different other responsibilities I have for I got three sons and a daughter, and I got three different moms that I have to coordinate with. So in order to make sure that Im getting the time that I need, I have to move around a little bit on a consistent basis. And so it kind of interferes with some of the progress that Im capable of making. And theres this dynamic with the way that the system is designed to try to keep you locked into this fold of its. Its like an entrepreneur resistance, in a sense. So if youre not entrepreneur minded, youll be consistently inundated by people who have the labor force mind frame and who want to limit your ability to be able to do what you should have the ability to be able to do with your time. And because I dont and Im not synchronized into a nine to five type of oriented business form, it makes people think that they can request my time at will. Im normally pretty lenient with providing my services, providing myself, and making myself available for all of my sons daughters needs as well as the moms. So if you can imagine having just one sons mom or one childs mom and then having multiple lots to work.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay, why do I feel like I needed some more help?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Entirely.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Okay. How about this? Due around seven no, around nine or 10:00 A.m..","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"And you wont even need exactly some parts of it. Is you dealing with this issue of reputation. Everybody likes to see the floss. They feel like this is why a lot of influencers or people who have very different kinds of business platform, they kind of utilize the glam. The glam or the scope or the idea of being glamorous as a perspective for people to want to follow or fall in alignment with whatever the vision is. So sometimes you got to have something that puts the idea for the results to get made.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Millions.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Please.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Definitely. Im a studyer. I know that the mastery of things has to do with the basis of what kind of knowledge you have. So if you dont have any knowledge or you dont put time into increasing your level of knowledge, then youre not going to be increasing anything. 3 hours isnt unusual for me.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, I dont. Okay. Im the solve.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"What day would this be?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, definitely. Please.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Cant wait to get the info so I can look it over and start getting ready.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Its about me having these steps that I put into place. And right now, this is the step. This is me having things that Ive arranged in my mind. Ive synchronized within the various components of me accomplishing the daily tasks in order to just sustain life and then also being able to implement the tasks that are necessary in order to achieve my business goals. Right now, Im at that place where this business goal is necessary, necessary component in order to move forward.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"My vision is to make an accommodation for about a million a month. And I want it to be hands on and hands off because Im going to be required to go to places, places that dont necessarily have the format that exists and introduce them into this space where theyre capable of being able to receive a significant benefit beyond what Social Security is offering. As a matter of fact, it kind of coincides with Social Security and how Social Security fulfilling operates for the way that it was for the purpose of why it was created in the first place in association to the Bankers Act and the Federal Reserve Act in 1933. So its just like theres a couple of things that require my hands on, but I would like to for the majority of my service because I feel like if I can create an app, not if I can, but when I am, because Im going to need an app. And this app is going to have to cover the basis for there to be people who are able to be serviced without me having to be available. I can create a couple of videos and stuff and set it up in that way to where theyre capable of taking the instructions and if they need any extra assistance. I have somebody maybe in the Philippines or something like that thats coordinating my calls and handling customer service. But for the most part, thats what Im envisioning. Im envisioning that Ill be making maybe about three or four different events a year possibly. And then in the process of that, mostly everything else, itll be run into the artificial intelligence system.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"That might be beneficial for you.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I like the morning more.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, its not necessarily about right now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thank you. Bye bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, my annual income I have a million dollars in secured credit that I utilize for my actually, Im not employed in any way. I facilitate all my operations through my trust its on a need basis.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats pretty good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im definitely very interested right now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats perfect.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No. Cant wait to get started, though.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Todd yeah, definitely. Whats the price margin that youre seeing thats up there? I want to kind of prepare myself.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I appreciate it. You too.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Seriously.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I love that youre thinking big and.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, Im safe.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}}]