[{"pageContent":"Got it. Seriously?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Facebook Live wasnt even out yet. It was periscope. So I think he had just written 13 Success Keys for Kids success or something. Anyway, so he did a couple of coaching calls with me and then over time, just kind of watched him grow and stayed in touch with his dad every once in a while.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats correct.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I dont know what the model exactly is going to look like yet in terms of with our partners and stuff. And so right now, we have a couple of clients and were figuring out what our frameworks are that were going to work people through to be able to deliver consistent results. So Im looking for what are the resources with the teams, with the tools that I want to make sure that I build those frameworks around to be able to get consistent results.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Different iterations of it, but the same core business. MVP leadership academy.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hey, whos this?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"No, within the next 90 days.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"But Ive known Caleb for a really long time. I know Matt Maddox really well, so Im curious always to see what hes up to, what hes working on, and if its making sense to integrate with some of the stuff Im doing with an agency right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im going to walk into my Chiropractor appointment now. Okay. So Im going to be distracted.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Central.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"How about I tell you this? Ill tell you just a couple of the things that were focused on right now. So we have a niche based digital marketing agency. I currently just stepped in, Im a consultant, stepped in as acting COO for them, temporary because Im helping them be able to scale and whatnot because they had some hiring issues. They had a team in Pakistan, had to let a bunch of them go all at once. And so were rebuilding the culture with them, basically. And so as were rebuilding the culture, were changing their hiring process. Were changing. And part of that is how do we integrate more AI? What tasks can we automate more of before we just go and hire people? So what are the systems, tools and processes that we can put in place to make us more scalable in the future? Obviously, thats what everybody is going to be doing here shortly. And also, then based on those things that I find, then how can I convey that to my coaching clients and other industries and niches? Were in the early phases of that. And separately, I also have a youth leadership program that Im looking to scale. Ive not begun the process yet, but its basically looking to start the beginning of summer, June 1, which basically looks like taking my curriculum that I have and either certifying or packaging them up in a way that other people can then use those tools. And I dont know if the business model, if Im going to do a licensing thing or if its just going to be a buy it user. I havent figured it out because I have multiple different ways I could go with it based on my current network. So thats another project that have thats been a business that has ten years of case studies, but I have never tried to scale it in this format before. Ive only ever tried to take on employees and teach them. So this is a different model. Those would be the main two things that were focused on.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I know that I can tell you how much money they manage an ad. Yeah. I mean, I can say that our next target is 100,000 a month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. All right. And as far as revenue from your consulting business, has that been pretty steady?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Youre like an agency for agents.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay. What is your clientele niche? Is it pretty broad or are you pretty narrow as far as the niche after as far as consulting?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Actually, when Periscope first became popular before Facebook Live, I was looking for young people to have on my coaching group for me to be examples of other young kids doing cool stuff because I work with kids. So I had him come on and coach one of my sessions. This is like right before right when he was kicking off with daily Matt Maddox thing and the Maddox Live or whatever it was called. It was way before that, I think.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"2009. 2010, okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Ill dig into that. Does that make sense? The tools that you already watch the video on it. I know, whatever. I thought it was interesting enough for me to opt in. Right, okay, right. Ill dig back into the case study. Yeah, go ahead.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That sounds great. Thanks so much. You have a good day.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im open to having it within the context of one of those categories. For example, like the agency.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, thats perfect. And I have a coaching business too. So with the agency space, specifically, the unique problem that you solve or the modality that you use to help them grow is.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I see. Okay. Whats the name of your coaching company?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah. Basically it doesnt sound like you have a specific tool. Its more of just youre doing similarly to what Im doing just on a larger scale for this particular day. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Defined? Mature? Like in terms of revenue or in terms of time in business?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay, got it.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Yeah, I would say Im the primary influencer on it, not the decision maker.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, thats a good question to me. In my head, theyre all stacked. Like, one thing serves the next, serves the next. So my stuff that Im doing in youth leadership, Im going to make Digital Addicts. Theyre going to start running my marketing. Right. So what happened with my client? I was like, okay, well, how about we start a new entity together? So instead just the agency. Now we have Digital Addicts Consulting. This is not official yet. Its what were planning on. So we will then be a consulting company. So when Chris and I can go out and do business consulting for people, if the lead is appropriate, well bring it back to Digital Ado. Thats a new thing, right. Just in the last couple of weeks that we decided were going to do that. So my focus is building that digital consulting and putting everything else I have under there. Like everything else Im running, I want it all to function by the team that I build underneath digitalized consulting that will build the network, like the marketing department and the sales teams to be able to fill those services that Ive already developed and built. So right now, what Im doing is Im hiring project managers to take the lead on each of my individual projects that Im like, I cant continue to go at this pace or I dont want to, putting project managers in place of each of those. So right now Im looking for resources that Im going to put under digital artist consulting to basically streamline all of this into one business building system consistently that we can then rinse and duplicate.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, basically well, the agency to me is not really much coaching as theres more of an agency. So you had mentioned doing coaching.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I would love to do that with you. Im walking into the chiropractor right now. I just wanted to make sure I got this call with you and I pushed a little late. Is it where we can just call? I can look at the case studies and I can send you a link or something and we can follow up at a time I can focus.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I havent, and its been a major thats why Im on these calls with AI people now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I have probably seen it, but I havent looked at it. I think I opted in for probably, like, 50 things over the last week, so just watching how the follow up.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I can totally go into that, but theres like, five different directions I could go with it based on. So maybe its more effective and efficient for you if you tell me exactly the ideal client youre looking for and the result you get.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I was just curious as far as what you personally have as far as.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Hey, Rick. Im going. Well how are you doing?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}}]