[{"pageContent":"Hey, how are you doing today sir?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"It depends on what you consider a constraint.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"How much are we talking about?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay, well, first off, Im going to tell you that I actually just picked up an extra shift in work today. So Im working from home. I just took a brief break just for a second. I do music, Im a DJ. Im also doing into getting to the film thing, but Im also trying to sell tickets and do event management. I just released the book saying its on Amazon Kindle right now. I pretty much created it based off of using Jounce a little bit to create kind of give me the story front of the thing of what I was doing and everything. So I have that stuff there. I want to make an NFT. I want to be able to maybe see how I can use artificial AI so that I can go get an office building somewhere and maybe I can start doing something and making money and how I have all artificially or whatever the case. What else do I have? Right now my slew of network is just artists. Oh man, my phone is blowing up today. Hold on 1 second. Hey Carlos, I got your phone. Are you sure? I dont see it. Yeah, Im checking. No, I dont see it. Okay, Ill call it real quick. Let me kill it. Okay.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Sir.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"How much is a certain amount of money, man? Whats the budget youre talking about? Because Im in the middle of working right now. So cash is coming. But what do you consider cash on hand?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay, Im just starting this part time. Im doing a little part time gig. Im really between needing money right now, so budget wise, and they just now kind of give me some more hours and I got to get back on the phone and start working again. I get off at 745. But the gist of it is that I want to make money off of selling tickets or for my events, and I think thats going to come with me scaling up my business, but at the same time, I want to use somebody elses budget to scale my business.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"My thing is what I want to do is make sure that I can get the what else I need to make some money from this stuff, man. Im not really out yet, but I am, but I know I know a little bit more knowledge than the people in my community, thats for sure.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, this is him speaking.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So I was thinking brand development startup. I was thinking like getting little business, other businesses like other entertainers and kind of building their whole brand up from the ground up. So for instance, my DJ thing, I was a rapper, and I wasnt getting booked for any shows until I decided to put a duck mask on and pretend to be another pretend to be the DJ. And then they create this social media guy, but its just saying and nobody knows who he really is, but hes a DJ, but he plays all the music from the artists. And so I want to be able to create events based off of artists being able to have their fan base coming in there to see them perform. I have access to the venues on Monday where I can have a space there and I can throw events there. I also have the graphic design knowledge to know that I can create graphics for these artists as well, which is also promoting me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"AI okay.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Thats actual cash on hand. What do you consider actual cash on hand?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Chris hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, damn it, man. Now you talk about credit scores. I got a business account, thats all I got. And I dont have anything but my credit card. My credit score is probably a 400, but it sounds like this might not be something Im going to be able to get into at this time.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I know that I need to buy some ads. Im already in the market for buying ads. I already have things ready to buy ads. I have graphics, but Im not spending $5,000 on the ads. Right, but is there a way you can send me something in the email? Because I do got to get back to work so I can be reading it while Im at work. Like, maybe you can send me like, a proposal or something, what you guys do and what it can for me. Yeah, we can kind of follow through with that.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"What is actual cash on hand? Actual cash on hand is $5.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"How much is going towards your recruiting? Because I can find teams.","metadata":{"fillerID":29,"fillerText":"Mhmm","category":"D"}},{"pageContent":"You know what? Hello?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"And what is that going towards?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"And I know one thing is that I have a lot of other brands around me that are going to try to follow suit and whatever I do. So if someone is working for me, I know theyre going to try to use it as well.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, what did you say, sir?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"And I want to take advantage of that before everybody else starts to realize that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"All right, thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, Im good.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Send me that. Send me everything. Send me all that stuff, and Im going to send it to these grant people and you can explain that to them. Okay? Yes. So send it to me, and Im going to forward it over to them and Im going to get them to give me the money. Okay.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im going to use the Power affiliate marketing for that part. But I know that, but I do know that I do know a little education over something, so I feel like I could give my expertise to someone. And some of the stuff, what I think is just basic stuff people are just now figuring out.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Go ahead. Im going to give you five minutes.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]