[{"pageContent":"If youre looking for somebody that is about to sign some large, big ticket sale, maybe Im not your person, but I could be in the future. Can you offer any service or anything to help somebody like me that is completely new to this?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"My adjusted gross income last year was $95,000 approximately.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You know what? I havent even checked, but I will check right this second.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I think a good first step would be to replace my current salary, which is approximately $6,000 a month. I think a good second step would be making to be bringing in net, approximately $250,000 a year. And if I could get say that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I think were speaking two different languages here. We started off with my goal. Whats goal number one? My goal number one is to replace my current income. Well, if thats my goal to start with, then Ive laid out what I think is the minimum to replace my current income. Again, Im not trying to limit myself to that. Im just saying thats what I need to do to replace in my mind, thats what I need to do to replace my current income. I would love to make $250,000 a year. $500,000 a year? A million dollars a year. If I can do more than that, then great. Im not trying to limit myself to two or three appointments a day for sales. If I could do ten appointments a day for sales, then I would do it. If I had that many good quality leads coming to me, I would try and sell every single one of them.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That I am passionate about. I definitely want different streams of income. I definitely recognize the value in that. And so, to your point, I understand that success looks different for different people. Success to one person may be that they dont have to go into a nine to five job ever again. Someone else success is riding around in private jets and going tahiti anytime they want. And I definitely would like to travel some. But right now, if I could just get myself into a position where I dont have to go into a nine to five every day, and I start building at least one income stream, that would replace my full time job, I think that would go a long way towards success in my mind.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Goal number one, replace my current salary of approximately $100,000 a year. Step number two, get to the $250,000 a year mark. And maybe step three would be to cross the million dollars a year threshold.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, okay, I get it. Well, lets go ahead and hear what you have to say, and well talk about it. And if we decide that we can move forward, thats fine. And if we decide that this opportunity is not for me, thats fine too.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So it goes back to what I said a few minutes ago. I dont even know what I would sell right now. Were talking about appointments. I dont even know what Im going to talk to these people about.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"All right? Fantastic. I appreciate you. Thank you so much.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So again, to escape a nine to five job, to have multiple passive income streams, to live comfortably, be able to pay my bills, be able to travel at least a handful of times a year to different locations, maybe. South America or Europe or Italy or the Mediterranean and to basically not have to worry about money or where money would be coming from for the rest of my life.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Certainly. Yeah. Absolutely. I dont want you to waste your time or mine. Right.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Its not getting me there fast enough, and its not really getting me there at all.","metadata":{"fillerID":38,"fillerText":"Ummm yah","category":"F"}},{"pageContent":"I went through a really hard time a couple of years ago. I was out of work for several months, and it drastically affected my credit score. Im in the process of getting that straightened out, but Im not quite there yet. So if that means you dont want to talk to me anymore, I completely understand.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Okay, well, so Im extremely interested in passive income. I definitely want things that will sell while Im asleep or while Im doing other tasks. I dont have a product to sell, so it really doesnt matter what I sell as long as its making me money. Im interested in building some sort of online business. And like I said before, Im completely new to this. So I have been working as an engineer for the last 30 years, and I I am technique. I do have a two year degree in computer science. I work as an It person for the engineering company that I work for. So Im very familiar with computers and the internet and things of this sort. So the technology is not really an issue for me. Its what do I sell, how much do I sell it for, how do I drive traffic to my website, how do I convert sales. And I want all this stuff to be completely automated. I dont want to have to talk to people a whole lot. So do I sound like somebody you can help or do I need to look elsewhere?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Do those numbers make sense to you?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im checking the wrong email address then. Hold on 1 second and Ill be right back with you.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hey, to whom am I speaking?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I have a good job. I make a really good income, especially for the area of the country that Im in. However, Im locked in, Im never going to escape having to go in every day. Im never going to escape in my current situation, let me say that. Im never going to escape having to drive an hour to a job, spend all day working, and drive an hour home. The whole idea of doing what were talking about right now is the fact that I would achieve much more, hopefully much more free time to do whatever I wanted to do and to work when I chose to work, as opposed to doing it on somebody elses schedule, having to answer to somebody else. Even though I have a good situation and I have an excellent boss that I really like, I dont think theres if I can choose how I want to spend my day, regardless of what day it is, whether its Saturday or Monday, I think that would afford me a great amount of freedom and help me enjoy life more.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Good. Hanging out on a Saturday afternoon.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes. Right now, its in the 500 range.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I could probably start right now with $2,500, and I could put another $2,500 in within 30 days.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"So I follow several people on Instagram and online. One of them is a person called the Ecomwolf, and she just sells regular products that you would buy at Walmart or on Amazon. I certainly recognize the value in that. As far as what Im passionate about, I love music. My living room looks like the guitar center. Ive got guitars hanging everywhere. I do enjoy engineering. I do enjoy technology. I do enjoy computers. But what I enjoy may or may not sell, I dont know. And so if you could point me in the direction where I could help you help me, if you will forgive the Jerry Maguire reference, to discover not only what am I passionate about, but also where my passions intersect with what will sell online. Because it really is about converting what I love into sales on the Internet. That would be greatly helpful to me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I tried to work with an agency last year that would help me get negative items off my credit report. If you have any suggestions for companies that could aid me in improving my credit score I have been working and paying my bills for the last three years now, and it doesnt seem to be improving my score very much these days.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Lets see here. Lets at my Gmail. What would be the subject line in your email?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay, so Im not trying to limit my okay. We were talking about what goal I would have. Well, if my first goal is replacing my current income dollars, then Im not trying to limit myself to that. Im just saying thats the baseline. Thats the minimum.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Evidently. Maybe its in my junk. Let me check that real quick before we go any further. No, I did not get an email from you. Im sorry.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I know systems like that exist. I dont personally know what those systems are or how to go about getting them.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Are those numbers okay? Are those too low for you? Youre not going to hurt my feelings right now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"You as well.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"So to me, it would be about automation. Could I set up a system that would go out and find leads for me and direct them to a website that would funnel them into the people that I need to speak to that have the money to invest in whatever product that Im selling?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yes, I would certainly be committed to doing it once I was sold on the idea. And we would have to start at a level where Im at. I obviously dont have tens of thousands of dollars to invest into this business right now, but if I could start it on a small to medium sized budget, for me, it would be something that I would seriously consider. And once I committed, I would be committed.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, so my business? I dont have a business. I would like to own a business online. Im interested in passive income, but I dont even know where to start. And Im really just doing research, trying to get started, really.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, if were talking well, going back to my goal of replacing my income, I would need enough appointments, as you put it, to replace my current income. So if I need to replace just for round numbers, lets say if I make $10,000 a month and each sale netted me $1,000, then I would need to do enough appointments that even if I missed on some, I would still make enough sales to replace $10,000 a month. If I had high quality leads and my conversion factor was, say, 30%, then I would probably need to do at least an appointment a day to ensure that right. If Im converting leads into sales, and I made $1,000 off each sale, and I was converting 30%, then 30 leads would translate into ten sales. If a sale landed me $1,000 net, then I would need to do at least 30 appointments a month. Hopefully, I could do at least one a day, and hopefully two to three a day.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]