[{"pageContent":"And like I said, I want to be able to create other avenues for generating other income, and that is something that is not tied to one of my employees or anything like that. Yeah, its just me. But I do know that it takes time to build the program, and I think thats been the biggest hesitant, because I still see clients, and I was like, okay, I got to be able to build out a program. And it seems like a huge amount when I think about it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And I was wanting to I was wanting to know, is that something that I could use for my business?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I could be able to teach other estheticians, more so ones that are already in the field.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, well, great. Well, Ill look forward to seeing that. I appreciate you for explaining it to me and breaking it down.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes. At first I was going to stop it, but I was like, well, let me just check to make sure that its something that I can use just to give you a little bit background. I dont know if I misunderstood kind of what your what am I trying to say? If I misunderstood kind of what you guys do, but I have two medical skincare facilities, one in Oklahoma and one in Texas.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Bye bye. Bye.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"In Oklahoma City.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"One of our locations well, I mean, this is service based, but one of our locations does about $50,000 a month, and we want to make more.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Versus someone going to school for it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, Im definitely very passionate about what I do. So like with skincare, I wanted to open up a school, but I decided that I wanted to put my business in a larger market. Ive thought about possibly franchising out what I have. Ive thought about different ways to teach other professionals thats in my field. How Ive been able to grow successfully over the years, the model. Because I get people about mentorships all the time that know what Ive done. Of course, nowadays its all about followers. So somebody sees somebody with a bunch of followers, they want them to coach and train them and Im like, well, they was able to attain followers, but you dont know their history or their background. Sure, but Ive thought about it. Ive thought about being able to have another streamline of income that could offset definitely when the brick and mortars arent doing as well.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So we have an ecommerce store thats online, and then we have two brick and mortars.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im good. How are you? I dont know if you heard me when I answered just a few minutes ago.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"No, I havent.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I love it. Its definitely my getaway.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, that wasnt the reason. Thats why I was like, let me ask and see. Because the more I was looking at it, I was like, I dont know if that was because I was looking for more so marketing to be able because our Dallas location is a new location. So I was kind of looking for ways to be able because I did a little kind of intro bought this intro class for AI, and weve talked about it briefly in our industry about different automations for, like, if people go to our website being able to scan the face and be able to make recommendations on what type of cleanser, what they need, and it could be able to refer our product line. But that just seems so like, I wouldnt even know where to go to even plug something like that in. But it started popping up on my Facebook. So thats how I found you since Ive been doing some of this marketing stuff and different AI things, thats when you popped up, I was like, Let me see if this is something that I could do. But then after I read a little bit, I was like, oh, I dont know. I dont know if that fits what Im trying to do at this moment. But I was like, it was definitely worth me being able to see if theres any opportunity.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So Ive been in business 18 years. I owned a health and wellness bot for twelve, closed that in 19 and then opened up Pivoted for just skincare. Okay. Actually, in my industry, Im a subject matter expert when it comes to correction of skin. And I have thought about it, about doing not so much coaching, but more so of offering like a class of teaching. Because I also have my Proline, which is like a chemical peel base with back bark cleansers and things like that that I can market to other estheticians, if you will.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Thank you so much.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay. Yeah, I love Denver.","metadata":{"fillerID":8,"fillerText":"Yeah","category":"A"}},{"pageContent":"I would love to. Ive been in the industry for a long time.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]