[{"pageContent":"Yeah, it just doesnt excite me to teach other people how to do that or do more consulting like that.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Probably around like $4,000.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Youre a management consultant for what?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And why not? And listen, I said that somewhat tongue in cheek. That was just the only thing Im like. Wait, youre already doing this for another company? Why wouldnt this be the vessel to be able to make one hundred k a month on your own and build out a program like that? Thats fine. If you dont want to do it, then thats not what you should be doing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, so I saw your guys ad on Instagram through Russell Brunsons connection, so thats obviously why I was targeted. The stuff Im thinking about using ClickFunnels. So I have a business where I sell audio Affirmations, so its actually a low ticket product, but Ive been using AI to automate a lot of my processes and create content. So when I saw AI, I was just interested in learning more.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Um, could we do next week? Can we do later next week? Im trying to meet a deadline on a few things.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So maybe I should have framed it this way. What are people getting when they buy what youre charging for now? Break it down. I know what you said to me before, but give me exactly what theyre getting for $49.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah. So I sell a bundle of Affirmations, a combination of Audio Affirmations and then, like, an e journal and digital Affirmation cards and things like that that are just specifically tailored to my target market. And right now, I sell through Instagram ads.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"To be completely different? Yeah, itd be completely different because theyre completely different offerings.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I totally feel you. Yeah, I totally feel you. Yeah, I think that thats totally right. Yeah, I think that thats right. I think I may have so many more thoughts, but let me just stop there. Yeah, that sounds right.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, I think it would be great for so many reasons.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hey, Alex. Im good. How are you doing?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I think I need to understand more about it because I feel like I need to really figure out if its something thats feasible for my particular product with the angle that I have. So it would be really helpful for me to just have some time to really think about it and kind of see if other people who are in the space I dont know, like this spiritual space or the psychology. Would be more relevant space, like what they have done, which I could totally research, but its just going to take me some time to put some thought into it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im just thinking what is keeping it from being high ticket? Thats a good question. I dont know.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, yeah, just with my main job. But I dont know. Thats interesting. Id have to think about that. Id have to think about how it would make sense in the business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello. Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, thats a good question. I think that I would need to do a lot more Affirmations, like, have a lot more audio Affirmations available. And I think that it would need to be a better user experience. Like right now its just a file people are downloading partially because Im confirming the concept. But I think that there need to be more options for Affirmations and it would need to be in a format that felt like people could have a better experience. And itd probably be like a human element too, having someone act as the coach or someone to interact with.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I actually dont know.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I think it would be more ads, but maybe like a different type of ad and probably like a pipeline that involves what were doing now, like a personal touch conversation, probably for a high ticket item.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I was hoping to read the case study. I havent gotten anything in my email yet, but I wanted to just even understand what you guys did.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Ideally, I think theres potential to make easily six figures a month from this. But I will say, Alex, I think that for me, this is probably going to be more of like an economy of scale situation with an app and a subscription model as opposed to a high ticket item, which, correct me if you have dont correct me, but Im open to your thoughts, but I think given what Im selling, its probably different.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You know what Im going to ask you next?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"No, its completely online, automated.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Just pop quiz for conversion rate for a high ticket item based on phone call?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Human centered design work? What does that mean exactly?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Its a great question. So funny you called right now because Im literally working on my pricing strategy right now. I was charging 88, which some people were purchasing, but I got a lot of feedback that people felt that it could or should be cheaper, which I totally understand. So my ultimate goal is to create an app for these Affirmations and use a subscription model. So right now, the bundle, which is downloadable, is just an intermediate in my journey.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sure. Yeah. No, I think that makes total sense.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Okay? Yeah, well do. Thanks, Alex. I appreciate it.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Just to be successful. Im in my office right now, so some things Im not going to say allowed, but fair enough.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yes, exactly.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"That is personal, but it is good. But I think the big thing is that at least for right now, Alex, I want to look at the information that youre going to send over. I dont know if youre east coast or west coast time. For me. Its East Coast. So its like 05:00 right now, and Im trying to finish up a few things on my day, so I can head out soon, but can you send me some stuff and then maybe we can talk again? But I think its been an awesome conversation. I really appreciate it. I just have to finish up a few things today.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Like it would help me accomplish my goals.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Whats your favorite food? No. Why? Is that not something on your forefront of your mind to build an online business with? You already do it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So 47 for the entire bundle.","metadata":{"fillerID":47,"fillerText":"Mhmm","category":"G"}},{"pageContent":"So Im actually in the process of trying to revamp my website to do, like, a funnel for it would be like an unboxing funnel for a lower ticket item.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Not because its like, inappropriate, but Im just in the workspace.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah. So Id probably create a funnel where I have a lead generator with a small offer in the beginning to squeeze emails, and then it would lead to a webinar or something informative, and then that would lead to signing up for a conversation, and then that would lead to a sales pitch and purchase. Probably.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Can we do Thursday?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thursday or Friday would work, but no earlier than Thursday.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"You too. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"And how long is each one?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Totally.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"What do you mean, how much work?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Pretty good deal. Thats a lot. So let me ask you this. How did you get into what youre doing right now? Like whats your background? What made you land on this?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I dont know. Id have to do the math. I have to look at what is a reasonable conversion rate at each step of the pipeline.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}}]