[{"pageContent":"Ill check it right now. Give me 2 seconds. Yeah. I have an eight three on credit karma.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Two to 250 a month would be nice.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im good. What was your name?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, find the right thing to coach. But yeah, if there was something that made sense for me to coach personally and professionally, I would do it, but I just dont know what it would be that would be scalable, you know what I mean?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure, yeah, I would definitely want to think about offer creation. And thats why, like I said, Im more looking at this, Im trying to understand different options and then passionate about a lot of things. So trying to understand what the means are, and then I could figure out the goal and attach it to that. And by the way, like I told you, I have a 330, so Ive got a couple more minutes. Not to break your stride here.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure? Yeah, Ill tell you. By the way, I have a meeting of you. I was just calling you back, so I dont have too long, but just to give you a heads up, I dont want you to think Im cutting you off if Im still leaving a few minutes, but what Id say is, me, contextually. Ive had kind of an SEO local marketing business with some partners. We were doing SEO for plastic surgeons, and we just sold off our client base. So I have experience kind of in the fulfillment end and ranking and things like that. So Im just kind of exploring. I saw the ad. Im thinking about maybe doing something on my own for local marketing, local SEO, things like that. And thats why when I saw it, I figured it was worth inquiring because we sold that off. Ive got a little time bandwidth, so I was thinking about maybe getting doing something solo, and it was an enticing ad, so thats why Im here.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ive run ads for clients. Our stuff has been organic, but Ive run some ads for clients and Im familiar in that sense, but yeah, Ive run Facebook ads, instagram, TikTok, Snapchat, Reddit.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, perfect. I appreciate that. Thank you so much, Mackenzie.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Oh. Hey, McKenzie. Hows it going?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Ten more minutes. Let me see. Let me look at my calendar. I have a 334 34 30 to five. I mean, five might be okay if its like ten minutes or under between things. If you want to give me a call then.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"I dont know. Are you saying this is something if there was a guarantee involved, like what would I feel comfortable? Yeah, sure. I have credit, obviously, and I have a good credit score, but yeah, ten grand? I dont know, something in that neighborhood. Plus, like I said, I have a lot of access to credit, so a good credit score. So thats something worth considering.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I mean, totally committed is an interesting word or two words Id say right now because, like I said, Im in between things and Im exploring options. Id want to kind of cost benefit everything. I dont want to say, oh, hey, Im running through the door because like I said, Ive got options. And Im not even tied to necessarily one type of business. So thats why Im exploring. Not to be coy about it, but you get what Im saying, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Lets see.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay, so youre saying its more like offer creation as part of the process to make it scalable is what youre saying?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And thats my overall personal yearly. Thats why Im saying that.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah. Have I thought about being an SEO coach? I could I dont know. That to me, some of thats a little spammy. You get what Im saying? And Ive done it because of the terms of the NDA and everything. When I sold off, I wouldnt be able to use old testimonials and whatnot, because the new company got that. But Ive thought about it. I dont know. Im not completely opposed to it, but Id be more thinking about this for scaling a business, unless youre saying that doesnt work. For scaling, like, a B to B type business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Talk to you then. Bye bye. Nice.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Like Ive kind of said before, and like I said, Im not saying to be coy, its more like Ive got some time in some breathing room, which I know doesnt make me a fantastic prospect, but theres no gun to my head. I got to buy this day. It doesnt really look like that for me. Its more like when the right opportunity arises, thats what I plan to act on.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And I have experience. Ive done SEO, local, like Google Maps, optimization, stuff like that. Ive done some other marketing things. Thats why as Im thinking about it, and I saw something like this that talks about getting appointments on the calendar. I said, that might be worth looking into. Im open to definitely listening. I mean, no promises, obviously, but yeah.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Interesting. Yeah. I mean, I was thinking this was just like an AI tool type thing, but if there were insights along the way, Id be open to having a conversation.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So I work a nine to five in tech, so everything is just kind of on the side nights, weekends, stuff like that. Anything Im doing kind of additional venture wise.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"About how much longer do you think we need?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Yeah, Im passionate about a lot of stuff. I think its a question of what would get monetized. Right. So Ive done a lot of nonprofit work helping nonprofits, organizationally and conferences and stuff like that, but we all know nonprofits dont profit much. Theres not a lot of money there. Passionate about the arts, once again, something that isnt full of money. Ive enjoyed the concept of helping some local businesses do well, so thats why Ive kind of been okay with possibly kicking around marketing. But yeah, I like helping people. It all kind of trees up to that. That kind of puts it in the neighborhood.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Are you saying like, I would have a great funnel with a predictable CPA? Is that what you mean? Yeah, sure. Okay.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure, sure.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Eastern Standard.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes. Natebarrett? Natebarrett, eight@gmail.com.","metadata":{"fillerID":33,"fillerText":"Yeah","category":"E"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont know. Whats it 60? I dont know. Ive been working with doctors for a while, so its probably not a great comparison because if youre dying or hemp plastic surgery, its probably a little different.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I did not. Not that I saw.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Trying to turn my yearly into my monthly.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I mean, if there was something like I said, Im kind of at the point where Im trying to figure out what to do next.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Somewhere in there.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}}]