[{"pageContent":"You dont want to explain it to me. I have money. Okay. And Ive built a company, and if you cant explain it to me, okay, Ill just have to go somewhere else, because I cant bring anybody in on the call.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"So did you say that Im sorry, are you a rep or are you also, like, the owner?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Monthly revenue, Im pretty soon its going to be five to ten grand a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And see.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"But what Im saying is you guys offer services too, right? Depending. Okay. Because its a financial thing. Okay, go ahead.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, yeah, Im keeping my overhead low, very low.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Whats that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Oh, okay. Yeah. I see you guys were persistent, so Im just returning your call.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Oh, me? Its not much now. Maybe if I dont know, its not reported anyway, so it doesnt matter. My money is not reported.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay, I am putting it in right now. No, I put air a well, maybe air AI, but I put air AI. Nothing. Okay, try the other one.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I understand what youre saying, but Im independent now. Of course, like with any independent contractor, you have rules and protocols and things you can and cannot do from the company. Okay, but we have reps in every state, and theyre using all these things. Some firms are worried about contacting people and stuff, but were not because most of the times its good news. Were really calling people here. Heres good news. And so as far as cold calling and stuff like that, they just want us to be respectful and explain to people that this is money that they have sitting there. So I, as a contractor, they cant tell me everything I can and cant do. So are you saying I need a business license first in my name before you can speak with me? Or is that what youre saying?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"My income? Within two to three months, itll be ten grand a month. I dont even know why Im doing it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, no, youre yeah, I did. Yeah, I had a company, and thats what we did. They would close on the first call, and we called all over the country, and we closed on the first call. We would say, hey, were selling. And we would say, look, were selling. We have television advertising. Were putting out thousands of commercials, and the commercials basically say, if you think about buying or selling a house, give us a call. We have went through all the realtors in the area, and we have found the best thats out there. Well, those are multibillion dollar corporations now that do that right. There, like, home values and all. And I did this 20 years ago before anyone was doing it, and so they took it and made it a huge thing. Im just saying now it was ideal agent, and theres a couple of commercials. Ive seen companies that do it. So what Im getting at is I know what needs to be done to make this work for me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, I dont I mean, if I cant make ten grand a month, start. Im terrible. If you cant make ten grand a month, a month at this, you need to be pretty bad. And Im getting started and like I said, Ive watched this company for 14 years and I know the VP is considered a friend of mine and I just need to get going and a lot of things are too. I dont want to be bound by a lot of because thats what hurt me before. I just want to make sure that I can have some freedom and make a lot of my own decisions because when I had the company before I couldnt do that and so I just want to make sure so Im letting you know that I can make and Im the one in charge because Im an independent contractor.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, I aint checked it in a while, but its not very good. But if that is a bearing on anything, Im starting a company here and Im going to have a corporation, so I dont know. I think I know where you guys are getting from, too. I know where its leading, but just let me know. Why is the credit score so big? Are you saying that I cant scale if I dont have good credit? That I cant get a telemarketing room with 2030 people like I did before? That I cant do that. I can do it. I can still do it. Yeah. No, were not doing credit.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Who would it come from? Actually, Air AI then would be the sender. Ill check it in a minute. It takes a second to load because I got a couple of different emails.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im going to that one right now.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Why is that? Because its a new business. I got to keep my Ive put enough out, and Im trying to find out where to spend the money the wisest, basically. And I know that with what you guys do, if you can explain it, I kind of remembered now what you do, and Im sure itll help me. I know it will help me. I already have a VA in the Philippines. I already have someone working in the Philippines that can get on the phone all day if I need. Okay, everything lined up.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Ive always had corporations. Im not going to let lightning strike. Its always a corporation.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"YouRe able to get a decision. I understand you want to be able to get a decision today, and you want all decision makers there, and you want to try to get a one call close, perhaps.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"You know what? I dont know. I think you use different numbers. Im just going through them here. But yeah, I get a lot of calls from all over the country sometimes. Who knows? But I thought that oh, yeah, lets see here. No, I didnt get any text messages. Yeah, I think I tried to call contact you guys, like, last week. I had some questions and I actually forgot. Kind of slipped my mind.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I just had it some and I hate it because whenever I go to it, I cant get it to go to my regular one default, so I always got to go to one. I havent figured it out yet.","metadata":{"fillerID":38,"fillerText":"Ummm yah","category":"F"}},{"pageContent":"Let me ask you this. Do you do that too? Do you help with business credit?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Hello, whos this?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Let me share this with you, though. Im just getting started, and Ive been following this company for 14 years. Every year, theyre experiencing 30% to 35% growth. Every year, especially about 40% during the pandemic, it went through the roof. So its a large corporation. You got to understand they got to get on the phone. When a rep decides to make a business decision, theyll just say, hey, look, we have some guidelines. If theres some questions, like if I send a flyer out there, it needs to be a personalized, basic stuff but I need to make decisions, because, listen, I built large companies before. I need to make my own decisions. If this company said, oh, I got to be there with I would not want anything to do with them. You see what Im saying?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, actually, give me a second. I could go into my email, but go ahead, Ill look here.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I wouldnt be doing anything in my personal credit anyway.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"And actually theyre on my list. Believe it or not, the president of Nevada corporate headquarters years ago referred me to Cost Aggregation Services. Now hes long gone, so Ive known them, they helped me start my corporation like 20 years ago. So go ahead. Sorry.","metadata":{"fillerID":39,"fillerText":"Yeah","category":"F"}},{"pageContent":"Even with business credit? Even with credit and funding and financing?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, and it would be a new corporation with new accounts. Im setting all that up. I have to because when you get paid, I really want to have a Nevada LLC like I did in Nevada Corp, like I did in the past.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]