[{"pageContent":"Well, in my industry, which Im sorry, go ahead. I didnt mean to interrupt you.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Im getting them to a point of human rollover. I use all the way up to the forms, all the way up to asking the clients basically what time you want to come in. And then the people, the human part of it that I do say that they need, just like you say thats somebody within, lets just say that my salon in Austin, theres this lady named Clarissa, shes in charge of all the forms and she delegates. This form goes to this type of stylist, this form goes to this one. Thats where the problem is. Because as a new client like me, myself, Im not trying to go to no new girl, right. I want the best. So you got to be able to basically pre qualify all of these new clients that are coming in from all the work that I put in with Google, my business, all the SEO. So were pulling them in hundreds of clients a month. Hopefully theyre closing at least 80 to 100 out of those. But I cant help that. I can with this chat GPT thing now, because if you suck at closing and you suck at how to book, thats out of our hand. But now we can take it that step further to where now Clarissa can refocus her efforts on the clients that are in the salon to upgrade them, or to just kind of shift their perspective on more than the basic crap that has to happen to function for a salon. Everybody has to answer the phone. Everybody has to make an appointment. Its just how are you doing it and why do we have to pay somebody to do that and wait on the call? Its just to me, you can get appointment setters that know, go high level. I know Im going to change industrys way of booking appointments. I just need more support.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"ThatS where Im lacking, is that you guys, like I said, I used to have a team. Id sit in a room every Monday and every Wednesday and literally regurgitate what I needed done, and everybody would leave. Everybody would do it. It would come back. Everythings done. You know what I mean? Thats what I need, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I hear that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, Im not booking them.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I was just saying in my industry Ill just go ahead and say it. I dont care. Its the salon industry. The level of intelligence that is required for the front desk. And this is no insult to anybody. I own the hair salons, so this is just the facts. You hire people who are temporary, who dont really give a shit. They just need a paycheck to sit somewhere and play on their phone. Right. Thats literally what happens when you own a hair salon and you hire a front desk. So sometimes its worthless to have that human body back there when the human body really just needs to be on the phone at a certain point of time in the sale, of booking an appointment. And thats the problem, is the follow up in this industry, the closing. Like, when somebody calls in for a question, the script or the word track, they dont follow. They are just like, oh, theyre asking a question? Okay, turn it into a sale. Theyre not trained for that because theyre getting paid 15 freaking dollars or less an hour. Because nobody stays as a front desk, as a career. You get what Im saying?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, so Im leaving for vacation next week. So I dont know if I could possibly do Monday. Yes, Im taking my Monday, and Im done from Tuesday to Sunday. Tuesday to Monday, actually, so Im taking a week off. I havent done that in a long time. So if Monday morning let me look at hold on 1 second. Im driving. Let me look at her. Shit. I just turned you on mute.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"So fulfillment means youre actually booking the appointments?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"In the yeah, I know Rob Bailey. Yes. I just got through his master class for five days.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I do. I work a shit ton because Im in the development process, right? Im in the creation. I love creating things. I go in waves. Right. I havent had a new client in a couple of months. I just took on three new clients. Really great clients. One lady has four locations. Im starting with her Naples location. That ones a $60,000 a year ticket. Im good, right its just SEO for a med spot. Im doing a few reactivation campaigns. Boom. I literally dont have that much, but a couple bucks to do some designing on her campaign and the SEO gets handled itself. I literally dont have to do anything after I give him my onboarding sheet. And when she sees the numbers and her reputation management, that campaign making it go up, shes giving me her second location and then Im going to get another one. So her alone is going to be $100,000 annual ticket, and Im barely going to spend not even probably $5,000 a year on it. Thats where Im going with it because I also do ecommerce stores. Like, I have those and can resell those. Yeah. Im just trying to work smarter and not harder. Even though the industry needs it. They just need to hire me. Im not trying to share my listen.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, sure. That actually sounds really nice. I appreciate it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, again, thank you for all that context. I like having these kind of conversations. I nerd out on this stuff. As I mentioned, one thing that I was thinking about, and I will answer your question, I promise. But one question I did have because it pretty much and correct me if Im wrong, but youre a lead gen source, not a fulfillment source for leads for salons. Is that correct?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, so tell me a little bit what Air is. It a fast no.","metadata":{"fillerID":29,"fillerText":"Mhmm","category":"D"}},{"pageContent":"I have no idea. Im in Charlotte. Im not into college stuff. Yeah, Im into like, the Panthers and not really into too much anymore now that I dont live in the city. But yeah, my nephew is a Duke fan, so Ill just say Im a Duke fan.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. Im not the tech person. Im the connector. Im the business owner. Im the niche. Im the expert in what that industry needs. I know its going to come to me at some point. Im just figuring it all out right now because were on the beginning of the cusp of all this AI. I just know that theres something huge out there for everybody to win from but let alone people like you and I who are developing systems and processes and kind of changing the game when it comes to a lot of the business.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I almost feel like I need to sit in front of a bunch of people like you and be like, do what I just did and spill my guts and be like, can somebody help me put this together? Because I think its bigger than me. Even though it seems like its so simple and done. Ive never been in sales. When it comes to sales, Ive always been good at what I did because it was just the hair world. But selling it on a larger scale, I dont want to be the you on the phone with people.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"ThatS basically what I need. Yeah, thats basically what Ive been trying to do, and I think I have it, and Im going there. Its just I almost need because I was the best at what I did with Salons. Right? Im okay at what I do now. Im good at what I do now. But I need somebody better than me to come in and tell me what to do. Like, you need to do this, and then I do it. Right? Like, I need a boss, almost. I dont want a boss.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I feel like yeah, thats what I was going to say. I mean, do you have that now?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"In Charlotte, North Carolina. I put so much money into people from high level, and theres just so many people trying to hustle. I mean, I cant even tell you how much money Ive spent. That my own assistance. Stop spending money like you keep buying things and Im like, yeah, Im hoping this is the ticket. This is what I need. She can only do so much. I can only do so much. And then all these offers, all these things that this will do, then they want you to watch 10 hours a day on shit to get it started. Im like, thats not what I want. I want to hire somebody whos already smarter than me to help me put this together and then go away. Like, take your share and go away. Thats it.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"But Ill tell you, I got some really good people, though, that are in the industry already doing this, and I dont want to reinvent the wheel because theyre so freaking good at it. Ill just give you an example. Her name is Heather. It used to be heather? Yurko. Now. Its Heather. Manuel. She owns pip university for salons and pip university for students. So basically shes got a program. Its a high ticket $25,000 program. I am not there. Like, I just hit 40 years old. She just hit 30 years old. If I was 30, Id want to do that. Im at the point in my life where I love being the pass through agent. What I do right now with SEO, right? I sell $2,100. They give me a set up fee. I pay my dude literally $400 for premium SEO when he goes to fucking town, and he does great work. So the money and the return and the work I dont have to do. Im not willing to switch. I love what I do. People dont like SEO because they dont have the right support. I have the best support right now, and he only charges me, like, a freaking nothing, right, compared to what I charge. So I want to stick with that versus coaching, to be honest with you.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Got it.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"All right, wonderful, thank you.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, okay, so if somebody I guess Ill tell you, I dont like people right now. My life, like, owning hair salons and managing humans at that level, that age group, I dont enjoy that part of it anymore. So to coach others in my niche, maybe Im wrong, maybe Im just still scorned by the whole last COVID experience. I dont know. Im not confident on that side of being a coach. Although I already coach my clients, I guess, kind of I do in marketing. I guess Im already in that role.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Whos speaking?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Sweet. Yeah. I nerd out over High Level, so I can appreciate that. Okay, yeah, come on. Youre in a safe space, and we use high level, too, as part of our CRM process. So the front end so youre white labeling high level and youre back end offering SEO services at a higher ticket, is that right? Just so I hear exactly what yeah.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Let me ask you a question. Yeah, let me ask you a question. I want to cut you off on purpose for that specific thing, just really quickly. So the services that you offer are SEO and high level in house. Youre white labeling it. I know that its not like 297 497, but youre giving those salons access under your user on high level, right? And you do SEO. Have you thought, I have my own.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I loved his he was so cool. He was on stage the whole time. I think hes an affiliate now somehow with High Level. Somehow or another he got some sort of deal with them. But yeah, he was awesome. Like I said, I was just there in February in Dallas for five days and going back.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Bye bye. You too. Bye.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"We did that I was one of the first people to do that for hair salons, and I got a lot of shit for it. And now its like nobody cares now, but yeah, absolutely. Because people just disrespect time. I understand 100.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Million bucks a month. Ill give you whatever you want.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Ive never heard that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, listen, Im very charming and charismatic, so its easy to talk to me. One last thing. I did send you some information. I do want to kind of keep an open floor communication here, regardless. But coaching, when I thought coaching, I wasnt thinking one on one. I was thinking you put together four or five modules, record three or four videos a module, put it on Kajabi, and hire a sales or whatever. Do a front end, do leads, do sales team, traditional, stuff like that. You can hire people to do it, and you make money, and then youre the face of it. Youre the omnipresent. Maybe do a one coaching call for an hour a week for people who join. Thats more of the vision that I had, not the nuts and bolts of every single person where youre talking to somebody one on one like you, front end of fulfillment.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"You want 09:00 a.m.?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, sure, no problem. Im just trying to understand the situation were in. So I am a go high level reseller. Im sure you know who Go High Level is, so Im a SaaS reseller for them. My high ticket offer is SEO services for small businesses. Whether it be well, I just offer a full high ticket that includes local to national SEO. However, Ive recently gotten into okay, let me just say this. Ive been into it since 2016, but it was back when it was like Manny Chat type of deal. But now that Chat GPT is live, and Im literally loving every freaking minute I have of it, and Ive integrated it with my Go high level software to where we create a knowledge base. And so now I have an AI chat bot with a knowledge base within my software that nobody has this yet, and I dont know what to do with it. So not in my industry, though. And Im going to keep that to myself just so I dont give anybody any ideas. My niche doesnt have something like this. And the AI intelligence of it with the knowledge base is what makes it connected to my software, which is awesome. So we have an open integration with OpenAI, so thats where Im at. Thats what I do already. I manage multiple businesses across the country doing those ticket high ticket sales with the SEO and the operating system through the high level. And then recently I just put together, like I said, the AI chat bot booking bot.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, so I just was reading your message. Im just looking at my calendar real quick. So Im taking from 11:00 A.m. Till twelve if you want to do ten. Or what time do you want to do?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Oh, he was like the main yeah, he was definitely very informative. Im using a lot of his reactivation things in my proposals now, like adding a whole other but I have this really cool proposal calculator that I use, which is going to go dynamic with that. But hey, listen, Im pulling up to my next stop. I appreciate your call, Im looking forward to everything. Youre going to send me all of that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. Youll send me that calendar invite?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hey, its good. Who is this?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right, Michelle, have a good day.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, well, I look forward to go.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Oh, I had you on mute. Hey, are you Alex?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, I mean, if youre not trying to sell me a coaching course, please dont.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hell, yeah.","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}}]