[{"pageContent":"Im in real estate. Im in loans. I am also an immigration expert. So the business that I have, basically, we started it doing immigration work, and Im handling loans. Im licensed in real estate both in California and Nevada. I also sell businesses to foreign nationals. Im originally from the Philippines, and I used to be a vice president for EF. Hutton. I was in charge of the Pacific Rim for EF. Hutton. Basically, the work that I do is that people in, lets say, the Philippines, for instance, that were interested in coming to the United States and buying a business here or coming in as an intra company transferee or an immigrant investor, those are the guys that I help. So its a combination of more or less, sales commission from the loan that I help people get, and I sell businesses to foreign nationals as well. Do you understand that? Clearly. Explain that clearly.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, right now, for the most part, the people Im finding, some of them are true. My former connections and my access to the former clients in the Philippines, hong Kong, Malaysia, Singapore, and so on. Now that they see about slightly a year and a four months ago, my third wife got killed. Right. I was retired already at that time. But then since she got killed, her income obviously ended. I went back to work. Since I went back to work, I was reaching out to a lot of the people that were former clients of mine. So for the most part and then Im working on the website, Ive got about five or six people that work with me right now. All right. So I get a lot of referrals from former clients. A lot of them are basically heavy hitters in the Philippines and in Hong Kong, basically, in Asia. Thats how Im getting my business now. So what exactly do you guys do about AI?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Scottsdale, okay. All right. Im here in California, but Im in the boonies of Northern California. So tell me, how can I avail of your services, and what can I get out of it? Im all ears for a few minutes. Yeah.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"By using AI. What do you mean exactly? I thought the AI was artificial intelligence. All right. It sounds like youre helping a consultant reach out to prospective clients.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yes. And Im not sure exactly what you guys do, except for from what I read. All right. Now, where are you located? Youre not in the same area code as I am right now, so where are you located?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right, have a great rest of your.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right. With that company air.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"All right. Right now, the clients that Im getting are former clients of mine that are basically pretty much well to do overseas. And a majority of these guys are some of them Im helping them invest in a US. Business. One of the visas that I help them with is called intra company transferee. What that requires is that the person has to have a business overseas, and they want to open up a branch office, affiliate or subsidiary office here, which allows them to transfer their executives, managers, and specialized skilled employees. But it sounds like although I can always use a lot of help from the outside, but lets keep in close touch, and I might have some clients for you that could utilize your coaching service. The clients that I have are foreign national that open up a business here. Now, they need a guide, a coach, more or less, to help them grow their business. Right. And Ill be able to refer them to you guys. You guys give a referral commission for somebody that refers business to you?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]