[{"pageContent":"What are you looking to do? Well, I am working in the energy healing segment. Beautiful. It doesnt feel like that kind of marketing approach. I couldnt handle that much business that way.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Probably four or five.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"So I dont really see that as mutually exclusive to actually getting the system and machine.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Monica.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, Im saying that I just had to throw it out there because you know what? Im sure Im not the first one to think of that, though.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I kind of already am in something that is actually scaling up when I wrote in my question and answer, its just a matter of the time for me to put into it. So I am looking at leveraging, and its not a one to one. I mean, I definitely want to do some different programs, and I have some things in line already.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hi.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So if I could walk you through what it looks like to maybe reproductize and make your offer work at scale so it doesnt break you down with just hours and hours and hours of one on one stuff, you could still do that. But if we could show you how to do that and get to that 15,000 a month much faster, would you be committed to that? If the dots added up?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Monica well, I kind of did take an early retirement from nursing. I went back part time and Ive actually followed and done stuff with Kern and Russell Brandt, but Brunson, and thats when I was trying to do it while doing full time nursing. And I just kind of burnt myself out. So I really passive income. Ive got a couple of things that are in the works. I just need to clone me, but, like, about five times.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"What do you think of pricing your offer at?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, good. Are you a human?","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I went back part time.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, it depends on which it is. I have one thats 1997 and so depends on Ive gotta Ive got to build it out so thats for several sessions. Twelve sessions or something, Im doing distance healing, too, so I dont know exactly what it is and how Im pulling it together. So Im kind of in that creation mode because Ive gone from physical, and I dont want to do that as much as I want to just bring it into that or just over the phone or something. So Im creating it right now. So Im really not at a stage to actually jump into doing something because Ive done that. Ive put the cart before the horse, and its just gotten me dragging. Done a bunch of different things.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, Im here. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Its kind of out of pretty much I love my patients and I am doing good work from there because I am also doing that within this. Im doing the energy work in the hospital. And so I went back because that was really one thing that its unique, really to be doing what I do. And at one point they were just sending me throughout the whole hospital. I was doing that, but I needed to heal myself, basically. So Im taking those tools that I learned and Im kind of just applying it to see if I can walk my talk because I was not walking my talk. I didnt take care of myself. And so my niche was going to be nurses and other healthcare workers. And then part of me is like sometimes it doesnt feel really great to be pushing rope, if you know what I mean. Anyway, yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Not that much different. I mean, I can do a little bit more traveling, but I really maybe add some more property or something.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, I mean, Im not going to offer 5000 for one session, right?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"My son.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I have to tell you right now that I did invest in myself. I do believe in that. And Ive put in over 15,000 right now that Im still kind of paying on. That does include building my group, so Im not sure that and Ive just been going at my own pace, which I need to kick it up.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Is there anybody in your life around you that you want to be able to help?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I would, and I know myself and Ive jumped in and had way many things going on, which is kind of where I need to put some brakes on myself. But yes, I agree with that.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Its well, a lot of different things. I just started back in and so 12 hours shifts are pretty hard.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Oh good. Okay, great. Hold on a second.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"So I dont know if you can really help me with that other than having the experience and know what it is that I actually am able to help with people. What theyre expecting, what theyre getting. And so Im kind of in that market research realm.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes. I was also curious because are you going to program it so that if someone says, can I speak with a human? Are you really human? Are you going to tell the truth or are you going to let it just fly?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"So 15 is going to be a lot different than five. Whats the major difference in terms of how you live and how you want to live between five and 15?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I did, yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im sorry. Are you still there?","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Hold on just a second. I have a worker here.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, it depends on what Im offering.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Got you. Okay.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Got you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im working with Thrive, so its specifically for healer and the energy work kind of group of people.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And I went back for part time.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Hold on one more minute.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Now, to have the life in the retirement that you want, whats the number thats going to get that life that you really want to have where youre not worried and a little bit more?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Do you need something? Did you get it figured out? Got it.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Sorry. I just had to give some instructions. The guy is still here. Okay. I have a little piece of paper and Ive got one little circle.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, but Im also like Im pulling things together and Im working on a twelve minute workshop talk that I want to build up to an hour. But Im tweaking it. Im trying to find what my niche is.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, I did. I took it. I took a year off.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"I mean, well see if my investments pay off down the road in a couple of few years, but well see. But I dont know. 10, 15, 20.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}}]