[{"pageContent":"Just $1,000. Nothing really major.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I think that would allow us to pay ourselves, like, a nice salary and still have some money left over in the bank.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Next six to twelve months? At least quarter million dollars.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Again, if you dont no, I dont.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im doing well. How are you doing, Jake?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"So Ive had different versions of agencies probably over the past, like, 15 years. This most recent version of it, I probably had it for about seven years, but we took a little break for three or four years, and now were picking everything back up.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, I dont.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"More like operations, but were trying to really figure out exactly what our unique roles are. And were both creative people. I feel like she has a good marketing mind. Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So, yeah, we want to make as much money as possible, but I would say with this version, its more of like a passion project and less of I got to do this to make money. We just really want to innovate and disrupt whatever industries that we work in. Just really put out some really cool and innovative ideas into the world. So its really more like a passion play. Like, all right, were only going to take on clients that we feel are going to either be fun to work with or possibly do some innovative stuff with, but definitely want to appeal to a wide base of clientele and really just make as much money as possible.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Probably a couple of weeks ago.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"No, I havent really dug that deep yet.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Were still just kind of laying the foundation for what services we want to offer, like our brand identity, things of that nature.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Annually. If we could get it to be, that would be amazing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, Ive done some small tests with Facebook ads for an apparel company that I have. I found moderate success, but I dont really feel like I cracked the code yet.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, personally, I feel like training industry is like a new hustle. I feel like theres all these self proclaimed subject matter experts that are like, oh, Im good at something. Let me go create a class for it and charge people to take it. So Im a little apprehensive when it comes to certain trainings. I have a friend who shes invested thousands and thousands of dollars into all kinds of trainings, but Im like, whats the ROI on that money that youve invested? So its like, I would just like to see maybe, like, a website or maybe some documents or anything. Yeah, just, like, own research and gauge if this is something even right for the direction that were going in. Because, like I said, were still building and were doing, like, a rebrand and were trying to figure out the new direction and everything. But like I said earlier, your ad caught my eye, and you guys are using AI, and Im a big fan of AI, and Im just curious about anybody using AI to make money. So thats what really wrote me in.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Probably like, three months.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, it sounds definitely like a worthwhile education.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Morning, afternoon, probably something more in the evening. But I would have to check and see what she has got going on tomorrow.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, definitely not.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Even Im looking for probably, like 10,010 to 15.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"As far as monthly income, correct. Yeah, between 1000 and $5,000. Were just really getting started. Back up again.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, last time I checked, I think it was 737 30.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Were still trying to figure out the specifics.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, its liquid.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, sounds good.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, I want to say it was like Russell Brunson. It was a still image. I dont really remember exactly what it was, but I saw it. And whatever the headline was, it had AI in it and whatever other language, it was like, oh, let me click on this to see what it is.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I have a marketing agency.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, right now they definitely do.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"About 80,000 a year.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, Im definitely curious about that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, yeah, Im not sure yet about her. And looking at my calendar, I think Im free tomorrow at six, but I would have to check with her.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I would say like tentatively 06:00 P.m., but I would definitely have to confirm with her.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Is there any way you can email me this so I can check with my partner and see when shes available and then we get right back to you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"We havent really quantified our process like that. Were both super connected. We know a lot of different, I guess, people from small businesses to executives at some major brands that we can probably get in front of and pitch whatever ideas we do have. So I dont think locking in new clients is going to be that sounds.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, definitely. But again, just with my personal perspective on training courses, I definitely want to just look into whos doing the training and the claims that youre making. Can I substantiate the claims just so I know Im not just talking to just some random guy who made a little money at something and now they feel like theyre an expert.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im like 70% there. I would like to just see some more information before I really commit to saying I want to do something. Yeah, I would definitely like to see.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Get to, yeah, I would say yes, depending on whos doing the training. And Im looking up Caleb right now. Im looking up AI right now. So Im learning a little by little about it. But just going back to just the time thing, I dont want to put you in a weird situation where I guarantee Im going to do something and then I think about it or look into it and feel like, no, this isnt right for me, and then I turn around and cancel on you. So I would just say if you could just give me a little time just to research it and then we could connect later, thatd be the ideal situation for me.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Its me and one other business partner.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im based in Atlanta.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. So I think definitely watching the video is definitely worth my time. Im always consuming content. I think after I watch the video, I would probably make the decision on if I wanted to move forward, like, if I thought the information was relevant or if we can make it relevant for my current business. I would definitely decide after watching the video.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, Im on it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Depending on the quality information, yeah, 100%.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I understand what youre saying completely. But like youve been saying, time is definitely precious, and I like to do my shared research on anything that I commit to, and I wouldnt want to waste any of your executives time or anything. So I know you said the first step would be just to watch the video and then from there we would do the call. So I definitely dont mind watching the video. I kind of look forward to it. But after that, I would hit you guys back and let you know if I felt like it was relevant for me to move forward. Because with us just kind of figuring out the direction, I dont even know if what you guys are talking about is even in line with what were going to plan on doing. Were still kind of working out with the rebrand and the redirection of where were going with this 100%.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Again, Im just stressing, like the tentative thing because I dont know what she has going on. Like shes a busy person.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"So we really just scale it per project. Depending on what the client wants, we kind of do it like Ala carte.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I have an android.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, were both in Atlanta.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im definitely curious, compelling ad that I saw on my social media and thats why I clicked on it and signed up for it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I definitely see how they go hand in hand. But again, Im just a research driven person, so I would definitely like to just do my research at my own time and figure out how relevant everything that youre saying is for what were doing. Everything sounds good over the phone, but I definitely would like to read up on exactly what you guys are doing. And if I could watch the video prior, that would be great, and then I could reconnect with you and schedule a time for the call or even just let you know, like, hey, were going to move forward with this and not move forward with this. Again, this is just respecting what youre saying about time. Im definitely a strong advocate of using my time as wisely as possible. I dont want to commit to something and then potentially uncommit from it because I thought it wasnt relevant or anything like that. So whatever stuff you can email me or anything, that would be great, and Ill definitely take a look at it and just hit you back.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, thats definitely fair to say.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I would say this the best thing probably would be like, give me like 30 minutes to talk with her and then hit me back. And then I can probably confirm tomorrow or not confirm tomorrow unless you know when we are available.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"All right, sounds good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Definitely. Yeah. I would definitely like to see the video first just to kind of gauge what kind of stuff you guys are talking about and then I would definitely love some one on one interaction.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"All right, man. Thanks for all the information you have.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, because, again, time is definitely one of the precious things that we have in the world. So its like, I wouldnt want to waste your guystime if I watch the video and I was like, this shit aint really for me. Im going in a different direction. I wouldnt want to confirm to something and then decide later, like, no, I dont really want to do it. So I definitely would like to watch the video first.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Before.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, I was just kind of curious as to what all you guys are doing over there.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"You said an industry standard what?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So, again, I think all that just really sounds great, and Ive even just put you guys in the Google. So Im looking through some of your stuff. Again, Im a real research based person, and I already expressed my views on training courses, so I would just like to do some more research on this specific training course. Just so, like you said, were not wasting each others time or anything like that. Im a real big advocate for making sure that I use my time as wisely as possible. Sounds like you are, too, so.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I have an interest in AI, so anytime something AI related pops up on my feed, I like to youre on it, look into it, see how I can benefit what Im doing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]