[{"pageContent":"Oh, no way. Yeah, Im in Scottsdale every day. Yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No. And thats what I dont have. Thats what I got smashed on two years ago. So I lost my credit, I lost my house, I lost my cars, I lost everything. So Im starting from ground level again. And thats why I went to work for one of my clients because he knew who I was, he knew where I came from. So he was the only person in that realm that sort of started paying me in the ballpark of something valuable. And so thats where I had sort of been stuck.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Good. How are you doing?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Ejremaginator. Yeah. The company I work for is reimagined roofing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Where are you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, if I saw a path and it was something that I could actually logistically integrate, then yeah, absolutely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I dont know, man. To be honest with you, dude, Im in the roofing business, and I work 80 to 100 hours, weeks, so when Im clicking on stuff or something, its usually over lunch when Im parked, trying to eat a sandwich, and then I miss so much. Email is a horrible way to communicate with me. Text is probably the only way that I see things. I do think that you guys have texted me a couple of times, and I just have not had a chance to reciprocate or respond or look into anything if it was sent. I dont get a lot of time to watch anything. I also dont own the company, so Im an inspector for the company. Ive been looking around for something that I can kind of moonlight with to sort of build on the side, and I may have clicked on something like that. I was looking for something that was passive in a way, something I could kind of work with with my hours. So, yeah, thats kind of my situation. What are you guys are you guys growing leads or something for an existing business or what are you doing?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Right. Thats kind of where we appreciate that. Okay. Yeah. So it sounds like at the moment right now, thats not a fit.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, I may have hit some like that. Ive been intrigued by AI the last couple of months.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, prior to COVID, I used to be in marketing. I started my own little firm doing congruency branding for construction companies and solar companies. And my clientele kind of got beat up when COVID hit, I ended up going to work for one of my clients, which is who Im with now. They have somebody internal thats developing a whole bunch of AI stuff for them. And it kind of turned me on to just chat GPT, which Ive just been playing around on my own while I drive around. And its just intriguing to me because what I used to pay people to do, I used to have to freelance and hire out. Its just amazing to me what can be done right now. And so its just like it kind of torments me because I work so many hours, but I cant go back. Im just stuck. I feel like I have a glass ceiling and I cant leave what Im doing. And so Im trying to figure out, what can I do leveraging AI to do something else that doesnt require my time, you know what I mean? Ive been kind of open minded to that and looking around at different options. But its just there seems to be a chasm, and Im not very technical either, which is kind of ironic. I used to be surrounded by highly technical people, but I was always the idea guy, the relationship guy. I had the contracts, I brought everything together, and then I just freelanced everything out to make things happen. And so I still feel a chasm. Im like, okay, theres a lot that I dont know, a lot that I need to know. I dont even know how to set up half this shit that needs to be set up to be able to do something on its own, like having it run independently. So thats kind of where Im at right now. Im interested. I want to do something. Im stuck in a weird pattern. I dont have money saved to invest in something. Im literally just in a weird spot. Thats where Im at.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Whats the play? Yeah. Can you give me the elevator pitch of the play? Like, whats happening?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. And I think that go ahead. Sorry.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Phoenix. Phoenix, Arizona.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Cool. I appreciate it.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"But yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, it feels a little scattered. I feel too busy to really try and focus on it. And every time I sit down to try and focus on it, I feel overwhelmed because theres so much I have to do in physical space and with jobs and stuff, I cant even sit down for five minutes. Im like, I got too much to do. Thats where I got okay, cool.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well do. Its going to happen. All right, bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats more me. Thats where Im at right now. I need my time freedom back. I used to work from home. Yeah, I want to get back there. I got two teenagers, and I need to spend more time home. But Im in a situation where basically Im kind of married to what Im doing right now for probably about another year, and I need to leverage something to get out of this in that time period.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, Im sure I havent. Yeah. Thank you. Because theres no point. Okay. Ive been making money under the table, like I said. And thats why I think, when your text started coming through and I realized that I hit on something that was for existing businesses, probably thats why I was just ignoring it, because I needed something that was something I could now, if you would have talked to me, if AI. Would have existed three and a half, four years ago, I would have been a perfect candidate. I had walk on water credit, made 400,000 a year, always had 100 grand at my disposal. I had seven, eight credit cards. I had Blaine to work with, and I was surrounded by other guys with money. And my current situation, all of that has disappeared. Yeah. So Im not in that situation at the moment right now. So Ive been there before in my life, and Ive bounced back. Ive been a millionaire twice in my life. Ill be back. Im just looking for something. I got myself committed to this project, and I also have an exit strategy when this company sells as well. So I have a half million dollar contract with him. Hes selling this company. So Im on a mission to keep this company valuable, push it to a certain place, and thats where Im just, like, swallowing my pride, my everything right now, and just putting 100% into that, because at least I know that way theres a way out. But at the same time, a lot can change in a year. You know what I mean? So I dont want to sit and rely on that. Ive already been here two years, and Im itching I dont like roofing. I dont want to be in this business. So it is what it is. And I completely understand if your model doesnt fit. I dont fit in that model yet. Im more than happy to put the number on the side and contact you guys back, or you guys can hit me up in six months and figure out whats going on. Sure. Okay. Yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Really? Wow. In Denver? Yeah. I used to go my wife and I used to go to Colorado every year we go snowboarding. Breckenridge, can you put me down for check in with me in a few months? Just tap in, man. Im talking to a few people about opportunities, so Im reconnecting with it was kind of funny when COVID hit, man, it was like my whole circle, some of my circle, it prompted them to take a step that they were scared of taking and they expanded and did really well. And then some of us that were doing awesome. It punched us in the gut and jerked the rug out from under us, so to speak. A lot of our clients and stuff, everybody froze up and whatnot, and then were all just doing what we got to be doing. But recently, Ive been reaching out and just talking to people about different things. So Ive got one buddy of mine thats wanting me to go into business with him on an off road company. I have another one for trucking. Ive got another one thats clever RX, which is an online RX app that would probably be more in line with something that you guys could help with. So I dont know. Theres a few things going on that Ive been entertaining. Again, my criteria was my time freedom that I could actually put into this, into whatever it is that Im doing. So well see where this goes in a few months. I may have something happening that could use what you guys do.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Is this your number? Is this your cell or a company number?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Hello? This is Eric.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right. Got it.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}}]