[{"pageContent":"But you youve had youve had 28 minutes to land the plane and counting. So if you want to call me back another day, I will take your phone call. Its a Saturday, dude. I want to get on to leisure time.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Work remotely.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, not necessarily. Right. So I also get variable compensation, so I dont get the cake until probably 600.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay. All right. And have you kind of looked at also the show rate again, you know, sales? So you get 16 leads coming in. How many do you feel are actually going to show up and say, okay, lets do this?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"What kind of businesses do you help scale?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Right now, I have 16 lead spots a week. Right. So if Im going to coach an hour for each one, Monday through Thursday, thats 16 leads. Right. 16 leads at basically $500 a coaching session. Thats about 32 grand for that five week session, if I just did that math correctly. No, actually thats wrong. Its 40 grand because its eight grand a week times five, which is 40 grand. Figure I can run ten coaching whatever were going to call them sessions, five week sessions a year, and that basically gets me over that fixed number. Now, thats at full capacity. Can I be at full capacity? Maybe. Could I expand to Friday and Saturday? Yeah. Im going to wait to see, once Im full, from a 16 meeting perspective a week, how I feel about that and whether or not its energizing or not energizing. I think at this point in my life, Im not interested in doing things that deteriorate my quality of life. So do with that what you will.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Go ahead.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Baby. What are you doing? Awesome.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"I would get it. Dude, its a Russell Brunson funnel that youre running on me right now, and its like every other Internet funnel. Right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"But before look, I dont want you to waste your time so if youre trying to get me to sell a big ticket item, my guess is you eat your own cooking and youve got a big ticket item. So just hit me with pricing, and Ill tell you.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Buy a surf resort in Costa Rica.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Wait, can I pause you for a second? How much time do you need?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Do you have any recommendations from firms that have bought your service?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, I can look, hold on a second, okay.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. Can we do this another day?","metadata":{"fillerID":16,"fillerText":"Ok gotcha","category":"B"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So that would be valuable, right. Having a testimonial from a few businesses that had gone through the process?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"24 95 for a five week baseline.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I cant tell you, man. March 7 wasnt a couple of days ago, right?","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I got it on March 7. So that was six weeks ago. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I think Ive been a self development person for my entire life. Landing on coaching as a way to solidify that, which Ive learned has been in the back of my mind for a long time. Right. Because the old adage is you havent really learned something until you can teach it to somebody else. It hasnt really been until this whole coaching phenomenon has come along. And then coaching for coachings sake has never really appealed to me. I happened to land on something via Dave, asprey if you know that name, bulletproof Coffee. He put together a program, which is the one Im certifying in, which is from an integrative medicine doctor. And so its a combination of essentially bleeding edge biohacking and this idea that our brain is we have a tendency to overthink things as people because our prefrontal cortex is really valuable to us in high stress situations. But the chance that we get eaten anymore as human beings are not good. So that developed 1000 years ago. And so there are techniques to defeat that. The same techniques that Michael Jordan used to win eight championships in a row right. And find flow. And so those are the kind of things that people on a day to day can use in the world of martial arts. Its called centering. But its essentially being able to defeat that overthought process in the prefrontal cortex to place yourself in a spot where you can win.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I think, look, there are agencies out there now that will finance this. Right. If somebody doesnt have 24 95 worth of credit on a credit card they can use, Im not going to burn them. Right. Theres a bunch of people out there that are desperate and will buy coaching, wont use it. You know as well as I do that 95% of all the people who buy an online course never look at it. And so that would be a real compelling reason to actually do the right thing for somebody who couldnt afford it and give them something else to buy. Right. Which is, hey, maybe you dont need me live one on one. What you need is my $295 version of this. If somebody cant afford 295, I would tell you you should be altruistically running a side business where you take those people aside, find out how serious they are, whats getting in their way, and give it to them for free, because those are the ones who probably could benefit the most from the coaching.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"The case study is a video?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Possibly. I could see doing, like, a weekend retreat or something like that for going through the five week baseline, where I charge them five or ten grand for the weekend, but I got to walk before I can run.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"The people who actually pay, the people that come in, and theyre 16, you got and all of a sudden youre not getting 16 paid, or are you looking at 16 paid? And you go from there? Im just kind of looking at the show rate as far as showing up to the meeting for you to tell them, hey, this is what we do. This is how much it is, kind of a thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, no, Im already making 600. Right. So my fixed is 250. It doesnt make sense to leave my core hustle for a side hustle unless I can get it above that number.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I coach financial advisors for productivity.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right. Bye.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yeah. So this is just a video?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Do you remember when you would have sent it to me?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"250.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I started a coaching program, and Im sure that thats probably what attracted me to you guys, is that Im in, essentially a beta test on a coaching program. So trying to get a feel for.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. In terms of my routine or in terms of what do I got to do?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay, all right. And would you bother trying to reach the people who basically said, hey, Im interested, but I just cant afford it? Would you follow up with those people? Would you say, forget it and go to the next or how would you approach that?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Hello? This is Jeff.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, look, Ive looked at Woo Sender, which Im guessing does maybe some of what you guys do. Again, theres a bunch of technology out there running around. Now, the fact that youre calling your firm error AI leads me to believe that you guys have a very strong belief that technology will solve problems. I dont know if Im that far along, and it may just be because Im 35 years into the business world. Right. And that doesnt make me a skeptic, but it makes me, I think, very focused on this idea that a lot of this stuff is new and is the bright and shiny penny, but theres not enough sort of this is why I asked you for testimonials, right? Theres not enough proof of concept yet. If I talk to one AI, Ive talked to ten, and clients in Community will charge me eight grand a month to build a Facebook group that guarantees me 30 grand a month. Right. As an example. And so I get that these guys have had a couple of successful people who have gone viral, but if theyve got 1000 clients, I guarantee not all 1000 of them are successful. So thats where Im very business oriented. Look at it from an ROI perspective. Would take apart a testimonial and have to have some proof of concept demonstrated to me in a manner where the success is yours, not theirs.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I need to replace my fixed compensation for my primary occupation.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No. $500 a coaching section I think is pretty strong.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Its going to be air. I AI right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats why, when you ask me, hey, have you looked at my case study? We had to go to a date that was over six weeks ago. And if youve been texting me, those have been going into the circular filing system.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Yeah. I need to log enough hours to certify, and that will happen by July 1.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Lets see. I started coaching certification a couple of months ago, and Ill finish July 1.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Got your email problem. Yeah, Im on the wrong computer to do that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. Yeah. I just didnt know whether you would run the numbers yourself in your head saying, hey, Ive got to have this many leads a month coming in because I know that my show up rate is going to be about this much, and I know my close rate is going to be about this much.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. Im out next week. Im at a conference next week. So it has to be the following week.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Im going to let you go. Thanks.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I work on Wall Street. Right. So I have 600 minutes time blocks every workday. And those 600 minutes time blocks are made up of now, actually, youd ask me that question two months ago, I would have told you I had those six blocks applicable to just calling investment firms to place any one of our 48 products on their shelf. Now, its that plus I also have essentially a third of the country with lets just call it 50,000 financial advisors who need to buy my stuff. And so I probably will allocate two time blocks there. So four time blocks towards talking to various investment companies about what their protocol is, where they are in adoption of the things that I have, and if its something that can happen on the phone or if its something that needs to happen after a committee meeting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Would I build a team? Absolutely. Do I want to build a team? No, not really. If I could get to a phone number right. Seven figures a year without a team, then I could work whenever I wanted to and not worry about having to support somebody else.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I dont Im eight minutes behind what Im supposed to be doing right now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, so Im going to have to reduce the six time blocks to probably five, and then Im going to have to add back probably two time blocks. So my time blocks now end at four for my primary hustle. My side hustle becomes four to eight until I get to critical mass. Right. And once Im beyond that replacement of my fixed income, then I can make a decision. It just depends on if Im wearing myself out or not. Right. Theres potential for that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, its not, but thats okay. Im going to let you go, Jeff.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats a good question because Im in the beta test. Im giving it away right now. Okay.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, I run a tool on LinkedIn right now, brought in 80 leads that are top of the funnel last month. So May will be all about, I think, seeing what kind of number I can pull through the funnel. Okay. My guess is its going to be 20% would be accurate. That particular tool cost me $100 a month. So put it all in context.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, sales.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, thats providing a million dollar question. Right. So I would tell you, look, if I keep my primary occupation, probably not, right. Its going to have to be a part time gig. If I make the decision to transition away from Wall Street to this as my primary gig, then depends on what the numbers look like. Right.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yeah. Sales for me is mono y mono. Right. Im a sales guy. Ive been a sales guy for 35 years. I like to buy things, but I also like to buy things from live human beings.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Pacific.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]