[{"pageContent":"I dont believe so.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"We do have a funnel where it starts with Google AdWords. Someone doing a search for become a travel agent. They land on a landing page. Its an opt in page. Theyre sent to a recorded webinar, and from there theyre sent to our join page, where its kind of like a long form sales letter. And then we have an online onboarding process to bring them into our company.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Those are annual, though, so were not getting the monthly and the annual. Its either or its either monthly or annually.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Course. Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, again, thats relative. Again, Ive been doing this for a long time. In the past, whether its Facebook ads, Google AdWords, Ive been able to put a dollar in and see two or three or $4 come back out to us. And thats on a pretty consistent basis. So if I find something that has got they can generate those kind of numbers, Im going to put as many dollars into it as I possibly can.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Eastern.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, I mean, I look at what our incomes are right now, what our revenue is right now. And again, I could give you any number. So, I mean, I just picked 100K, but I think thats attainable.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont have the time to put ten grand into a program, and well see how it goes for the first six months and see if we can get you where you need to be. Im not interested in those kind of programs. Thats why Im with you. Yes, Im selective. If a company, if anybody feels that they can help us to do that, heres a new method. Put ten grand in, and were going to show you where youre going to get 10, 15, 20 grand back out of it. Well find as many ten grand as we can to put into it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"It does, but honestly, our biggest we just need more leads. Were not getting enough leads. Again, when we were doing pull up my numbers here, when we were doing Facebook ads back, this is prior to 911, we were bringing on 2000 leads a month. And now Im looking at my system right here, and now were bringing on 300, 300, and 5400. And those kind of numbers we need just to find a way to bring on more reliable leads without driving our costs through the roof and still maintain some level of quality.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, of course wed like to continue to grow it. And again, at this point, were looking to grow smarter instead of harder. So were looking again to bring on fewer people, charge them more money so that we dont have to also scale our support staff and all the other expenses that go with that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sounds good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, were just 2 hours away from you in Bradenton, Florida.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes, I did that yesterday.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Good, Ethan.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, Ive been doing it for about 20 years.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"But again, that $2,497 product would be something like one time upfront and then you pay an annual relicensing fee of something nominal, $100 or something like that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, were spending about four grand a month on Google AdWords. We were doing Facebook ads pretty successfully, and then we got slapped by Facebook and cant get back on Facebook.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, sure.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, thats just not going to work. Actually, lets start with youre going to send me over whatever you were going to send me. Lets start right there and then we can circle back next week. Im actually going to be in Mexico towards the end of the week, so sometime Tuesday, Wednesday, Thursday would be better.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, possibly. My thing is I have zero time in my life right now to do anything more. So as far as putting together new products, new plans, new courses, I have got zero time to do that. What I need is I need more people coming in to the top end of my funnel. Thats my biggest thing. I mean, right now Im paying probably on average $12 a lead. Id like to find a way to get more leads at a little bit less money. Thats my biggest concern because again, once I get those leads in the system, our funnel basically does a really good job of selling them.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I think we would have to bring on that 24 97 product, the $2,500 product. Im a firm believer of the what is it? The Pinelli principle, the 80 20 rule. If I put a $10,000 product out there, thered be one person over the next 120 days that would buy that. Just because of the fact that Ive got a $10,000 product, theres probably more that would buy a $2,500 product and theres going to be even more that are buying my $67 product. Again, it all starts with the quality of leads. I know that if we could bundle that product together, itd be good. But if I dont have leads, people to put that in front of, its not going to do me any good.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, again, theyre either offered the $67 a month theres a one time registration fee of $97, theyre coming on board for 164, and then a commitment, minimum commitment of twelve months at $67 a month. And again, youre putting that on a credit card. Theyre also presented with two other options, a 697 option and a 997 option.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And the rest of them are at a monthly $67.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, obviously hopping on the AI bandwagon here and trying to learn as much as I can, see how we can incorporate the tools into our current business. So Ive been just on a hunt for everything AI and just kind of trying to plow through all the information. But we have a kind of a unique business. Its more of a subscription business. We do have a high ticket item. I think its high ticket. Its $997. I know for some thats not high ticket, but for us it is, and were looking to just continue to grow.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Checked its like 899, 798, 800.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Correct. Yes.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Itll range anywhere from $30 to $40,000 a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, like I said, anywhere between 15 on a real slow month to about 30. But again, my track record over the years had been 75, 150. Our record was 204 agents in the course of a month. Now, not all of those are at that 997 plan. So we would like to bring I mean, right now were probably bringing on five to maybe nine people at that $1,000 level.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I believe that the sky is the limit. Right now were bringing on about 2025, 30 new agents a month. At our peak, we brought on I think our record is 204. Now, again, we reduced our price. But again, to answer your question, I mean, wed like to see this thing at least one hundred K a month in revenue.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And again, the other way that we make money on all these agents is we override all their commissions. So we take 20% of the sales or the commissions that they generate, but thats more of a longer term thing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"What we do is we are a host travel agency. So what were doing is were recruiting individuals that want to become a travel agent. Weve got $1,000 a year package that we send them, and for that, we provide everything that they need in order to start and run their travel business under our corporate branding.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, its just a long story, but obviously through COVID, we downsized our staff. We took everybody and made them remote so no one works in an office anymore. And we do have another program thats a subscription base. Its monthly, its $67 a month. Were trying to get away from people who dont have any money, so were looking for someone whos got some money on a credit card that they can invest in the business. So we do have a plan to shift this focus, this plan that Im talking about for 997 to like 24 97. So, I mean, we could easily do that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Other side of the state.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So were primarily on Google, bidding on keywords, like, start a travel business, become a travel agent, travel agent, training, things like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats correct.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Around 100K.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Its fulfillment and customer service.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. And of course, theres no humans at Facebook anymore, and no one can tell you why you got canceled. So we like to figure out how to get back out. We were spending probably ten grand a month at our peak on Facebook ads, and again, it was one of those situations where we put a dollar in and get two $3 back out of it. So we were making some good money at that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"That sounds good. Yes. Absolutely.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"You too. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure. But again, it doesnt sound like thats your core offering. It sounds like thats a way to get me on the phone with them. If thats what its all about, is theres ways we can get more leads, then Im open. But I just dont want to waste their time. I dont want to waste my time if it isnt.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, they get something like, Im going to say, 60 emails over the next nine months. They get a combination of voicemail messages that are dropped, text messages that are dropped, a bunch of that kind of stuff. Plus we do some retargeting with Ad role as well, so its a pretty mature funnel.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, well, like I said, Friday is not going to work.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Lets do that. Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Early afternoon.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, it really doesnt. Honestly. Again, because my time is so tight right now, Id really like to take a look at what youre going to send me and then we can get back on the phone and set up another time.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Sure. And again, I dont know. I probably found you on reels or stories, but there was something that caught my eye other than just the AI in the name. By the way, Im familiar with Cable, and Ive seen him speak a couple of times at the Russell Brunsons Conference. Where was I going to go? Oh, I never got whatever this thing youre going to email over. So if that would help me, give me a little bit more information, make me more willing to sit down and spend an hour with you guys.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"We are not calling them. Calling them, in my past experience, has been a waste of time because youre spending all your time dialing, not reaching people, leaving voicemails. So thats why we use Sly Broadcast to drop a voicemail on their cell phone. We use gosh, I cant think of the text twilio to drop text messages into their phone.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, we are definitely scalable. So going from ten to 100 is not a problem for us. Very easy to do.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, its not really so much as a higher ticket program. Its just a different means to pay. Whether paying monthly or paying annual. We do have some upsells along the way, too.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Looks like anytime. Tuesday?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, outside of salaries for existing staff, were not taking a product that we have to purchase, mark it up and sell it. So I mean that 997 is other than the fact that theres salary and everything. Yeah, its pure profit. Not pure profit, but I mean, you get the idea.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]