[{"pageContent":"Melting.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Because I just recently got started again. Okay. So Im scaling from basic zero. You say about 2000 a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. Im sorry.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"ThatS how it was related to me. My associate called me and said, I got a meeting today, tonight with the Spy. I need you to be available. I was like, okay. I said, wait a minute.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay. ASAP. Im not really trying to drag my feet about anything.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hey, Im okay. How are you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, maybe thats fine.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"For me, its just another avenue for independent film creators to actually get their product out there. However, they will make money from it as well.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, nothing. Im in the process of getting redoing. My website, Im in the process of just rebranding all the way around right now because I had an idea or thought process and I have a couple of other things Im working on right now that Im getting ready to relaunch my rebranding process.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, well, everythings going to get their own attention. Its just that I just transitioned from that talent management aspect of it into doing this. And thats where Im at right now. Ive always done entertainment marketing, but when it comes to talent management, thats like literally having a child or children that you have to actually have to monitor and watch. And I didnt like that. Its fine. But when youre dealing with grown people and they feel like they know everything, you got to let them go and do what they need to do. So, like, with this, where Im going to now, and when I say regionally, its probably when I reached out to you guys online for their information. Its only been a week that I said, hey, let me actually focus on the things that I want to do. And thats what Im doing right now. Im still doing marketing, NPR, but the television component, were starting this channel to help other people out. Thats what Im more interested in.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"All thats going to be important for what Im doing with the film. Because theyre going to need to purchase ads and theyre going to need ads, theyre going to need product placement. They need that particular thing. The AI, Im interested in that because regardless, this marketing and PR company, thats been my baby since they won, you see what Im saying? But at this particular point in time, I got sidetracked doing the talent management, and so Im leaving that alone and Im going back to my roots. Im doing a lot more marketing and a lot more PR right now, and thats where Im at right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, I write films, I write scripts.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I do entertainment marketing and also have a media company as well.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, Im always interested in figuring out a starting point, get my business models structured right and that would be the biggest thing structuring my business model.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Advertising. Im going into film, starting a channel online platform for independent film producers.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, Im sorry about that.","metadata":{"fillerID":39,"fillerText":"Yeah","category":"F"}},{"pageContent":"Right, and thats what Im saying. Thats why I got to sit down and just kind of like structure everything. Thats what Im going to do this weekend. Start structuring each individual piece so I know which way Im going. Because sometimes, be honest with you, Ill sit down and Ill look at the workload or my to do list and its like its not structured. So I got to structure it. And allocate time to do that. I mean, time like, hey, this is part of the day. Im going to focus on this, focus on that, and then that way I can go in and get some of this stuff off my plate.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Well, actually Ive been doing it for a couple of years. I just recently shut down in the pandemic, so Im just recently getting started back again.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"There isnt the most expensive one. It really depends on what they want. If they want to do something in film, then of course its going to be a little bit more money. If its an independent artist, its different from a nationally reporting artist. Okay. It really depends on their budget.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So it didnt dawn on me that there was that. And I do have an award. I mean, theres so many things, but there is a need for my thing is if I get a better understanding because I know theres so many different elements or components to AI, and if I get an idea of what it actually is and I have an understanding, I will know how to apply it to what it is that Im doing. But getting clients and customers in, thats definitely number one priority.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Everything is word of mouth. I mean, thats how it was before. Once I get started, I dont really have a problem with getting clientele in. Its just that its just getting the start.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, the marketing agency does not manage the talent. A talent manager finds them avenues for exposure. They may find them bookings. I can do that, but I choose not to do that. What I do is if you have a product, Ill take the product and figure out a way, the best way to maximize your exposure and come with some type of strategy that bring you more exposure to whatever it is youre doing. Or if you have a product, figuring out the best way to help you scale your product on a grassroots level because most of the time these people dont have any money. And figure out how to go from there and scale it up. Right now, Im working on what Im really working on right now thats kind of like a lot of focuses on these. Im doing an international music and film conference. So thats the most important thing for me right now that I have. And then Im getting ready to launch a Roku TV channel too. So thats where Im at right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Im not really familiar about the Air AI, but AI in general, Im interested in learning as much as I can about it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, theres a few things right now, Im being brought into a couple of projects. One is dealing with espy. I think it has a subdivision of ESPN. And also theres a comedian out there that hes been in industry for some years. His name is BD Freeman. Doing some things with him as well. So I am getting reached now into that clientele that has money that wants to get exposed. So exposure?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, yes. Question for you. Is it possible we can talk next week? Yeah, Im in the message doing something right now I cant step on.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"And the other thing is its going to be as of right now, finding independent film producers and then theyre looking for an avenue to getting their product down, whatever they create. I see, I guess where Im going. So more headed, more so than anything, thatll be a lot less hands on and more sustainable for me at this point in time because everybody is creating something.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its just fine tail as far as building clients. And its a whole gamut of things right now. Right now for me to really get please hold on.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"It would be great to make a minimum of at least 5000 a month. Yeah. Tuck and scale my business. And of course I always want to scale up.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, more online. I want to be able to work from my laptop.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"AI.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right, Derek. Ill follow up with you then. All right, bye.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"It really depends on what they want. I develop packages for what they want.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]