[{"pageContent":"I think the hardest part about marketing was probably research and being able to identify and knowing where to look and how to target the right customer. Because everything is geographic. Its demographic. Believe it or not, its interest. So what I cultive with the business that I cultivate because I not only consult in one industry, I consult in multiple industries, like trucking. I can also do Human Resource. I know how to teach dispatching for trucking because I own a trucking company at one time. So I know how to do those things. For the most part. I know how to do home care, health. I know how to staff for that medical health care staffing or whatever. I just know how to help people get the initial start in their business. And you can take it from there, because you still got to do your own research.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It does.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im good, how are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"And people would always come to me in business consulting. Yeah, well, people will always come to me and ask me, and Im kind of diverse. I have a couple of different industries that Ive worked in, and Im familiar Ive started a couple of businesses myself, so Im pretty fervent in those areas. And people would ask me, and I would just do this and this. One of the first clients that I think I had, I think I had was he the first? I think it was the second the second client I had, and this just came back to me. Thank you. Holy ghost. He was working at a bank in bank of America. He was actually a banker. And I went in, I opened an account, and he asked me if he could come over to my office. Well, he had my address because I had opened the account. So he came over to my office one afternoon after work and he told me what he wanted to do, and I told him what to do. And with less than a month, he had went out and done it. He started a new business. Wow. Yeah. That was one of my first success. They do people actually do listen to me, and then I have a good persona when it comes to people.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"What works best for six Monday would be lets do 08:00 P.m. On Monday.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"I think my goal is first thing first. I dont want to just set my sight on money. I know you have to have a projection. I know the bottom line is money. I know you need money to live, but I have a desire to help. And one of the things that Ive learned, your tenacity is exuberant to other people. They will be like what you just said, it that charisma will catch on fire. And thats how Ive been able to get clients to maintain, clientele to get referrals. Because when I speak to someone, I talk to somebody. Its not just about the bottom line. Dollar. I need to know where youre thinking, what youre thinking, what your goals are. And Im not going to waste my time now. That Im not going to do. Im not going to waste my time. Because if you sit here and you just want to play with it, you can go find somebody else. But I just like to kind of get to know thats why you have to pray for the spirit of discernment, baby. So dont nobody be wasting time. Thats her. And then sometimes people are just trying to get information and thats cool, but thats kind of where I am. I dont want to just solely set my heart on dollars. I want to set my heart initially, I want to set my heart on structuring my business so that I can provide a sustainable service to my clients. And then I want to see them prosper as well as me prosper. Yeah. Because I want my clients to call me back and say, you know, I scaled at least $10,000 this month and Im like to God be the glory, you know what Im saying? Because thats an accomplishment for me because I can say I had a client at scale ten. Thats marketing, thats marketing strategy. So thats your referral base.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"About ten years or so.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Perfect way to put it. Thats a perfect analysis. Exactly. And miss one payment and theyre going to repossess your car. So thats just the way it is. Im serious, thats just the way it is. And like I said, you see a lot of people. Im a millionaire.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I do consulting to help people get their businesses started. Okay. Business consultant? Yeah. Business consulting.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, yeah, I totally agree.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"What it means, what it would entail is, like I said, restructuring the business and stop lolly gagging around and being nonchalant about it. And thats just being honest, getting a little more focused, probably getting a mentor. That could probably help coach me. Well, Ive gotten mentors and Ive been working with mentors, someone that can coach me. And a lot of time is financial literacy, its taxes. Its not just making a million dollars, its how to accumulate that within that million dollars, you got customer service, you got responsibilities. So a million dollars bring on more a million other responsibilities. So its not just, okay, well, I made a million dollars. I mean, when I see people say that, Im like, anne, you got probably $6 million in debt. So Im not fascinated when I see people say they made a million dollars. Im just not because I can count. So, yeah, you might have a nice car, yeah, you might have a nice house. So you make a million dollars. Just think. Now, if you make a million dollars and youre living out of that million dollars, plus you got a business to run out of that million dollars thats you use common sense. Now, if youre making a million dollars, you probably got a house worth a half a million. Well say 400,000, $400,000. You probably got nothing less than a 70 or $80,000 car. And you got more than one car. You dont have this one car. So you got two luxury cars, which is probably about, well say, 2000, $3,000, including insurance a month. Your mortgage is probably about a good five, $6,000 a month. So what are you doing with that million dollars? Youre paying bills and you just look rich. You understand what Im saying? Youre making it no, youre spot on.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So you got millionaire bills and you probably got 2 million, $3 million in debt because you dont went on about a million dollar house or at least a half a million dollar house. And I can guarantee you depends upon your age, you probably got a 70 or $80,000 car and you got multiple cars. And with those multiple cars, luxury cars or even a sports car, you got high insurance, so thats a good $5,000 right there, gone each month. And then you got taxes. So when you take out your living expenses from that million dollars, lets say 6%, so thats $60,000 right there. Thats just round everything up. Thats 6% on tax. So what are you living out of? About $400,000. That 400,000 is going towards your bill. Your mortgage almost 5000 at least five times. So youre spending about ten a month or so or more. So, yeah. I mean, you have to think like that. That come from the Holy Ghost, baby. That didnt just come from Natalie. God, give me stuff like that. Thats how I come to the conclusion of stuff like that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Its attractive.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I usually charge at least 75 an hour because I want it to be affordable, but it just depends on who it is.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, got it.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"You my goal, and Im going to say this, and I know this is a big jump, but this is my reality and Im a believer that it can happen. And I havent gotten there yet, but I have made good money in other industries or whatever. I think a million dollars is just common nowadays. Its too many millionaires. So I dont want to make six figures. I want to make seven figures. So I dont think, I know you have to start from beginning to end. You have to crawl before you walk. I understand that. But you hear a lot of people say, well, I want to be a millionaire. Well I want to be able to make seven figures. Thats my goal. Because if I can get being a million right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im in Atlanta.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"A bad month will probably be about 2300 somewhere in there.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I was about 710.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"So if you create an offer, lets.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Ill pick their brain, whatever they can tell me, and I can tell them as much as I possibly can about the business or whatever. Just let them direct me from there.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I charge hourly and I need to change the structure. I really do need to change the structure. I had a mentor and I talked to a couple of different people, and I use Score, and theres some pretty good people at Mentors at Score, believe it or not, and theyre free. And I really need to restructure the business for the most part. And Ive been praying with the GPT, Chat and all of that stuff, and I actually developed, and Im not that technically savvy. And I did a website myself. I was like, Holy crap, good for you.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, youre fine.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I kind of accidentally moved to Atlanta and had to survive.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Would I be comfortable because of the economy right now? And Im just being honest because of the economy, and Ive been a part of the market crash before, so I would say safely, I wouldnt spend any more than about $5,000 right now because of the economy.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"I think it would be a net positive. Im curious. Okay, great.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Yeah, I can do that. Do you suggest I do that on my laptop and not on my phone?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, if I can get the six figures, I can get the seven figures.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, thats the reality of it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, you can share it to me.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"About five.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"But I got some credit. Ive been using my credit card, so Im sure its dropped down at least 30 points or so.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Okay, lets go back. So then when you say what does that mean to you? Im thinking in numbers, not just in service, lets think in numbers, not service and service, lets think numbers first. So with the million dollars, if youre making a million dollars, you still have responsibility and youre in the tax bracket of a millionaire. See, a lot of people dont think like that. Just because you make a million dollars dont mean you have a million dollars. So you can make a million dollars, spend one dollars, youre no longer a millionaire. But you got a tax bracket. Youre in the tax bracket of a millionaire. You have to think smart. So to me, this is the way correct me if Im wrong, tell me what you think. So when I think of a million dollars, I think of a million dollars as operating cost. Thats just my operating cost, thats just my overhead. So thats six figures. So when I get to seven figures, I can live. Thats when Im living. So thats when I profited. You understand what Im saying?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right, thank you for calling.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I havent checked it in a while, so I dont know. I did have pretty decent credit, though, but I havent checked it in a while.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No. Thats why I said 08:00 P.m.. No. Thats why I said 08:00 P.m..","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So to get you off. Yeah, so I did the website. So when I recognized that I did the website, I started playing around with it. And I do transaction core because I work in real estate with Realtors or whatever. So I started playing with it and putting in different commands or whatever for it to give me scripts that I could put on social. And I started getting good. I was like, okay, this is getting even better. So these are different things I could market to my clients. They dont know Im using Chat 14 or whatever. So these are different things. So now Im at that place I just need to strategize and I need to structure a whole lot more I need to be a whole lot more structured because I cant charge one client. Well, I kind of do it because everybody cant afford it. Some these kids just trying to get started or whatever. And I understand that because somebody helped me. Thats how I got started. Thats how I got the opportunities and the knowledge that I have because somebody was gracious enough to show me thats one.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, Im just kind of curious. It sounds like something Id be interested in, so Im just kind of eager to have the conversation, and its what I call professional conversation. When I would teach, I would go and do seminars at Georgia Tech. I dont know if youre familiar with Georgia Tech here in Atlanta. I would speak to some of their students. Yeah, I love that college. Love that school. And I would do some of the resumes review. Some of the students, those kids are geniuses. Jesus Christ. And I would tell them, when youre in the presence of anybody thats professional, just dont get all humbled. I say just think youre having a professional conversation. Thats it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I will do that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats just the way the market is. And like I said, I just pretty much operate off of referrals and Im not going out networking no to get clients. Im not going out networking or anything like that. So Im setting a go so that I can network for the most part.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"All right, bye.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Wanting to pay, I think I would be open to doing that. Because one of the things and like I said, the first client that I had, and this was years ago, and for some reason this just came back to him, I hadnt thought about this young man in years. So I guess you just bring me in. Yeah, right. And I promise you, I hadnt thought about him for years. And I think I read because theres times where I was thinking, Im just giving this information and Ive given a lot away. Im like, Im just giving it the information away. Ive given it away. And Im looking at people on Instagram and TikTok. They make a million for some of them lying. I know that much. But some of them are. And Im like, Holy crap. And Im like, Im just giving this information away. Giving it away. I was like, I need to restructure my business, and I need to learn how to create a high ticket product. Should I say? My consulting could be that high ticket product, ebooks or whatever. And whatever platform that we use, I choose to use or whatever and just market it. And I know marketing is one of them. And thats probably one of my weakest points, is learning how to market. So I probably have to do a little more research on that part of it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Pretty straightforward no?","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Moved to Atlanta and had to survive.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah. Now wouldnt be a good time to talk about it. Can you give me a call back online day?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thats a good month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Resources actually send you to be sustained. Right.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Youre really good at what you do.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Well, it would likely be different than what it is now because I would feel accomplished and I would feel like now I can rest. Now Ive met my goal because not only within that seven figure income, my family is set up. I have a 13 year old grandbaby. My grandbaby is now set up so I dont have to worry about that. His college is out of the way, so I dont have to worry about trying to save here, save there, or whatever. So thats what that million dollars would do for me. It would give me freedom. Thats freedom. Because if youre living out of a million dollars, if youre not conscious within your finances, you still got to work, youre grinding and that just mean that your bills are just more expensive than mine. Thats all it is.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]