[{"pageContent":"We can confirm. All right. Right now, you have been hearing people talking about, oh, you dont have enough vitamin D. Right? Well, thats a general category statement that has no value because you dont know whether Alex really is deficient in vitamin D or not, do you?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, the resolution is that we have a test. If they take the test, it will help their doctors to be more efficient, effective in the treatment of their residual issues. In other words, right now, the way its done, lets say that you survived the virus, right? Did you survive the virus? Did you?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Wow. Thats pretty cool, right? Okay.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"This is it. Not only that.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah. Well, Im very intrigued by whats going on with you guys.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, come on. No, I think if we can generate, I would say half a million a month, probably this is very early, Alex. You have to understand we are not an established income generating kind of enterprise. This is really cutting edge pioneering.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And it destroys your life in the meantime. I have known friends who are fairly healthy, except they worry about atrial fibrillation, all that stuff they gave him. I went spent a week and a half with him in Cleveland clinic. They put him on this drug and he declined from there on.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Can you hang this one up for me, Alex?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. Then youre lucky, because there are millions and hundreds of millions of maybe tens of millions of people who are being treated by the doctors. But the problem is the doctors dont really know how to treat them. Its a fishing expedition. Okay? Mainly a lot of frustrations out there. We have the tool, the diagnostic test that can report to the doctor specifically how to treat where the problems are, how to treat them at the molecular level before the symptoms surface at the molecular level. Again, like I said, even doctors dont know. We have the AMA approved course to teach them that. Thats another tool. We are the creator of a professional course for continuing medical education, course for doctors and medical students and nurses and physicians assistant. So thats one thing we have. We have a course online in English and in Spanish. Okay, so in addition to the course, we actually have the ability in our labs in Europe. We have two labs in Europe that actually do the testing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Now you want to do something else interesting?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It sounds like youre an advertising agency, right? Almost, yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. Its like the invention of the automobile, right? Okay, so theres challenges for being one of the pioneers in that. The doctors and the hospitals and the governments and the insurance companies in the world. First of all, they dont know doctors dont know much about it. We happen to have the AMA approved course on precision medicine. Thats what were into, precision medicine. We can nail the diagnostic test at the molecular level to the molecular level on 15 non cancer tests to 15 cancer tests. The non cancer test starts from long COVID. We have one of few, maybe ten in the world long COVID test at the molecular level. In other words, over 800 million people who have survived the virus. The problem is, a lot of the doctors of these people who survived the virus dont know how to really deal with the residual issues, medical issues that remain with them after they survived it. This is a big problem. That alone we can just market. That test alone is probably $100 million. Opportunity, who knows? But again, the challenge is communication. Thats the problem. Communication, then education, then application. And were making a lot of progress, but I dont want to its proprietary information at this point, but it may not be proprietary to you guys. You guys can find up anything.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"We have elic a molecular diagnostics on a neuropsychiatric system of our body.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Survive? Excuse me?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Half obese. And we have the molecular diagnostic test to deal with the obesity issue. Now, thats huge. That alone. So dont forget, we have right now 15 non cancer and 15 cancer. For example, cancer. We have colorectal cancer, liver cancer, breast cancer test being used right now. So on the non cancer, I told we talked about the long COVID and obesity, but the latest one we just got today on the clinical results on atrial fibrillation. Do you know how big atrial fibrillation is?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, go ahead.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Oh, my God. The thing is that, believe it or not, in a biotech company, I have basically financed this all by myself. I have not gone to venture capital money yet, which is a good thing, because now were going to be very valuable company if we ever go that route or go public. Of course, I have been doing this for seven years now, or approaching seven years, and I have all the freedom to go anywhere with it, pretty much.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Well, Im too stupid to know what I should like at this point.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Right? Exactly. Like youre in California. All these famous movie actresses claim, I survive breast cancer, right? Guess what? Over 40% of those people survivors will have the cancer resurface. And then it may spread to the brain. And thats what kills them. We have the test that can tell ahead of time whether the cancer, breast cancer, is going to spread or not to the brain.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right. Actually youre right. Actually, you may be the guy Im looking for. No, let me tell you what Im thinking about doing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. So you know how weird the world has become? Our country has become a lot of killings, unexplained.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"But with genetic engineer, with genetics here, with molecular science at work, healthcare is going to be based on your DNA and based on your molecular profile. Amazing stuff.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont know how you operate, because Im telling you, this is that the philosophy of my company based on three Ps. The first P stands for partnership. The second P stands for policy. The third piece for perseverance. Thats my company. That tells you that we are not a typical biotech company thats been financed by a venture capital fund, have $20 million to start with, and we can afford to buy everything and buy people to do this. Thats an outdated model because most of the biotech companies, they dont work. They dont last, they fail.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"This is where we added medicine and health. How old a man are you, may I ask?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"You should have recorded what I just said because that is exactly the story. What do you call it? Yeah, that is exactly script I want.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"But we are helping our part. Our service helps the doctors of the world. Who then helps the patient? You? Its not a B to B. I mean, its not a B to C. Its a B to B. We deal with, for example, doctors, hospitals, clinics, insurance companies, government. Like I said, our country right now is considering using our test for the whole country, for all the females. The Social Security fund is thinking about using it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I made my money basically in real estate in Washington, DC. And then I became a stock broker, which I developed my own trading system. That is better than youre not going to believe it. Im the only guy, probably, that can own Bush or Hathaway and get pay a dividend. It does not pay dividend.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No. Well, I dont. My partner does. Hes a professor of medicine at the major George Washington University Medical School in Washington, DC. As well as other in Europe. Hes a PhD and an MD professor.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I just took you off this speaker. I started a biotech company, molecular Medicine. Molecular diagnostic testing. Were really special in that we now have 30 molecular diagnostic tests for cancer and non cancer medical issues.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"A man. Okay.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Well, heck, first of all, my partner actually, right now, as were talking, a government, a full government of a country is considering using our consultancy to deal with obesity. For example, they found out that the countrys female population, over half of their women are obese.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"This is the future we can predict before it surfaces.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And its in two languages, english and Spanish.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, listen. Waiting to hear what we got. Alex, you couldnt blow your mind. This is big. Were in the field what they call precision medicine. Right now, phase one by my company. Write it down. Precision medicine. But part two is precision nutrition, which is the big monster. Huge monster.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Theyre already using stem cell to improve your vision. You know that, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Im not starting the nutrition part yet because the medicine part is like the atrial fibrillation thing. That alone is probably $100 million opportunity very easily. We just signed up a clinic in Europe, five clinic, heart surgeons. Theyre going to be selling it for $450. Shot just like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, its amazing. Let me get to my office phone number so I can talk with you longer. Hold on a second.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah. So you may want to ask them the question if they have any medical issues and find out. For example, I want to bet that they have medical issue and our test will be very valuable for their doctor to really right in their guessing the medicine practice goes back to in the 1940s, basically.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. The B to C component would be the course itself. In other words, if you can get to all the doctors, the primary care doctors, the cancer doctors, the oncologists surgeons, or the cardiac surgeons, in other all the doctors in the world, they could benefit from our course.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Satin drugs will link in your life three days.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. We basically have a service, and we also have a consultant consultancy.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So your parents are probably in the 50s or sixty s at the most. Fifty s?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Even on cholesterol, thats bullshit. Cholesterol is bullshit. And even Satin drugs, if you take a Satin drug for five years, you know how much it lengthened your life?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Declined fast. Bullshit.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"We want to franchise among the first franchise biotech company in the world. In other words, every country we go, every major city in other countries. We want to have someone you guys probably could be a global franchise. And you dont have to own a laboratory. You partner with the laboratory, they do the test.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I want a clickable link. I want to start as small as we can afford to. Im here on the long haul. The third people never persevere. Its almost like we want a few people who discover the automobile.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im an entrepreneur. I made some money.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Alex? So quickly. Im not even finished. Thank you for calling.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Perfect. You take care.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"A healthy what kind of offer?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"My knowledge I have a proprietary trading system. Im putting that on hold because this is a bigger play for me. It impacts humanity. The biotech company I have impacts humanity. Do you know, Alex, when the virus hit first hit the healthcare community diagnosis was that the virus was impacting the lung the most. Right. Remember that? We were the first company in the world that said, no, its not the lung, its the brain. Then months later, Mayo Clinic confirmed it, that the virus has affected our brain. Thats why so many weird violence and killing going on, in my opinion, in.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I have to understand Im always the last one to indicate money numbers. I need to know what you what? Im not going to name it. You have to name it. You have to tell me how you cost you service. Meaning I dont even know how. Im really dumb about your kind of business.","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}},{"pageContent":"Thats exactly what Im looking for to do.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Three days. Thats all.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"We have the intellectual property and trade secrets. Okay. To actually file the report on each individual. Very interesting stuff here. So, yeah, I think a health and wellness would be top. Would be top.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"This is great. Yeah. About seven years ago, I started a biotech company.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Its absolutely insane. And no one has mentioned, except youre hearing it for the first time for me, its partly impacted by the virus on the body.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Of course you would.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"You think about it. I want you to think small as opposed to thinking big. Okay? Its small that gets things going. Get big. Perfection is always bullshit. Its always constipation.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Actually, Im very humble and modest. I am just looking at 10 million. Im sorry?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"It goes even people who have also rhettists or young people, athletes all the way to anyone who have high blood pressure.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"But the good news is that the brain is regenerative organ, meaning it doesnt remake itself. Our company I just told you, were into precision medicine. And the next phase is going to be precision nutrition. But before we get to precision nutrition, were going to go to regeneration. You know what regeneration is? Its when you can use your stem cell, your own stem cell, your bone body, and and remake, regenerate your own esophagus, your own eye. Eventually, this is down the road.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Where are you located?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Have you noticed. Who are you based, by the way? Where are you based?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Well, at phase one of my company that we are in right now, its called precision medicine. Right? Its molecular medicine.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I have five young people who wants to be my intern. One is a majoring in communication in the college. One wants to is a very high level athlete, wants to get into health care, and ones very savvy with the Internet. And heres what I was thinking of getting the interns as a group to work together on a company wide project is that I want them to come up with one simple question that will get to the consumer level. The man, the girl, the boy, the woman on the street of the future of medicine. We own the future of medicine. Okay. Yeah. If we can make it simplicified, make it a simplified message, have it so that it will entice them to give more information so they can take it to their doctors and say, doc, what do you know about this? I need to take this test.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, you can do that? Absolutely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. Have you dealt with the doctor since then? Your doctor?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Small. Okay. Perfection is the enemy of the good. I may not be your perfect client. Its okay. Im going to be here. Im going to keep on trying to do it. Im going to find somebody using our company, using artificial intelligence right now to create the report.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"How do you like that mobile?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]