[{"pageContent":"You as well.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, essentially.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No. Are we talking about AI? Like what? Im thinking? AI? Like artificial intelligence kind of stuff?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Do what themselves? Do what?","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Well, I dont know what the numbers are exact, but one deal could be $500, it could be $5,000. It just depends on how they want to get themselves set up. And this is part of what we teach also, is how agents get paid so that they can understand that just because somebodys a licensed agent doesnt necessarily mean theyre going to do a good job for you. Right. Insurance sales is probably one of the highest paid commission jobs out there. I mean, its not the highest, but it is definitely up there. And so its all based on how much people are paying in the first year. So when you understand this going in, you can understand that that agent, just because hes a licensed agent doesnt necessarily mean hes looking out for your interest. He might be just looking out for his paycheck. So thats kind of one of the things that we talk about that as well. The crazy thing about it is were all going to die, okay? And nobody really likes to talk about that stuff, but youve got to plan for it. You got to kind of reverse engineer your life because two things might happen. You might die too soon, or you might live too long and get sick along the way or whatever. Now youre financially, were you prepared? You know what I mean? And then were also going to have real life stories of others that thought they had set themselves upright or their parents or whatever thought that they were set up right. And what actually happened. So well have all the war stories and the success stories and that kind of thing, too, and thats all free. Theyll join this network and be able to ask questions. Well probably do some podcasts and YouTube videos with licensed experts and this kind of thing. At least thats my vision. I dont know if this flows with what you guys are doing or whatever.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, 250 reps in the field. This is like before the Internet, six offices. Were doing about $100,000 a month revenue. But the thing is, we pretty much had all our eggs in one basket because that one huge client and a few little ones. And that was just a bad place to be. But we ended up with six offices, and it was going pretty good at 95% appointments off the referrals, which is just unheard of. And basically this is the same thing, but instead of getting like $5 a lead like I was getting back in those days, now Ill be getting splits on the commissions on all the deals that come through. Got it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hey. Pretty good. So what is this all about? Sorry. Yeah, thats why I was inquiring.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, it is a referral. I mean, it is a referral, but its more than a referral. Its not like a list that you would buy and you could cocall it or whatever. A couple of weeks ago, I was looking for a calculator, for a mortgage calculator, and so I did a little search and then this thing said, whats your email? And I put that in and then it was like, whats your name? And its like, I didnt really want to go there, but I was like, whatever. And the next thing I know, my phone is ringing off the hook with all these mortgage companies. And Im like, Excuse me, but that was not what I wasnt looking to talk to anybody. I just wanted a freaking calculator, you know what I mean, that I could do my own little computations or whatever. And I dont like that kind of marketing. And it seems that the net has a tendency to do that if you let it, and I dont want to be like that. So what were doing is were going to be talking to people and basically educators and just educating as much as we can. And when youre ready to be referred to, because even though I may be a licensed agent, Im not dealing with you as a licensed agent at that point, okay? So Im just giving you this information. When youre ready to talk to a licensed agent, then from there Ill refer you out, and then my license will go on the contract because of course it is my referral, so Ill do a split with it from there. And thats the idea. But it worked really well with the schools, let me tell you. It was crazy. We had every kind of job training school from you name it. We had truck driving schools, corresponding schools like that. We had a body shop, actually in Rhode Island. There was a school back, they had a body shop. They taught welding and all that kind of stuff. We had schools that would teach just computer administration type stuff, accounting, bookkeeping, all that kind of stuff, nursing. And basically people would just tell us what type of training that they felt would get them a job, promote them on their job, get them in, work with her. And then wed say, great, were going to refer you some sources. Youre not obligated to anything. Youre not committed anything. We just encourage you to check these sources out when they contact you. And then the people would say sure, and if they said no, wed say, okay, we dont want to waste your time. You know what I mean? But if they said sure, then they basically set themselves up. And thats same thing I want to do right here. I want to give them enough.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yes. All right. I just want to make sure Im on the same page. Thats what I was thinking because Ive been looking into some different ones, and one of my partners, hes toying with one, but were developing a financial literacy program and referral service.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, my idea initially is to have interviewers that go out basically like what we did before, and send them to our site and ask them to go through this interview process, which is basically ten questions and it kind of tests their knowledge and understanding of financial principles and this kind of thing. And then ideally theyre going to fail miserably. Okay. And then from there we plug them into our financial literacy program and its all free. Ive seen this guy on Twitter when I was learning Twitter way back when and he had posted this thing. I said, Im going to give you 50 tips before I ever ask you to buy anything. And I thought, okay, well, well see. And the next day tip number one, next day tip number two. And he just kept sending tips and he never asked me to buy anything. And I was like, man, this guy, hes kind of got my heart because he was a man of his word basically, is what I was seeing. We want to do something along the same lines, giving you tips and then again testing your knowledge and experience in the industry and then hopefully by giving you these tips youll realize that, yeah, I need to do something. And then from there were going to refer you to our network of sources that we have that can actually administrate whatever services that youre ready to get started with. But its all at your request.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Got it. So these sources are people that this is where youre saying that you get a commission from these people by sending them referrals, right?","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right. I appreciate it.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah. The only thing is that the network of sources that I have already, they do all that too. Thats part of what they do. And their philosophy is to help you basically reward you for getting healthy. And thats what they do because theyre an insurance agent agency. So if they can help you get healthy and reward you for getting healthy, then that means youre going to live longer, healthier, youre not going to be making as many claims. Youre going to live longer, which means youre going to be paying in longer, which is just all good for the insurance company. So the more that they can give you and help you to be healthy, not just physically but mentally and have a knowledge of your program, they can reallocate money that would normally pay for insurance, that would go into the retirement side, this kind of thing, and they do all this for free. I mean, thats all kind of factored in, so I dont need to do that and sell that. Its already a part of the program. Do you know what Im saying?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats fine.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Were not even actually doing anything yet. Were just developing it right now. But I used to do basically the same thing, but with schools, with job training schools. And so Im just kind of revising what I did before, but using this industry versus that industry.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]