[{"pageContent":"I hate to do this to you, but my buyer just pulled up.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Thanks, Kyle.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im going to be tied up here for probably about 30 minutes.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"And Ive recently joined EXP, and they have a really nice program for recruiting and sponsoring new agents. And Ive thought, well, if I could find some way to fit that in with some kind of coaching deal or something like that, that would work for me. So thats my thoughts. I dont know anybody doing that or anything else. Of course, I know theres lots of real estate coaches out there, but anyway.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im just fine.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oklahoma City.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes, it is.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im not exactly sure. Im a long term realtor. Ive been doing selling real estate for 34 years.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Actually, if you could call me in about 30 minutes, thatd be best.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, Ive seen everything there is to see in 34 years. Ive been a long term survivor, and my income is pretty steady. And so, yeah, I found a way to make it work.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Ive been following AI. I like all the stuff going on with that. I know its going to be exploding.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I have a hard time seeing exactly how that would work just because most of my well, not most, the last 34 years, Ive spent basically selling houses, and Ive been involved in rehabbing and selling a little bit here and there. So Ive got experience with that. Ive got personal rentals, so Ive got that experience to fall back on. So Ive got almost everything that you can do experience wise. Ive owned half interest in a mortgage company for a number of years, so I know that side of the business. And Ive always got people kind of tugging at me, wanting to kind of tag along behind me. But that doesnt do a whole lot for me except eat up my time.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]