[{"pageContent":"So? A couple of things. So I started working for a company called Living the Legacy Mentorship. And essentially they have a high ticket sales of think and grow rich principles that they package and create a training videos for, and then you can resell it once you become a mentor. So its an affiliate link program. So thats one thing I was looking to scale and try to acquire clients myself because they are supposed to provide warm leads for us, but it has been slow going on their end. So Id like to kind of do my own work there.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Its ten years maybe. Its crazy.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, go ahead. Ill be very transparent about it as well.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I work for an athletic country club called Lifetime. It used to be Lifetime Fitness through them. Right now Im around $45,000 a year. Im looking to get a promotion here in the next couple of weeks to bump it up to around $60,000. And thats without any life coaching things on the side.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I probably decided about a year and a half ago. But I havent really taken action until the last couple of months.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I mean, its both because you can really pair the thinking, grow rich. I dont know if you ever read that book. Its phenomenal.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Wait, like, I actually just asked if I was okay. Legitimately?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"All right, I appreciate it very much, sir. Thanks for your time.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Exactly ten K. Okay.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Yeah. January 1, Id like to have $500,000 in my bank account.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Do have that kind of capital. After I close a couple of clients or something like that. Whats the best way to re reach out to you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"What are the non monetary goals that Im hoping my business helps me achieve? Yeah. Are you asking what drives me?","metadata":{"fillerID":44,"fillerText":"Yah totally","category":"G"}},{"pageContent":"Hi.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Huge driving force. Are you really doing okay? Hey, hows it going? Im good. Are you okay now?","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Thats pretty phenomenal.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah, thats correct.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Good, how are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Obviously to do normal sales tax tactics of stepping down prices depending on different things and how that all works.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Said, over that fear and the lack of understanding and knowledge, those are like really the three things just connecting with these individuals.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Let me take a look real quick.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"You too. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Beautiful. Im going to be in Mesa, but my wife will work in Scottsdale. Fashion Square.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, for sure.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Start reading five minutes a day. Its an amazing book. Really pair with anything that you want to do if you have any sort of entrepreneurial mind. So thats the easiest way for me to drive income as far as like, hey, I have these training materials. I can sell them to you. I can help you learn them, apply them to what it is that you want to do. But $10,000 scares a lot of people away. Thats where I kind of partner it with life coaching. Hey, maybe thats not an issue for you, but I also offer life coaching services, and based on the discovery weve had during this conversation, I think does that sound like something youd be interested in? Whatever.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And then secondly, Ive become a life coach, so Im looking to kind of scale my own business, aside from the high ticket sales there.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, thats honestly like a conservative number for its. More so the issue Im having is trying to target a niche, get them interested in scheduling a zoom where I can actually have a conversation. Thats probably my biggest need right now. Its like connecting with people. I have a specific niche Id like to target. I have three specific niches Id like to target, actually.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Definitely. I literally tell myself the mantra every day. Im going to change the world because the bar is low out there and I would like to help people. Another great book I read is A Man Search for Meaning. And through that I feel like were sold as a kid. Theres a meaning to life thats like generic for humans. And really its whats your unique meaning to life for you, the individual, that only you get to live that life through your eyes and your experiences. So trying to connect with people on that level, get them to find something theyre passionate about and they can be the very best at because theyre them and no one else can be them. Thats what Im looking to spread globally, essentially. So the monetary thing is great. I want to be able to be debt free, take care of my loved ones, live a life not of luxury, necessarily, but just of worry free, where I can own a house, maybe multiple properties eventually. But you just not have to stress paycheck to paycheck anymore trying to climb a corporate ladder.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, sir. Its 40 to 60K. Youre out of state. And I barely retained what I learned in college, and Im not getting jobs based on my degree. Its like, why are we telling people to spend 200K over five years of time when I can sell something for ten K over a one year of time where they can immediately make income? So its like, okay, what do I know? Where did that come from? So I was a struggling athlete trying to play professional volleyball in Europe. It was really hard to work two jobs, train for my sport and do really well in my sport. So Im looking for that athletic group of people that want to maintain playing their sport but have a hard time doing so because they either dont have funds or a job that they can do to make sure they can train to the fullest of their ability. So thats one group. Im looking for another one is anyone thats basically turning from athlete into, what the hell am I going to do after athletics? A lot of athletes have this crazy identity crisis because we put a lot of weight in our achievements in athletics. And once that goes away, its like, well, I have no self worth. Who am I? So anyone thats kind of making that transition would be another niche Im looking to target.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Definitely interested in that as well.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im pretty ambitious. You want to hear my number?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And its like, well, yes.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Just not at this time, unfortunately. Yeah. This call has been very encouraging and I believe that you guys can really change peoples lives. It sounds like youre doing pretty meaningful work. Im very okay, honestly, with kind of doing it the right I dont say the right way, like the traditional way of just doing all the work, with posting my meaningful content on my page, starting a YouTube, starting a TikTok, doing all this stuff. It will take longer, but thats kind of the I have to accept the life decisions Ive made to this point where I do not have capital.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Both of them.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I dont think I did.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"And then lastly, people that are either lower income a lot of high school, theyre great, smart kids in high school, theyre being told theyre dumb because they focus on athletics and they cant get into college because they dont have the funds or the grades. Thats another group Im looking to target as well.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. So basically my idea, and I dont mind really sharing it because I just think the way education is going right now. It doesnt make much sense to me, and especially with things like AI and all these, like, the Internet and educational tools does not make any sense to me. I went to school. I was a college volleyball player. I went to Penn State.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"At this point, yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, thats tough because were moving to Arizona right now. So basically all of my income has been putting that I have spare has been going in there, but maybe like up to $200 a week or so like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats where we want to end up.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, Im kind of in the process of that. I have someone building my website currently, but I have ideas written down, but nothing solidified yet.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I mean, recently it was 650, but to be honest, I went into essentially credit card rehab because I made some mistakes as a 20 year old. Just maxing out credit cards, trying being irresponsible. So my credit score probably will drop here shortly and then Ill be looking to build it responsibly after that.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}}]