[{"pageContent":"Got you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Thats correct. And you got the emails? Yeah, Ihracing nhra@gmail.com.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, one course on the mastermind platform. In fact, the leader was actually on the video call thats being recorded, so Ill catch up with him later. But theyre actually leveraging chat GPT and Generative AI. And I cant wait to see those modules on how theyre leveraging that because I hear what youre saying, Ryan. You cant sip of the sidelines too long because they want this knowledge business to go to a trillion dollars in like 2025 or something like that. And AI is going to play out very quickly due to Google and all the international companies around the world making chat bots and all that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Im looking at that as to how its going to affect me selling my books online.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ill check it here.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Well, as I said, the business model right now is trying to increase the sales of the books. I am going back out there 2025, and next year were going to secure a motor home and prepare to go out. Probably just a driver this time as a hired driver. But along the way, the books are still out there. Theyre published, theyre available three and a half out of five stores on Amazon. So, I mean, the issue though Im grappling with is its a very narrow niche. So its not like cooking or health and fitness or something like that. Right now Im all across social media as I tracing. In fact, a buddy of mine wants me to go on to Instagram now, and Im just getting messenger and Im learning the social media, but its like a fire hose coming at me. But Im on the mastermind platform, which is with Dean Graziaso and Tony Roberts and all those guys. And theres a bunch of content. Im just up Sponge right now because Im on a trial version for the 16th, and Im just stepping back and Im absorbing everything. But like I said, I was an It for 30 years, and Im a white hacker. I knew about SEO and HTML and everything, how it works and how the phones are working, how the APIs are working on the devices. And Google, Meta and Elon, they own the world, so theyre controlling all the narratives. So how is AI and youre with AI, so I want to hear from you. How do you think its going to affect the search results and people finding books and everything like that and more so that the content of being copywritten, but AI can suck the content and produce search results and the readers dont have to buy anything.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I have tons of hes excellent. I cant wait to see his additional courses and Dean Raziosu, but theyre down. And then the reason I get on this journey was Im more on the art of living. Im on Matthews road trip for 14 days. So thats why Im on the Mastermind platform. And I understand the platform is a vehicle actually to do everything that we signed up with, like the opt in page, the autoresponders, the call to action. And Dean, his teachings are amazing. Thats good to know that you guys are aligned that way. Thats my function right now, just basically to have increase because its funny Ryan. Its like were in these private groups on Facebook. Youre not allowed to promote and all this, but I mean, everybodys got it. Theyre all passionate people, weve all stumbled with a pandemic and everybodys getting back on their feet. But a common theme on the two private Facebook groups is, okay, I got this product or I got the service and how do I get it out there and how do I use social media and how do I use AI? Im still looking as were talking, Im still looking for your email, but I havent gotten anything on the phone or anything yet.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I know that okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Its interesting you say that, because my mind has been processing that in the background because I actually have a couple in the Facebook group. One of the things thats happening, which is excellent, is people lifting people up. Like, a guy launched a mastermind course the other day, so Im kind of asking him, like, how does that work? Another guy said, Well, I looked at your profile. I got some suggestions for you. Hes in the marketing because as I check their profiles out, everybodys in the space, you know what I mean, and digital creator or whatever the buzzwords are. So I have been thinking about that, and Im more passionate with because the book explanation actually says, this is going to save you a lot of hours of rework or the wrong parts and added secure sponsorships to decrease your budget and your racing. My forte is promotions. I can secure sponsorships. I can sell it to Eskimos and all that. So that would be my if we would put a I mean, I know the buzzword now is coaching, and thats what the Mastermind platform is all about. And I guess thats a good word. But to the racers and people out there that want to drag race, I could think of a flow of maybe a free PDF to start them to get them into the opt in and email listing. And then I have yet to do a video on my buddy that hooked me up with Messenger Ryan. I dont pull the trigger quickly. Ive been in it 30 years. So I step back and Im looking at the privacy thing. Its owned by Meta. You got to trust Facebook and messenger and Instagram and all that. So Ive been thinking about that, and Im thinking if I start doing the videos and I get my self confidence a little better out there, I could do that. I could probably attract a lot of people out there by utilizing certain channels of social media and targeting my audience.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Hey, Ron, I dont mean to cut you off, but I do got to get off of here, get back on that video call. But why dont you send me something in an email or you have my information now, my phone and my email, I want to look it over and digest it. And I have to the 16th, Ill tell you because there isnt a lot of money coming in. It might be someone like catching dolls on Amazon. I mean, its weird how the Lord works right now. I cant get to my royalty because my new phone, my new email, everythings brand new at Amazon and saying, well you cant right now look at it. And Im like, you know what, I dont really need to look at it because I got a feeling that things are selling out there. So let me look at everything. I got to get through the Mastermind courses by the 16th and by that time Ill be able to study your information and see if we can actually do something along your platform and maybe with Mastermind too. I mean, who knows where this road trip is going to go.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Got you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"All right, got you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Thanks for your time, Ryan. You take care.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Good. Whats AREAi?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Because theres 50 courses and Deans got these inner circles, probably about 30 different of them over the years. And I think I want to zone in. I want to ask you, I should zone in on the social media and the AI and all that, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, thats 01:00. Perfect time.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont have anything in notification, drawing or an email. I looked in spam. Its not in spam. No worries.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah. My name is Ikeler Jr. Got you. Im looking for your email somehow. Google Mail. Okay. There it goes. Let me see.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yes. I was on TV. Pinks all out was a big show put on by Speed TV. Rich Christensen. I was at Tmax Drag RA, April 2010. Thats what 201 is all about. Chronological events of all my life, how I moved from Florida to North Carolina, how I got on television, and all the sponsors along the way. So its a good read, but the issue is youre with AI. And I was in it for 30 years, so Im also on the mastermind platform. Thats where I thought the call was coming, and I was in the middle of the video, but thats being recorded. Thats no big deal. And your time is valuable and my time is valuable. So Im looking at this AI, chat, GBT and Generative. AI listen to Wall Street Journal every morning. And Cinder Pachai was on again, and he says were going to change Google search structure. Well, a lot of these Internet businesses are built upon search and whatnot and how is that going to change the search results? And authors like me, theyre stealing the content, and were not getting royalties. So theres a big concern.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ive been a drag racer for 16 years with major sponsorship, and I wrote the first book, drag Racing 101 building Your First Race Card Security Sponsors, and then 201 Racing into Economy. Theyre available on Amazon, Google, Play, and Barnes and Noble as an ebook and a paperback.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Got you. Were losing tracks, but nature is not going anywhere. Theyve got like 3000, 400,000 members and all that, and theyre driving the force out there. All right, Ron, it sounds good. Let me study everything you can get at me and heads down with a Mastermind on the 16th. But definitely I like your ideas, and I think Im going to put something together out there. I think Im underselling myself right now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im in Florida.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"You, whats your business model? It might be premature. Let me listen to you guys. Right now theres no funding because were starting out again and minimal dollars coming into the bank accounts. But Im hoping that the Amazon royalties increase by because I am really slamming social media. See, the first book is just not about drag racing, its about sponsorship. So I dont want to hold you up on this, but basically any racing needs sponsorship. So Im actually tied in with F One with World of Outlaws with late models. I dont know how much you know about racing, but Ive expanded that and instead of pushing the book, I say, hey, do you need help with sponsorship? And I realize that the Mastermind platform is you give away something free first and then you get them interested and you say, I can really help you. You know what I mean?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, right now the paperback is 24 95 and the ebooks 499. And Ive reread them over the past couple of months, and its like they are very good reads, and theres a lot of information that I mean, read the reviews on Amazon. Im too my own horn because thats the new me. Im on a new road trip. But yeah, I am good and I know whats going on. And they really say yeah, this really saved me a lot of work, a lot of time. Drag racing. One on one is out there. 201 is not that much because its kind of economic analysis and how to race with a different economy and all that one on one is out there. And youre right, theres a lot of good information in the different chapters.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"What was your name?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Got you. I see whats happening here. Its like within that package, lets call it the sponsorship, mentoring. Within that package, you also get a paperback book or an ebook or an audio book, whatever.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}}]