[{"pageContent":"I havent and to tell you the truth, you probably have the wrong email right now. It would be let me see, give me 1 second, let me see which email was given.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"I can be, I believe I had a 03:00 with somebody.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im sorry.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Score and thats where we would have to look at what scale that we would get into as far as running ads. Is it likely in New Mexico that were going to be able to turn a $25,000 month? Highly unlikely without evidence of it working, actually turning out some actual players? Thats going to be something that were going to have to look at financially short term versus long term. Because if were going to invest in ad space, we have ad companies that we deal with. Theres not a whole lot of them in New Mexico. Wed run some West Texas. But thats exactly what Im talking about is if its going to be something high dollar investment on a wish and a prayer of getting clientele of coachable clientele, that may be something that were not really in the avenue of doing right now. So thats why Im saying, send me the case studies, well talk about it and see what investment is worth doing. Because we can get in with any type of coaching company that backs us and puts their name on it. And we can have a guest speaker for pennies on the dollar to come, shake hands, smile, and get people in the door. But is that going to give us a return? Were not looking at ticket sales. Were looking at long term, were looking at percentages of commissions, were looking at different stuff like that. Its not going to be something that were going to go in the hole off the bat. Thats just not smart business without seeing, yes, this is going to work.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, you got it. Whats that?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Right, no question. Yeah. If we can show and theres a high percentage likelihood that this is going to work, thats going to be something that well spend time on. If we look at it right away and say, man, this is a Cracker Jack box of hopefully you get a good toy, then weve got to spend time somewhere else.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, no question. You wouldnt be on top of it as you are, and with the text messages coming through five minutes after click, its great response time. But also, let me look at the stuff and then and then well go from there, see what questions I have. And I dont want to waste your time with blowing smoke either way or coming from me.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I got a text that was for 03:00. What were you going to try to do today?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"This is assistant, what can I do for you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"It would be N-U-N-Y-A-B-Z as in business Bznz@gmail.com.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, it very well could. I mean well structure it in any way we can as long as again, lack of better terms, if it makes dollars, its making sense. So well look at this case studies and see how because I can write a case study for a pharmaceutical company off the top of my head, that makes sense. Is it true? Is it fictional? Well see on that and how much of it is a storybook and how much of it is actually like, yeah, this is 100% legit. We can actually.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, actually Ive won a couple of raffles with it when we put your name down and put Nunya. Whos Nunya? Nunya fucking business. Give me the money.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Basically all the management, he does a lot of the appointments in person and I do take phone calls and try to keep the ship afloat while hes out playing golf and schmoozing.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"VZ.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hold on, hold on. Hi.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I wouldnt do personal and we would have to look at as far as credit score, itd be something that we wouldnt run as credit. Thats something that I think would be on the red flag side of were not going to go into the hole of running credit on something that is a slot pool. Its either were going to go in on this and do it because were running credit. Running it as a credit.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, depending. And that would be something that we possibly even reach out to some of our home builder sales associates to actually do the speaking, do the coaching, and we manage it. So we do have a couple of contacts that do the new home sales conferences in Vegas and stuff like that. And we help with that as well as get paid on the back end.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Were just building anything we can get our hands into and onto. Whether it be networking, coaching, whether it be building, storefronts it, were doing whatever we can as far as trying and for lack of better communication with it, is putting people with money, with people that dont have money, that have the desire to make money. Thats the best way I can put it is theres plenty of people out there that have the will and desire to build something they just dont have the capital to. So the people that are sitting on availability, which is funds, they can make money while someone else is working for them and their investment, their return is much greater than any type of stock portfolio, whatever you want to look at. We structure it to where they see a quicker return. If that is the case, they see it as a building and we even look into opportunities of people looking to not make a big return. Stay in the red on this one for the next three years and then in seven they get a big return rather than because theyre parking money in other places. So theyve still got to be able to show a loss in some places to balance out. And then we flip it so theyre not constantly showing red in one avenue of if youre in the red for longer than four or five years, thats a red flag of why are you still parking money there? If youre losing that much money, youre investing in something thats losing. So then by five years time they switch it. Now theyre making money. Whereas at first they were losing money. The people that we put in place to run the business are making a ton of money now. Theyve made that money to make that money work for them. They dont lose out on their salaries, their income, because that money that theyve made that the initial investment has lost, so to say, is now working for them.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"If it made sense, absolutely. Let me go over the case study, talk it over, and then Ill actually have more of an idea of what avenue we can take and use you in the best way we can with what funds we have available.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, you would have the wrong email if you dont mind sending it again. Are you ready for a new email?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Sounds like a plan to me. I will talk to you sometime next week then. Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"In all honesty, we are just looking for opportunity. George has his real estate license, as you know, its been pretty much hit and miss with that. So thats what were going to have to do is look at opportunities and see what this new AI business is all about as far as what avenues we could take with where were at here in New Mexico.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]