[{"pageContent":"Hold on.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Its what? Im sorry.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Yeah. I just spoke with Phil, actually. He works for your company. I set up a meeting because what I find to be interesting is my brother and I think well be doing an FBA business. Not sure we need the Coach for that, but because its pretty self automated and finding my product is the hardest part. I think we are going to just pay someone in Pakistan. Right. But the FBA, really the only thing you have to do in FBA is once you have found the product, once youve set up your Amazon page, is sending the product to the warehouse.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You could pay them $5 an hour, and its a high paying job. And then they dont speak English and all of that. Its honestly a genius idea because theres a company in Dallas that theyll find a high demand product, low competition product, doesnt mean its going to be a $20,000 a month product. Who knows? Right? But you dont know that with finding your own product yourself either. Right. But then they also source the cheapest manufacturer so that your profit margins are higher. And theyll do that for as little as no, Im not telling you on the business. I dont work there. Its interesting because theyll do it for $500 for finding the product and $500 for sourcing the cheapest manufacturer, which is nuts because its only $1,000.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ive ridden my bike around there. I was a professional cyclist before I was hit by car.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, $10 for them is an hour is a lot of money. Youre paying $5 an hour. Okay. I know in the Philippines, out in the Philippines, $25 will buy you a whole entire weeks worth of food.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, not officially. My brothers and I were thinking about a couple of ideas were going to be doing FBA. Were trying to figure out if this company in Pakistan theyre based in Dallas, actually. And I live in Austin, and theyre based in Dallas, but they have a genius business idea. I should really probably do it myself. They hire packet. Really? Its a brilliant idea. Just because you can pay pennies on the dollars to teams like the Philippines or Pakistan or anywhere else. A lot of the Aetna employees actually live out in Pakistan. Same with bank of America. And the Philippines is a great area. And Pakistan, you can hire people out there to spend all day long doing product research to try to find the most high demand FBA product that is very low competition. They have all the tools because its just what they do all day long.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I got the software of Costar, which has all the tenants in specific buildings. I lived in New York for two and a half years, so I was in New York and I was originally from Austin, so I came back to Austin because I much prefer Austin. Where do you live?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So to be quite honest, a couple of things my brother is the CFO of a public trade about tech companies. He has not a lot of time to do things together. So hes looking for hes one that we all have a little bit of innately in us. Just loves to build businesses and loves to work. Hes wanting to do this on the side because I think he sees this opportunity as it would be almost a mistake not to give it a go. We have a friend that we honestly probably should have done this five years ago. We sat down with our Kemper that we went to high school with. My older brother is 21 months older than I am. And we sat down with Kemper, who started selling bedbugs products on Amazon. And now youve got these oh, wow. We were so naive to the so naive to the business, to FBA that youve got these giant aggregators that have billions of dollars that are buying successful FBA businesses. Call them basically private equity asset management companies that buy successful FBA businesses and sell FBA business now for $10 million.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"I have a friend that lived in Petaluma. He was a cyclist.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I have two brothers, and one is the CFO, and the other one is the younger brother. Hes nine years younger. Might have been a mistake. He laughs at that. So I can say that he knows hes funny because hes got the funny gene. My older brother got the smart gene. I say that people always need your reaction. Like whoa. Brent Brent never said I was dumb.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I would go on that side, which is interesting because we almost looked the exact same. So kind of like the Winkle Voss brothers, the Facebook brothers. We look the exact same, but he got the better brain. Im kidding.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You are? Where? In California.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Basically just hold 34 miles an hour for 35 minutes, which has been ridiculously fast. Without drafting.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. So hes one of the best time drawers in the world. And I remember and I was like 18 years old, and I was in a Pro Cat One Two race, and they said, we have a 14 year old. What? I think he might have been 13. I was 19. Maybe we have a 13 or 14 year old. We have a 14 year old in a Pro Cat One race. And well, then he was lost in crate. I remember hearing his name and my mom speaking to his mom and then going, oh, this guy lost in crate is like 13 years old, and hes racing at a Pro Cat One level already. Youre not paid at the pro cat one. Youre just professional cyclist, but youre not paid to get free stuff. And so he wasnt being paid, but hes like, pro he was a Pro Cat One at 14. And Im like, oh my gosh, whos this guy? And then, well, he ended up being lost in crowdic, and hes a Tour de France rider. Wow. Whats insane is he broke his collarbone in his first Tour de France. But you never know if youre going to race the Tour ever again because a lot of the time youre on the Tour de France teams, but you will be kind of like, be on the bench in the NBA or something. When NFL, you may never race again. Your fitness may not be at that level. Because he didnt race the Tour of France last year. Hes on Tour France team, but he just get picked because his fitness level was not there. Like, theyre not going to add much value to the team right now. Sort of like if youre playing badly in NBA again, theyre going to take you out. And so he broke his collarbone and he finished the 200 franchise that broke the problem. Wow. It wasnt displaced. The bone was not displaced. And it was not a compound fracture, but it was just a minor fracture. But still got a minor fracture. That doesnt feel very good.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I know it is. Ridden my bike around there.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"You could pay them $10 and $10.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Doesnt mean its a $500 a month. $1,000 a month or $100,000 a month. You have no idea. But you dont know when youre finding your own product. $1,000 is not a lot of huge expense if it doesnt work, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sorry.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"He just sent me an email, actually. Let me look.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I do, because hes got the phone. Its interesting because were going to be doing the FBA business. But he really opened my eyes, which is cool. Maybe this was the universe speaking to me. So I did debt and equity placement in the first part of my career, and then I transitioned over to tenant rep. And its interesting, even the largest brokerage companies in the world have no really mentorship or teaching people how to do tenant rep at all. Specifically the cold calling and business development side. They have nobody that does that. And I got a phone handed to me and Costar. Do you know what that is?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Brent yeah, I think I just told him some of that and hes like, damn, man, youve been through a lot. Like, man, Im still running around, kicking, Im loving life. And that was rough for a while when I had 14 surgeries and six titanium plates and was in a coma for four days and then had a stroke. But Im still around. Think Im around for a reason, man. I love that. I love that he opened my eyes to consulting, but dont move the needle on that. So I think thats maybe why he looked at that and said, look, lets do this, brother. Good luck.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Does he work with you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I think he might I cant so these are high ticket items, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its interesting. Another guy just called me. His name is Phil.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, that guy. Yeah. So we also have a guy from our from Austin, Lawson Cratdock. Hes toured franchise. His specialties time trial, though okay. Where they were those air helmets and the skin suit.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, of course. Thats what I mean. Yeah. I think you and Phil definitely have something really special on the line and Im excited for your call. I got to get going. I would love to hear more about it, Brent, but I have your number, so Ill definitely reach out and just check in and hear more about it in the next few days. Does that sound good, brother?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I live in Austin. I was a professional cyclist and then I was hit by a car.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Brent likewise. Just going to call some time. Well catch up. Oh, yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Absolutely imagine that. They were giving him a lot of lidocaine shots, for sure. Thats probably legal. So as long as its not doping, theyre like, sure, give him that litigant shots. Who cares? So he probably went back to team carve every hour and was like, yeah, fill me up with some more lidocaine right there.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"But no, man, I am coming.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I think that would be an amazing offer. I mean, are you guys going to put that together?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im like, My older brother went to Wharton and the CFO of public traded company at 37 years old that didnt be at Wharton and graduated with honors, with distinction, and was the CFO of a public traded company at 37. Im happy to say hes smart. That I am. Yeah. He had never been a CFO and he had never taken a company public, and he did it at 37 years old. Yeah. Excuse my language here. Excuse my language here. I hope you dont mind. But he goes, I dont know what the fuck Im doing. Ive never been a CFO. Ive never taken a company public. Im like, well, just go on. The fact that youre really smart, you graduated with distinction, and you spoke at the graduating class, and in high school, they said, whos most likely to be a billionaire? And they said, Andrew. Im like, your GMAT score was one in 100 million. Get that high of a score.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, man, things happen for a reason. Well see. If this why I got this call and I was like they had inquired about it online when I just saw the Instagram video. And then Phil and I talked for like 30 minutes. Hes a really nice guy. He had heard about some when I was trusted, like I said, by car. I told him about that story. Hes like, dude, Im going to waive all this for you. That sounds like you got pummeled. I was like, worry about, man, Im still kicking. I did a story. Ill take this 30 seconds. I think its a cool story. Hes like, what about most people think what happened is cool. Im like, well, I was hit by a car. I had 14 surgeries. I was in a coma for four days. I had a stroke. And you wouldnt know that I had one of those things happen because I had six brain surgeries due to a stroke in the brain from a brain surgery that just kept bleeding. But I have all of my hair and so you cant even tell Ive had one brain surgery. You cant tell if I have any titanium plates in my entire body. So when I walk into an office and with certain genes on, youd have no idea that one of that happened. Thats why I think its pretty cool. People are like, what about thats cool? Im like, well, the fact that Im running and kicking and loving life and working and doing anything and all thats happened, its pretty cool, no?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, no, of course. I dont see any reason it cant be absolutely huge, Brent. So Im super excited. I got to get going, but Im excited for what you and Phil came up with, brother. And I hope that everything comes to life.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"How are you doing, man? How are you doing?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}}]