[{"pageContent":"So for my mentorship, I would say like four weeks, and then I have one for six weeks, so I would say probably in a month range. And Im still honestly playing with that also because I know that still takes time to meet with them and all of that, but Im just kind of playing around with that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, definitely, I could do that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes. I did want to do some research. I know you guys popped up with the algorithm. I saw you guys on Instagram, the ad. I was looking at AI stuff, so Im pretty sure thats why you guys popped up. I havent even got a chance to really look into this company and what you guys offer. So I would say I definitely want to do my homework first to see exactly what it is. Just judging from the conversation, it sounds like you guys help scale businesses, which thats something that I would need. But yeah, I would definitely just want to look at just get an overview of the company, like I said, because right now it was just an ad. And then I opt in for the offer that you guys have, which was like, the five AI tools. Thats pretty much where Im at now. Im at the very beginning of your guysfunnel. I just saw your ad, and that was it. And it was great that you called me right away, but I just havent had the time yet to look into the company.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, I use the ebook for my freebie to get them to join, but my ultimate offer is either like a course or my mentorship.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ill go with 06:00 P.m..","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, sounds good. Definitely doable.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"May I ask whos calling?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, I would say the 20th. I will say that will pretty much give me plenty of time to kind of.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So being that I did see that decrease, Im doing freelance marketing on the side, different from this. I do some projects on the side. Im working with a software company at the moment just to kind of like kind of just to bridge that gap from the difference of revenue that Im experiencing. So like I said, hopefully I could get back to where I was. But I am doing other projects to kind of make up for the amount of money that Ive lost being that I made this change in my business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, awesome. So I am in the beauty industry. I do digital products, ebooks and courses, and I pretty much just teach beauty professionals how to generate passive income while theyre working on clients or even while theyre not working on clients, just to have another stream of income. Yeah, so thats pretty much what I do. I recently got into AI to help with the creation process to kind of, what do they call it? Like a shortcut when it comes to creating ebooks and all of these digital courses, using AI to help with the outline or to help with the actual context of these digital products. So thats what Im looking for.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I have played around with it, but I havent fully implemented that. I probably would. Yeah, I want to more about it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, I would say my funnel, like building my email list and SMS. I would say reaching that. Social media, honestly, not so much. I mean, its good, but I dont really focus. I know that social media isnt a sales strategy. I dont look to really sell on social media like that. I would just say my funnel. I use a marketing platform called Go high Level. So that pretty much all of my marketing tools there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. And thats another thing, too, that you mentioned that I was wanting to look into is like business funding, because of course I know thats whats hindering my business, because right now its all out of pocket expenses and of course no one wants to spend their own money on marketing and all of that. So if I did have some funny, then I know that would definitely be the answer to all of my problems.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I do, yes. And usually for my ad budget, I use the money that I made from either my Upsells or my down sales, and I pretty much just put that into ads for whatever amount that is.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, it does.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"About three years.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Appointments? Or do you mean by, I guess.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"So do you know about how long that will take?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, Im so used to myself doing everything and kind of like trusting someone to do it. But I would say, I would say the ads and maybe like the automation just automate the whole business just so I can pretty much just sit back and look at all the deposits that come in.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I would say definitely just me. Pretty much just changing my business model. I used to do services like hands on beauty services, but while I was doing my hands on beauty services, I was also doing my courses and for digital products. So I pretty much just stopped with the hands on service, and I want it to be completely online, just on making 100% passive income. And Im not trading my time for money. I just want everything to just pretty much be online. So now Im more focused on getting that bolt, that ball rolling so I can just make 100% passive income online.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, Im sorry. I had clicked over really fast.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So right now, it has slowed down. I want to say when I first started, I was making, like, ten k a month. Just recently, its kind of slowed down a little bit. So Im definitely looking to be in a minimum of that ten k group up until and beyond whatever I can make. But I would say definitely a minimum of ten k and above.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, definitely. Last year was like I said, it was like eight to nine, like ten K per month. So now Im pretty much like half now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im sorry, you said a process of a place to get customers.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Okay, sure. I have five minutes.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes. Last year I did a great with my business. I reached six figures. That was my goal. And Im definitely trying to we got.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I would say 500. If its my own money, then I would say, like, $500.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I would say for this year or last year maybe?","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay, thursday should work. Can you give me the time?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yes, Im here.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Tron, Texas.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yeah, I dont want to say Im new because Ive been doing this for like three years, but like I said, being that I just recently I want to say the ending of last year transitioned to being completely online. So now Im getting into the discovery calls or the strategy calls.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Awesome. Sounds good. And Im sorry, what was your name again?","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Yeah, definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hello? Hello?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Okay, recently I would say per month, its been like 45, maybe 5000 on a good month.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Sounds good. Thank you so much.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"So, to be honest, I will probably need to be focused on the business funding when it comes to my own money. Im not so sure if I have anything set aside. I probably would definitely need some business funding to invest for my business at this point.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I would say its like in the six. I dont know the exact number, but I believe its like 647, if I remember correctly.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes, of course. Thank you. Alex. It was nice speaking with you. Thanks so much for reaching out.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Hi, its going good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Central.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I would say is the evening time possible? Maybe five.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah. I have the freebie, a free guide I offer to beauty professionals on how to grow their business. They enter that, and then I have my welcome sequence, my nurturing emails and things like that. I have low entry points like the ebooks too, some free. I add tons of value throughout the funnel where I give them videos, like, I have a YouTube channel, things like that. So they have extra resources to go to or like tools to help build their business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No problem.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes. So my courses, theyre like the 497 for a course Im working on. I want to do, like, a low mid and a high ticket. With my high tickets. I dont know. I dont want to limit myself, but I am kind of I dont want to say scared, but I just dont want to because I know people who do have high ticket courses. Theyre like, $2,000 and all that. So Im just pretty much just trying to see what prices are for my target audience, being that I am in the beauty space. I know a lot of the women there are, like, moms, single moms, who probably dont have the income to invest in a high ticket offer. So I would say my price ranges are pretty, like, honestly, nothing over like $500.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I want to say maybe about I know its over maybe like 1000 to 1500 for ad spend.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, of course.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And you said I would need to watch the video first, right, and then were going to have that meeting with the group.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, that will be perfect. Yeah. So I can do something in the evening. Thursday for sure.","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}},{"pageContent":"Okay, perfect.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I actually have some things on my calendar for tomorrow and today. So I was thinking about I probably could watch the video either today or tomorrow and then do it. So is there another day available this week?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, of course.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"George. G-E-O-R-G-E.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yes. Or if you have something a little earlier, like maybe six. But I can do either.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes. Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, the in person stuff had a lot to do with that, as well as the courses too, and the digital products. But once I took the in personnel, I did see that difference. So Im trying to kind of.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Perfect. Will I receive a text about the call?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes. Im sorry, the email, can you repeat that?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"It yes, Ive seen a post about the five AI tools and I thought it was going to be kind of like an instant type of thing where I would get to five tools.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I do not, no.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, that is a hard one because.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes, of course. Thats definitely the goal for me to be on this 100%.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, it definitely varies. I know it takes a while, which I just recently learned this that it takes I think at least like two weeks for the ad to start really renting. So Im just getting into the whole Facebook ads and Google things just pretty much understanding how ads work fully. Ive always really played around with it, but now Im actually really starting to get into Facebook admin.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I would say definitely in a few weeks. It is the beginning of the month, so I have my bills that I would need to pay and just see what I have left over for investment.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]