[{"pageContent":"No, I havent reviewed it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Hey, its going well. How are you?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. So what exactly do you guys do? What does area I do exactly?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"As well as lead generation, like just getting those things out. Because of course we utilize ads to attract investors and different things like that. So were pretty much just wanting to learn some newer ways on how to get those lead generations and get more quality lead generations. Because what Im seeing is when we do the inquiry with the ads, especially like Facebook ads, for instance, it seems like every 50 to 60 people we talk to, thats when we actually get a good investor thats able to invest at least 300,000.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Say it again.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Say that last part again. People cant get their hands on what.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"We havent actually used Twitter and TikTok right now. Its just in a research phase. Its because we typically like to develop a strategy before we get on there and get a team and everything together because we utilize like, UGC creators. If youre familiar are you familiar with UGC creators?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, of course life is about experiences. We enjoy pretty much building out developing businesses and just generating revenue. But Im younger, I dont have children, so I may not have the same goals as them. A lot of them may be family, have families, and theyve probably been working a nine to five. Ive been doing my own business, doing these developments now for about seven years. So I dont think I will have the same answers as them because I already travel. I do all of that in my spare time with the team. We take rewards trips after weve hit benchmarks, certain revenue rates, so I dont think I fall in any of those categories. What we want to do is just pretty much polish up on our sales, just talking to investors and different things like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, its not their vision. We already have the business plans. Theyre just investing into it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"My name is Ryan.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I was going to say how Saturday morning because I could watch the video while Im on the flight. The flight is about a four hour flight, so I guess I could spend half of that time watching it. Itll make it go a little quicker.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Consider doing like fifty K a client just because we are partnered with kind of people we partner with. Even when it comes to mortgage lenders and things like that. We dont work with representatives, we work with the CEOs. So we will have direct access to these companies to get people banking and just different type of lending to go credit repair, whether they need financial statements, we have tax auditors, we can literally build a business for a person with.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I do have to go because I have a call coming up. But if you can email me over the video, Im going to take a look at it because I thought I. Was speaking to you guys with the sales and marketing. This has been something Ive thought about. But I will have to work with companies that understand that Im already dedicated to other things or either smaller companies, too. It doesnt have to be 50K clients. It can be ten K clients, because just because Im thinking about 50K clients, they may want more from me, and Im just not even in a place to offer that time. So what I had in mind is just like more so later in the evenings, around like seven, eight, I could just take a couple of two to three calls with the same clients and I could find out how they spent their day, what they need to work on, and give them some direction. Thats kind of what I had in mind to help. Just like more so. I looked at it as me giving back because I dont need to do it. Its more so something I would just want to do because I have so much experience and knowledge, and Im pretty sure a lot of smaller companies will want to utilize it. But Ill take a look at the video if you send it over, and once I decide that its something that I would like to pick up, then Ill email you guys to set up another call.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, thats what were trying to figure out. How can we get better quality leads? And that led us to developing more creative strategy on how we can get to investors. Its just more so developing that lead generation portion with the ads. Because if were going to pay for the ads, we want to make sure that were getting the quality people as well as which platforms will be the best. I know Ive spoken to some people and theyve been recommending Twitter, but when I went on Twitter, it seems more social. And what I know is just from Instagram, using Instagram, whenever we did the marketing style where we were more personable, it made the sales struggle. Because when investors are investing this large amount, typically they already have businesses themselves. This is just something theyre investing in so they can bring in additional income. And those are the type of investors that we prefer. We dont really prefer the investors that want to be a part of the project because we are developing the project. If there are investors who have experience in a serial project and they want to be there as far as just growing it or connecting us with more partners to make it better, thats great. But thats what we prefer when it comes to the investors, those who already are established, but theyre looking to just develop some different incomes and those that just like to invest, but they didnt take it serious. Like when we would get on calls, the respect level was lower versus when we kept it really clean and professional. Thats when the standard was set and it was causing a lot smoother with the investors, if that makes sense. So thats why Im trying to figure out how we Im not sure if you utilize Twitter. Do you use Twitter?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, you know, theres WiFi too, so Im typically on a lot of meetings.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, the revenue is going pretty well. We typically raise like 20 to 30 million a year.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"It will be 09:00 a.m. PST.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes, pretty much either joint venture or private equity.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"08:00 a.m is perfect.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Ryan, thank you so much, Ryan. Its been great speaking to you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So we pretty much do everything. We source the properties, we purchase them, we get them renovated. We have general contractors, we develop the strategy on the marketing, how were going to sell the units, how the whole building is going to operate. And its really just the investor investing and receiving updates on how the project is going. But we dont do it traditionally. We actually build out business plans and we just develop the business plans pretty much. A couple of other ones is like electric vehicle chargers. We have a few partnerships with Whole Foods and Public, so we deploy those, a few government contracts. We are in a few different industries. We launch commercial industrial buildings for research and development companies. So investors would pretty much fund the research and development. So pretty much what we do, we develop business plans and investors are able to invest into the development of that business plan.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Weve been at the same company for eight years.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"This is for business. We have a few projects going on out in Washington. Seattle. Seattle, Washington.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You too. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So thats what were currently doing. Were able to have them create the content because were developing. So we do a lot of we do like multifamily buildings, like a lot of high rises. Like, our most recent development was in Florida, is in Florida has been developed. Now its going to be a 50 story building, high rise luxury condos. So we do the development, but we also know that we have to focus on the sales and marketing too. And before we typically hire new people, I like to understand it more before we bring them on because some people just hire and they dont have any clue or understanding of the persons position to the point if they have questions you have no idea how to answer, you cant really give any kind of direction. And from the past weve just hired people and wanted them to handle everything just kind of really just be over that role. It didnt go well. I noticed that a lot of people, even though even if they are experts in a certain area they do prefer some type of direction from the company that theyre working with.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Especially when theyre investing that amount. They want to know that theyre investing that amount with people thats going to actually bring them a return and not people whos going to spend their time making TikTok videos and keeping up with money trends and different things like that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, thats fine.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So as far as setting up the call with the execs at you guyscompany, would you guys because I do have to go soon because I have somewhere to go. Im going to be traveling for the next two weeks. So you guys have anything available maybe like the next two and a half, three weeks?","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah, sure. I can find time to look at it. Im not going to promise that I can watch the whole two hour video. I am pretty busy. But Im sure if you send it over, Ill find some time to watch it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"And go, yeah, but people dont appreciate free knowledge, so they will have to pay for it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes. I typically go by Michelle.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, its an 800.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, every other day Im pretty much on a plane.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"As the yes, that would be great.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Thank you, Michelle. Have a wonderful day.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, my apologies. I was going to say, how are your clients making a million dollars a month from $10,000? That means that they probably overworked and overstretched.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Well I thought you guys were I guess I should look more in company. I didnt know you were for high ticket coaches. I thought you were just to help get more sales leads. So when I got on a call, initially it was for our company. But I have been thinking on my own to offer business consulting. So I havent even thought about it. Honestly, I didnt think it would take much funding to get it started. I thought it would just more so be like just taking phone calls and sharing the benefits of working with me. And then the client, they submit their fees and we get started on some weekly calls or when I will look at my schedule to see when Im available.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. So I actually have considered taking on at least like two to three clients a month. I just didnt want to overload myself, well, what Im currently doing. But after hours, thats something I did want to get into just because we learned so much. And I know theres a lot of small businesses that are wanting to develop and learn and they dont really have access to the strategies that were using because we do partner with a lot of other investment firms and venture capital and hedge funds and different things like that. So we know behind the scenes of what a lot of these major companies are doing for their marketing strategies. So I have considered doing some business consulting, and what I will be able to offer is honestly just everything from beginning to end, from sales to marketing to how to structure your business to how to get investors, how to like everything.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ill be there. I understand. Im a business owner myself. I understand time and when you set up calls and different things like that, yeah, Ill be there.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"We do development. Were just a development firm, so that will be for our developments. Thats not what were pocketing personally. That goes towards our development, for sure. Yeah. But we have like, management and operation fees because we manage our developments, we manage them for their full lifecycle. So we put teams in place. Like, for instance, if we launch an apartment complex, we provide to manage the property management. We manage them, handle the payroll and all that good stuff, while the investors kind of are just receiving their distribution.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, awesome. What was your name again?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Well, I have been sourcing for a team, sales team. And what I do, the ticket sizes are pretty large. Theyre ranging about $100,000 up, typically like $500,000 up. And were working with investors. I have a few creative strategies on how were getting investors, but I dont like talking to investors. Traditionally. I find that when you are talking to investor, where its kind of like youre asking for their approval of the investment, if its a good investment or anything like that, thats typically when you place yourself in the student standpoint and the investors kind of carry like theyre a teacher. Im pretty sure these investors, they know a lot, but I prefer to position myself as the opportunity for the investor over the investor being the opportunity, because we have plenty of investors. And then I also understand theres plenty of investment projects out there, but what we offer is just totally different. So pretty much we develop different real estate developments as well as just different businesses as a whole. Different we have a few different investment options. We keep them updated and we manage them for the full lifecycle so that the investor can just simply invest and earn passively as either private equity or joint venture.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Ill be in PST.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]