[{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, I actually havent had time to look into the email, but I hope to make our time later on today. Im actually out for sure.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"That will be CST. I see you in tennessee CST.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, its something we are looking into, diversifying into having it as one of our product lines or some value chain consulting, but its not something were doing for the bulk of the revenue right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im sorry for that.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Awesome. I appreciate it. Thank you so much for this call. Absolutely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sorry, Im actually about to step up. Im so sorry. I really wish this was a good time for us to talk more about it, but Im being back on to pull me in. Could we do this? Im going to look into what youre going to send me in the email and then I probably would initiate the call just so we can talk more about this. And then Ill probably fill you in on how we go about delivering value and helping out in establishing value streams.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Thats correct, yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"True.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Or would it just be basically those were intending to start up, those were intending to buy into our equipment and take on the same journey of setting it up in their local, that consulting avenue. And just to see how I hear about it, I see other firmness and I see it on the website that we do consulting and it seems so rudimentary when it is said. And when I sign up for some consultant pay $500 and to stay an hour and a half or an hour to be on the phone and it seems so rudimentary, Im like, is this what consulting is all about? There is no value add, so I really would want to know how to package it. And I see that from your perspective, I think you would have the meat of it. What really is a value that will be adding when I present myself as a consultant.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im doing good, how about you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Lets do that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Any tooling, any coaching of some sort, whatever heads up I can get in the area of consulting and whatever efficiency that tool AI would employ, I would like to just read up on it, get to know whats happening in the market. And thats the main reason why I gravitated towards the advert. The moment I saw something out there, like, theres an ad, and then I said, oh, could this be in the line of my interest?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Not to mention, sir, my businesses, and for lack of a better word, would be agriculture, but urban farming. And all weve been looking at is to see how we can integrate AI toolings for the sake of productivity and efficiency. So thats my interest right now to see what can I really improve upon that will drive more leads or bring about more closures or just overall operational efficiency. As a result, Im looking forward to see the five AI tools that will have been prescribed if they are just strictly tools that will be used in the digital space or tools that can actually be physical operation.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I think it will cut across the whole chain of the business. First, it will be operational, the set up, the construction work itself, the marketing, sales. So I know for right now, Im well grounded in the construction and the setup of the business, having an urban fan, regardless of what kind of facility is intended, an Aquaponic, Hydroponic and whatever. So I know very well how to set it up. And so we have professionals in our doctorate degree, individuals who can go to the theory of it, but Im hoping also to be able to consult in the area of generating revenue. How can I be that prolific enough to be able to speak in this regard? I package it so well that Im not speaking and tottering in delivering value that I can add in that regard.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Monday? Monday, yeah. Okay. C-O-B monday. That would be good.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, I can hear you. Yeah, I was saying its.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"That would be about 535 30.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I would say its more of training. Its something Ive heard about everyone else who has done it saying, oh yeah, its a good avenue for adding up a new stream of income, but I dont double into something that Im totally naive of. So I dont know what the investment would look like, what the time investment, energy investment would look like, and what would the ROI look like. So I have no view of that. And so Ive been looking for coaching, looking for material things that would just really give me a little bit of an insight on what will be required to be invested and what should I be looking forward in return.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}}]