[{"pageContent":"Farmers market. So we hit some of those here and there, but were so busy that we dont do those. You have stitching sews all over the place. You have yarn places, all, you name it. There are so many areas of sharpening to use, tools to knee sharpening. When pandemic hit, we got so busy because everybody realized that they got good knives, but they suck and they dont have no one to sharpen them. So we provide that mobile service.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"And again, if you need to schedule hold on. Now youre saying they would charge me? What if I dont do what I missed that part.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, I get it. I dont want to be tired kicking either, so I want to make sure I have that time and have it carved out. And then we can talk or either give me a buzz back and then Ill call out some time then, and then well go from there. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Well, I believe we could do it online. I believe we could do a lot of stuff online. Thats the way its going right now. Because if I do it personally, Im only going to feed my neighborhood. But if I do it online, I can feed the world.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Again, really? To scale to have a trade school so then I can franchise from the trade school. Thats what I would love to do. Im an inventor. I invent a lot of things, but I have not moved on them in one day. I got a whole bunch of things sitting there that should have been out on the market already.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I did a little bit over 100, something like that. The funny thing is Im going to my accountant because I didnt even put in for the last two years. So I have to fix that because theres funding out here for me to get and they told me I need your tax returns. So I say I understand. So I got to do that. Thats important to be happening for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im serious.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Thats a good question. I have some, but I dont have some. Let me say I would probably like ten k and thats really no money, but I do have it, you know what I mean? The reason why I say ten K because thats what Im about to put into the market to the stock market. To move that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, to move that a little bit, move the needle a little bit and now is a good time to do that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. Okay. Let me just say this. Im never just sitting back doing anything because we get over the weekend Im sorry, between now and Monday, we end up having people waiting. So when we open up, boom, theyre coming in, dropping off. I wanted that, but I wanted it so I can train someone to do that. But, yeah, well call out some time. You said about 06:00?","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"No, I get it. I service dog groomers, hair salons, barbershops, delis, awning places, work rooms, kitchens, restaurants, boating places. We sharpen tools. We are mobile sharpening service. We have a brick and mortar. And we also have a mobile service where we come out to you. And we do and also, I know you heard of the what do you call those places? They pop up everywhere. What do you sell? The fruit and vegetables?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, right now is a bad timing for me. Im actually in the middle of doing something, but I would like to get a call back maybe this afternoon, if thats possible. If not, sure.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Im good. Who is this? Eric? Alex?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Hello? George speaking.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Because I feel like that will give me more breathing room so I can pull out and begin to do other things. Give me more breathing room so I can scale. I believe I can scale a lot better if I had that kind of cushion. Because I dont want to stay at month for years. I want to get to 100. I want to get to 200. I really want to be scaling this thing. There is schools this is another thing. There are schools for the stylists, right? I want to have a team going to every school, if it will even if its online. This business is huge. Schools just for hair, school just to sell them scissors, the proper maintenance, the proper sharpening, all that stuff. Boom. Now youre going over to the guys who fish, start doing things with it because theres a lot of big ticket places around here that fish. Im by the shore. Im Jersey Shore. So we get called in when theyre having these shark tournaments. We get in, we pull the truck up, and we do with COVID happened. Nothing happened within the last few years, so hopefully that break out this year. Now you got the schools at schools, theyre all over the place, and theyre giving these kids, students, older adults garbage. So I can tap into a place that sells good quality knives one day, pull somebody out and have my own brand that I stamp thats good quality that I can give these people. And okay, lets face it, its still not going to be a lot of money for it because its just the markup on it. Scissors are ridiculous. Markup, let me stop you there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You too. Take care. Bye.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, Ill be open to it. Let me just say this. I am going next month. There are sharpening shows all over the place. Its like the market. No one knows except the sharpener, the ones who are digging it out. Sometimes I feel like I should have been far along than I was. But Im here and Im not killing the game like I want to, but I will be. So anyway, Ive been doing it for a long time. Next month, May, Im going to be going to this convention. Its called the gathering. And I know a couple of people there has curriculums for that. So Im going to grab this stuff, Im going to put myself with it. Because I talked to them. They said, well, the naysayer did it dont work. I dont believe in that. I dont believe in that. I want to try let me see if it dont work. So Im going to go for it. Doing that, Im dealing with some of the best. Literally. What is it? Is it June or July? Im going to be going to Vegas to another one. This one company called the above. Theyre shipping people. Shipping. But theyre having people come from Japan that has a special technique that they use on scissors sharpening. Scissors sharpening is huge. You could buy scissors for $5 or 5000 a scissor. And people go, what are you talking about? Yeah, you can. Its like a knife. You could buy a two hour knife or $2,000 knife, $200 knife, whatever. Sky is the limit to that. And my goal is to upsell the high end companies, the high end chefs thats looking for that premium service. Im looking to do that. Upscaling on them. Upselling on them. Selling one thing I missed out on a really good deal, christmas time. Every restaurant always want to give their staff knives. Why havent I sold them thousands and thousands of dollars of knives? Because Im sleeping. Im sleeping at the wheel. I cant do that no more. I got to get on this thing. Well, shit.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, yeah, this is going to be a good one. Probably never heard of it. I run a mobile sharpening service.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, well, she comes in on Monday. Shes there at 09:00. A.m shes at 09:00. I should be back in the area then. Oh, I am back in the area because Im training the guy. I have a guy in training right now, and hes there Monday and Tuesday from ten to 410 to four. Hes there? Yes, hes there from ten to four.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Excellent.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, Im prematurely saying yes, but what happens? I dont make my schedule. I have an office manager that actually does my schedule. She did tell me this week, and next week was going to be really busy, but I can check and see what we can possibly do on that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im like 70. Yeah, Im 70. Ive been on that. My business credit is 80.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"It would be the day or two would be an issue. I am going to be going away to my relatives funerals. Next week would be the soonest that I can do anything.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Im sorry. Im at the corner of a busy town and the guy Im sorry.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Well, let me just say this. One of the parts of scaling it is to end up doing a trade school that no one does teach people who has hands on, who retired military, they got the slot kitchens. Its huge. Shrubbing is one of the my wife and I, we argue about this. I said, I have one of the oldest industries in the world. She said, no prostitutes are I said, no. I said, the cavemen had to kill to take food home to the prostitute. So thats a little thing. You could use your wifes a trip.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Yes.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Youll have it over to me.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And then you got the dog groomers. You do do anything for dogs and kids. You could go out the roof. Dog groomers are huge. I designed a clipper holder for dog groomers and for barbers. They always ask me, george, when are you going to make some more? When are you going to make some more? I stopped doing it because one thing I had one guy doing, and he cant do it anymore. So now I got me a 3D printer. Im playing with that. Im an inventor. I invent stuff. I got some stuff thats really nice, just sitting back. But again, the dog woman, thats what I was getting at. The dog woman is a huge market.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"My vision is like fifty K a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I should say take home or what are you saying? Take home or just the business itself?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"You need me to respond back before that time to say yeah? Nay?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, absolutely. Thank you.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Sounds pretty good. I like to take a look at it. Okay. 1 second. Yeah. I said I have no time in. This guy waiting on me. I got to get a tire fixed, and Im really targeted for my next appointment. I dont want to keep doing that either. Id rather have somebody else out here running, doing the appointments.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"We do about 8500. Not much because I am the one whos doing all the work, unfortunately. Young guys. Well, yeah. Well, I got two other guys who Im trying to train to do it. My biggest thing is really hair salon and dog groomers. Its huge. But then again, the bread and butter is the rest of us because we have a weekly, bi weekly, monthly contract with them. They need their knife sharpening, period. And we do rental service on machines for slices. I do full resurfacing and rebuilding those and also rent them out. No one does renting out slice machines. I went to several big places in my area. Johnson Restaurant supply Store is one of the biggest over here in my area, which is New Jersey. They handle all over, all over the world, really. But theyre huge over there and they dont even rent out. So Ive seen a market where people need service work, and they dont want to spend $3,500, $2,500 on a really good slicer, and they have a slicer thats jacked up. I go in, I pull their slicer, I rent them mine, and I take my time and fix theirs properly. And so I get bang on both ends. Thats a bad word to use, but I get it.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]