[{"pageContent":"Hey, whats going on, brother?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"What do you mean six figures per month? What are we even talking about?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"No, both. I mean, I have a lot of friends that own media agencies that have done work for me in the past and Ive opened outsourcing in the future if the fit is right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I mean, bro, honestly, I really need you to get to the meat and potatoes. All these questions, like, I see them coming from 10 minutes ago. You know what Im saying? Yes, of course, brother. If I can scale my business and get that many people, of course I would love to build out a sales team. But you know, my situation right now. I dont need a sales team. But yes, I have no idea what you offer or what you do. I am super interested in hearing it. And if I can get enough leads, I would love to hire a sales team, and I would love to do one hundred K a month. Let me know how I can do that. How can I achieve that?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Health and wealth.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, fuck that. Yeah, exactly. But for new existing clients, for sure, I could alter my prices and whatnot.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"How that?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"100%. If I could find that balance, that would be great.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It just seems like a really good number to hit some 100 billion dollar goals on trying to get honestly realistically. Having this coaching business has been great and everything, but its something that I dont know if Im looking to scale it even bigger or if Im trying to just really focus on the quality of the community that Ive already built and these people that are already there. I dont know if Im trying to open up the floodgates or if Im.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"What do you mean by that makes dollars make sense? And I think I said one or two other good ones that made you giggle.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Honestly? Well, its been kind of slow in the last couple of months. Like I said, Ive been in New York. Ive been in Florida. Ive been buying properties. So as far as taking on new customers and leads, thats kind of gone by the wayside this last month or two, I got way bigger and better opportunities taking my time and attention. I hope you understand, brother.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, brother. This is not my first business call and business meeting.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont have any cold leads. If somebodys contacting me and reaching out for my services, theyre hot as fuck, baby.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"How long has your company been around and in business?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"This isnt the most optimal time for me to begin into all this, but just holding their hand and helping them maximize everything in health, wealth, and relationships in their life, its a really long, sensitive process and its all tailored to the individual. But yeah, just selling people on the service. I dont really have too much funnel experience. Ive created a few funnels in the past, but Im more of like an individual, just kind of building an online presence. But most of my customers are all, like, word of mouth. I might help someone achieve some really cool things and they refer a couple of family members or friends to me. So, yeah, thats pretty much it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Thats the thing, is I got some appointments and I got some obligations and stuff, so every day is a little bit different for me. I might be available one to two one day and then the next day its four to five.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I just got into it. Its real estate, brother. Weve been on the phone for 11 minutes. Ive been talking about myself nonstop. I really want to hear what you have to offer me and how you can help me in my service based business.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"The point where Im getting into real estate and doing stuff like that. So Im looking more at less time intensive, passive things that I can build that will pay me for a lifetime. And this business is great. Its a good service based business. Its online, theres no overhead, its everything I could ask for. But yeah, I just dont know if Im ready to take on thousands of clients and shit like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You got something for like, Thursday or Friday, my man? Im pretty busy tomorrow.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"You guys have your own AI tools that you own. Thats correct.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, sure man. Absolutely.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No, man, like I said, this is something that Ive built and its been running smoothly. So Im not trying to go in and update contracts and terms and rewrite right now, especially when Im going to New York and Miami and buying properties and managing those and overseeing projects. It just doesnt seem like a good time to up my offer and shit like that.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Likewise, Matthew. Have a great rest of your day. Much love, brother. Peace.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"When you open up a funnel, you might get thousands of leads, but who knows what the hell the conversion rate is actually going to look like.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You can use all these, by the way. Im not trademarking none of those. You can use all these in your future pitches.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, sure, if you want to do that. And then, yeah, Im just excited to get this email, see this information youre sending me. I want to read it, go over it extensively, and then hop into the call with a really good understanding of whats all going on here.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, like very basic. Very basic. I cant say Ive not done any marketing, but just very basic marketing stuff. Not my expertise or anything.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"You guys do work for them too, or whats the deal?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Like I said, you know my situation, so I dont want to like this is such a tricky question because I dont want to give such a low number where you guys are like, oh, this guys just not even worth it or worth our time. You know my exact situation, bro. If I am blown away by this suite of tools and I see the potential, Im going to want to scale and yeah, Im going to be wanting to get 1000 people to pay me 10 00 20 00 30 00 50 00 and my budget will be fucking six figures. But Im just waiting for this email, this case study. Im just really diving on all the facts and the information of what you guys have built. But yeah, I just say like 60 to 100K, bro. Honestly, I have so much funding available to me. I do personal funding and business funding and help people get credit lines and trade lines and all this shit. I literally have unlimited access to capital at this point in my life.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"That was a funny little chuckle you did after the case study. I thought it was really funny how your company does it is they get your information and they say, like, oh, just give us your info and well send you this case study. And then like you had revealed, youre like, Ill go ahead and send this case study over to you. Nobody ever sent me no case study. Boy, what are we even doing over here? But its okay, bro. Im really glad I took the time to talk to you today. I understand a little bit more about whats going on. I cant wait to see this email youre going to send me, watch this video, read this case study bro and just see if this is a good fit. Like I said, this could be something that really changes this whole online service business for me. So Im really excited to check it out and give it some time.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, one man operation.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"760. Dog.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"No, brother, Im super clear on it. I mean, at the end of the day, Im really interested in the offer. Ill definitely be there Wednesday at 03:00. And Im not worried about the notional policy either, brother. You wont have to worry about that. No heavy penalization for my boy over here. Okay.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"100%.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Bro, realistically Ive had 20K months. Ive had 30 grand months. But right now Im in a transitory position. Im in a transitory thing, building some other businesses, working on some real estate portfolios that I got going on. So its just whatever.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Of course I got to get on the phone with them and go over the program, go over the terms and stuff. So there is somewhat of a sales process, but I honestly like having my simplified. I just get hot leads that come in and its pretty easy to close. Got a high close rate, high success rate.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Honestly, I found that this price point is really good where Im adding a lot of value and I know Im adding a lot of value and I probably could be charging more, but the price point that Im charging is honestly good enough for me. As long as I have X amount of clients paying me monthly, were golden.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Like 1000, 2000? Just depends on the person and their situation and what Im really going to be doing, how many calls theres certain levels of accountability and certain levels of checking in and stuff like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"What about Wednesday?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, 100%, man. Honestly.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Top to bottom, it sounds valuable, my friend.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, just let me know what times you have open on Wednesday if you can. Or maybe like 333. Oclock, Im looking at my calendar. It looks like Ill have a window from like 230 to 430. So maybe something around like 330.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, its all same kind of theres like four programs really that Im running off of and yeah, just off those four though, they all have different focuses and different things that the individual is really trying to achieve. So there might be a heavier emphasis on that, like those one or two different areas.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Just service based business. Online consulting and coaching. Very simple and straightforward.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I would just say like ten to 50 grand, bro. Honestly, realistically, thats what I would be wanting if Im putting any money into my coaching business today, like tomorrow. I wouldnt want to put any much more than that. Like I said, unless I had these amazing systems in place that are bringing me all these new clients that are paying higher tickets. Right. Any objection to anything would go right out the window.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So if its a good fit for my business and my service that Im offering, then I would consider outsourcing with another company.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, 100%.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Awesome, brother. Im excited for both of us. Lets go.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Thanks, brother.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"All right, lets do 03:00 Wednesday.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"People that are already there paying me.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I would love nothing more, my friend. Ive been chomping at the bit to hear this. Lets go.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Money making matts. Got to stick together, baby. Come on.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, brother, I was just really curious. Its like, put in your info, receive this case study. I put in my info and never.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, they go hand in hand.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"For sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, brother, as any smart, logical human being in business, man, its all about the ROI, the risk to reward ratio and the return on investment. Using those two things and using my critical thinking and discernment, thats how I move.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Of course, brother. If it makes dollars, it makes sense.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Est, time zone?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Lets say like five to ten grand a month at least.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]