[{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes. Good to go.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Grant cardone? Ten, X, all that stuff. Yeah, its a sales guy thing. Its a motivational kind of guy. I do his stuff all the time.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Not much we cant do when it comes to video production. And if I cant do it myself, Ive got a rolodex of people to call immediately, and you all get me here today to join my team, right? Interesting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its very customized, but right. Generally speaking. So we do offer like a subscription, monthly content kind of packages starting at $1,500 a month. And Ive got a package that goes up to about four or five grand a month, just depending on how many videos. So thats more of your smaller business kind of stuff, generally with a three month minimum. So anywhere from 4500 to about 15 grand, as youre kind of jumping off point with us.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"For sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im leaning more towards that mentality just because Ive been around money my whole life and Ive never really officially had it. Its my freaking turn and Im just ready to scale up, whatever that means. You know what Im saying?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im not trying to be dismissive or whatever, but honestly just depends, right? Not a ton, but if its a right thing with any kind of real guarantee and all that. I honestly dont I cant answer that question. Its just one right value is there, and you say you give me 10,000 tomorrow, give me ten today, Ill give you 20 tomorrow. Then Ill find the ten if it give me ten today, and we promise in a year and a half youll be making this. Well, Im not going to give you the ten because were not that liquid.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Monthly.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"My new goal is to show them what he could have been doing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I already told you what were making.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Saw your Facebook ad and it said, click here to view the case study. And I knew Id get in some kind of funnel, but it I thought it might actually be a case study without initially jumping in the car.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ive been wrong once or twice in my life before, but I feel pretty good about a couple of decent systems in place. Will be right where we need to be, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, he should be back by then.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Matthew?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Sorry. Yeah, beat Donna to the punch about 10 minutes.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"If I can find the right tools to get me there faster, then Im down for the conversation, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I mean, Im down cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Mesmerize, we do video production and photography.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, Im going to go. Looking forward to the call tomorrow.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"One guy officially trained on whats? A qualified appointment and all that stuff. Hes working on that, but obviously any kind of bigger, better system for that, Im open for talking about.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It definitely would. Follow up to that question or follow up question to that offer?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I dont want to think small, basically, right? Like the guy that used to own it before he was super happy making 600 grand a year. Not his person, but for the business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. I do have a little bit extra debt right this second because we use some of my own personal credit to fund a couple of things over the last few months. But if its a loan kind of thing, I probably need to pay a little bit of that down before doing that kind of thing. Just one of those. But 720 ish got you.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Remind me your name.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Im doing all right. How are you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Wrapped up a call early, so I can give you a couple of minutes.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"It makes sense if you see my logo.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Ive got a shoot tomorrow from two to four.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, they show up three to five a day. Lets just pretend like I close one a day. Even if I did two a week, wed be 100 to 200 grand a month. And Im mostly thinking that just on the micro content. On the smaller business side, like I said, we have the three packages essentially for small businesses. So you got one 5000 hundred, 2000, 504,000. Lets just make that up. So most people are going to pull to that medium to the middle level, just psychologically. So it takes about ten to 20 clients to get to that 40, 50 grand range, so whatever that is. And then on top of that, the bigger projects that always come from that, a good handful of those guys are going to say, oh, we also need our full marketing video, we need training videos, we need XYZ.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"We would be doing what I want to do.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Itd be worth the conversation if nothing else.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sounds good. I just got your number there.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Any training? Obviously Ive watched a ton of that kind of stuff so Im always down to learn. AI is the keyword and all this kind of stuff. I know its the future and I dont want to be that guy that fights it. So its definitely something I would like to watch but obviously it depends on cost and timing and all that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"On an email.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Technically, I think August 1 was the date we put on the paperwork. And then another bit of context there. The guy kind of ran this place almost like his own little clubhouse. He never really did anything to make it as awesome as it could be. Like, we have a 60 seat movie theater in here. Weve got really 500 just studio space in the back to build sets and do that jazz. I want to get this place up and running. And thats what weve been doing for the last six ish months, is cleaning it, getting it ready, getting it out there, making it look nice, so when we get people in here to see it, everyones blown away and has no choice but to do business with us kind of thing. Interesting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"We basically do all things video from mom and pop, local commercials all the way to we work with Home Depot and Lowes and clients like that to do like training videos and things along those lines. I actually worked for this company for about twelve years and then I took a brief hiatus, went to corporate route, did it doing a few other things, got laid off during COVID So another buddy of mine, we decided to start kind of a smallish video production company, mostly local stuff, and luckily we were able to pull a few things together and get a few things figured out and came back and was able to buy out my former company.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I just got a text while were on the line from W.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yes, I have processes in place to try to scale both. Obviously, its probably a no brainer to I would much rather have less clients and more money. So I would much rather get ten or 1500 thousand dollars projects in here instead of 100 $500 projects. But I dont see any reason why I cant scale both. If I could wave a magic wand and say, heres what my next year looks like, its six or eight really high end projects that would be less stressful, more manageable, all that kind of stuff. But also, like I said, Ive got 12,500 sqft here to work with. I wouldnt mind filling it up with editors and salespeople and have a freaking machine. Video agency machine.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, weve officially launched as of, I guess tomorrow, actually more of a more aggressive social media campaign. Basically. Ive got a Ill call him inside sales guy, doing primarily appointment setting, but also doing some lead generation and stuff like that too. And Ive looked into plenty of ways to generate leads, but I dont have an official team on that. Right. The second or tool doing that specifically, other than, like I said, its a company called Conversionly. And their whole thing is essentially doing probably a little bit what you guys are talking about doing, but also just showing you how to do a lot of that stuff and generate leads and mostly set qualified appointments.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I do have a business partner.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im hell bent on at least doubling that this first year. And realistically, I think were three to $8 billion a year company, not million, three to $5 million a year company within the next couple of years. I have no reason to believe that we cant do that other than right minded people tell me that you should be fine making this. No, Im not fine. We can make a couple of hundred grand a month coming in here.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"A few months ago, it was like closer to 800.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"If Im on that 60 Minutes call and they say, and I say, man, you guys are geniuses and I love everything youre going to do, blah, blah, blah, whats the next step after that?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"But were looking to grow and invest in the proper tools to make it all happen. And we got the systems and the infrastructure in place. Yeah, we did just buy it off on a couple of, like, the conversion platform and a couple of other things that weve got to see some return on before we do too much in that area.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I got it.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"The 750 ish range 727, 50, something like that?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"But I know everythings also in negotiation. So if you all are as good as you say you are, I could get some kind of guarantee or you all put your money where your mouth is and blah, blah, blah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"And then for your more customized stuff. Perfect. Example one of the things we lost was a job with Home Depot that was supposed to be basically on location kind of work. And it was about two to three weeks worth of work. And it was about $130,000 project at a project a few months ago with a big flooring company here in Georgia that about a five day shoot and about another five ish day edit, and it was a $65,000 project. So a good size project with a real company usually runs anywhere from 25 to 100 for us.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Were in a really nice space here in just north of Atlanta, Georgia, and we do a lot of really cool stuff. But one thing, the guy that used to own it never did. He never had a sales team. He never had never really did any marketing, any of that kind of stuff. So he essentially lucked his way into about a half a million dollars a year kind of business that I always thought could have been three or $5 million a year kind of business, which is why I left in the first place, because he wasnt growing. He wasnt doing what I thought we could do. So now that Ive taken over this business, Im trying to put my money where my mouth is and say, hey, lets get systems and processes in place and run this like an actual video agency instead of just a couple of dudes getting lucky making a few videos. Thats essentially where Im at. I can do nothing but get targeted and watch about every freaking video I can see about sales systems and do this to make 100 grand a month, to do a million bucks a month and blah, blah, blah. But Im open to all those conversations because its what I need. The one thing that Im just now starting to do is really start trying to build a sales team. Ive got one guy, we went through a company called Conversionly, and theyre jumping off on our they helped us get a good appointment setter. And Im kind of the sales guy right now, and Im working on Im in that weird early transitional period of I know I need a full time sales guy thats worth a base salary of 100 grand a year, but I dont have any money to pay him, so I cant really get him. So I need younger people or commission only people, blah, blah, blah. So Im in. That weird, right? If things go like I want them to go about six months away from being where I need to be, its hard to get there without being there already. Im in that right. Im not your biggest gear head in the world biggest tech guy, but Im pretty tech savvy, and Ive been on Chat GPT the last couple of days writing a ridiculous amount of scripts and saving time. So guys on my brain, and as much as Im borderline scared of it sometimes, Im also fully down for using it. So however you have your targeting system implanted into my brain and voice. Probably why I got targeted with your ad. So I figured, right, realistically, were a $20 to $30,000 a month kind of company. I need to be about a $50 to $75,000 a month kind of company to do everything Im currently doing. And realistically, I think with even half as decent sales team, we should be at somewhere between one and two or 300 grand a month kind of company. And Ive got processes and systems in place that can get us there. Just got to have the sales to get those started first because the world needs video. Everybody needs video.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. I have recently invested in a few things. One of them that wasnt cheap. So Im not hyper cash flow positive at the moment. This is why this is an $80,000 thing. I dont even want to waste your guys time.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I do have my business partner. Hes more of the networking local lead generator guy. Neither one of us are official, trained up, lifelong salespeople. Im a pretty darn good closer in what were doing because I believe in it. Ive been doing it for 20 years now. But Im not your, hey, whats it going to take to get you in this video strategy today, sir? Kind of guy? Thats what I could use. If I had three or four or five appointments a day on my sales calendar, wed be freaking killing it. I have zero doubt in my brain, but its just getting the qualified appointments to my desk, mapping out an official strategy and figuring out the money is what we need more of.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"It is what it is, and theres.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"It looks cool. My logo looks cool when its capitalized correctly. It makes sense, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Ill have time to watch it this afternoon. No problem.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes, sounds good. Well see you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Mesmerizedmedia.com.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And then we have other people that.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"So I dont want to be a flaky prospect.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, we dont have an official sales team.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"To live my normal life, I need about 60 grand a month coming through here to live the life I want. I would love to have 300 grand a month coming in. And obviously Im never going to turn off fall deeply into the grant cardone world, which Im sure as a sales guy, youre aware of.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, make that work. He should be here.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Ill probably just have him zoom, or.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I want to waste anybodys time.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, the physical location. And we also had a few really high ticket projects that were supposed to be on the books, essentially get taken away from us, which is why we werent as focused on this side of getting the sales team going and all that. Because I had buffer. I want to get it all where I wanted to be and then start that process because I had the buffer, and then the buffer kind of got pulled away from me. So now Im a little bit I have less buffer. So Im trying to make shit happen and go ahead and get focused on all that stuff that I need to get focused on, which is right. Whether its a wholesale team or AI salespeople or whatever it is.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}}]