[{"pageContent":"As an agency and a consultant, the number one thing that drives my business is leads in the door and closed business. So all this other stuff is great. Well, I dont really know in depth much about all the different products you offer, but the number one thing that Im always looking for is more qualified leads.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"This is Lisa.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Wow. Eight years as a one woman show. Thats something a lot of people dont make it in their first year in business. So to be going eight years, you got to be doing something right.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah. I have to hop on another call here shortly, so I need to wrap this up.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Got you after 11:00. A.m mountain time.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So are you saying, Ryan, there are five AI tools that you guys have as offers for me to buy into, and then theyre all different price points for those.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I get that you want to free it up for other people. Theres a lot of things that go into business so you cant spend every single wheres your business currently in terms of monthly revenue.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ive always worked my whole career.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Eight years. Long time.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay, Ill just want to catch me next. If were trying to book a call next week on Thursday or Friday, if you need to touch base with me Wednesday that would probably be okay. But I dont want to spend any more time just if youre not able to answer any more questions and if theres a two hour video I need to watch before the call, I need enough time to do all of that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I mean, theres so much AI out there. Im not really into running necessarily Facebook ads or that kind of thing. Im just wondering what solutions you have for lead generation that dont involve paid advertising?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yes, I did. Its hard when you get the text because you really dont know and remember where it came from. So sure. Like, Im trying to put the ad together with the text and the actual product, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right. Thing that pays me full out and then its collected on the other end.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. And again, Ill just ask you for a third time. I really do want to know the tiers before I and Im a bottom line person, so its not going to freak me out, but I want to know that.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I do. And youre right about the run around like its everywhere in marketing and even so many of these calls end up with the minute the credit card is processed. Its crickets. I definitely have a healthy dose of cynicism from just having been in this industry for so long, but I typically dont even have a conversation this long and youve kept me here, so I dont know what that means, but I am interested in learning more. I do want to know what your tiers are like, do you have small, medium, large? And sounds like your executive consultants are the highest tier.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Really? Where were you before that?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"How many years have you been?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Tell me again. Im sorry.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"I dont think so, but sounds interesting, though.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, metaphor. Mankind and all that. One woman show. Apologies, miss.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"I would say its in the mid six figures. Got you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yeah. And Ill tell you, COVID really did a number on just everybody, but that whole rebuilding from that has been fun.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I know.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Got you. And how long do you generally keep them? I mean, as long as they want, I guess. But how many of those do you have spinning? Are you like a one man show or you got a crew?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Looks like an Italian New York kind of guy. Looks like a kind of guy I see walking all over here.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"You could have made a TV show, I promise you that. Yeah, I promise you that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"It just varies and its not something that is consistent. So it is the area of my business that I want to work on the most.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay, sounds good. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I probably did not see it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Tell me your name again. Im sorry.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Absolutely, yeah. 100%.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, you could text me on Tuesday the 16th. Yeah, I cant guarantee I can get on phone, but you can absolutely text me and then whatever you need to do from there, I will do that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, I am fully booked rest of this week. I could do something maybe, lets see, like Thursday or Friday of next week.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Let me just regroup and see. So you all use AI to tell me and then that will jog my memory.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right, right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Whats that name?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Ryan, okay. I dont normally listen for the name until Im interested in the message. Thank you.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I was a sales manager of a if you want to call it that. Its kind of like a family run business. So they were a plumbing supply actually based out of New York. They were like a fourth generation plumbing supply. I came over there as just stocking the shelves and I spent like ten years there and just really rosed as high as I could. I watched it get passed down from father to son, and then I ended up having I have a six year old daughter and my wife is pregnant with another child, so I needed to expand my living situation a little bit more. So I eventually left my family over there. But it was a great experience. And you learn a lot about when youre a small person, youre a small family business in an industry of giants like Lowes and Home Depot. Your edge really needs to be that customer service and that caring about the customers because they could sense it. And thats what gives you the difference of asking a Home Depot employee where something is and they blow you off. That caring and that next level customer service is really like, what gave us our edge, and thats what allowed me to rise here, to become the client success manager over here, because I was really dedicated to what really made Frank special when I was there. Sorry, I guess I said the name of my company. I dont know if thats legal or not, but yeah, either way, forget I said what the last name?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Whats like your price point on your higher end packages?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, of all the things you mentioned, obviously the financing is just one of those things thats really nice to have in a business and especially if its the type of thing where the client can get they spread their payments out to the finance over time. But Im collecting upfront, I like that. And I know that that financing is out there for a lot of different industries. So that is definitely something Im interested in. I do have a fulfillment team, so I dont have a bottleneck really there I know that piece of it. But always open to optimizing everything because thats what you do in this business. But my number one thing is lead generation and quality leads and all of that process. And Im curious again how you do that without paid advertising. Is that something thats in that video that talks about doing that without paid advertising?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure, yeah. I mean, you have to sometimes, especially if you want to scale up, theres only so much you could do. As one woman.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Like Wise Bank or whatever.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Its extremely high. Thats very personal information. Yeah, its high. Its always been very high.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]