[{"pageContent":"If Im sick, Im really the brain child they come in to help. So if Im out of it, its really nothing doing getting done.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Give me the short version real quick, but then I want the long version tomorrow.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Thanks for calling Simar Green. Its Juana speaking, how may I help you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Can I call you the SOP queen?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Meaning its me and my partner.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes, but can we do this in the morning? Because I am actually in the middle of doing something. I was like, okay, I didnt know who this was, but I want to not answer the phone call.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Got you. Okay, cool.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I like the way you operate.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"DonT have any credit cards. That is old.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"You want me to do some math right now?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I think like $1,000. I dont play too much with it because Im the one doing it all by myself and Im not too savvy, so I feel like Ill be losing money sometimes.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Really the only reason why I brought them in is because I get sick so much. Thats why was trickling out of catering, because I make tons of money doing catering, but I had to get out of it because Im physically not able to do that. You know what Im saying?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Because honestly, I feel like its worth that, but I just business coaching, right. Theyre going to make more money. Yeah. And Im like the business coach, and I have no problem with charging whatever because I know the value that Im able to add to anybodys business.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Ill check it out. Im not 100% sure. I get a million emails a day, so Ill check it out.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"If they use Dentify, I get paid weekly. Like, once they make their payments every week, I get paid weekly. The other one, I dont even think its called after. Its called flex by flex buy. I get paid all at once.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"How do you package up that offer? Whats it priced at?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah. So its kind of like based on where the company is, what they need and that package is really for people thats really getting started in business because a lot of the business owners already have been in the lines of credit and things like that. So if theyre in that situation, we just kind of filter them off to our partners and get a stipend. Okay, well, you are already ready. Let me go and get you somebody to give you some money and then Im going to get some money on the back end type thing.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, I am transitioning out of the event planning realm to business coaching, which Ive been doing for the last three years already. I do have a course that I run for business development, and I have a funding company that is tied into all of that. So I really want to get to the point where Im able to scale each one of those companies. Im the type of person, like, Ill buy into something and then really learn it so I can market it the correct way. For me, my funding company is a white label company, so Ive been kind of playing around with that, trying to see how I could incorporate that into the things that I do. And I do my own marketing for the most part, but just trying to find a software thats going to kind of make that process easier and bring in the leads and the money because thats what we all get into at the end of the day.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"We can send them an invoice. We lock them in with a contract, though, stating that they will pay the money once they get it. And then once we get notification from Flex Buy that they receive the income because they usually get the money within 24 to 48 hours. Once we get notification, then we send out an invoice with the amount that we agreed upon.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I brought in 156.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yes. So its basically like a line of credit for them. So they know my program is 10,000. They offer them up to 15,000 just so they can have some wiggle room. They get approved for it. They have like a 40% to 60% approval rate depending on if your credit between the 588 hundred. They take weekly payments or monthly payments. I was going to say, its kind of like these furniture stores also offer Flex Buy, so like, if you go into a furniture store and maybe like we could take a weekly payment from you, its kind of the same situation, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, Ive been business coaching for three years. I just incorporated the funding aspect last year.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Let me think now. You got me over here thinking for real. I think I got, like, 13 credit cards. Lord. Well just comfortably say about 50K.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Last year, I think I had it. Yeah, we had 23 people last year do it. But I dont really do like we just send them over the application and they do everything. We dont have to do anything now.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, Im not going to say I know what Im looking for, and no, I dont have a plan. I have talked to some companies that its like you get a sitter or a virtual assistant or something that they train specifically for your company, and they charge like $1,500 a month, and you get your own personal setter and they are abreast on everything, like all your products and things like that. So I have spoken to companies with those type of services, but I never jumped a gun on any of them because Im a research person. So I got to do some research before I just give people my money.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"It kind of depends because I have them in different sectors, so Im always educating myself. So I do have a $10,000 education budget every year. Marketing, I usually factor that in depending on how much Im bringing in every month, so it kind of varies, but I would comfortably say about $15,000.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im fine. How about yourself?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"It varies. Some months I could do ten K, some months I could do 30. It really depends on how often Im marketing and how hard Im going. Really one of the biggest hurdles that Ive been dealing with is Im a two man show and I have thyroid disease, so Im sick very often. Like physically sick.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I learned quickly, trust me.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I would say at least 100. Im going to be realistic. I dont know, because I know everybody I talk to. Im not going to close thats right.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"He has a physical job, and we tired of him getting up at 04:00 every morning. But hes like, as long as Im getting my businesses off the ground and until everything gets steady, he dont feel comfortable because thats where our insurance is and all of those things. So its bigger than just the money. And we got really great health care insurance through his job. So he works at Ford, so the perks kind of outweighed him not being there. But if were making that kind of money, it wouldnt matter because wed be able to do okay because Im at the doctors quite often. You know what I mean, like Cat scans is $30,000.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, honestly, the thing is me just retiring my husband, realistically. Okay. But me personally, what need is there.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, Im going to tell you yes, but you got two minutes because I got to get back on what I was working on.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Okay, thats the course. How much is the coaching?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right, right. Yeah. Seriously. So how much is your offer, like, the course you have already for the business coaching?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, like social media. I do email marketing. I thought about buying into list and things like that, but I never did it. I always just either get it off, I got a couple of Facebook groups, and then I do TikTok Lives and I go live on Facebook talking about our products and services and giving away free information. So I typically get emails through those funnels, those different social media platforms.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I would say around there between twelve and 15 if we was going to average it out over the year.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, I run paid ads sometimes. It is not often, but if Im launching something new, like when I first did the course and I got like 20 people in the course that were the first run. So I did ads for a couple of weeks, and I did like, a pre launch and gave out discounts and all that kind of good stuff.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, all my balances get paid off every month.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, if its 40% show up rate, Im going to go with at least 10% closing.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Realistically, I want to be at like 90K months with me doing the least amount of, like, possible 90K months. Thats in my goal book right now.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So I get paid up front and then the person is liable for the debt.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Listen here, Im trying to be as off hands as possible with this process.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im at 740.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I have money available.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I would assume we would at least need 200 to 300 people a month to get to 18 Real.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, I do offer Buy now, pay later services. So Im signed up with After Pay Karna. Its an identify, so I do offer that. Its a payment system for coaches.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Most definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, typically well send out outbound emails and things or reach out to people through DMs and stuff like that, or people thats a part of our groups and then they reach out to us. Or if they send out, like if they fill out for a lead magnet, then we will contact them.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I have a few funnels set up. I have a lead magnet for my coaching. I have a lead magnet for the funding part, and Im working on the lead magnet for the course because I just launched the course, like, three months ago.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]