[{"pageContent":"Yeah. If you want to do Saturday at 930, I can make that happen.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"While youve been on here, Ive gotten two phone calls. I sent the voicemail.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I mean, say not like, Saturday 930, but that.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"All right. Thats why I had reached out, because I know I want to get some.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, I do it. I have clients who I work with helping them establish budgets, assessing where they are, financially, creating goals, new start business owners, people who are just coming to entrepreneurship, showing them how to start from where they are and how to scale and deploy resources to help them. But yes, I do have some coaching clients, but I want to grow it. So I have a whole idea for the movement Pivot to Prosper, where Ill be coaching individuals and or couples around finances. And so my expertise in serving the masses is in credit strategies, saving money in taxes and things like that. So that would be a part of it, in addition to budgeting and money management, investing their money, stuff like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Finding the people and finding the people that will actually pay.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Work with the clients? But I could do that. I got that experience in corporate America, bringing the coaches together collectively. So Im working on a project now with some other women and were building out a business together where coaching will be involved. Were going to do a group actually right now we got a group with about 7000 women in it, and were trying to figure out how to make money in that group.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Can you hear me?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, I think right now probably whats the wrong time to click on that? Because Im trying to close out tax season, and so every second of every minute is literally accounted for back to one of the messages, but I think the auto responder keeps hitting me up. But I slow down long enough to do that. I got to get these tax returns out.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes. So he focuses mostly on business credit and trucking. So were not exactly parallel. We feed into each other, but not holistically.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, I got you.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"I only have four individuals.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I do.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, I dont.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"You just put in your calendar both paper and digital.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Im looking it up right now. The address, Panera Bridge, Conyers, Georgia. From my house to that Panera branch sorry. From home to there is 50 minutes. So we could make it work because its 36 miles, but 50 minutes driving.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"No, I have a couple of things, but I do tax preparation and I do credit repair. So this is kind of like the busy, busy season for everything.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"So this is Saturday. Meet with Celeste at seven and then at nine. Tell me your name again.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Im outside of Atlanta. I live in the rural area, but yeah, got you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Talking less. Like not even a four.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I dont want to say it because Kanye is, from where I live, is an hour. So were going to meet at seven. And so if I need to be in front of a computer or taking notes like I am now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah. They got.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"This weekend is going to be tomorrow. Theres a dermatology appointment on top of tax returns and its my aunts birthday, so thats driving 2 hours out of town one way, 2 hours back. If I can listen to it in the car, if I dont have to be taking notes and being super attendant, I can listen. But if I got. To be something I need to pay attention to. I know I cant commit an hour.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, thats a no brainer.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So my tax business, I have a team of tax preparers, so people are hitting me up left and right because everybodys trying to get a tax return review. So tomorrow wont be good at all. Saturday wont be good. Like, after the 18th, ideally being honest, because its crazy right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I want to go high ticket. I got ebooks, Ive written, Im working on now more stuff. So I got the knowledge and I know I can carry people to where they need to go. But I havent been monetizing the skills so thats why I reached out. I need systems to be able to take that piece of what Im trying to do next level. I need systems for automation. I just need stuff that will help me scale.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I dont think thats the bulk of my audience, so Ive been doing these banknotes recently and thats attracting a different crowd. So those people pay a high ticket.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I think the less involved I am, the better, I think identifying people, getting them to the table and then a warm introduction. So definitely, ideally less hands on, like in the front side.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Got you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yeah. 765, just like last week.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, well do like six one on.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. I got you.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Crazy. Thats why I said earlier at the beginning, I probably should have held off on this because Im doing taxes while Im talking to you. Thats where Im at.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. So part of my business is inside of network marketing platform, and so the company that Ive been with for five years was shut down by the FTC. So I just started over in a new company.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"To be able to do that. Friday is crazy. Yeah. Friday is a full day.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well probably initially but I mean with time I think you could find the people that will pay. That because Ive paid money like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I say I want 83,000 a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"It should not. But Conyers, where Ill be is an hour from my house.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Hey.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I dont know about that. If its something I can grab while Im listening, this is what I do. So earlier today as Im working, Im listening to an ebook. But if I got it like paying attention and taking notes, I cant give you honest. Yeah. I would be able to squeeze.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Last year is very different than this year. Last year I made about $260,000.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Is it a zoom or over phone?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Kyla, please go out of here. Youre disturbing me. Thomas the copel yet? But I did get the text.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"So you would train them?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"No, I dont.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"From day one? I would say somebody else because I think if a person is in my social media, right, theyre going to see all I talk about is finances. Theyre going to see all I post about it, all I go live about it, so theyre going to see that so I dont have to be upfront, I dont have to be but if it makes sense to build a rapport and all of that, then it makes sense. But ideal world, I would want to not be hands on in ideal world.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I typically work evenings and late night, so thats really when Im most productive. Saturday could be an option. I dont want to promise you that because I agree to meet somebody at 07:00, talk about a Pam account in person, and so were going to meet at Panera at 07:00 p.m., and then I have to preach earlier that day. My time really is allocated, so when I say its after the 18th, Im really not lying because my schedule is, like, cram packed. Its a million things going on right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Go clean your room. Get out of here.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah. But pray none of those happen.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, youre good. Watch out, baby. Get out here.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Matthew, okay. And its air. AI right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. All right. Its calendar. Put it in my phone calendar. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, I get exactly what youre saying. So the people that push you to where you are, your squad would sit down, offer a one on one session with me.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, this is right down my lane.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"We might be there an hour. So shes basically showing me some software, like some crypto software. So I would say for sure an hour. So that puts us at 08:00. Then for me to drive home, that puts me home at nine. If Im there hour and commuter hour.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, Matthew. Sounds good.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"I missed what you said. Im sorry. Im trying to multitask my phone keeps yeah, I thought I heard you say if you would throw in the ability to work with them and get them up to speed, and then you said, how would that sound? So Im trying to make sure.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Okay. Itd be right at the door at nine if we didnt go over a minute.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thats good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Factoring the people who are looking to be coached.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im sorry I missed that.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"All right. Appreciate it. Bye.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"The undefeated attention. For sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, I can do that when Im in the car. Im an Audible library, so Im in a mobile library.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Correct, what Im saying.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I got you. I do financial coaching.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Are you going to mail the video?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Nothing Harley, like 250 nothing.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"One on one right now is identify clients who need it. And my husband works with clients one on one too, with business credit. But for what Im envisioning with the Pivot movement is group coaching. So I created a group Pivot to prosper and been adding content to it. And once I get the right platform and everything developed, I want to drive traffic there and create a place where we meet maybe once or twice a month in a group coaching setting and they could have like a VIP where maybe youre on a hot seat where your business is. The one that were going through just kind of like live out loud, kind of digesting whatever the issues are and coming up with solutions on the spot.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]