[{"pageContent":"He does?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right, yeah.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Still will be a Realtor? Ive been doing it for 17 years. I do it in New York State and the state of Georgia so that Im not going to give up. I renew my license every two years, and its still great. I do more. I enjoy more of the appraiser. Its less stressful. I go out, I measure peoples home. I give a point value for refinancing, selling, listing on whatever it is. I enjoy that more than I do listing and selling. And also its a lot of driving up and down, scheduling appointments, all that stuff. So this is why I said I wanted something more automated, where Ive been on a couple of webinars where affiliate marketing works for a lot of people. I just had a book published, and so its more like maybe you more say its marketing, actually, that you would say going into a more social media. So thats what I would go I mean, my inspection thing will be there, but I just want to do something thats more automated, where money is generating, coming in versus me having to go out, because what I put out is what I get back when I do inspections. See what Im saying? So doing this affiliate marketing or setting up what I would love to do with Amazon is actually getting sales, getting things coming in with marketing, promoting myself out there on social media. You do the work. Lets say I created a book, I listed it got published the other day. Ebook, art cover. Not hardcover, paperback. Im doing the hard cover now. So its just setting up things where its there. You do the work one time and it makes the money over and over again than me going out every day doing inspections. Its just like I said, Im getting older. I dont want to deal with the hustle and the bustle every day of my life. I have children and grandchildren. I would like to leave a legacy back. I just dont want to deal with the hustling and the bustling every day anymore. So thats it. So I dont know how I came across your thing, because Im always looking at things, joining webinars, listening to whats out there, to get a feel if its of any interest to me and so forth. Right, yeah, like I said, I dont know if what you do has anything to do with what I do.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, can do that. If hes available.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, and when was this sent? I could switch it up right now.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Not saying I didnt trust you with my credit card either. No, but Im just saying you said if I had any questions Im just saying thats the first time Ive heard one. And I mean, I think its probably good for people, too, to say, okay, we take this seriously. Its either you go into you know what I mean?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I guess? Well, 54 years old, so now you know my age. Im a mother of eight and five grandchildren.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"But youre still near there. No, its just a little bridge. Are you kidding me?","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"I would say to be really where everything is paid up and all that stuff every month. I would say, realistically, 20 to might not sound a lot to some people. Some people it might sound a lot, too. But my husband and I, we have two homes that has two mortgages, you know what I mean? We have the car. Its a lot. Groceries have gotten expensive. And when you have three teenagers that eats after they come in from the gym, thats not funny. Its a house full and its a lot. So between being a mom, a wife, its a lot, and doing being self employed, its really a lot. Really is.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay. Will you be on the call or.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"See? Well, listen to this. Its so funny. We are here in New York City, and then you have so many tourists that comes in and see places that we have never been to even though we live here, you know what I mean?","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Let me tell you, when I do stuff right, I make notes and I would go back and I might say, okay, dear, what do you think about this? Whatever. And he knows me that anything I go into, if I think its a good thing, then he trusts me to go into it, because I dont go into everything there is, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. The reason why I said how soon is because tomorrow is definitely out of the question, so it would have to be the earliest Wednesday.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So its just relationships, many things, if the person is good for you, the male or the female. One of the biggest things I experienced is, and I did a study on it, is a narcissist. No one really speaks about it so much, and it does exist, male and female, and Ive been a victim of that. And it takes time for people to heal when they are the victim. Believe you mean it messes your mind up. Yeah. And Ive overcome that.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Is that the name he charges, like, he says, $40,000 for.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. And Im losing sleep and I need my sleep time back. Its really a lot. And then they schedule me tomorrow for an entire day. So its really tiring. Yeah. They tried to give me days in between, and so its really tiring.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, I do.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. Oh, forget about it.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Im fine, thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, the 05:00 P.m. Would be better then because at the 730 would go into the eight.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah. Four children are grown, and I have four smaller ones home, like from 13 to 17 or 13 to 18, whatever it is. And so woman, I think its just a passion of woman. I guess it has to do with my life growing up as a child to now with what Ive experienced, you name it, Ive been there. So Ive been able to give advice to people who its like a mother figure, seeing these young girls, theyre young, they dont know. I guess they have to go out there, get their feet wet to feel what its like to get hurt, to know what is it you are trying to keep them from, you know what I mean? Because everybody thinks they know it all until they start off tears and go, oh, you broke my heart, or whatever. He has another girlfriend, or whatever it is, vice versa. Male to female, female to male, whatever.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im going to watch it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Are you serious?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, dont take it personally because I have family members living in the Bronx, in Westchester, yonkers, you name it. So its nothing to do with the Bronx. We just need to get licensed there, right?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"And most time, too, if Im doing something, how should I say? Not say all the time, but it depends on what it is that I would have him on the call. Like, a lot of things I take care of, you know what I mean? Because like I said, he has an ongoing medical condition. So Im involved in everything, making most of the decisions with a lot of things. He survived his third heart surgery. He lost his left leg last year. So its a lot that yeah.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yeah, because they always call me and Im like, why am I not charging for this?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. The reason I ask is so that before I watch it, Ill make sure that I have that space open where nothing is going to interrupt. Because what I dont like is starting something I got to pause and get up or go cook or come back. So this is why I ask. So Ill break myself for, say, 2 hours to say, okay, my husband and I going to watch that video, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, I do a variety of different things. My main profession is Im a Realtor and also an appraisal inspector. Now currently I just started getting into affiliate marketing and Amazon with Drop, shipping, all that stuff. Ive been a Realtor for 17 years, doing inspections for two years. And so Im looking for something that is much more how should I say? I dont know if the word is remote, but more automated, if thats. And so I figured affiliate marketing or different avenues on Amazon. That the arena I would like to be in, even though Im still doing real estate, but doing something where Im not working too hard. You know what I mean? Im getting older. Yeah, thats my thing. So I dont know if its within your alley with anything that Im here doing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right. You got to invest in yourself.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Full schedule tomorrow. Yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, because let me tell you, I worked in the city for years because I was in investment banking until I resigned in December 2010 when my last daughter was six months old then. Shes 13 now. And so the only time, like I said, if I have inspections or so, Ill go to the city, and sometimes I miss it, the buildings and so forth. Im like, wow, Ive worked in the city all my life, like, from 18 to 2010. And I dont go in the city unless I have to. Only inspections bring me there, but other than that, no, but I kind of miss it sometimes. But its crazy. Its too busy and the traffic is horrible.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Sure, that sounds great. Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, its not far. Youre missing out. You have Barclay Center in Brooklyn and I dont know whats in Queens.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"05:00 p.m.. Or six would probably work. Yeah. Okay, so you want to do it at five?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah. How soon would that be?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. And I got your text with the information that you said to text me.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hes come to so many of our real estate events every year for motivations and so forth, so there are quite a few people Ive listened to.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That is true.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, not the marketing agency, but coaching, that would probably be something I would be interested to do, which I havent not. But I have thought about that in the past of doing based upon certain things that Im familiar with and one of the things that my expertise is and I dont charge, but then I give so many of it when it comes to relationship. Yeah, definitely. So thats one of the things that would be up my alley if it had to do with anything per se, which Ive helped now hundreds, a lot of female women and many times and people say you have so much to give to people, why dont you just turn it into a mentorship thing or whatever. And Im like, I dont know if I have the time. And it was something I was even thinking about doing, like starting YouTube channels regarding something like that. So its not something I havent thought about, but just wasnt sure how to really go about it. I almost enrolled in one of those things where this lady was teaching about she would give you step by step how to develop a coaching business and so forth. And I almost signed up for it, and I didnt because I just wasnt sure if I had the time to do that. Yeah, but it would be in the arena of relationships, actually.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, Wednesday. Let me make sure I know what Wednesday. Okay. Well, Wednesday I do have an engagement at eight that I am in every Wednesday night. So it could be before. So I dont know how long it will take. If it will take an hour or what?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Definitely. Yes.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And I know a lot of people can be reliable, dont get me wrong, because I do respect peoples time and I see where youre coming from, because imagine whenever Im driving to an appointment, right, I call an hour before, and Im like, listen, Im calling an hour before. Sometimes they get upset. Oh, I thought you were supposed to call 20 minutes. But no, where Im coming from, its an hour drive. And before I leave, I would like to know that youll be there because you dont want to drive an hour and the person isnt there. And its only one time ever. Ive had, like, a no show, and I didnt even get paid for it, which I was upset because it was a weekend, you know what I mean? But I understand, but Ive just never thats the one is kind of I dont know.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, when I resigned in 2010 from investment banking, I moved to Georgia and lived there for five years, and then I came back. So thats how I got my Georgia license in Georgia, because I was already licensed in New York. But my parents and my brother and sisters, they live in Georgia, and their spouses, they live in Georgia. And then I go back and forth, back and forth. But I dont know, because right now I was even discussing with my husband yesterday that we need to move where we might do like, a bridge load for both homes, queens and Brooklyn, and get a bigger home. Because, like I said, we have four smaller kids. When I say smaller teenagers, 17 to 13, but they need their own space, like two boys room together or whatever, theyre getting bigger now. They want their space.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And let me tell you, you called before and I wasnt sure it was your number because my numbers I dont have, and Im not familiar with it. I dont normally answer. And I remember when you text me, you said if today was a good time. So I said, let me check back in my phone to see if you call, if a number had called around the time that you said you would. And the number I saw, I saw it once, and I said, that might be the person calling who text me. So let me answer it. Yeah, because if I tell you Ill be here or that day is good, fine, but unknown numbers, I dont normally answer, but when I saw that call before any callback, I said, this has to be the person. But I was hoping that the first time when the phone had rang and I didnt pick it up, that I would have gotten a text saying, hey, then I would say, okay, I think thats the call that I need to be on. But I didnt get a text. Let me just answer it this time around. Maybe it could be you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Let me ask you, how long is the video?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay. And this is your cell number?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Income wise, I would say mines up and down varies, but I would say about 145. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, I enjoy working with people. I think maybe in the beginning it would be more working with the clients, I would say. You know what I mean? Yeah, I think that would be something I would be interested to do. Its funny because I just watched a program where I didnt know that there was something out there where you get paid for actually, I forgot the name of what they call it being, like, a buddy or a friend to someone. And you get paid actually by the hour to actually speak to people from all over the world that needs to have a friend or someone to speak to. And I was saying, well, maybe I should sign up for that. Get paid for speaking to someone. You know what I mean? I do it all the time without getting paid. And I seriously was thinking about signing up for that this month. Maybe I might. Yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats the first time I have, actually, besides having a consultation with an attorney or something that they require a no show fee in case the person doesnt show. Yeah, I dont know if I kind of like that one. I can understand what youre saying.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes, it does. Again, Im always like, am I going to have the time to really do it or not? And believe me, my time is so busy that I have to be setting alarm clocks to remember when I have a conference call or a webinar to jump on. If I dont do that, then Ill be like, okay, its 711 now. My gosh, I had it at six. Why didnt I set my alarm? So its just that I have a very busy schedule, right? Yeah. And my thing is make the time busy. If youre going to be busy, make sure its making money. Thats how I see it. And many times Im busy doing other stuff thats not making money, its just everyday life, you know what I mean? Like I said, Im getting older. Yes. Its about working smart. Yeah. So thats that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Its about, say, 670. So its not like up there. Up there in the seven.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"You too. Thanks. Okay, Matthew. Okay, bye.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, exactly. And like I said, Ive been looking into other areas to make money, where money works. I think Im searching for avenues, different things to really theres so many opportunities out there, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You mean for the month, right?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Inspections, back to back. The banks are getting busy and the office scheduled me for like, four to five inspections tomorrow, so by the time I start out at ten tomorrow, I probably wont be finished until maybe six or so. And I know by that time Ill be tired. Then I come home and have to do the report and send it electronically to the bank. So, you see, this is why I say I need back most of my time, you know what I mean? Yeah. Its just time consuming up till late at night doing reports. I dont go to bed until three, four a. M. Sometimes and have to get back up at six for the children to get ready for school. Its really tiring. And like I said, Im getting older, Im not getting younger, so its really tiring. And when you called me, I was just there, got into bed with my pillows propped behind my back with my laptop on my knees to do a report thats due.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"So I was thinking of getting somewhere, but somewhere with a driveway. And funny enough, I love Westchester and I was thinking either it would be Westchester or maybe Long Island or maybe go back to Brooklyn and get somewhere. But we got to get cars because, you know, once these teenagers start to get their license or get older, youre going to have a house with four or five cars. Right, right. We need a parking space. And you know how it is with the city. We need parking space.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes, got that.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Let me ask you a quick question though. You said this is something that is set up automatically, like people running this stuff when it comes to the taxes portion. How does that work? Do they have a tax person too that does a lot of that? Or you would have to I mean, we know we are responsible for our own taxes, but do they help with that? Because now youre on a higher scale making so much money, they know what the cost, the expenses are to run this thing and so forth. For sure they have tax professionals for that area.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I have nothing against the Bronx. Its just that my office dont do the Bronx because they do not have Bronx MLS. And so its like three weeks ago, we were trying to inquire how we could go about getting the MLS, because when we do the inspections, we have to have comps, you know what I mean? To sole comps. Comps that are listed in the neighborhood. And like, me being an agent, Im associated with Brooklyn, libor and long island and queens libor, but not with Bronx. And we dont have anyone on the team thats licensed with Bronx. So Bronx is the only place we dont do. But were trying to get it in our thing. Until we get someone whos licensed in Bronx, thats what well be doing. Bronx.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Well, Im back and forth between Queens and Brooklyn. Like I said, we have two houses, one in Queens and one in Brooklyn. My job involves the entire tristate area. Manhattan, Brooklyn, Queens, Long Island, staten island. I go to Jersey at times. The only place I dont go is Bronx. I cover every area right here.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, I did not. Which email was it sent to? The Dion sovereign@gmail.com.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right. Well, thats the question. Is there a company that actually does that? I know there are so many things out there, but do they really do do that?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay. Yeah, tony Robbins, Ive been around for years, I can tell you that. Ive been in the real estate business 17 years. Hes been around for years, and I used to go to a lot of his things. If hes in New York or whatever, or the real estate company like Keller Williams. When I was with Keller Williams, he was one that was there for mentorship, so I listened to great people.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure. Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I dont know if you know about this guy. I dont know if Ill be able to sign him. His name is Myron.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"New York City.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Now at five, Ill make sure that its all clear for that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No problem. I appreciate it. Im excited. I cant wait. Yeah, Im excited for you tomorrow, but Im so booked. And this is why I dont try to cram myself. I know when I get tired, I dont really concentrate or someone could be talking to me and it could go I like to make sure Im focused, like Im getting it in, like understanding whats happening here. So Wednesday is a better day for me, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thanks. And dont think I wont be. Ill keep in mind too, that I know these things require money. So I think Ill be prepared for that as well. Yeah, because Ive been there.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I know.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Him in the loop. Yeah, I do that. Yeah, I do.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Run a lot by him. I mean, hes sleeping now, but in a lot of things I do make, I would run and say, what do you think there? Do you think I should? And he would say, go for it. Sometimes he would say, dont. But no, at the end of the day, its what I most of the time. My husband has an ongoing medical condition too, so he doesnt get so involved in hes very supportive with anything that I do, but he will say its your call. So its not based upon.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. And Im like, wow a lot. But then theres value in it, like you said, so I guess, but its right. Yeah, I just googled him. Yes. I just googled him. Its golden. Yeah. Mary I listen to his YouTube all the time. There are other people I have listened to this other robin whats his name? I dont know. Tony Robbins.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}}]