[{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hi, Alex. How are you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, the only capital I have, all my funds are tied up and theyre in seasoning mode, so I cant take them out. I do have because I do invest right. Theyre tied up in investment, so I cant just take them out. Theyre not liquid. I dont have any car payment debt, so Im free and clear on that. I do have personal credit line, and Id like to change that to have more business credit line, which Im working on at the moment to try and get a business line of credit that I can leverage for real estate. That was one of the things that I was working on, is that so not a whole lot of liquid. Basically, the 33 five allows me to not be desperate as far as for my living expenses, basically. And its enough for me to live on. And then all my other investments are tied into a seasoning mode, so theyre not liquid. And I think the number on that is somewhere around a quarter of a million dollars. But at the moment, I cant leverage them because theyre just locked. Does that make sense?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, yeah, Ill definitely take a look at that. Ill watch it. Let me watch it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right. Of course Id be willing to do that, willing to put in some effort. Of course I do. To me, its about let me work smart this time, not work hard like your dad. I probably wouldnt mind working just ten to 20 hours a week. Right. Or not even that. Right. Or fit it into the nooks and cranny of my living. I want to enjoy life. I want to do more dancing. I want to travel more. And if I could fit it in the nooks and cranny and still make progress and still make something out of it, thats great, because Im not at a place where Im desperate for money. Im not desperate for money because I do have something. Its not a lot, but I have enough to live on, lets put it that way. And to me, Im pretty happy with that. Right. Some people are not. I am. Right. And the people say, well, you get into this business, youre going to be addicted, and youre going to want more. Im not sure I want more. Theres a certain number that Im looking for every month to be comfortable and maybe to not rely so much on Social Security income. And thats it. My immediate goal is that my long term goal is really to leave something behind for my family, for my daughter. Right. Shes still working J-O-B the 40 hours week, sometimes more. Shes working 50 hours a week. I know that. And sometimes she travels and Id like for her to, at some point in her life, have a good head start so she doesnt have to rely on a paycheck. Most people are living paycheck to paycheck. My daughter is certainly no exception. And the fact that shes got $95,000 in student loans is just criminal. But thats for subject for another day, Alex. We all know that our system is broken. So if I could help along with that, at least in my life and my daughters life and impact her life, Im doing what I can do. Im doing my job right. Thats a good start. Do I want more? Of course I do. But am I driven to it? Not all the way, perhaps. And maybe thats the problem, is I just am not driven in that way, right? Im not driven in a way that I need to make millions or I need really a massive big wealth portfolio. I would like a little bit of the comfort and not relying on what the world tells me I need to rely on is to me enough. Beyond that is a bonus, right? Its just icing on the cake, as one would say. Like I said, when I saw the AI thing, Im hearing it and Im like, okay, I want to find out more what this can do. Right? Number one on the project that Im working in a real estate development, because that is a business that I own and that is something that I am trying to launch with hardly any money, with help from the community, and thats about it at this point. I have people Ill reach out to to help me in that, and I am right, but the money always comes into play with that. But thats the way the world works, Alex. What can I say?","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yeah, this is her.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, all right, that sounds good. Alex, thank you for your time. I appreciate it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, first of all, Im kind of in the startup stages of my business. Its in real estate, of course, but traditional real estate on one hand, because Ive been investing in that space for a number of years. I am retired now, but I have another source of income. But Id like to be able to increase and supplement that with something else. Right. So that being said, Im also doing sustainable real estate development. So its mostly in a real estate space, is where I play. Lets just put it that way. Right, okay. Its whether its traditional investing in a real estate for passive income or using creative financing, as well as sustainable community development. So theres a sustainable aspect to my business, and then theres a traditional aspect to what Im doing. Im not a big outfit. Im very small. Its just me for the time being. I dont have a big team, but I know people in the industry, if you will, because I tend to circle the real estate groups and real estate investing. I know some people. Of course, Ive got my inner circle influence, if you will. But Im not really selling anything in particular at the moment. Im just trying to figure out at this point how AI can help me in what Im doing. Does that make sense?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Somewhere around $700.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Of course. Have you thought about? Because, I mean, traditionally, like and traditionally is loosely defined, but when youre at a time where you retire or people are on the precipice of retiring, the term consulting comes into play in some capacity at times, where its like thats. The Mecca of youve busted your rear end your entire life in some field and you have an accumulation of whether it be merits or just seasoned expertise. And youre able to consult on a higher level than what maybe youve worked at in your life up to that point. Have you thought about doing some sort of coaching or consulting at this stage?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Id like to be able to make probably $5,000 a month in passive income. More is always better, but I would start there, start somewhere where we also have to start. The goal is for me to start with a passive income and then eventually leave a multi generational income legacy for my family. Thats really it. I mean, I know thats a pretty tall order, right? Thats why Im doing the sustainable community development in real estate, because to me, that leaves a legacy for the world, right. Im trying to do a socially responsible real estate development thats very new and unique. So thats one of the things I am doing. And Id like to find out, okay, how can I get this piece to fit in? That model. You see what Im saying? Because I have the architecture, I have the rendering, I have the vision. I know what I want to do, and I know what must be done with our climate changes and reversing our global warming. And Im doing that in real estate. So thats one of the goals I have. And all of this are part of the way I live. It has to be a part of the way I live. So in other words, I cant go down another swim lane that says you have to put in 150 hours commitment to do this. Right. I dont have that kind of time, Runway. I have to do what I can do for the time being. Does that make sense? Yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello. Hi.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And then we can go stay in touch. So this is the number that I can use for you or the 310-905-8209?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"About how much I make from my retirement is about $33,000. A year. I havent filed my taxes, but based on my monthly income that Im getting, I think its 33. Let me do the math. Its 33, 500 a year. 33,500 is my income. Thats my fixed income, because that is my retirement income. Thats a verifiable income. And put it that way, thats a way to say that. Okay?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im just really curious how this work.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay, yeah. All right, that sounds good.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Good day.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, that makes sense. That absolutely makes sense. To your point of would I be open to consulting? Absolutely. Because I was a consultant in a different way. Not in this sense, but I did work as a consultant for over ten years, right. So Im certainly not a newbie when it comes to that. To me, again, Im just really at the early stages of finding out what this can do for me and what Im trying to do in my life, in my investing. Im not going to call it a business because it really is just yes, it is a business, but its more investing in a passive way, right. That I dont have to be actively trading my time for the money I make. I want my money to work for me rather than me work for my money, I guess lets put it that way.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thank you. You have a good day, okay?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}}]