[{"pageContent":"Yeah, Im very much consultant at the moment, but my thing is, Im not opposed to not looking at what you have to offer, because anything is value. We learn from everybody, man, and Im not opposed to what you got. You have to show me what youre really talking about as far as the 3000 in the back end, because you also can take equity into business financing and that type of stuff. Even businesses, you can even buy them if you really want to. It depends on how you structure.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"What do you mean, what does that do for me?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Well, if you go to my name on the oliohodges.com, you see S-O-N-E-A-L. Hodges, H-O-D as in dog, G as in go, E as in egg, S as in sam.com. Thatll be my name, thatd be my website. Thats what I go on. And then also I have Bama market all property finder.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Ive been in this game almost 1520 years. I got into the residential stuff, but once I met some people who I got into commercial side, then you got to realize commercial is wholly different than the house market, because once you get above the $5 million range, then the property qualifies and not you. Youre not stuck in the credit driven world. Im in a base income world where its based on income and not guaranteed for the credit market. So Im on that level. So thats what I offer my clients so I could take residential investors to the next level of buying commercial properties, that type of stuff.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Heres the thing. Heres my thing. I might decide if I want to work with you picking me. I might have to pick them. So let me just get straight to the point, man. If you cant give me no price, Im putting like that. You only get one shot with me today, is it? Dont call me back no more? Im just being firm with you. I dont have no time to waste. I aint going to be on the phone every day with nobody who cant do nothing. If youre not a decision maker, then get off the line, man. I aint got time to play with you.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Revenue wise, right now I have a couple of retirements and I have income, but I dont want to be tied. I dont want to have to go and get into that if I dont need to. Im going to leave that alone. Now, heres my thing. We look at it like if I want to get into another business or buy a business before I buy the business, Im going to presale before I get in there. That means before I buy it, its going to be already sold. So I rather sell what I need to sell to go and buy what I need to buy. So before I buy it, I sell it first, then I go purchase. Dont make no sense. Go buy it, then purchase. Im going to be already having sold. And thats another thing about being free and buying the things I want because I want to live in the cash world. I dont want to be tied to no debt, no mortgages. Thats another thing. So thats what I call free.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"If I bring the funding to the table, Im charging two points, at least two points. Lets say if investor got a deal, if they want me to fund, it a brain table to a deal, and its $10,000,000.01 point, I make 100 grand. Two points, I make 200 grand. Also. I can require equity into the deal, 10% equity also, and create that as a promissory, no doubt, of being there. So it varies the way I do stuff. It depends on how much I got to be involved with it. But I know if I bring the funding to the table, then Im requiring two points. Now, sometimes I might get one point out of it, depending on the funder and how they got their stuff structured, but I kind of least get one point or two points because anything under that, then thats just insult.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, yeah, actually Ive been looking at the AI and the take off, and with that chat GPT, its going to be tremendous, going to change business forever. Im going to get involved with it. Im going to get some investing for myself. Just tell me, what are you selling and what youre trying to do, man? Lets go ahead and get to the meat.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hey, how are you doing? Who am I speaking with?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Think about it. When you bring a fund into the table, this is our motto. People try to say youre scamming when you get you ask the money up front. They dont like to pay the fees. Its a scam. But heres my question to people. When you go to the doctors office or when you got to go pay your utility, dont you got to pay them people too? Its a service. When you go get you buying a house, its a service. They got to collect fees from you to make everything right with appraisals and all different type of stuff. Like doctors, if they look at you, theyre going to charge you for X rays and all that. So you got to pay your copay when you go there. But the way we do it, we do it as like a retainer. We do that. And also sometimes it depends on it being non refundable. Because we create value. We bring value to the table to do work for them, to work with us. Also, please come to shove. If they do what they said theyre going to do, then we refund the money back at closing. We just want you to do what you say youre going to do. Okay? We got to looking at funders and investors, and we got to looking at banks on how they set up these due diligence fees, and they do all this and do that. But see, if they charge you $20,000 for a due diligence fee, man, think about it. They only take them five or six to do the appraisals and due diligence. The rest of it goes in their pocket, man. So heres the thing. When we do qualifying clients, if you ask them for millions of dollars, lets say you ask them for 510, 15, $20 million. If you cant afford to pay us to help you get your stuff done and qualify you, then sooner than if we go to the table, you might not be able to pay the down payment of the fees to close the loan. So why should we work for free and then the loan dont close and then we sitting here stuck, burning out midnight off? Thats how we look at it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im kind of open to it. Im not opposed to it. It could take me to another place to get to where I need to go to another level, too. Im not opposed to it. What Im asking is whats the cost here? Its a cost behind everything. So what is the cost, man?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, yeah. If you check out while I got you on the phone, if you go to hold on a second. If you go to Belmont.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, to be honest with you, its really interesting. Dont get me wrong. Its really interesting, man. And like I say, the ones who dont get come aboard now while I was on a breaking point, youll get left behind later. But I get what youre saying, man. Like I said, what Im doing now, I got a partner whos been what I do, let me just tell you, be back up too. Im in a real estate business, but not really. Im in a finance game. I finance big developments, investors. Also, I have my own software and own tools to make offers, own properties. I can underwrite my own deals. So I work with a lot of hedge fund and funders to find money for people who need it, for investors or big developments who build apartments and all that type of stuff. And I have a range view of I can get involved in. And also I buy and sell money. So thats my take on that. I have a lot of things going on, but I have some profit points on some things I could do like packaging underwriting consulting structure deals on properties. It just is a various type of thing. I can offer 100% financing. Its just consulting. All Im doing is setting processes to solutions.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, see, for me, this is all about creating lifestyle, man. This is about being free to do what I want to do and not be. I mean, I still work a job. I work for Toyota. Do I want to be a Toyota rest of my life? No, Im just doing stuff on the side, man, so I can build the wealth. And then if I want to decide not to work again, then I dont want to do no working anymore. So its all about lifestyle and freedom, man. Being free.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Lets just say job wise, about four grand a month. I want to get out of that. As far as business it varies because I dont do deals every day, man. I mean, if you dont do deals every day, if you dont do it every day, then if you do do it every day, you got to ask, are you really working your business or do you have another job? I dont want no jobs. Thats the whole point. I had to really get a graph of that about looking at miles, even though Im not dead yet, but I had to create obituary for myself and look at for the things that I havent done yet I want to do. And then I had to look at all my debt, get a real number, not no line number or something that you just can fake and say, this is it. And I want something real to me on how much debt I got. And then the debt will be my mission statement to get me debt free. Because once I look at the debt, then thatll push me to know what deals I need to go after. If I got $300,000 debt, then I need to be looking at $30 million deals. Either finance flip, sale. I dont need to be looking at nothing else to get free.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I do it independent, but sometimes JV with my partner, but I do it in my own little entity corporation.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, we already doing stuff like that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"What do you mean?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Im good, how are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"This is my goal, man. This is me as far as consulting. And we call it like meeting the monthly budget. If I can make me 20 to 50 grand a month, but also lump sum, I look at lump sum. If I can make me, like, one point five to two million dollars a year, I aint no greedy person. Im doing good, but I want to make the money come so itll pay the bills. So thats why I met with that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, we open to that. We could do business funding because, like I said, not just touching on it. Its like we could do business funding. I know theyre doing some projects now where wind farms and then biochemical. Just taking your trash and turn it to biofuel. Theyre funded the transaction like this started out as 16 million, and then it growed into almost, what, $16 billion. They got to do it in phases. So by the time they get paid to be $360,000,000 off that whole process. So its up there, man. So you can do businesses too?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]