[{"pageContent":"I know that youre not hesitant right now. There is money the money that I have is for all my personal stuff right now, my own business. So not hesitant on going to 50,000, Im going to go the way organically first, and then Im going to scale up as I hire. My first hire is going to be at the end, which is happening soon. That probably is going to happen next month. It needs to be slower. Its not that fast. I cant take and liquidate $5,000 and do whatever you guys are you telling me youre going to help me run ads and everything else and build a team? Yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Literally personal, not even business wise. Like family and stuff like that. Im already taking care of it all legitimately. I have two cars. I had personal issues, money coming in, and I was working this stuff with a lot of personal stuff coming at me. And Im still showing up for myself daily, fucking working from whatever, 07:00 in the morning to 10:00 at night. But a lot of things was learning, too. That was slowing me down, too. Learning how to because Im in my 40s, so I was with the business coaching plan, and theyre, like, teaching us how to do the marketing and how to show up, or how to show up authentically. A lot of time Ive spent reading, watching sales modules on a call with a coach, and then being slow at the stupidest things that arent for other peoples. Theyre slow, you know what Im saying? So all Im saying is, you understand? Like, I didnt even know how to make a real man, and now I didnt even know how to do captions. The fancy captions. Now my shit, my social media platforms, they look polished. Theyre looking really good. Tight blue check verified by Meta. Everything from my banner to my logos crisscrossing all over from my email signature, up to Facebook, Instagram, all of it. Twitter. Its taking time to figure out things, so it slows me down making appointments when I could just be making the freaking appointments, you know what I mean? I could just be lining up appointments left and right.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No. Yeah. No, thats paid in full. So some of its contracted. So if Im getting paid in full, Im getting also people that cant afford that. I have a finance company that Im going to get into too, using Sweet pay so they can make payments, but some people just cant afford that. And they go to weekly payments, like say whatever package that is. And Im like, okay, so its $75 per week. Thats sixty five dollars to one hundred and fifty dollars per week. Some people pay like that and so then thats recurring revenue. So the reoccurring revenue is $2,500 on top of monthly paid in full. And I dont always sell $4,900. Most of the time they go to my mid package and its about $2,200. So the last two months its brought me from with the 20 people that pay me in full, bring me right up in there, the five to seven K. You see that?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I would say probably like its like, right around, like 75%, 75% close rate? Yeah. So out of one to four, Im always getting one or two of those if I line up those appointments. So if I make four, maybe I get one or two or three. See that? And it keeps going weekly. So if I only got one for the next week, thats bad, because if I get on that one sales call for that one, thats a good chance. Especially if theyre cold, then thats not, like, moving this week.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I was curious on how much that was.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No. Well no. Yeah, I had an in person job and now I became an online trainer. Ive dropped down to three in person clients, which freed up my time. But in this and personal stuff, crap family here, that being out, theyre crazy. So I moved from one place to another place to another place and Im moving out. I have all this fucking money Im making now and Im moving into an apartment. Literally. Im looking at it today. Im taking it today. I bought a brand new car just last week. Like little tiny things. Im paving the path for me. No distractions, nothing. I dont need to round my crazy family, things like that. But Im making money. I have clients. Like I said, I have a call today. Im for sure closing him because hes a good referral. And then I just keep going up. I just keep making more money, I notice. And the business coaching program is the NLCA in Texas and they are awesome. They teach you every freak are a big part of the game and your schedule and how you organize your day essentially.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Its fitness coaching, man. Yeah, I do an app on Google, and I ask, I have clients, I get them all social media. I do marketing posts, reels stories, you name it, daily, I communicate through WhatsApp community in the community. I have all the clients dive in there, and they all converse and talk. I have a Facebook group, you know what I mean? Emails, onboarding, sales calls. I have a sales call at 09:00 A.m., so I got to prepare for that. I usually prepare an hour out, but I have people fill applications. I use type form, all social media, no website or anything like that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, its going up. Its 620.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, with the fluctuation right now, based off of the projection, its 50 to 70K right now off of just online.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"How many what?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Why do you feel like you dont have freedom at the moment?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Thats just something new. I just had a business coach. I was never doing this well before. Im going already up, like, the next two or three clients that come on. Im hiring a DMR for one $200 a month resourcing out in the Philippines. So somebodys going to be DMing for me. And then if Im DMing and theyre DMing in all social media channels, so I get one to four calls per week, and I dont even try. And theres always a closing in there somehow. So if I go up to eight to ten calls per week, Im at 40 calls per month. Those numbers are going to everythings going to just speed up. Right. So I might even hire two DMRs. Im not sure yet. The coaching business that I have, the service that I bought, its like school. Theyre like, doing this doing that. They teach me all the marketing and stuff like that. They teach us not to run ads until a consistent ten k. So once you hit organically, theres no way to pass it. Well thats not true either because theyre saying that some organic Im going to.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So its online, its fairly moderate, high ticket, but I ask a lot of the sales calls that I take, I get them to pay me in full majority of the time for eight or twelve months. So, I mean, I can make anywhere between $1,600 and up to 2200, plus up to like $4,000 off of one client. And then the monthly packages are anywhere between 247 and up to 500 now. And those will all be going up higher. But its the structure of my business. Its when am I doing reels on social media? When am I doing a sticker post on Facebook, when am I doing my check in for that client? Because its always when am I onboarding this person? When am I doing for programming on Friday? That kind of stuff. And its changing. And I have a business coach right now and theyre like, oh, just schedule it all out and stuff like that. Ive tried, that doesnt fucking work for me, you know what I mean? Even the tasks become longer. Or if I get it on point, I was just looking for something to organize my routine for me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Because Im not disorganized. Im just trying to organize my day still. Im still trying to figure when Im doing my reels. I do reels pretty much. Or Im not reels, but I use all social media channels, I use all the lives, stories, everything, right? To improve the algorithm to prove how Im seen. So on top of all that then Ive got my own current clients, where my income comes from that I have to deal with inside my coaching app, designing programs or whatever. And then Im in my Facebook group trying to cultivate marketing that way. But I feel like its my schedule that is stopping me.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Well, there you go. Thats my busy ass schedule, which I need to get my day going. But if we can just push this call back just past next month or at the end of this month, we can do that. Lets do that. Yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, thats just it. I already have a business coach, man. Theres no theory behind it. Its already happening. But he recommends when you get to eight to ten k, which I am not at, thats when you start running paid ads. So Im not there. I have one or two more clients to start to order paid ads is the only way thats going to happen, dude. Thats the only road thats going to happen. We both know this. And you cant do this without a team. I cant take inbound calls. I cant be a one person.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, its got to be expensive then or something, if youre not going to tell me the price. But yeah, Im busy as shit. I need help. Im always redoing my task list and my calendar almost like a daily basis instead of planning everything out, and my schedule gets away from me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Of course I do. Im going to close the dude at 09:00 this morning too. Theres always money. Im always making money now doing this. Its just this living second. Im talking to you. I cant do anything. Im moving into an apartment. I bought a car. And I have overhead with the business too. My business coach is 732. I need to breathe. So I didnt expect this call this morning. I dont know. Did I put in a thing this morning for this?","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah. Actually, more than that. Thats for the paid in full. So I ask people to pay me for the total length of their program, and thats where sales come in. I do a presentation on zoom.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I have capital, I have credit from building this freaking business. Im just saying this is the wrong timing to be on this call too. Its 07:00. Ive got other things to do, man. And Ive got a call at nine. I have to leave. Theres some personal things going on. Call me back, make an appointment. Ive got money. I need to breathe some air, right. Because Im going through it like water.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"What time is it there? Is this for the AI? The calendar?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Oh, pay in full. One to two.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Just personal distractions, which Im taking care of.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes, of course.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"So its hard to say. Its anywhere between 247 and $500 a month, but the majority of the income comes from paid in full, so that means that we take $500. If they do four months with me, its two K. So I get them to pay me for the length of the program, four months, eight or twelve. And so thats anywhere between $1,600, depending on the actual number of which program they select up to, its over, like, $4,000. Actually, because if they can select the highest end once for twelve months, itll be like $3,900.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Because I want a big business that can pay my retirement. I want a big business that I and then the economy and everything. Of course, why not?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Where I get five k. Yeah. Thats like my baseline. If you were to take $2,500 plus deposit writing those numbers, whether its 6500, whether its 5900 for the month, all I didnt have any money working online, but I think this hall is a different spot for us right now. I think we should make another appointment and you should call me back when I clear out some things.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Oh no, just like three months, I would say. Like last three months. Yeah. Thats all new to me.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, it depends on cash, like my bank account now.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats whats running paid ads. Thats not organic. Organic. My goal is ten K, so I make between five and seven K now, so its ten K. So the next two paid in full is Im hiring a DM, or as soon as I run paid ads, its all about the team. So Im looking at building a team. Once I build the team and I get an assistant coach, first hires the DMR coming thats soon, and then the second one will be an assistance coach. But then as soon as I get to the ten K monthly reoccurring, Im going to do paid ads, and then that should bring me up to month ish right there, and then go from there.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So Ive only made what cash you.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Like $50,000.50 grand a month? Yeah.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Ill be living in a freaking apartment with a desk, and Ill have a shitload of money on my hand. And I can go into my capital, my bank accounts, and pull money. Thats how I know Im going to have it. And Ill have four more clients. Ill have eight more clients by the end of this month. Ill have eight more clients because Im running a different marketing strategy. Im running a funnel inside of my fucking Facebook group, organically.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Im only making five to seven K per month. Thats not a lot of money. So I just bought a car for $4,000 and Im moving into an apartment today using my businesses money, and Im closing somebody at 09:00 here. So I dont know what to even tell you, man, on that until I move in. And after this car thing clears, Ill have maybe end of the month, three or 4K on me. Its hard to say. I dont think this is the right position for me yet. I think its more about me taking what Ive learned online and what Im doing organically. Everything is going really well and I think just keep working that because I keep adding clients that are paying me. And I have reoccurring payments inside of the month on top of paid in full. So thats security right there. And I think I need to wait this out. I think I need to move into this apartment today, which Im doing before we I think we should jump on this call at a later date, like in a week or two. Does that make sense?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Its four, eight. Like anywhere between ten and 1510 and 16.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"$5,000? Yeah. Well, if I make $2,500 reoccurring right now from current payments and every month or $600 or $700 and then I break down payments, I do every payment plan in the world right now to make those numbers for the last like two or three months, and then somebody pays me two payments of 1700. There you go. Theres your five K.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And all those things that I have to do. So social media posts, Facebook group, my Facebook group, my WhatsApp? Community group. Theres just so many fucking things that I do daily and throughout the week that just get away from me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Like three years.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Thanks.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I need to increase my numbers is what I need to do.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]