[{"pageContent":"Hello?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Well, I have been following Caleb for a while and I hadnt heard about him or seen him in a while, but he had the Air ad came up on, I think, like, Facebook and YouTube, and I was like, you know what? And hes talking about users and our artificial intelligence and everything. So I have some high ticket courses and I also do affiliate marketing. And I have done ads in the past just, like, solely on my effort. And Im like, you know what? I dont even want to do ads, but I want to partner with high quality people that can do ads for me and we can share in the profits. Thats what I was thinking about. And I have the money, like a budget set aside to do the ads. So thats where my thoughts were before you called.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Ill let you go. Im sorry.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. Thats awesome. Thank you so much for calling.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Oh, er Im sorry, youre calling from what again?","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Okay, got you. Okay. And I forgot your name.","metadata":{"fillerID":16,"fillerText":"Ok gotcha","category":"B"}},{"pageContent":"Maybe like 650 or 700? Im not exactly sure. Maybe like in the 700 range, Im guessing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So youre going to email the resources?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay, got you. Okay.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Yeah. And using primarily like YouTube and Facebook and all the social media. But I guess I would want to focus on one. So I just think Im either like YouTube or Facebook.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"My income, let me see. I think it might have been hang on 1 second. Im going to do some math around like 29,000, give or take.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I have checked it, but I usually dont use credit cards. I just use just the money that I get earned income in order to pay for things. But then theres also the government assisted program too, that can help businesses get funding and everything. Its the ERC, Im sure like you have heard about that, right? What Im talking about, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Not right off hand. No.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"The ERC, yeah, its when the COVID was going on and theres all this funding that came out of that and.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. I got you. Okay.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Well, I guess its a course creator, so I have a lot of courses and then a lot of physical products, and those are the two main things. And then also I have access to products and or services from celebrities, too, that I went promoted and everything, but I dont know specifically what they are yet. I need to get more information about it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, I dont want to start a digital marketing agency where its me doing the ads, but I want someone else handling that aspect of it. Does that make sense? Like running the ads, testing the ads, working within the budget?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, its from Caleb, right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So what resources were you thinking about?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Good. And I guess would you all or someone on your team or other people or agencies that you know of that is willing to do the profit sharing?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, sure.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Well, right now some hat has already been spent. Everything right now I have a $1,000 budget for the ads. So if someone can go ahead and manage that, the money that I get, I could give like a certain percentage of the sales and everything or to whatever we make.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I guess like low end, lets say like $10,000 a month. But seeing the results from other people, I think like $1,000 a day is completely doable with the ads and getting traffic. As long as we start off small and then see whats working or whats not what needs adjusting. And then if we do find that its working and scaling up the ads more and if it is working more, then scale up the ads more. So thats like where my thoughts are on that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]