[{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Eastern? Yes.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"330. Correct.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Let me see.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Where would you come in this equation?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Hey, Tony. Good.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"160.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"That would work, yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"90 minutes? If you send it to me tonight, maybe.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, thats a good question. The wellness center will be open in July. That branch, that one in Maryland. So right now, if you ask me, we dont have an agent yet. I can tell you from the other branches, there was a time where it was fully booked three months in advance, all 8 hours of the business that was open. And that is what Im trying to achieve with this one thats coming up. So but now these other centers, theyre not fully booked. They have spaces in between. Its not fully booked as it was before. My goal is to have every month to be fully booked every day the 8 hours that the business opens.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, send it. Thank you.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"So the wellness center is going to be yes, there is going to be packages. Usually theres a two hour, ten hour, 20 hours packages that Ill be selling. The 20 hours is about 2510 hours is like 1600, and couple hours is like $190.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, I was just scrolling on Instagram. Thats what I saw. But can you give me more information how it works and what it does?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yes. The leads mostly going to be social media and the conversion rate of that. According to the other sister businesses that Ive seen its already. What people I mean, people look for it just books. It its not like theres other alternative or things like that. And thats based on area. So say in the area where Im going to be, theres no other places like that that they can just go and compare. So if youre in my area, if you was looking for the service, you get it, period. So theres no closing or follow up or nothing. The people who looks for that service will book, but thats what my target is or will be concentrated in getting the word out to where more people are aware of it. Thats it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes. Probably start off maybe to 20 a month.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Sure. Absolutely.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Appointment based like the other centers have? They have, like I said, every 2 hours. Thats a package every 2 hours. And there are ten different sections or ten different rooms where people can be at the same time. Like, lets say ten different people. I can have ten different people every 2 hours. Ten different people every 2 hours/hour per every 2 hours. So business opens 8 hours, itll be ten per couple of hours. Bus, how many people would that be? 16 and two. My goal is to have from opening to closing, fully booked, all ten rooms.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sounds good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, thats what it is.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"People who reschedule or not show up will be, like I said, maybe like something emergency came up, but everyone else will show up, people who makes the appointment. So my goal is to have as many people to make the appointment. Because the thing is, we have a system. Well have a system where if youre booking an appointment, youre paying right away, youre paying up front. Youre not going to miss your appointment if you already had paid. And if you dont show up, you lose whatever you paid for the service. Theres no refund.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Say that again.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Straightforward.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Lopez.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay, there will be all types of clients on this industry. Fortunately, we make it possible for every budget. Like I said, our lowest package is the 160, I believe, 65, 169. But for the value that they will be getting, yes, it is affordable.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Perfect. Yes. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"720.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Not for this business, but yes, Im planning to run because everything is going to be starting and definitely, yes, run ads to acquire those clients, the bookings, and thats what I need to have.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, not really. The package is self explanatory. When people know about the service, all the information is right on the website. And whether you want to buy the least expensive or the highest expense, it will be on peoples choice, depending on how fast or whats the best fit for them economically. But theres no need for me, like, answers that they will have. Its already up in the website, right? Okay, its already there. Yeah, its self explanatory.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Another example, if we go back to the dentist, they will be like, okay, you want cleaning, you want deep clean or you want tooth taking out. Theres a price for each. Which one do you want? Thats it. Theres no consultation because you already know what you need. By the time youre going to book, you already know what you need to book for, right?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"20.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Of the ten that books an appointment, Im saying ten if not nine. But nine will be if that person had difficulty getting into their appointment. Its just like if you had a dentist appointment, you have to go either way. You go in because you have a dentist appointment to your dentist. You dont go because maybe you had something that came up that day, but you will reschedule it again. Its that type of service.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"If they dont want to go with the highest package, they can just always start with the lowest. Theres no need for everyone to be in the highest end.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"The 330 will work.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Like I said, I was looking in the Instagram and I saw something that I could probably use. Im not sure if it will be a good fit, but you can tell me how it would integrate to what Im doing. Ill be opening a wellness center, and I need, obviously, to grow it. What would you guys be able to do for this business?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Thank you. Take care.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sounds good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Not yet. Thats why Im looking for things that I can use, stuff that can help me. Maybe I was looking into marketing agencies as well.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]