[{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"See the yeah, I just kind of wanted to see what the case study is, and then I could say, oh, this is something that I could work with. I want to go with this. I want to try to do this. Or maybe its not anything that Im looking at. I have no idea.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Not let me just double check right now. Ill be on the phone.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, the coaching is all same thing has to do with fitness and training. So I kind of do it as a case by case basis because Im trying to narrow down what I do, because I do so many things, and Im kind of spread out all over with a lot of different things that I do. So Im trying to kind of narrow it down.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thats my initials. Im in Jersey.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"It really is.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. Yeah. Im just trying to learn as much AI as I possibly can as it relates to marketing, as it relates to the fitness business, as it relates to everything, because I know its brand new and something like that comes out, you have to jump on it or its going to take over for you.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, as far as the network marketing, same thing. Its just getting the interest there so that I can meet with more people.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, no, definitely not there yet, but very interested. But I understand what youre saying is how it works. I need to have some kind of structure in place before that AI can actually help me, because I have to feed the information in.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, probably not until I figure out how I want to scale everything and have a plan.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, I use the trainerized app so I can work with anyone anywhere.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I know what Im making every month. I have that idea of whats coming in, and theres not so much up and down, up and down.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, I get you.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Good, how are you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Have you got an idea? I do like my own marketing, but Im not a marketer. Im learning as I go, so thats why I wanted to see how AI could help.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, at the moment, Im not selling any packages at that price range. Eventually Id like to work up to that, but I have to put together what I would be offering for that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I just saw I was just scrolling through Instagram and saw it, and Im just learning a little bit more about AI.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats why I wanted to see the case today, because I wasnt sure exactly what you guys did and if it even pertained to what I was doing, just to kind of see if its a space that I want to jump into.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, Im going to be putting together some packages, actually, what kind is probably going to go with the app that Im using. And Ill probably be selling packages on my app because Im uploading different workout videos, different things, and then Ill have access to it, depending on what type of package they purchase. Things like that is one way that Im going okay. In that space. So Im trying to expand what I do where I dont personally have to be there for every client as far as in person. I can work with them through Zoom. I can work with them by creating programming and videos and things like that where I dont have to physically always be there because we run out of time and then you run out of money.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, I dont see it here.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, financially, I want to make more as a trainer coach. What I make varies monthly because you have good months, you have bad months. So theres nothing thats really constant. And thats what Im trying to change. I want to try to put something together that makes it more stable.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Just how reaching out to people, like the best process, how AI can help that as far as content, different ways to build, lets say, my following, or just to build interest in what I do.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah. No, I think I want to possibly duplicate what I do on my app, but more so in my network marketing business, I want to duplicate that, because that will probably bring me the greater income right now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"It can help so many things, which is great. I mean, a lot of people are scared of it, but very true. I love technology, and I love to learn new stuff when it comes out.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im a fitness trainer. Trainer instructor. Im building out my website. And a fitness coach as well. Online coach. So I do in person, I do online. And Im kind of building that website together to kind of encompass everything I do, all the different ways that I train and how I work with people. And I also run a network marketing business, so Im just kind of researching the AI as far as marketing goes and how it can be used.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, great. Thank you.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}}]