[{"pageContent":"Okay. Were a dying breed, Ill say that.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"I have not. Im actually out right now driving, so cant check it, but before I left, I had not received it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"That about a 660 from the three bureaus, and that was as of about 30 days ago.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes, that would definitely be fair.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Passive income. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I still do some units because at the end of the day, real estate is up and down. Okay. So one year, like I said, average, Im going to be around 120. I did really well in 2000 and 22,021, 2022, we took a dip. And with what were trying to accomplish, when your income is up and down, its difficult to do. So I like the safety net, so to speak, of having that W Two consistency there, which is kind of why were looking at doing something that, one, has the income and the consistency, because its great to make a million dollars one year, but. The next year, you make $100,000. That can be a shock to the system, so to speak.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, I dont know if Ill be a fit, but Ill just tell you what I am doing and what Im looking to do. Okay. Currently I am a real estate agent in the Atlanta area and an investor in the area, but Im recently just dabbing and thats all it is, is literally just the initial steps of getting into some possible ecommerce type business and things like that and just kind of understanding what it is and dipping my toe in. I havent done a whole lot with it. Okay. Ive become an Amazon seller, but I dont do any coaching or anything like what youre talking about. I do have a real estate team, but that team is internal. And obviously we help each other share ideas to grow our real estate business. So thats kind of where I am now. But I dont know if thats the market that you guys are looking to expand or if this will work with.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Absolutely. Hes one of my favorites.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes. Definitely heard of him. From the real estate side.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Doing great, how about you?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Nice.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, got it.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"So, I mean, Im there now, but Im working now. And when you get to retirement, the goal is to have more time, but still live like you become accustomed to.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Simple as that.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, so metrics of it is kind of what I looked at from the real estate side of it. And when I first started working with social media, what I found is that its one thing to have a website, okay, so that puts you definitely better than the guy thats just putting out signs like in the old age or newspaper ads, so youre at least on the Internet. But how are you going to get people to the site? And even if you do get people to the site, like you said, okay, thats a nice site, but Im not ready to buy today. I might be ready to buy in six months, which means youre going to have to follow up. So how am I going to even know? Whos going to remind me? Follow up with John in six months, follow up with Susie in three months, follow up with Fred in a year. And if youre trying to do all that manually, its almost impossible if you got more than a few people, which at the end of the day sales is about numbers. What you just said 100 people get to your site. Typical sales say 9% to 10% are going to do something. So of that 110 are going to say yes, I like your product. Of that ten that say I like it, how many are going to actually buy and all the follow up goes into it. Im definitely familiar but its those systems and processes that the average person just doesnt have the time or knowledge to do. Correct? Yeah. And with Chat Bots and all that I played around with Chat Bots which helps. But if the person gets outside of the realm of questions and then they get frustrated or fall out of it did you know that? Why did they fall out? Is it something that was in our script or whos going to follow up with all that type of stuff? Yes. Very familiar.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Donnell.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thats correct.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah. So salary wise, I still do some consulting for Unix and stuff like that. From that standpoint, W two, Im going to hit probably around 120 a year. From my real estate stuff, Im probably doing about another, on average years, about 100,000. And then my wife is a nurse, so shes bringing in another 150,000 or so.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes. I was just curious to kind of see what you guys did and if it would be a fit. Not sure, but just kind of get some information.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Youll sell it, but will you be selling it at the right price point? Correct. Some of the risk that are involved, I mean, anybody can put a sign in their front yard and do for sale by owner. Absolutely. But are you looking at the right comps? Theres a lot more that goes into it. And I think that for now, were talking about AI. AI definitely will help, is helping and will continue to, I think, play a larger role. But I think for some people, youre just going to have to have a human component because AI is as good as it is. Its not a human. And I think that theres always going to be a place now, 20 years from now, may not be. And I see my wife and I were just talking yesterday, I definitely see some areas, sports, for instance, tennis. I just saw something yesterday that said starting in 2024, a lot of the tennis matches, matches are going to be computer driven as far as the calls, whether the ball was inbounds or out of bounds and all that type of stuff. Now theyre still going to have the judge that sits at center court to oversee, but as far as people saying in or out and all that, no, thats going to be computer driven. Now, football, I dont know if youre a football fan.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Donnell I would love to be able to help people, whether theyre family or not, family, charities, things like that, give back and also create some opportunities for folks that might live in more depressed areas. For instance, inner city kids. I think one of the areas there is that kids dont see role models and have the role models. So they tend to get into the role models they see are negative, unfortunately. So they tend to gravitate towards those. So create some opportunities where they could see. Heres a person that literally started like you did, but worked hard and had a process and a vision and just worked towards those goals and eventually made those goals, but also give them some things to in the meantime. Thats all good down the road, but you definitely got to have some things for kids to do today. Summer is coming up. Kids need to be into doing something positive and productive, whether its in math, science, have some more positive messages on social media, the radio, TV, et cetera, et cetera. So those are some of the things, I mean, yeah, definitely want to live good myself, but help some other people and give back in some of those areas as well.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, I think the thing is, just being in a competitive environment, the skills you learn stay with you forever. So people who play sports tend to understand, in my opinion, how to work with a team and know your role, but at the same time, how is my role going to benefit the team?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure. Like I said, Im open to whatever is going to create some income thats sustainable. And I definitely dont want to be a one hit wonder, but if youre going to make an investment, Im sure most new things involve an investment of some type, whether its time and or money. But yeah, if its something thats new and I can see it being sustainable for the future, definitely open to at least learn about it and hear about it. If it looks good, we pull the trigger on it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, really?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Thats the goal.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And I do have a background in it. 30 years as a Unix administrator. That may or may not I have.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, wow. Hes going way back.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Well, just similar to your friend, again, dying breed, but you still got to have create income, preferably passive income, but income nonetheless. As we get closer to retirement, and it seems like we never have enough of retirement based on our current lifestyle. So just like everybody else, Im kind of forced to look at some different income streams. And thats kind of why Im looking at ecommerce and or something dealing with real estate investing or just investing in general and just open to new technology and seeing how that technology can I mean, people are making money every day of the week, and they may or may not have as much experience and or education. Its just they are at the right place at the right time. They jumped on something, and they were looking forward versus backwards. So thats kind of where I am. Thats it. Okay.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, it was more and I just looked at doing something, again, on a very low level. What I was looking at doing was more T shirts, mugs and things like that. Kind of seasonal items where you pop out slogan type mugs or something for seasons, like Mothers Day, Best Mother Ever. And we put probably 100 different versions of a slogan up, youre the best mom. I love my mom. No other mom in the world like you and just put up little snippets. Up. We dont necessarily produce it. When the person clicks on it, it automatically goes to a print shop. They print it, ship it, and they take their portion out and send us the difference.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, they slowed down, obviously, when the interest rates went up a few months ago. But were starting to see a little bit more activity, which is normal right around the summertime. Ive got several people that Im working with, and we expect more, obviously, as the summer comes and people transition out of the kids, transition out of the school system, and then other people move into the area and theyre looking to move to different areas. Okay. Were starting to see a slight uptick, and I would expect more of that from a price standpoint, though, I definitely think that were starting to rebound here in Atlanta. Im starting to see prices rebounding a little bit from the dip that we had.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"What is a football move? So that part of it, I think, is, I dont know, you hit the quarterback too hard, thats a penalty and all that. And I definitely understand targeting and all that, the need for it. But I also think you can get too scientific to where you take the fun out of the game. Its not even a game now, its a science experiment. Right. But anyway, thats getting off track. I apologize.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I am 6ft even.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. So my wife and I laugh now because we cant tell whats a catch or whats not a catch.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Right, exactly. Which is why in basketball they say, look at the waist. The head fake is great. Its a great move. Shoulder fake, head fake, upper body fake. But at the end of the day, the top is not going to go where the bottom is not going. Absolutely.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Well, based on Im an older dog, so to speak, but Im smart enough to see people dont look at offers and information the way that they used to. So, real estate, as an example, in the old days, you talk with a Realtor, and the Realtor sent you some listings and you get in the car with them, and then youd go and look at houses all day and so on and so forth. Whereas now statistics are showing us that most people start and theres a 70% to 80% statistic based on the National Association of Realtors, that most people start their search on the Internet, and theyve already looked at several houses, and theyre smart enough with the tools available to find comps and look at areas. And with Google Earth, they can pretty much zero down onto the house and the area and find crime statistics, et cetera. So the need for the traditional Realtor has changed. Not that you dont need a Realtor. In some cases, you actually dont need a Realtor. But the majority of people still, if theyre looking to buy or sell a house, are going to need someone, at a minimum, to give them the legal documents and kind of walk them through the process and couple that with the mortgage process, okay, this is the house I want to buy, but how much can I afford? Whats the monthly payment going to be, et cetera, et cetera. So, in essence, the process has changed. So to answer your question and just use that as an example, not to say that thats going to be my product, but I would start with social media because thats pretty much how I found you guys, and I find everything. Im on Instagram or Facebook or whatever. So to me, the question is putting yourself in front of the most people for the most cost effective manner, and whether thats pay per click or by ads or whatever that is already there. And of course, the other side of that, which is kind of how I got into the ecommerce part of it, was Amazon already has the customers. If you put a product out there on Amazon based on certain keyword searches, et cetera, youre basically paying them for their existing customer base. So if someone searches for a blender on Amazon, the customers are already there. Its just how does your product compare to the other thousands of blenders that are there as far as shipping and the price, all that type of stuff? So thats kind of what I would say social media or use an existing platform with customers.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Likewise. Thank you very much for the call, and look forward to getting more information.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So far so good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, nice.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Exactly. Amazon type stores and thats all that Im looking. Again, nothing major. Im not doing millions and millions of dollars. And I just started that maybe a month ago. Again, just to kind of understand it. But my primary is the real estate stuff.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, I played basketball.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Last name is Henderson. Henderson, okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I would just say ballpark 10,000. Okay.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Okay, thats fair. Thats definitely fair.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Well, also, I think society is just kind of selfish in that were kind of in it for ourselves, and we kind of forget about everybody else, but yet we all need each other to survive. Somebodys got to create jobs and opportunities. I-E-A CEO, but you got to have somebody on the fries. Otherwise business still not going to go so you need people at all ends and they need to feel that theyre not just a number but they are part of the organization, part of the team and that were doing something that matters and has purpose. So I think we can talk about it or we can actually do something to correct something.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Roughly, yeah, roughly. Okay, all right, roughly.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, sounds good. Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Typically, shes home by about 630.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure. It would probably definitely not Monday. It would have to be Tuesday. And shes a director at a hospital, so it would have to be after work, after hours.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Let me know absolutely if we do. Absolutely. I will.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"All right. Take care. Bye bye.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Got it.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Well, so my number would be 20,000 a month, but of that, Im probably not even halfway there at this point.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sure. Okay. I got about another ten minutes before I get to my destination.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Sounds great. Sounds good. Okay. Very exciting.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"It really does. Yeah, absolutely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}}]