[{"pageContent":"Right. Okay. How long is this video here?","metadata":{"fillerID":7,"fillerText":"Yah totally","category":"A"}},{"pageContent":"Ive got your information. I appreciate your call.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And if the leads are good, Im making money on both sides.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Im with Philadelphia american.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im a broker, so I represent just about every company, including companies in Colorado, everywhere, blue Cross, you name it. But the one that people hate the most is the Blue Cross. I put them with Philadelphia, and they love it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And if Ive got 2000, 3000 people to give it to, to me, thats the same thing. Were saying the same thing, arent we?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Are you going to text it to me, or are you emailing it to me?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I knew you were going to say that.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yeah, whos texting me? Hold on 1 second.","metadata":{"fillerID":33,"fillerText":"Yeah","category":"E"}},{"pageContent":"Yes, I sell health insurance to small businesses and individuals.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Actually, what Im using right now is SEO, and Im placing number one in several cities. Its getting more competitive. Im still holding out, but the issue is theres only one guy that can be number one. So if you got a bunch of agents, theyre not enough leads to share.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Why dont you text it to me, and then I can do both email it and text it to me.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. Okay. Yeah, Im kind of burnt a little bit because I just invested $12,000 into what I thought was going to be a great lead system. And Im a little salty right now. Ive only gone a month into its supposed to be a six month program and I am pissed off that I got into this, man. Its opportunity cost because thats taken away from me to do other things.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Are we saying the same thing, though? I get an override from my agent, I dont have to give my leads away. I could sell them for $10 a lead. $20 a lead or whatever.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Thats where I made my money when Obamacare came in, not because I was selling Obamacare. Its because I was selling alternative plans. People hated Obamacare.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Pretty good. How are you doing?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So Ive got agents, but they dont have anybody to see. Thats an issue.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Alexa. Alexa, pause the garage. Roku, whos doing all this text? And Im getting so many texts. Is that an AI text me?","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"All right, buddy. You take care of yourself, okay?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I agree. Now, when you say agency, whats confusing on that is youre not specifying what type of agency.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Whats your name again?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. Whos this?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats all I do is digital advertising and digital marketing.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I almost didnt answer the phone because its not matching the phone numbers that Ive been calling back on.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay, so youve been in the lab for three years on it. And how long have you been testing the beta side of that?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And I use AI on a daily basis just to let you know for different things. Let me know what it is, you guys, and how that works.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I appreciate you though, Rick.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay. Yeah, let me look at it and digest it. And Im going to be traveling on Saturday and I wont be back until next Thursday.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"How long have you guys been developing this?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Ive got an insurance. Ive got 150 agents and I have other people have as many as 1500 agents. That would keep all of us busy. So Ive got people to give this to. I just need something that works.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"The lead generating company that has the clients okay, I see what youre saying. Got you, correct.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Bye bye.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"All right, see you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Ive gotten, like, ten or 15 texts, and obviously its not that smart because Im trying to tell it its not a good time to text me, or Ive gotten the same text more than twice, like, asking me to have an appointment on Saturday. And I said several times I was traveling on Saturday, and Im thinking, this is probably AI, but its not. Comprehending what Im doing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"But tell me a little bit, because Im really interested in what you guys do. Im wondering how smart the AI is based on my conversations that Ive had so far with the AI. And what I want to know is Im very good with leads. I understand leads like the back of my hand. As far as automated leads, my background is engineering. Most of the things I do is online, its tech. And Ive worked with a lot of different people who claim they can do a lot of different things, and they cant really do it. So very specifically, explain to me what you guys do and how it works, and then let me see if thats something that I would be interested in and what the price is, either on a per lead basis or on a group basis. Ive got 150 agents, and Im looking for something. Just because its AI doesnt mean its got to cost a lot of money.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, Im not doing badly. Im not doing bad at all. Let me look at what you have. And when you say agency from my perspective, thats fine because my background is marketing. And so for me to give my agents my agents, they dont know anything about marketing. For me to be in a position where I can give them leads is where Im kind of focusing on a little bit, but I see they have to be affordable. Ive dealt with lead companies before and Ive dealt with stuff, facebook and all that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]