[{"pageContent":"Whos speaking?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Listen, I only make about $30,000. Okay.","metadata":{"fillerID":16,"fillerText":"Ok gotcha","category":"B"}},{"pageContent":"I think I received some email, yes. But I dont have a chance to read it yet.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes, because this is very important for me. This is the starting point for me. I want to see how we could do this together. Okay.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, let me book you and maybe for the weekend we can meet next week or so. I really would like to know you.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Man, thats great, man.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Yes, actually, let me tell you why I called you. Actually, why involved with you guys. So Im thinking about developing a course and filling this course. Okay, so the course is not ready yet. All right. Anyway, my course is how to make money with Amazon and Walmart. Basically, thats it. So Im trying to market this course, but I want to see how it works. So can explain more to me. Lets say I have a course ready right now. Okay. Its not ready, but I want to say when its ready. How you go about marketing it?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"A big restaurant there. Its called the Persian Room. Persian Room, have you ever heard of it? Its in Scarsdale, by the way.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Definitely. Yes, definitely. You can have a wonderful experience.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, I really love to hear that. So tell me how you can speed the process.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"But do my favor. Do my favor because Im very forgetful person. So try to hit me with a message, like ten minutes before the meeting or 15 minutes before the meeting. Can you do that?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Im good, how about you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"50 grand a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So the only thing Im interested in I want to ask you a question here. Whats your name again, by the way?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Okay, first of all, I have about five business right now. I never have a business with courses, so I want to try with this field. Basically, Im trying to diversify my income, basically.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I can check my email right now, so go send it now if you like.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No, Im going to be home. I might oversold my home anyway.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Phil. Phil, my question to you how we go about partnership with you, how you make your money, is it percentage or how it works? Lets say I give you the course until you phil, go ahead and market this for me. What kind of financial agreement with us between us going to be? Can you explain that to me?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. Thats interesting. Yes.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, I know.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, I dont have, like I said, marketing. I have nothing. I have zero. Right now, Im thinking about the course. The course will take about a month or maybe six weeks to develop, and thats it. But dont ask me about marketing. Thats why Im looking. Thats why Im sure he called you guys say, lets see what we do with these guys. For me, thats it. And contact you.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, go ahead, please.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I changed my mind. Only $30,000.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Optimize the sale and automate the process. I dont want to do nothing after I develop the process and develop the course, I want to put it somewhere there and everything will be automated.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sure, no problem. Yeah, send it to me now. If you send it today, maybe Ill spend the night over it before I go sleep.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Did you say 60%?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"You got it.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Sure, of course. Yeah, I think it would be helpful.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Ill take you the best Middle Eastern ford. Im from the Middle East, by the way. Im going to keep you to the best restaurant from Middle Eastern.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I live in Arizona. And just keep in mind, Arizona is the only state on the state union that does not change time.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Sure, go ahead.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Exactly. Both ways. $100 both ways.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Actually, I have my own company. Let me tell you something about myself. I got three businesses right now. I have Walmart store and then I have Amazon store, and also I have a supplement product company. Supplement, like for testosterone supplement, nerve booster supplement, stuff like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, just lets go pick it up and see whats going on, whats going to do, how you can help me, guys.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"No, to me, I think its marketing. Marketing.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes, actually, today.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, of course continue scale. Im saying if it will be worth it for me if we get like 50. Okay, but no, actually I would love to see like one hundred K a month or maybe 150 a month. Yeah, but what Im saying to make it the sweetest platform, its worth the discussion. The idea 50K without any involvement, just everything automated. That would be fantastic.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Exactly. Of course you have to have some kind of customer service involved in case somebody want to help or something like that. But I want everything like automated as much as possible, of course.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im a morning guy, so I will choose the alist one, like maybe 10:00. That should be fine.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, basically what Im trying to do, basically Im trying to develop a course and get maybe like ten or 15 sale a month. And I have a business, automation business, meaning I dont have to involve anything after developing project and thats it. So we can do it like everything will be automated. Thats my vision.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I would say around 200, 250.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes, I hear perfect.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No, I thought you were part of the founder of this company, arent you?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, but Im trying to sign up with you and get you the business by visit. I want to start I do want to learn how to I want to give it outside house, you know what Im saying? I want something my brain right now does not function well fully. I have so many businesses, I cannot retain anything in my brain right now.","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}},{"pageContent":"And also I have development software development for myself. Theyre working company for me. Its only for me they do that. And they have social media advertisements only for me too. They develop that so I have everything to start doing development. Okay. And I have the idea so right now I dont have to spend anything to create a course, basically because I have everything in house. I have about 20 people. They work for me from Pakistan, India, and Bangladesh. Okay. So I outsource everything I do to overseas. Like Pakistan and India and Bangladesh. So the budget for me is actually going to be very low because I have everything in house. Did I answer your question?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, but development is no big deal. I can do it myself in a house. Okay. But I need somebody expert on getting lead and closing sale and stuff like that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"In this company? I mean in this company.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"My score, I would say between 680 to seven something.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im sorry, I thought you are one of the founder.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yeah, my question to you, what I need right now is someone from your company to contact me to see how the financial arrange between our company because its very important. After that I will decide if we can go with you or not. But this is the starting point for us. Can we do that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Have, by the way? Just a question. Are you working for IRS, by the way?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"So what make you decide to establish this company?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Exactly. Like I told you, I have a store in Walmart, and I have a store on Amazon. I have a store in Ebay. I have a store in Facebook Marketplace. So Im trying to diversify my income by adding to it. And I have experience also, by the way, how to make money in Amazon, how to make money in all these drop shipping businesses. So I want to use this course to help others, too.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Let me ask you a question. How much experience do you have? Guys? How long have you worked in business?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I appreciate it. By the way, this phone number, is your phone number personal? Its a business phone.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sure. Because Im really busy. Sometimes I forget. So the best way to get me just keep a reminder, like 1015 minutes before the meeting. Sweet.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Look, I really dont have time to do that, okay. I really appreciate it. You might send it if you want, but to be honest with you, Im so very busy. All what I do right now, I want to sign up with you and you take care of my business, marketing business on a start. But if you send this, probably Ill watch it, but I will not watch.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"In Chandler. So you are the north? Im the South, I guess.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Pretty much. Does that make sense to you?","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I saw the ad and you said you can scale the business. So can you tell me more about when you say scale the business, what kind of business youre talking about? What kind of industry are you talking about? I would like to hear more about your experience first.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"You want someone to drag you?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So if you dont show up, you give me $100 scores. If you dont show up. Remember, both way, Im going to charge you too.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Exactly. Because Im not experienced in marketing. I never done course before. That okay. So I dont know how to market it. I think this is the biggest change.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure, no problem. Im really excited. Im looking forward to it.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Can you spell that? Sure. D like in David, e like an elephant, and another E like an elephant. B like in boy, its like in home. A like in Apple, n like in Nancy 2000 at@yahoo.com.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, thats great. Were in the same town here.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I would say between three to five.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Can you repeat it just to make sure? Because my ex yeah, absolutely.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Sure. One more question before you leave, okay? Yeah. Okay. Do you know some people, like, professional, super professional developing courses itself? Like super experience with the creating courses of, like, a professional way?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay. All right, thank you so much. Have a nice day.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Did you send it by email yet?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay. I really appreciate it.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I think you have deephand 2000 at@yahoo.com do you have it?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay, so bookman Arizona, but you know that Arizona is the only state does not change time. You know that even though were mounting. But sometime the other mountain, they change. They change the time we dont change. Okay.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I want to give it to someone else like you. I prefer you guys give you, but yeah, I dont mind you sending me. Go ahead, send it to me, no problem. But I want to do something like that. Lets just start. Are you going to send it to me today or tomorrow?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Exactly, I would just develop it and go sell it.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yes, indeed.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}}]