[{"pageContent":"Well, actually, most of my services nowadays is not really bringing in any money like I thought it was to be bringing in, but mostly trying to help people too.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Hello? Yes. Can I help you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, its a cali number. Okay. Big state. Okay. Appreciate it, sir.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Oh, yeah. What I did was put it into a book form, ebook form. Right. And doing digital downloads, and Im doing ecommerce, but I want to drop my ecommerce in order to do it in a different format.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Because sometimes people that are really strung out on drugs and stuff, they dont really have the money. They have the insurance or something. You know what I mean?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right, Take, thanks again for calling. Bye now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"All right, take care. And where are you calling from, may I ask? Erica?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Unfortunately, my budget would not permit that expenses, so I understand that too, because business I understand, and nothing is really cheap nowadays. But I hate to keep getting burnt, though, every time I turn around. Invest in maybe $100 200, $300 here, $500 there, and still come up with a goose egg.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"About the digital AI.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So talk to me about whats going on with this program.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Well, Ive been using their programs and been associated with them for about last maybe ten years. All right, so no disrespect about new offer, new errors and all this stuff, but like I say, I just want something thats going to be reasonable. I paid $60 for an AI program for videos, going through all this good stuff and everything, right? So they say, okay, I get the software, I get the download. Boom. Next thing I know, I cant get into my account because I have to come up with new password. It seemed like every time I go into try to get to an account, I had to go through another change, go through this, go through that, and open up a new password. Four months. And then I say, okay, well, Ill buy another program. Right? I paid $100 together for both of the programs of software. Come to find out, both of them were the same company. So thats why Im pissed off about going into different things, to be honest.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Unfortunately, youre about the fourth person in the last maybe this is the fourth month. I said in the last maybe six months, youre about the fourth person that I have looked into high ticket programs, offers and seminars, webinars and free classes offering the same type of a program or same type of software type thing about AI, which is okay. And Im learning. And Im listening. So what do you have to offer? Im not even going there. I hate to sound like when you hear one, you hear them all type thing.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Okay, whats the name of your company again?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Open to creating, do you rent your software or do you sell it? In other words, that you have after you go to the trading, do you rent it, lease it, or sell it?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay, so once I download it to my computer, then its mine, right? Correct.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"You get a chance to check out my website, peopleinlove, L-U-V peopleluv.com. And like I said, might see something, get me back up.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Because its the truth. Its not. I guess maybe thats why I was looking at different programs and things for marketing. What can I do to stimulate the public to be aware and make videos to put it out there? The bus is going.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Who knows? Right now Im working on my website, and thats why I say I could try to use some things to go into my website, some videos like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You heard of Lisa Nichols, Tony Robbins?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"A long time. 1520 years.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"You can help me out there. I appreciate it. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"That sounds real good. Any information is better than no information. Exactly.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Whats going on?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I really dont have a business more or less a ministry. I do life coaching, more or less for addiction, relationship type thing.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, Im listening to the other phone program and I get a lot of information and messages from YouTube and different programs in order to get more message information out to the public.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Yeah, I have your text messages. Yeah, I was just reading that, in fact, this morning early. Right? Like, what was it? So early in the morning? Okay, I got you. Thank you.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Whats that again? Im in the process of doing it now. Thats why I reached out. You know what I mean?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Yeah, Im listening.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Independently.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"The only thing about high ticket coaching, unfortunately, Im in the wrong position or wrong situation. And also Im at the wrong race. Im a black person, single, male, mature and Im not associated with the rich and upper scale, upper class people like that. I came out of a situation. Well, see, Im on social media more or less trying to drum up this is more or less business and try to get the exposure. Right. Now, as far as my contact, usually mostly from church people, which not paying the money. Theyre not really asking for a life coach from black men. Black woman, maybe. So black men catch hell and let you in that click, and Im not in click.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Something like that. You ever heard of Tool?","metadata":{"fillerID":44,"fillerText":"Yah totally","category":"G"}}]