[{"pageContent":"Well, SaaS is software as a service. Right. So this is a little bit different because were providing kind of managed It services that include troubleshooting, desktop troubleshooting, network troubleshooting, cybersecurity disaster backup and recovery, business continuity, making sure regulations, compliance are being met, things like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Were an It services firm located in Manhattan.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im good, thank you.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"It could be as little as $1,000 a month, up to a big balance. Could be ten times that. Yeah. Because again, were dealing with smaller organizations. Okay.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Its most of whats considered managed services. So basically, organizations are engaging us to manage, maintain, implement technology that either have in place or want to have in place. Interesting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. I appreciate that.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, we do consulting. I mean, its part of our business, but its a small part.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. Most companies that need consulting services or large organizations that arent really theyre dealing with the larger companies in our industry, so its not our target.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Is that right?","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Not necessarily. Its a tougher, longer process. Right. So youre talking about typical enterprise sales and its just a much longer process and its a little harder to break into it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Anything else I should know about you guys?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"All right. I appreciate the call. Thank you so much.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Or is it yeah, our clientele. Are corporations usually on the smaller side? Ten to 50 man shops typically.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Understanding why it matters. Why does it matter? I mean, from a marketing perspective, why does it matter?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Before you take too much of my time, why dont you kind of tell me what you guys do?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Okay. Youre geared for a certain industry and were not industry.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, most of our agreements are annual commitments with a monthly recurring charge whereby were managing and supporting their current infrastructure pretty much in an unlimited fashion.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"It? Were focused on our core business right now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}}]