[{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, like managing jobs, job sites.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"My credit score is I had it up to 700. I had my car. Were trying to work on some things, and some other things happened, and it shot back down. So its like I had to start over because thats another plan Im trying to set myself up. My general contracting company, I started with my own money, started from the bottom and used all my money. That was the problem. My own money. And then when I was trying to go do things with the bank and stuff like that, I had one account. He was just trying to zero everything out. I just listened to what with it. But then when I looked up and try to do things, its like, hey, this is not even like a real business youre running. You dont even have anything proof, like, you dont like doing it the right way. So moving forward, my insurance guy, my account said, this is what were going to do. Were going to set you up. You got to take your time so you can go get fine money, credit, business, credit, funding, work on your credit, right. So you can have the money to do it the right way.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Like, you call, I quite didnt hear your company. Then I have another company call. They give me something else. The prices are different. Then it started, say, email marketing. Now its an email marketing SMS funnels website. And then what I do is I try to take the free trial plans for some reason, and thats where I get caught up at. I never get them complete. And then I just get overwhelmed every time I back up. Then I just try to go at it again.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Someone I know.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Im just getting back to it now with my country.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So thats my goal to start there and kind of work my way as I learn it and get close to profession. Then I can come down to the smaller companies that dont really have that may not work for them. They may spend for one month, and theyre not going to do it anymore. A lot of people just dont want to pay for the stuff. Thats another thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I think I might probably like 580 now. 590, something like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Exactly, right. Yeah. So I had this problem with the contractor business. Like I tried to do everything to get into work, building relationships, recruiting, subs. Like it was a lot, it was a lot micromanaging bringing on guys that I knew that wasnt capable. I had to shut it down and regroup. Its almost like Im trying not to follow the same route, but its like Im going back down the road.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Cool?","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thats what Im looking. Im also looking for that one day to have that feeling yes, sir. Or the opportunity to help someone else.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. Washington, DC. Area.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Kind of grounded up like that. Set my bank account up, my business and credit and stuff like that. So maybe in six months to not be available for financing and more capital.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. All right, cool.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No, I fully understand. I just want to make a certain amount of calls. You cant waste anyone time. Im sure it goes on a lot, because when I first started these things, it would be a zoom call. Im sitting there waiting for this call, or Im waiting, and they say, yeah, we tried to call you. No, you didnt I was waiting on also for a couple of months. I said, yeah, this is fraud, this is not real.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Things like that, that kind of holds me up. And then if I ask you, do you know Vendesta or some of that?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im doing good.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Oh, man. Last year, I tried to go at this full throttle. I thought that would be the route, but I ended up having to pick up other work, like, say, some of these gig work has got me through point pickup DoorDash. The scooter companies. Thats one of my main things, scooter companies. Just so I can try to get back to my business and get some of these new things that I have Im trying to get accomplished off the ground. So last year, 45, 60 or so.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Yeah, you the first one. Most companies say, no, I dont know anything. Never heard of.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Yeah, because when I went to the digital marketing part, like, I provided services getting stuck there because I dont want to go get any money from a business, especially like now, especially in my community. And I really dont have any idea or I dont know. At first it was like I couldnt even figure fathom how these things work.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Im at a place where information overload. I have so much information and companies, so Im trying to narrow it down so I can make a better decision.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Before I left, before I stop, I would do close to month now Im kind of checking. I dont have any crews or Im doing extraction work.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"The sooner the better.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. My community is a lot of people just dont use these services or these platforms. They dont trust them. Thats pretty much the deal right now.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, what I tried to do is try to do it on my own, like I said, to know businesses that I know. Like, I know this guy, like your warm up so I can get comfortable and understand whats going on. Then its also like, okay, then Im going to go get virtual assistants or virtual sales team. And then again it starts going the wrong way and I get kind of lost. I cant sell it. Maybe I should give it to someone else because that also starts popping up in my emails.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its like the Internet, digital marketing services. Once you start dialing into it or trying to learn it, then you start getting these phone calls. So youre trying to learn one thing and then you get these phone calls. You can get ranked SEO by next week or tomorrow. I can build your website for $50 a month. No, I can be website for 10,000, stuff like that. Funnels 650 unlimited funnels. The other guy calls say, hey, $37 per month for funnel.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"All right, let me ask you this. Where do I need to be at? Because Im looking at, like, 2500, between 1000 502,500 to get these things going for advertisement, some type of return. I dont need to make profit, but something where I can feel like I did something. I succeeded at one or two sales, and then I can go to the next month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Not really.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Know what I mean?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, cool. Yeah, its some Rogers, man. So I kind of get overwhelmed with it. All the companies that I talked to did direct contact. Like you say, theyre good people, so they sound genuine, but I still cant grasp it pretty much.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Yeah, pretty much all three. Im trying to get results. I want to get results for someone who spends their money like a business some companies tell me that, hey, everyone wants to mentor you, be your coach. Some companies say, well, hey, its going to take 90 or six months to see. Some type of some companies say, well, itll be next week or immediately, so and theyre not its almost like it started off to me, almost like bitcoin like its almost not real. Yeah, Im catching on to it now. I can get a better understanding of it. So I think Im pretty much ready to go. But when I go to social media, anything I do, these things start popping up. Its like, oh, that sounds pretty good. I need to research this company or this product right.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I want to scale it. I want to be able to get close to the facts, scale it and utilize it for as much as I can. Hair shops, barbershops salons, 420, marijuana. Im at a festival now. I need to go in. You got, like, contractors, subcontractors. I got guys who got car wash vans or detail vans. They have all the equipment they cant so I can help them out. You do that there, and then I can go, like, doctors, dentists and things like that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thanks, man. Appreciate it, man.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, cool.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"But my credit score is pretty low.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"So thats an issue. When I go find a partner, should it be someone I know or should I be trying to go on LinkedIn? Thats another small issue.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Youre talking about somebody else, theyre talking about you guys, say, like, kajaba Kajabi, or whatever.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Monday? Yeah, 230 is good.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I havent found them again because I dont have the facts and I dont have the understanding of this. I cant sell it to anyone else.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay, cool.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yes, it sure does. Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Matthew, whats the name of your company?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Taking my time. So I dont have nothing. Full pledge.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Like I said, Im a general contractor. I learned it on my own, became the number one in the state of Maryland. So I was having alcohol blackouts, drinking problems, and I was running crews. I was running my business almost seven days a week, so it almost killed me. So I had to shut it down. Regroup and as doing my recovery, I just went head into the market and just started trying to learn value. When I came back to my general contracting business, it was going to be for that, but it just went somewhere else. I can provide just services for others. Its just something I always been into. Like, Im trying to get to the facts so I can have it for my son, my grandson. You ride down the street, guys say, hey, can you give me right up the street? I want to have it. Hey, I got this for you. Thats been my plan and my ambition since Ive been born, trying to make sure others can emulate or like a partner. The more that knows, the better. Offer to be later on. But like I said, so many calls. Im doing too much, actually. And then the price fluctuation is all over the board, so I dont know what fraud and it was now I spent money on it before. I went with companies like vendors. I went with companies and I tried this and tried that. They supposed to set my website up. They didnt. Then you go back and look. Im getting emails and getting bills saying I owe them like, $7,500. I havent did anything with this company. I had a guy that I work with, and I no longer talk to him.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"No, I havent seen it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Thats one of my goals.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sounds good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"But I havent gotten anything done yet right now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Cool. Whats your name?","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"About two years now. Yeah. I started this during the Pandemic. Before the pandemic, I had a contracting company, but I didnt use any websites. I was doing well. I didnt use any websites, I didnt do any iPhone. And I didnt do anything with it, but made phone calls. So I stopped my business to take care of some personal stuff. And this is what I needed to do, learn more so when I got back to it, I can be better prepared. I needed to learn new things. Im prepared for new opportunities so I can get back to others and just let one thing led to another. It was like, okay, lead generation, I can get that and put to my business. Then it was like, oh, I can get that, like, white label and I can provide that to others that I know have the same issues that I have.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats the issue right there. Things like that.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, thats what Im thinking in my head. But again, Im not.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Start up, digital marketing, lead generation.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right. Let me ask you this. A-L-O-A-L. Is that a company or is that like a software S-A-S? Because Im starting to see this all over the place now.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"They want to see it work first before they put anything to it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats also another part of the process, trying to bring someone on as a partner.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"None. None. I brought it to a guy that hes like me, he has a mechanic shop hes had for over 20 years now. Hes a DC fully, so I was going to try there, but hes a good buddy of mine, and they quite cant understand it either. Shut it down.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Break it down to me, so I fully understand that. I learned that. So a lot of things Im learning exactly through experience the hard way, right.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]