[{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Let me check. Actually, in AI as we speak. Let me get out of it. Theres a loan, Im not sure what its called. We can close building. Like, if I wanted to buy a bunch of apartments and its based on if the rental covers the cost of the loan youre in without any docs. I think its called a CRS loan or do you know?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I know. Thats what I was trying to look at, though.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Is it Cody?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I got so many in here. Ive got seven figures land flipping.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I have a dan. Thats not you. I get so much of this. Everybodys mostly doing what are you all doing?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, Im actually a chef and a corporate event planner. And then everybodys doing affiliate marketing. They said its not saturated, but I see it is everywhere. And then somebodys trying to get me to do land flipping.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. Where I live. And thats my main thing. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"But its also slow. The summer is coming.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes, Ive been looking anyway, but the biggest thing that I see everybodys doing is whats it called the marketing advertising. But theyre doing gurus. Theyre marketing them. Theres little videos where theyre saying, I can make you $50,000 a month, whatever doing online marketing. Right. But the main thing what theyre doing is that they tie on to the guru who wants $4,000 a month for the class, and thats whats in there marketing him, because theyre making commission off of that. From everything Ive been looking, thats the biggest thing that Ive seen that most people are doing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"ItS up and down. Like, yearly, Im running, like, 300,000.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That is my profit.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Gosh, I dont put limits on anything. Its unlimited. Okay.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"5 million a year. But I lost that contract. I had a big casino under me. I did all their events, and I lost that. I had it for 17 years. So that was 5 million a year, and I lost that. So Ive drawn weight. Id love to get back over 5 million. 8 million.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. And Im still trying to live it. Im actually selling my house because, like you said, lifestyle change.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Right, right. Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thats right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Everything. I mean, the cash flow. I mean, I dont understand, but I still dont know what you all guys are doing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You dont do it for free. You charge for that, right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"People are selling people like you, so I could take you make do videos, and I can sell you and make commission. Thats what theyre doing. Theyre taking people like you who help people make money. Thats the biggest ticket I see out there, that theyre taking people like you who do that, and then they sell you and they make commission off of it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"But I need to start a new thing. Ive been online looking and seeing, what do I want to do? Do I want to do land flipping? Do I want to buy real estate? But the biggest thing I see is all these coaches that are out there and companies like you, people are doing affiliate marketing to where they go, five quick hacks. Thats their come on, five quick hacks. But if you really want to know what Im doing, click this. And then when you click it, its a sales pitch to join, like you or join something. And when they do that, they make commission from it. I was talking to a guy in Australia, and hes selling one guy.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im just saying thats what Ive seen so Im trying to figure out what my niche is going to be, and I dont have it yet, so I dont need you to help me with my company, but I need to find a new niche and then hire you all to do that, I guess.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"What do you charge it for all this?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Maybe. I dont know what the cost is. Obviously.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"But but if I dont have it now yeah, I dont want to waste your time, in other words.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"780.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, I own my company, so I dont have those you dont pay yourself.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I dont pay myself. My CPA yells at me for that, too.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats correct, but I also have bills and stuff.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"But I dont know what business Im going to go into.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im so tight right now. Thats why Im looking at all this shit. I have to figure out what most everything that Im looking at that I can do. I dont have to put anything into it. I can just start making from it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I know what youre asking. You want to know, can I put 5000, 10,000, 20,000 in it?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay. What Im looking at is, Im looking at all these things, and Im studying them, and then Im going to find one and go for it. Ive picked up a lot of stuff along this way, how to do stuff and what to do. So what got me was you all had seven AIS, right. They help run your company. Thats what I was interested in, was the new AIS to see what are they doing? What are they but Im not wanting to pay. Youre going to waste your time. No, I agree.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, but I dont have any right.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, I do.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I understand what youre asking me, but what Im saying is summer is coming, and I need all I have to keep my company afloat, and I want to start something else on the side, but I dont know what. Its something that I dont have to invest a lot in and start making money. And once I get that niche and it gets rolling, then I can hire you and say, okay, Ive got 10,000. Pump it up. But I got to find the niche first, and I havent found it, and Ill figure it out because Im studying all these things. Everybodys doing the quickest thing that I think would be the real estate one to make the most money for me because Im in the Dallas area, and you can buy it with the SCR loan. No credit, no money, nothing, as long as the rent covers the loan.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Not ready to go there yet. But I will. But I dont want to waste your time now, and Im not ready, so I got to find it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I dont know what niche I want to do, which one Im going to go with. I dont want to throw money at something unless I going to do it.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay. Im going to try high ticket marketing. And then its like back when I was wanting to do stocks.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, the biggest thing for me is cost. So as long as I know what it is, I look at everything and then I always follow back up. So I still dont have your email. I never got your email.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, email me anyway because I want to have your email. So I get back to you.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"214765 maybe because Im talking to you.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Let me go in here.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"But Daniel, I will get back to you. Let me analyze all this. And thats what Im doing. Im taking it all in and making a plan. And then Ill call you and say, okay, lets move forward. I hate people wasting my time. Im a bid bitch so much, and I hate it. Companies call me. I just had one this past. She wasted my time. They were a high ticket supposedly person, and they wanted to do this conference, and she had to have all this stuff. And then when I got ready to send her email proposal, I thought, wait a minute. I had five proposals already over the past two years to her. So what shes doing? Shes just getting bids from me? And then I called her back on that. I said, I didnt realize that weve given you five bids already. I have to get three bids all the time. Stop making me your bid bitch. I dont want to waste your time. I still got to pay people to put it all together.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I told just selling my.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}}]