[{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hi.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"With who?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay. Yes.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I didnt I didnt get a chance.","metadata":{"fillerID":38,"fillerText":"Ummm yah","category":"F"}},{"pageContent":"Consultation.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Business life coaching.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im also an author. The business since 2017.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im also an educator, so I can do education consulting, but I do women mostly life coaching just for women that go through trauma drama and couldnt get out of it because, like I said, Im an educator.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"100 and $5200, which is equal to an hour.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, now, but Im looking to make it bigger than that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That, but in regards to me going to speak, Ive gotten as much as $800 for 45 minutes.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I would be.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Probably 15,000, depending youre making 15 this month, high next month will be low, depending on the season, I could say sure.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Probably five. Four, five high is about 15.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, thats the profit. Thats the take home.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes, but then we had COVID happened during that time. There was no income coming in during that time.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"A million.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Because thats just a monetary moment. Go. Thats just that with everything that I have and I do, I just want to hit that goal. That doesnt mean necessarily, like, a month, but it just means that I want to hit that goal.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Because it showcases in my growth and what Ive done, what Ive done differently. It shows me going to school reach a certain level, and you just want certain things, which you have to offer is much greater than a lot of other things, and its what everybody else wants and need. Its not only a one and need. So its just like, I want to hit that goal for that reason.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"My effort versus what Ive made from my effort, work smarter, not harder type.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Travel. I used to travel a lot. I havent traveled in, like, four years, but travel Ive been to 44 different countries.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It was actually my last.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, now, but thats educating, like I said, so if I could travel and do that, Ill be good, which is why I want to transition. I want to transition into doing that, into speaking. Im done with my chapters, but Im going over now with my book, so I want to do it in that manner, like, transition from educating in a classroom conformity of a classroom, to educating on stage, to educating in books, traveling with that.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Itll probably be courses and how to courses. Like completing those courses when youre stuck in a rubble. Like right now, my book is about the seven baggage that we carry in life. And when you think about those seven baggage that you carry in life, how do you get rid of them? Meaning even down to the point that what you feed yourself mentally, spiritually, emotionally, physically to get you to where you need to go. So in that book, it breaks down different things that you can do in order for you to get rid of the baggage that youve been carrying for a long time.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Theyve always come out on top. Theyve always come out knowing whats wrong and what they need to change, and they end up making the change. Because I always say that when I life coach, I do it for, like, three months, and after three months, I cut you off. And the reason I cut you off is so that you can begin to lean on yourself for the answers. Because I dont want you to become dependent on me. I want you to start to feel like what Im teaching you can be utilized. You can now implement it into your lifestyle, your life, which makes it easier instead of always leaning on me. So because you learned it from there, or you could go back to the book and reread that part. If you get into that same type of problem, we mostly face those same type of baggage, like regrets and doubts and fears, and then youll have your own story to tell to get somebody else out of it, sort of like each one teach one. Im teaching you through these books, but then you go teach somebody else. You could give them the book as well. But staying for you, staying with me is not a great idea, because then you just become leaning on me for the answers all the time instead of learning to just lean on yourself.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, thats the time for you now to take over. Its like if you teach a kid in your classroom how to do something, now its their turn to implement it into their style and create it molded into what they doing in their life. It should never be that Im going to hold your hand for the rest of your life because I might not be here. What happens if something happened to me? You dont feel devastated that you cant get the answers, but you have the answers within yourself. You just needed somebody to motivate you and inspire you to get the answers that you had already inside of you. And then you need to create that habit, that three months habit of knowing how to answer yourself, knowing how to listen to your intuition. Once you created that three months habit, then it makes it easy. You no longer need me, but if Im there, youre going to always feel like you need me. To answer your question. You dont.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"With the stories? Yeah, I thought of it. With the stories. In other words, with my book, I tell about, lets say, for example, regret is your first baggage that you carry. I explain what regret is, and I explain then I tell a story of when the time, listing the time, almost like whats that book set. I think its called something soup. Needless to say, almost the same thing telling my story in regards to the time that I had regret. And that makes the relatability factor. So now you have an understanding. I have about four stories. There so two adults, which are male and a female thats older, and then two young adults, male and female, that tell their stories, which brings up the relatable factor. And now you can see yourself through their story. And then youll see, maybe I did have regrets. Now its time to get rid of the regrets. How do I get rid of it? So I have the whole listing of things you can do, what you should eat, like I said, mentally, physically, emotionally, spiritually, in order for you to get rid of thinking of things as a regret instead of as a lesson and experience that yield a lesson.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Probably the chapter, because I dont plan on releasing the whole entire book. I plan on releasing in chapters.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Monthly, like its seven different baggage. But I planned on releasing the chapters, but within the chapters, I have workbook. Now, the workbook can be almost like journaling, so that can be free on a monthly basis. Do you get what Im saying? The book itself wont be free, but the workbooks that come along with it in order for you to see your progress, because everybody wants to see that they progress. So the workbooks that come with it can be free.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So that would become my presence, my social media presence. So it become almost like a talk show. Like every day I have a topic that has to do with that chapter. So if I have a topic every day, Im speaking about it. Im engaging everybody in the conversations that were not having in order to rid of that baggage. So the nuggets that come along with it online, the conversational piece that Im going to have with everybody else, the engagement that will happen, the storylines will all be online prior to not the stories thats going to be in the book, but stories of other people sharing their stories online.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"That would aid in selling the product itself.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Now, online presence.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I think I could group it instead of doing how I do, like life coaching individually, I could book groups. So if Im booking groups, it really doesnt matter. Like I could have a good amount of people if Im booking groups of, like, say, for example, if I have an audience and Im booking groups of like 500, I could teach all of them at the same time in the classroom. Im a teacher by nature, and thats what I do now. So I could do that. So cartel can be great and bigger depending on like, I could have events and that could be online events that invite people as well as I dont mind doing that for free because Ive always done, like, I went around doing motivational speeches anyway. So I feel like if I could get them into my online and speaking to them and engaging them in conversations that we all should be having, then theyll understand whats holding them back from getting to where they need to get in life.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Go ahead.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im going to make them believe. So Im going to make them believe in me.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I was just thinking online to be in thats all I was thinking. I mean, I dont know if you have anything further on, but I was just thinking online, if my presence get big online, then that begins to be the place where I can convert them into clients.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You have to be believable.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Now its on a small scale. I know what youre trying to say. When it gets to a bigger scale.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right. For me, it would be exactly. I would have to get in front of people. Like, I would have to go yes. I would have to get an audience thats in front of people other than social media. I really like the personable because I like being on stage. I like talking to people. I like the one on one.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"So for me, I would have to get in front of people in order for me to make more funny. Im sorry. Because Im going up the stairs at the same time in order for me to get more clientels and make more money, I would have to get in front of people. So thats how I started before. It was just stage and motivational speaking. And then from then, I gained people. I gained all for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I dont think I could be the whole sales process because then it would take away from a lot of things that Im doing. Like, it would take away from the personalization of anything. Like, say, for example, if Im on the sales process, that could take a lot of time for me writing and getting together new courses or anything like that, because that would mean that I will be part of every single you understand what Im saying? Every single thing that transpire in the company. That becomes too much. Thats why you hire other people to do certain jobs for you, because it becomes way too much. The load becomes for you to carry.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Going I think thats what I would want, because I think itll be too much for me to do everything on my own.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I think thats why I havent taken off in a lot of things because the whole doing every single thing on your own, it becomes too much. Thats why some people have social media people handed in their social media platform, and they have people handing in other things for them because its too much for you to do on your own.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That depends. Sometimes I go to school. Ive been to schools and done things that way.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Majority.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I would say Ive seen people as young and old, so Im really not I would say young adults probably like 18. And I have seen older people where the young adults were at, too, so it varies.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"The events that we put on, like a team summit, we had, so that was young adults, but there was a lot of parents. There was women there. I did a womans group thing in a park. There was a lot of people there. So its all dependent on the events I put on.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Lot of people all the time.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I havent put in as much effort as I should have been putting in. Why not put in a lot of effort into education? Because remember, Im also a teacher in class.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"So most of my effort was put into me teaching in class. I had a role that I had and the road that I had, I would do it there and then I would do that almost like part time.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im looking to transition out of the classroom and doing that full time. Because thats where I feel my fulfillment at.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"All business education courses and all technology. I have a masters in technology education.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I have a girls group in school. I have a girls group that I work on with them. So a lot of things that I get for young adults, like young women or up and coming women, is because I mentored a lot of women in the school from teachers to students.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So, yes. In school, I teach what they call career technology education courses. I ran that department for three years. In Visual Performing arts, I ran both departments.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So what I did was marry the two things that I love the most. I love writing and business. So I just married it and just love helping people get to a better place. Its my son, so I love getting people to a better place. And it came to me naturally, so I didnt know that I had that skill until I started to see that everybody always coming to me, and Im always consulting everybody, and its like, okay. And then I started looking at it like, this could be someplace I make money from, and Im passionate about it, and I feel like this is my purpose in life. Im always grasping and growing from that purpose. So I became a teacher, an educator, and now I feel like I dont want to educate only in the classroom. I feel like I got bigger than that now. When you start to have conflict and you feel like its just the same thing going in and out of your life, then you conflict, awakens, complacency. So I felt like the conflict awakened all the complacencies I had, and now I feel like its time for me to take it by and just make it bigger than what it can be. I think we fearful of becoming bigger. Even though we want to become big, were fearful of it. But I think that me getting big is not about me getting big. Its about me being able to offer all the things that I have to everybody else thats there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Still want to monetize.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Its like when people say things about pastors and priests and stuff and theyre making money off of people. But they offer in the service, though.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And they have to pay their bills and stuff. So its not like 1 may think that its negative, but its something they learn to do and something they pass about and something they do well if theyre moving everybody.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Means too, but I need the help, too, because I have not gotten there yet. And I dont believe in coincidence. So I always believe, even if somebody called and it was not really based, even if it was crookedness for me, I believe that everything that happens to you is happening for you. So it is what it is. I just need to see what I need to do next in order for me to get to where I need to go.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"We dont ask for it, right.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I think that happens because were always looking at the peoples pocket, not our own. Because were scared that people might say we charge in too much or were doing too much, even though we know our talent is way beyond the measures of what you can pay for. But you just like you dont want to ask people for too much. And itd be like, Are they too expensive? Because then that could go around. And the fear of that, of somebody saying youre not good enough to begin the amount of money that you get is what keeps us from getting the amount of money that we want.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"It was about 690. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Probably about 90.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I have no idea. I never even thought about I just spend where I need to spend. I dont know. I think that if I feel like its right, price is right, Im going to pay for it if I feel like its going to give me where I need to get. So whatever that is.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I have no estimate because for me, Im always thinking, like, whatever. I dont budget. I dont say, like, oh, Im only going to spend $30,000. I just say whatever comes my way that I feel would be profitable, would be a way for me to get better and profit mentally, physically, emotionally, in all my areas. Then Ill invest in it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"One that just connect me to the bigger picture. Simple as.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"It means, like, I call it I created it. Its called, like, a giraffe theory. For me, its like the giraffe could share plaintiffs with a lot of people, a lot of other animals, like a turtle or whatever. But a person that could see the bigger picture and could connect me to that bigger picture. Not on the turtle level, but on a level of giraffe. To be able to see the whole land because of your height. So that person would have to be able to connect me to everything that I need to be connected to in order for everybody else to get my bigger picture.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Example is give.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"An example is like, if I had something to do that would connect me to, lets say if I was coming out with my book, right? I would need social media presence. I would need things to draw an audience to make sure that they understand what they getting into. And how much this book will serve a purpose in their life and how much is therapy in the book. I would need them to know that. So whatever platform they need to be contacted on in order to see this book and hear about the book and hear about quotes from that book would have to be done for me to feel like this employee is doing good. Because this employee has not to only come and get things for themselves because you work for a company, because youre making money. But I also need you to get the same thing that Im feeding everybody else, because if youre not eating off the same table, we dont need to be eating together then for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"In other words, that person got to be for me. They got to be. They got to believe in me and they got to believe in what Im saying. And they got to believe in that employer to work for me. Has to believe in my concept. Has to understand it and learn how to elevate where Im at too. Its not only believing in what Im saying, but learn how to add your own thing. That will make me see things from a different perspective as well. But they got to believe in me. You cant work for me and you dont believe in me and you dont believe in the brand. Youre just making the money. If youre just after the money, then youre not doing it for a passion or purpose.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I dont want that.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"It sounds good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thatd be positive?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Something good, so even if I choose not to, I would still gain something.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im in.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"It would have to be about this time, like 05:00.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes. V as in Victor. I-L-B as in boy. R-U-N as in Nancy.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Let me think about it because Im a teacher and I do things after school. So I dont want if something gets in the way, I dont want to be charged for it. Im not even in something.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"As of now, yeah. But I dont know if it will work. I dont know if something comes up.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay. All right. Because Im supposed to meet my son.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Clarity on what youre going to text me your number just in case.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. All right. Thank you.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Nice speaking to you as well. Bye bye.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}}]