[{"pageContent":"Hi. Who is this?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Oh, hi. Good.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah. Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"I did not see it come through.","metadata":{"fillerID":38,"fillerText":"Ummm yah","category":"F"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, so I currently work for a small firm in change management. So I primarily help businesses upgrade and get their people and their technology ready whenever they have a big implementation or a big change coming. And I am planning on starting to do this more privately for a number of reasons. I like what I do. Im pretty passionate about what I do. Ive got experience doing it. And also I would love to have the autonomy to fully sustain something like this on my own. Im getting more involved in the sales process with the firm that Im in, so getting a little bit more of a feel for it. But Im also open and think theres probably a lot of value right. From being on my own.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. Ive got a meeting with one or two other folks who are in a similar freelance kind of consulting space to kind of see how theyve gotten involved and what are the tools that theyre using. But I have a lot of templates and knowledge and I think a lot of value to add.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. So they may be redoing their operating model, their target operating model. So maybe they want essentially like, a big HR reorg. Maybe they want to change policies. And those policies have big implications. Oftentimes if theyre running, like, an old software for could be anything. Payables, HR, payroll, and they need something new. Theres a lot of pieces that get missed when organizations try to do that. So I do executive strategy. I help with operating model, figuring out I call it governance, like, what to do after the change is made, how will you handle change in the future? And then I do trainings and engagement. So its a very broad role. Tools and templates and things like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Exactly. Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"The current firm, Ive been here about two years, but I did it for three years at a giant higher ed.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Five years? Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Ive been thinking about it for the last several months. One of my friends that Ive networked with has started doing that as shes moving away from a very similar company. And I met somebody else who also scaled kind of more towards doing work on their own and finding their own clients. And I know that they are making enough revenue right. That they actually have hired their own employee. And I think that would be wonderful.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, well, I think its a lot of things. I really value having autonomy in my day to day and my work that I do in my life, I also am pretty efficient. So something that I have been seeing in other firms is sometimes practices that dont drive that efficiency right. Where youve got minimum hours that you have to bill, even if its not necessarily work and things like that. My value is I want to cut that time wasting for me and for my clients to help them do the work. Im really passionate about the work, but for me, outside of work as well, I have other dreams. I would love to start like a nonprofit and be able to balance that with freelance consulting on the side.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I do have a lot of autonomy in my day, which is good and which is why I havent quit. Right. But its something that I also see. I see improvements that I can make from being at a firm to doing something by my own.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I think it would be similar to what I already have in a lot of aspects. But having my own business for me would mean that I am not having to check in or coordinate with as many folks. I can just work directly with whoever my clients are and if they want to see me or they want to book travel right. Instead of having internal approvals and things like that, I can just work with the client directly and cut out kind of my firm in some ways acts as a middleman. Something else that my firm does for me is they do a lot of that soliciting in sales, which piqued my interest. When I saw the ad for AI, I was like, oh, thats actually kind of the area where I think I will need to grow from starting and having a practice on my own.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, exactly.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I do, Im very small, so I did run an LLC teaching piano for a few years. So I have a little bit of experience. But I would say the clientele that may need my services or that I see being a great fit is probably not fully aligned with the sales experience that I had. Right. Just teaching locally.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, thatd be great.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, Ive advised clients and put together packages for them, but I havent done it for myself.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, thats the part I need to work on. Got you. Yeah, I was wondering actually what servicesAir AI has in that space. The ad that I saw talked about some of that scaling and some of those leads, right?","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, its over 800.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, thank you.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Id say between 130 and 150, depending on bonuses and things like that.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I would anticipate maybe 500 to 1000 a month for more of, like, a startup. Right. If I needed a cash infusion to start it, I could put up to ten or 20K, but Im still kind of feeling those things out.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, thatd be great. And Im familiar with some of those. Right. Because I use them. I work with people that use them. Whatever you have, Im interested in taking a read through, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sure. Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Like you were touching on, theres friction.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yeah, I think that would be helpful.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I think the first option has my interest a little bit more, but Im open to speaking with somebody as well.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure, yeah. Im up with scheduling with them.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im on the west coast, so Pacific time.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, I grew up actually in the Chicago area, so Im pretty familiar with the Midwest, but Im in Seattle now.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, I followed somebody I liked.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Okay. That caught Amazons eye. Move to be closer to Amazon.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Just about? Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Lets do a 03:00 P.m. PST.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, just me.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, lets see if we can push that call out maybe to Friday to give me a little bit of time.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, that works.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, Im looking forward to it.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, that sounds good. Thanks, Matt. All right.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay, bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]