[{"pageContent":"No, I have not.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"You know what I want to say. When I was on YouTube, I was looking for ways to filter some of my Im a life insurance broker, so I run a life insurance company and I was looking to prospect, pretty much just prospecting reaching out to people on social media, but being able to have a system that kind of filters out the looky lose from the interested. And I was going to YouTube video. Somehow air popped up. I want to ask the reason why, but what exactly do you guys do? If you can refresh my memory.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, I do remember information. Somehow I came across you guys and yeah, Im glad you got back to me.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So Ive been for about three years and so pretty much life insurance and retirement. But I market for about 24 different financial companies.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I already do.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Perfect. Ill look out for that call, and then well zoom right from here. Thank you, Alex.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"What was your name one more time?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Yeah. Eventually I want to market myself as my brand. But to your question, you are correct.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. Yeah, its been a few weeks.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Just kind of give you an idea. For monthly premium, we write about $87,000 right now, a month on average. Nothing too crazy, but the goal is to scale that to a million dollars a month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Can you do me a big favor? Yeah, Im just about to log out of my office and head out. Can you call me back, like, in five minutes?","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah, so I think you get the nail in the head, kind of add the vision of what Im looking to do. Just trying to figure out a way how to get there.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I want to say I reached out to Air for the marketing end of it, but I think I was also looking at AI. As far as I was diving into Chat GPT, I was diving into AI, just trying to really understand that and how I could implement AI into marketing my business. I think thats what it was. It was weeks ago when I reached out.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Correct. Yeah. So I have me as my company and I am partnered up with about 24 different companies to I help market their products and services. So Im just like the middleman. If someone wants life insurance, theyre not going to come through me and my company. Im going to partner them up with the company that we go with.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. No. So basically its just through social media.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"How can I help you? Good, how are you doing?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"So right now, I started to do this this year. I do a lot of educational videos when it talks about finance money, life insurance. And so kind of like the vision with that is just being able to be like the go to person. If I get in front of enough people, enough audience, be like the go to person to where if someone is looking for life insurance or tax free retirement, theyll recognize me, theyll recognize my name, my brand.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. Im just saying through social media.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"What thing of your company get bus.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Im already getting a little bit of a little bit of traction with people inquiring about it, but right now, its just more so just trying to get the following just by providing free value, but eventually being able to offer part of my coaching, my trainings as part of a package.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Have you thought about doing that as its own entity? Yeah, thats one of the goals, is because even right now, as Im barely starting, Im already getting people that are saying, hey, you know, what are you offering courses? Wed like to learn more about financial literacy.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Alex?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]