[{"pageContent":"And really quickly, how does that beta system thats in beta kind of work? How does somebody calls in or they schedule a call and then they receive a call? And whats that call experience like? Is it voice?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Its up there. The first thing is solving this membership thing, which I actually have. It kind of solved. Its more of like I have a couple of options of it. Im kind of just filtering through, which is going to be my best route. But once I implement that, lets say then it becomes pretty high. But I would say its probably about a month to two months out before Im like done with my garage storage, with website. Got that going. The affiliate program is running, I got people doing the outreach and then I got the membership figured out that selling that course and that program is next in line. So yeah, a month to two months out.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"In two weeks?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Got it, okay. And on those high ticket products youre selling like the $2000 to $500,000 products, obviously it probably varies based on the product, but are you interacting with those customers? Is that like a back and forth?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"It good deal. All right, Tim, well, I will talk to you in two weeks. In the meantime, cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Youre not having closed calls on the garage door thing. Youre just kind of doing some kind of like customer service question answering in that scenario.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I havent totally started selling my courses. I have started to build the community. Right now Im just letting people join our Discord for free. Thats my top priority really is getting setting up how I want paid membership for the community. But the course I was looking to sell the high ticket drop shipping course for $3,000 plus probably a tiered system of monthly subscription membership to be a part of the high ticket drop shipping discord community, among some other freebies and stuff with that, but about 3000 for that. I was going to do an affiliate marketing course where it was free and then an advanced affiliate marketing course thats not free. And I was thinking maybe $500 or so for that course and then a low ticket drop shipping course print on demand course, which I havent thought how far, what price I want to do or what I maybe want to offer for free and when it becomes paid. Havent thought of that. And then Im creating Marketplace and creating a community courses as well. So thats my courses now other people. The high ticket drop shipping course I took was, I dont know, I think it was about $2,500 or so when I bought it and I was going to offer those guys to be able to sell it on there. Theres a couple of other high tickets, two others actually that I personally know are reputable that I would be willing to sell on there as well. So wed have starting off about four high ticket drop shipping courses that are all thousands of dollars, a few thousand dollars each ranging and yeah, thats probably.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Jackson, okay, cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"I did see one where you could record an hour. You could probably do more, but it started with an hour, and then just based off of that hour of speaking, it can put together your words with your voice and really make it intuitive.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. As long as it was sent, I should receive it. I dont have any problems with that email ever, so should be good.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Yeah, so the thing that I saw, its had like five AI tools in the case studies using them or something like that. And so I was really just curious what AI tools it was you guys were using. Im pretty trying my best to stay up to date with all of it, but I mean, obviously its coming out faster than a human can even keep up with, with all these different tools and integrations of them. But Im pretty familiar with a lot of options and I basically just wanted to see like, oh, what is this five combo that theyre talking about? I wonder what just curiosity, I guess. But I do ecommerce. I have a bunch of websites, and Im trying to consolidate right now, but I have everything from high ticket products and Im talking products that go upwards of like half a million dollars. And I basically clump high ticket from $2,000 to a half a million. And those are physical products. The half a million stuff is like commercial playground equipment, like an entire city playground all the way down to my best selling product, which is a garage storage lift, which is $2,000. And its still a platform with a motor that goes up in your garage. And then I have other websites that are like print on demand and low ticket items and then affiliate marketing stuff mostly. Well, affiliate marketing, it will be physical products, usually low ticket or software. I have a whole nother brand thats all like software and courses. And I have a marketplace, actually. And Im going to be rolling out more Marketplaces that are niched down. But were going to do both physical and digital products with Marketplace and basically have I dont know if its going to be on the same website or if Im going to break them out to different websites, but Marketplaces for kind of like fiverr where people can sell their services. Marketplace kind of like Grin, where people can sell their social media, influencer UGC content. And then what else? One for courses. People can buy and sell courses and review them and join a community.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So it would be both. It started with me creating my own courses on how to create a marketplace, how to do high ticket drop shipping, how to do affiliate marketing, et cetera. But I dont want to be a guru. I dont even like being on camera. And thats the best kind of way to promote that stuff. So I figured since I know how to make marketplaces, its going to start off as just private, where you have to go through a verification system, through us to be able to sell your courses on our site. But it is still a marketplace where you get your own dashboard, you get your own sales, you can change your own prices, all that. And I was just going to promote that and then feature my courses at the top of the drop shipping page, the top of the affiliate marketing page, so that Im kind of scooping most of those sales. But technically you could buy anybodys drop shipping course or anybody verified or approved.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"17? Yeah, its one every other day. Yeah. I just need to get my content going, which Im in the middle of moving and traveling to move. So Im a little caught up this week and next, but as soon as I get settled in a week and a half here, Im going to start pumping out content and stuff like that for YouTube and TikTok and all that. But I want to hire a team. I just want to film my shit and just dump it into a file and have somebody else go through and edit it and all that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Probably a bunch of courses that are in the hundreds and then the thousands, but not tens of thousands of dollars per course.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, like I said from the course, nothing yet because Ive only given away free memberships to the community. The community is just for making money online. Its not necessarily just drop shipping. However, like I said, I do plan on selling that for $3,000. Ive got all the proof in the world that Ive done millions of dollars in sales with this business model. So well see how that goes. And then Im going to do lots of YouTube content and give away some stuff, a decent amount of stuff for free to lure people in. But I havent actually sold the course. Its not actually a completed product yet.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hi.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, cool. Thats very interesting to me.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"And the case study stuff, what I saw with the five tools, I havent dug into the email that was sent to me, but am I able to check out those five tools?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I know, its so nuts, but thats what I need. Thats exactly what I need.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"You too. Bye.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Probably, lets say two weeks.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I just saying I did sign up a bit earlier just because it came.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I dont know that Ive received it, actually, but either way, Im going to.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I definitely see no reason not to. I mean, at $3,000 a pop, its not that many I need to sell to reach 50,000.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Cool, thank you. What was your name again?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Prices.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Days for me to get my whole desk set up and everything like that and get situated, but Ill be in the new place in about a week and a half.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, cool. And will that have any information about what you were saying is in beta?","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"And that tool, I know its not on the market yet, but that sounds like what I would be after almost to implement with all of my projects eventually, obviously starting with the most important two, but thats definitely what Im after. It sounds like something like that right now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. And thats what I would like to solve the most is I have a website, yblgoods.com, and its in disarray a bit right now, but I just went too big. I had tens of thousands of products on there. It became impossible for me to keep prices updated, inventory updated, information accurate and original and all that. Of course, creating original information is simple now with chat GPT and whatnot, but price updates, I mean, Ive solved that too, but not in an efficient way, because the way Ive solved it is to have AI bots and scrapers that monitor a website and when theres a change, it will notify and automatically even update. But the problem with it is it has to constantly be checking those websites and theres thousands or hundreds of websites that I get products from on that site, on that brand. And just to beat the cost of just checking prices all the time, even when theyre not changing, is going to rack up a bill that just doesnt seem to make sense to me. So my solution for that, at least this needed to happen a long time ago, was to just take that best product from that site, which is that garage storage product, and making its own website for it. So thats where Im at with that. I havent made the new website yet. Its going to happen in the next Im traveling, so its realistically going to be done maybe in three weeks to a month, as long as theres no problems. Sometimes things arise. Its my best selling product. I do have a fair amount of communication with people to be able to sell it. However, I feel that the reason a good portion of my communication exists is because of lack of information on the site and lack of demonstration and lack of FAQ that really pinpoints things. So thats what the new website is going to do. Instead of a navigation that has tons of different product categories, its just going to be one or two product, fairly low end, maybe 20 products total with some accessories. And the navigation is going to be very straightforward. Why buy with us FAQ, videos, blah blah, blah. So that should help eliminate some of the calls and stuff that I get. But the other problem with it or thing to work through is that the clientele is also older. Theyre usually maybe 65 35 on 65% being 70 years old ish and the others being some young guns that are financially well enough to buy a $2,000 kind of luxury toy luxury tool. I feel like some of the communication is just because these people are old and some of them even just will call us just to see if a human being picks up or what thats like. So I really am after a system that can answer questions and I can load it up with information. I do have one chat bot, one that seems fairly all right, I havent tried it yet, but load it up with information, it can answer pretty much most questions and then at some point if they just absolutely need a human. They could schedule a call or request a call or something. I dont so much want to have it anymore where they can just call. I dont know. Its to be determined, but yeah, I think theres going to have to be some communication. But I think a lot of it can be eliminated with, one, with my new website, two, with an AI system that answers most questions.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]