[{"pageContent":"It depends. We like to be around at least 60, but 80 or 100 is always nicer. Just depends.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, Im basically just going through and AI stuff is popping up left and right right now. Just keeping up on who has what products and whats working and whats not working and what theyre still trying to figure out. It basically eliminated my writers and a bunch of people within the workflow pipeline with AI already. Im automating everything. I basically dont want to work. I just want to tell the tasks to do themselves. Tired of paying people to do stuff and managing. Okay. Our different verticals, if we have solar leads, mortgage leads, life insurance leads, stuff like that. Right. So we sell the people who call centers, who call other people and try to sell them that stuff. So were not actually making the calls, were just providing the data. Okay.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Solar mortgage. And those are our main ones. Solar mortgage. We have some other ones. People call us for various things, but thats mainly it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I havent even had a chance to look. Ive been so busy.","metadata":{"fillerID":16,"fillerText":"Ok gotcha","category":"B"}},{"pageContent":"No, I mean, theres three partners in it, so it gets whacked between the three of us.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, a month.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well leave it out. Yeah, thatd be super easy. Well go all day long.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, go ahead. Im an open book. All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thanks, buddy. Thank you, sir. Sorry about that.","metadata":{"fillerID":39,"fillerText":"Yeah","category":"F"}},{"pageContent":"Well, it doesnt make sense because its all a game for idiots, you know what I mean? Its like people dont understand its all a show. Yeah. You know what I mean? So its like theyre going to sit there and go, oh no, climate change. Its like you guys are just retarded. Banks would not be giving the Obamas a mortgage for their Marthas Vineyard giant crazy mansion thats sitting on the coast. If that was all those mansions are building in Miami and redoing all those giant buildings, they would not be putting out hundreds of millions of dollars for that. Its like Al Gore would not have a Malibu beach house worth 20 million. Right? Yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats flying around.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, it just depends because different leads have different margins on it, different types, because sometimes its just straight leads. Right. Were just selling data and we go away. Sometimes theres an operational process to it where were still like, live leads. Right. So its like as the leads coming in live, were like, handing it off to the other people.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"The way the farmers are getting hammered right now, we have some pretty easy ears. They want to listen. They want to hear what we have. Because opposite of what the government is saying when were talking to these farmers, theyre getting hammered. Its like every which way they turn. Theyre saying they have to use biodiesel now so they cant use whatever diesel they have. And thats costing them a ton of money, plus Fertilizer. And everything went up skyrocketed because of all the bullshit Biden has been doing and then all the shit thats going on with the water right now. And then Bill Gates just bought up half the farmland. And China is coming in through Little LLCs and trying to buy up other farmland and stuff like that. So its like these guys are getting pushed out and local authorities are actually helping these funds and China and all these other crazy people who are buying up all the farmland. The local government people are helping them because theyre funding their political campaign. Yeah, its crazy. So when you get out there and youre trying to get this stuff done, its like theres real rest up there, right? Theres like a community of people starting to get together to fight all this stuff. And getting it with them is pretty easy for us because we hate all this shit anyway.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And can you give me like a 30,000 foot view of your plan to get leads and then convert them into clients?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Good, sir. How are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, different partners and different businesses.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Johnson johnstonston. Okay. Yes, sir.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Communism is terrible.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Its like a rice kernel that you put in the soil, and then when the water hits it, it sucks all the water in and then starts slowly releasing the water. So you save water from evaporation and the loss in the soil and all that, so youre getting more water to the plant. Plus its holding all the nutrients, and it has nitrogen in it too. So its nitrogen adding nitrogen to the soil while all thats happening.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, my goal right now is going through every process that we have in the entire company and automating everything as much as we possibly can, even if its just prompting right. Where its like its completed all the process, and its just sitting there nagging someone until they complete the prompt to get the next bit of information to continue the process.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thats the whole reason we do what we do, right? We can do what we want all day long. You just got to put in the time. It all boils down to have freedom and cash to back up your freedom.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"They wont do anything until Im already sold on it. I need to look at the video and go through all that and make sure its good first. Especially the main guy. Hes crazy, alpha and like on steroids, hes crazy. Hell go fucking nut if I put something in front of him thats stupid. Okay. So Ive got to look at it, evaluate it, get it all worked out and negotiate it down as far as I can. And then if everything is good and I feel warm and fuzzy about it, then I present it to those two. And then we either strike my law iron hot, make it action iron about of it, or we say no.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yes, sir. I like it. Whoever you put me on the phone with, make sure theyre not woke.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"How much figure on the solar side. Theres like 10,000 companies in a space here that would buy from us. As far as I go. I keep pushing and pushing and pushing until the limits are to the and thats what were creating all the automations and everything for and trying to figure out how best to make everything efficient so that we can start creating more revenue at the point of automations and all that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I present them a plan of how were going to use it in the business and why I need to spend the money.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Las Vegas.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Oh, yeah. The machinery is on the way from the Czech Republic right now. Its going through shipping channels. So thats going to end up in Sacramento. We can start producing probably here. Next quarter. Better be next quarter. All kinds of universities involved. The Feds are involved, even though we dont really care what they think because their data is terrible. So were putting that out. So thats going to be another major initiative. And thats mainly getting out to farmers and anybody whos growing anything, really.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, thats cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Okay, cool. Ill check out the video when I get it.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"All right, check it out.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Right now we go and collect data. We use different data sources to collect solar installers, depending on what vertical. People who buy that sort of data, the call centers, whatever, and we go to them and we just start cold calling the bejesus out of them and emailing and text messaging them, hitting them up on LinkedIn, like every form of communication that we can find on them. We just hammer them until they get on the phone with us.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And then we have another product called its a hydrogel product that is for agriculture and manufacturing that you put the stuff, these little rice kernel looking things in the ground with your plants while youre planting them, and it holds the water and doesnt let it evaporate and slowly releases it with nitrogen into the soil, which is going to be crazy for agriculture. And then we have a couple of charities that we work with once for autism, so we help them with different products and what were working on. And then we have an event series with electronic music, house music, lots of different stuff.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"In that too. Everythings whacked right. With all the COVID hopes and all those insane idiots who shut us down and made us do all this dumb COVID shit, you know what I mean? That crushed everything. And then with what Congress and Biden is doing right now, thats making everything nearly impossible, especially on our solar side. Our solar side. Now theyre wanting to put tariffs on Chinese solar panels, but they dont want to help American manufacturing. Theyre just creating another problem.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats not you. Whoever told you to put the fucking.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"The hydrogel.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Not why I need to spend it. Why theyre going to spend the money. All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"The way we do, we have operating account stacked, and then weve got the main account. And when we need money, we need it. If weve got to pull back and get cash from anybody, we can. Its just a matter of who we because with other entrepreneurs in our circle, every once in a while, everybodys calling each other going like, fuck, I need ten grand. This client didnt pay. I need to get this done right now. Im going to lose if I dont get this done. Float me ten for right now. You know what I mean? Yeah. We have that network available. Its just a matter of when the needs there pulling back and dealing with it.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yeah. Seriously. My buddy, he just bought $600,000 in property in St. Keith no kidding. If you buy $600,000 in property at St. Kitts, they give you a passport. And he also works for Ford, so he just made a deal with Ford so they can redo all their new government vehicles are going to be Ford. So he has government protection right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Is that no, thats gross.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right. Okay. All right, cool. And who is basically handling sales right now? Is it a bunch of people in the call center? Have you got a small group that handles that?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"So youre just creating a giant negative and putting that because my blood pressure went up. To think about it, I just looked at my watch and my stress went from green to yellow just because of the absurdity of saying something like that.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Is impossible when youre working with a bunch of Communists that want to take away everything. Yeah.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Which is 150% more than what our high goal is right now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And what is your show rate on those booked appointments?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Oh, no, were just getting rid just figuring out what our outreach is going to be with that and what the easiest way to reach all of them.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Ill be there, but Im not fucking paying. Thats completely stupid. It almost makes me want not even have a fucking meeting. Yeah, whoever fucking told you to say that, you should go and touch them on the fucking neck right now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"No, they wont. Theyre not going to do anything until after Ive seen everything.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, thats cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Yeah, pre pandemic, when the economy was good and we had some good things happening in the government, everything was good. Then Biden won and everything got destroyed.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Four or five? Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Woke. Make sure theyre not woke like a crazy liberal thats going to fall apart if I say anything crazy. I doubt if thatll happen.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Okay, shoot me over that.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Im sorry, what?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"I want to hit a quarter million within the next quarter. So thats adding more seats and stuff like that, too, because we just fired most of our call center staff and got some good bangers, and were just going to start hiring and firing until we just have people who can come in and close like crazy.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, and your ability I cant even listen to anything youre saying right now because of that $100 thing. The ability to collect on that is impossible. Well, whoever thought of that and said it to people is just a freaking idiot. You could never collect on that.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I got it. Do you track your ad spend, Im assuming, as to whats working, whats not working and making changes.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"That should be our average month.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Were selling anything from basically our minimum is like, $5,000. Weve got clients that buy $20,000 worth of leads. It just depends on the clients. 1500 to 3000 a week. Clients are bread and butter. Those are the ones that pay our bills.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Terrible.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"So thats what Im looking for, and Im super interested in running Google Ads and other ads and using AI to monitor how each keyword and all the different little things and then sit there and coach it so that were getting better metrics. Right. Okay. Before I started doing got in and started doing a bunch of stuff a few months ago, theres no SEO or none of that. We need to have social media for the solar stuff, so Im throwing that all up right now and just running with that. So its an interesting time to hook up with an AI or something like that that starts some automated things because its fresh meat.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, yeah. So crazy.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah. All right, I got to go. Can you email me the meeting?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, Ive been here my whole life.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"All right. Yeah. Thank you, sir. Thanks very have a good day.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, if you look us up online, theres no complaints. Nobody complains because we go in there, we look at whats going on. If they get some bad leads, we replace them. If theyre having problems in their operation, we help them figure that out. Because if we help them figure it out, theyll buy more lease.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Monday.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Pacific.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"What is that? My holding company. Oh, okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So were starting to pick up.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}}]