[{"pageContent":"Rather not even have to do real estate again if I didnt need to. Right.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"So I do a few things and I dont know that Id be a good match for you. I wish I was. One of the things I do my real job is I am a Realtor in New Jersey and my wifes a Realtor in Texas. Were living in Texas now and I work as a wholesaler. So Im trying to procure off market properties that I can buy and then add a small finders fee on it and then sell it to people who like to buy and hold or flip or any kind of investment. So thats my day job. The other thing I was dabbling in and frankly I got out of it was, yeah, I kind of quit pursuing it was I beat heart disease through lifestyle changes after I had every major cardiologist tell me I needed a double bypass. And so I have been able to help other people if theyre willing to do the same thing because its very easy. Anybody could do it. You just need to know what not to eat and what to eat. And its pretty simple. Most people dont do it because theyre overwhelmed, and they dont know how to make food that tastes good, because when you take out the stuff thats bad for you, for most people, it tastes like garbage. So what Ive done in the past for people and I didnt even collect a paycheck for it, was Ive helped people to clean out their houses with all the junk and teach them how they to make their life. Make it hard for them to cheat. Right? And then show them how to make good tasting food and what exercise you could do to kind of get back to where you were when you were healthy. The challenge I had with it when I pursued it was I wasnt getting anyone that had either the will or the ability to pay me pretty much anything. And so I kind of bailed on it. There was like some coaching company that wanted me to join their thing, and they promised me, like, I dont know, it was like 30 grand in three months or something. I was excited about it, and I said, Well, Im not there yet. And they said, well, we like what you do and what your story is, we can help you. Then they never called me back again, so I just kind of bailed on it. Jackson so thats where I am now. If there was a way for me to get back into it where I could be more confident that I could make a living, then I probably would do it. So thats where Im at.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Shes not with me right now. Hopefully it will be okay.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"So $1,500, would that be like an annual subscription or is that a one time fee?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Whats up?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I front like, a fun sold band. Its called Buster.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sorry, Jack.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"My wifes a degenerate gambler and Im a play in the sky kind of musician knucklehead, so were dreamers. But the thing is, I got to make money would have to be strong, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I already have a private Facebook group.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"That I dont know.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Probably just above.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Were out of outside of Austin.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Good. How are you doing? Boy, you guys dont waste a second, do you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, Im in Bastrop. You know where that is?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Or maybe I could do like, the first 1500 for lifetime membership and the first three months you get X amount of one on one calls. Or maybe I could do it six months. You get once a month, one on one with me.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats the hardest part, Jackson, of this whole situation. Because I guess the biggest value in what I could be doing would be really the accessibility to me and just to be able to have someone that you can kind of consult with on a regular basis, the information is not you dont need a really thick book. The book I used to do this was I read it in 2 hours. So its not like theres I dont know, you know what Im saying? Theres not a lot of information and pretty much anybody could do this. In fact, the information that I have to give anybody could just get on the internet if they had some curiosity, which is probably most coaching plans.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Give me 1 second.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thing is, I need to squeeze in a two and a half hour slot.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, to be honest with you, at this point, because I just moved to Texas and Im not licensed here as an agent, my wife is, but Im not really generating any money to the household because when youre doing wholesaling, it takes a while.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, you guys called the minute I clicked on it and then Im working so I cant really talk too much right now. But I havent even looked into what you guys do yet. What is it?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, Id love it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Same here. Jackson thank you, sir. God bless you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Even if I was making enough just to cover the rent and some of the bills in the beginning, Id be very content.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I have to both be on board, but yeah, right.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, I paid for a course. I dont know if you know Graham Cochrane, but he made millions doing a music production course. And then after that, he decided to kind of got bored with that, so he kind of sold part of it, and he has a course where you can take and you can build a business, an online business. Basically, what were talking about. And he kind of gave me everything but where Im supposed to find my clients interesting. Thats the most frustrating thing. Dude, come on, man.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I think Id do that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So would you do it? I could start out like say start at 1500 for six months, but then you could have a lifetime membership to the Facebook group and then at some point I could change the offer. Is that credible or is that kind of trappy?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Last year was pretty we didnt do have a good year. It was probably about 100.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, you know, the other thing is as Im talking to you, Im thinking about it. I think the lifespan of a client would probably only be a year or two anyway because once you get into this lifestyle past six months, you probably wouldnt need to talk to me. So even if I did a lifetime membership for X dollars and the first six months are intense, I dont think Im going to get so busy because what will happen is my clients will kind of taper off.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"At that point, I think Id be comfortable, but I still wouldnt let off the throttle. Not that Im not all about money. My Walk is with Christ, and the more that he gives me abundance, the more I can share my cup with other people. So thats my why, thats beautiful, Anthony.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, I mean our conversation would have to be Monday afternoon.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Wow, thats high.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Cool.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"What is it that you all do and how can you make me money?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Have to be a discussion with my wife. But 500 probably the very tops right now. Unless we would need to have a really great plan going forward to sell this not only to my wife, but to myself, you know what Im saying? Because literally Im only in bastard. This is my first month here and then I had to move two horses here. I spent a lot of my savings getting here, but I got here as fast as I could, as they say. Right, right. So Im a little bit strapped right now with cash. So thats why I almost didnt fill out the form because I didnt want to waste anybodys time. But I dont know, I was curious.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I love it. Thank you.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Thanks. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I could talk to you in a minute. Okay, hold on 1 second if you could.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Jackson. Good name, Jackson.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah. All right, my friend. Im all here for a few minutes.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thats amazing.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Hello, anthony speaking.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"It was pretty good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Just sent you a text, the phone call. The 01:00 meeting is like, what, an hour?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay, sounds good.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Checking right now.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, for sure. My wife and I are a team.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So your name is again, sir? Im sorry.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Whats a good time?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"It probably Monday morning.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"How about 01:00 P.m.?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yes, sir.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"And they can have lifetime, they can come on the Zoom calls whenever they want. And I would do like a once a week group Zoom call and we would just kind of talk about a topic or anybodys hang ups or basically you could just come on and we have a group kind of session.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"In the morning sometime.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Well, I also used to be in the music business, and so we used to do a lot of that. I was around when they first started putting funnels online, and so Im very familiar with I dont know if the marketing has changed much, but Ive taken classes on how to build funnels and how to do landing pages and what verbiage to use, and so Im very familiar with the process.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I would like it to at the very least, be like, ten K a month, but thats certainly not near what my goal would be. Ive got a lot of plans, and I would like to at least be making $500 a year.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]