[{"pageContent":"Could you explain maybe more detail?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah. So I was I was trying to see I mean, it came up my YouTube, and I was curious, but yeah, I dont know. Im not sure if Im really interested anymore.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right now Im currently doing two CRM build outs and were charging a little bit less than $2,500.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Not enough. Not a lot. Not enough. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I still work for a consulting firm, and I do a lot of the upfront sales calls and marketing stuff and then building up sales calls, and then I have a person that does some of the back end building.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Youve got organic wait, sorry, so its a software tool? Is it a software tool or what is it, air AI?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Oh, no, I dont think I got to it.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"A little bit, but not really well, I guess. What do you mean?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"So its all in, but it takes me about a month and a half to do build out.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Want to scale, but also because I love automation and AI, finding ways to layer that into my business. I think initially it was more so me getting case studies myself and figuring out what works. And so now that I feel like I found something, finding a way to grow that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Not a lot. Yeah. I think I definitely would prefer more.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I still have my nine to five.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Its currently two.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"So its been less than a year. So its less than a year. Fairly new. I have clients and a contractor that helps, but in general within a year. So new startup.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"And then that allowed me to transition out of consulting to do my own thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I probably have to do a month. I would say on average. Lets see if I did average, like 1520.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Actually, let me search and see.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, I havent actually done that. Actually, one of my friends has used white I mean, go high level, but I havent used them in particular.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"And the case study, is that like a client case study or yeah.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"So I have a tech startup. We do systems and workflow automation. So more so, like, CRMs and marketing campaigns appear, those kind of things?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, below that. Yeah. Ten k a month. But I think for me, ideally, 20 grand a month, 30 grand starting and then obviously growing from there, ideally, the sky is the limit, but realistically, first year in.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So how does it work? I guess, would I be paying for a service and your people are using the software?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Or usually like, a few a day. And then, to be honest, lately I kind of scaled back on some of the cells just because my nine to five started to pick up a lot. So if I could have something that would be in the background that would help out. So you have to tell me what you do, what you guys do.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Because Im so early in. I do, but what do you mean in general?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, at the startup phase right now, in a year, Ive been averaging Im below ten grand, but I think ten.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So my corporate background essentially Ive been doing yeah, I did like the big four accounting track and then worked as an auditor, business process auditor with one of the big four CPA firms for like ten years and then during that time started doing automation RPA more at the corporate level.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Their sales funnel process to be automated. So thats what were doing in this case. And then with the two that I have now and then one that I had before, it was more so using like Zapier, they wanted to use their existing tech stack, but connect it right coming in, auditing processes, streamlining it, making it more effective and then layering in automation.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I do.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. Wait, so I dont want to waste your time. I dont think Im interested. I appreciate you guys reaching out.","metadata":{"fillerID":39,"fillerText":"Yeah","category":"F"}},{"pageContent":"Hey. I think you guys keep calling and, like, hanging up.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"I got something, but it didnt explain what it was. It just was like it seemed like it forced me to give you guys my number so that you got to talk to you, but I didnt see anything that explained well, it should have.","metadata":{"fillerID":38,"fillerText":"Ummm yah","category":"F"}},{"pageContent":"Im good. How are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"It could be a few things. The two that I have now is I come in and then these two in particular wanted their systems to be streamlined and they wanted their sales funnel process to be automated. And so we use unauthoted? No, they wanted them to be automated.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Its not automated. I mean, its like social media and stuff like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I think I said but yeah, they.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}}]