[{"pageContent":"Im sorry, hold on just 1 minute. Ive lost a Yorkie, Lexi. You want a treat? Okay, I found her. Sorry.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"My husband said hell sit in and listen to you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Say that again one more time. You break it up.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"I dont really know what it would be because we have different things going on. I do some court reporting on the side for the company that bought me out, which is not great. Its okay. But we have rental income coming in from our vacation rentals and our real estate. We do midterm rentals. I dont know what to tell you. Im not really sure.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I would love to do that. That would give me a lot of I think that would be something that I would definitely be interested in because I like building businesses. I want to take something from zero and I want to make it a fortune whether I do that for me or somebody else, as long as Im making money.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right, right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes. Abextrainc.com god.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, so that means I have to watch the video today and then be prepared to talk to somebody in the morning.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Last name Jackson.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, I provide extra instead of ordinary.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I mean, this AI software is blowing my mind.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Call with you, be sure I get it so that I know how to get up with you.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, its probably between 102 hundred.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I mean, that makes sense, but then I dont have a plan of what to sell them.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"And then the other stuff, I am Im a certified paralegal and a certified court reporter right now. I cant do any court reporting for anybody until January, other than the company that bought me out. But Ive got a lot of stuff going on in my head. Im a true entrepreneur. I love building businesses. And so I saw your little ad and I just thought, okay, what do you have?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hold on just a minute. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay. That makes sense to me because Im not scared to talk to anybody on the phone.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I normally am in North Carolina, near Raleigh, in Wilson, North Carolina.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Possibly.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, I think my problem right now is the avenues that I have found that I do think I can make that kind of money. One is I think its going to take me some time to get there. Like selling the AI transcription software. I cant do that until January because I have a non compete.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Thank you. Lexi. Come on. Okay. I heard you. Lexi. Come on, baby. Okay. Thank you, Lexi. Come on, baby. Come on. Lets go get his marco. Come on, tree. Come on, Lexi. Okay, sorry, were at our vacation house in Florida, and one of the neighbors said your dogs have to be on a leash.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Okay, well, so Im an entrepreneur, and Ive owned several businesses. I have real estate, vacation rentals. I have three vacation rentals that we rent, and we usually go through evolve, and theyre listed on all the sites or whatever. So on my social media, I know AI can write ads and video ads, text ads and all this stuff, but what Im doing right now with General Chat GTP is Im typing in things, theyre giving it to me. Then Im saying give me hashtags. Theyre giving me hashtags. And Im having to put it all together and create my own Instagram ads or Facebook ads. So I know theres got to be something that can help me just do an ad very without me having to copy and paste and do all the other steps that Im doing right, like integrate my pictures and all that. So, one, Im looking for something like that that I dont know if you have anything like that or not. Number two, Im also getting ready to, in January, Im out of my non compete for a court reporting litigation firm that I sold, and Ill be able to be a free agent again and start up another business. And Im considering selling AI transcription software, so thatll be another sales thing that Im going to be doing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"My process to get customers on a consulting basis. I know about the traditional means that people are advertising, like Instagram, Facebook, all those things. I understand that. I understand email marketing. I understand there are different avenues to market something.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, Im excited. And so Jackson, are you going to send me the video from email or what?","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"If I wanted to? Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Lets do it for ten.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"So are you a partner?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"With you, I would.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Really? Okay. And so tell me the name of your company.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I really dont know. Because I dont know what Im talking about. I dont know what were talking about. Are we talking about I dont understand what you have.","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}},{"pageContent":"I dont really want to set anything until we leave here and go back home, but if I have time to watch the video, I could definitely watch the video today and make a note and then maybe we could then schedule it. What do you think?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Its really hard to say. We havent done our taxes for this year. Are you saying income or revenue?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Right now Im in Kissimmee, near Disney.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Running, like, Instagram ads and things like that? Yeah, I mean, Ive run Facebook ads. Ive run sponsored ads on Facebook, Levi. I have run some ads. Yes. Im not an expert at it, but Ive done it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. We lived in Lothian, Texas for about three years.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Of course.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Hey.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont because Im actually on vacation and today Im working today, but Im supposed to be on vacation over the weekend.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Lets book it for ten.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, now tell me your name again.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay, so let me just back up for 1 minute and say this. Okay. If I were to buy something that I feel is a proven method in other words, I dont mind selling my consulting services, but I need a plan. I need a plan thats already developed, thats already ready to roll out, and I just can sell it. Thats what I need.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So is Air AI, is that a startup, too?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Hold on just a second. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I can do sales calls. I just dont have a clear picture of what this all looks like.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, we have one daughter we live like, 40 minutes from, so we wouldnt leave her. Well probably go wherever she goes.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"How about 930?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Its insane.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im from what Im understanding, I am more of someone Im very open to starting a brand new business. Im very open to earning as much income as I can. I love sales. I love marketing. So I dont know if you have an idea of what something I could do to use your product to achieve that. Im open to hearing it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Ive created surveys this morning, introductions. Ive just created all this stuff. Hashtags articles. Ive already created all this stuff in seconds.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"How many employees do you all have?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay, thank you for your time. Jackson, it was nice talking with you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, whatever. Okay, go ahead.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I dont think Im limited. I think if I found something that I believed in and that it had proven results, I can have my own funding.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hey, Jackson. Its good. Look, I am so obsessed with this AI. Stuff.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I mean, Id like to earn 20 grand a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So Im open to selling something else that would not make me compete against the company that bought me out. But I dont know what that could be.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So how long have you worked for this company?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Equity? You have equity in the company? So youre part owner?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Oh, my God, Im so obsessed. So I can tell you a little bit about my say, help, and maybe you can see how I might or might not fit in with what youve got going on.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Im at the point right now that Im getting ready to go out of the gate and do something else, and Im not quite sure what Im going to do, but Im so ready to dive in and work. Its killing me.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, so I would love to help other people build their businesses. Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, look, can you go ahead and send me the emails and make sure I get it?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Hold on just 1 minute. Okay. Could you do it tomorrow morning?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Its probably 800 or more.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"If whoever doesnt get on board with this, they will be left behind.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Jackson, I do know a lot of business owners, like a lot of business owners and entrepreneurs, so thats probably going to come into play at some point with this.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I mean, honestly, its about the money. But its not about the money for me. Its more about the challenge. Like, I have enough money because I sold my other business. I have enough money to be comfortable and to live this life fine. But I just want to make a lot of money. And the challenge for me is if I make a lot of money, then I have done something that was hard to do that I did. You know what Im saying? Oh, 100% the number. I want a big number. So I guess I said 20 because if I got $20,000 a month, I could do whatever I wanted without blinking an eye.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hold on. Im waiting for it to pop up. And I think I found you through.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Its a Latin term, AB extra. Means help from outside.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So I believe thats how because, of course Im liking all this AI stuff. So now thats all Im seeing. Okay, so here we go. I got your email, Jackson. So I am excited. Im going to watch this video and see what happens.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Hold on just a minute.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]