[{"pageContent":"Just has to be after nine. Yeah, probably my husband wont be here, but he does everything that hes not the leader of the band in this. That would be me, although he needs to be involved and Im going to have to get him involved, but hes not. Do you understand? In other words, at this point, hes still working as an anesthesiologist, but that cant last because were in our its not going to fly.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"He tends to be somebody whos a great facilitator, but hes not who starts things.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Now, in other words, theres a lot of stuff I can do, but Im not 100% sure where to go. But nonetheless, it sounds to me like this might be something I need to know about and might help me go where I need to go, which Im not sure where that is at this moment. Yes.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. It sounds like Im not a perfect fit at this moment in time, but this sounds like someplace that what to do, I need to think about. I mean, we have enough money to do something and we have plenty of time, but the world has changed quite a bit from what Im used to.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I should be okay by then. I cant do it now. Still. This has been horrible. But Im a lot better than I did. What?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Im sitting here looking at the computer and stuff. Can you call me? Do I need to speak to you then? Is this for something? What is this for?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"We do a couple of things. Number one, we have some house we renovate, and I do some interior design stuff. And were also physicians, so were kind of thinking about my husbands probably going to retire and Im disabled, unfortunately, I got hit by a truck and I have a spinal cord injury. So I figure out how to use our brains to make some money.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Anytime after like 09:00 in the morning here, Pacific Time. I dont know where you are. Are you in Colorado?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"So right now Im not 100% sure where I would go with this, but I probably would have. Sorry. At any rate, thats what were doing right now. We had a business selling dogs for a while, but it was too big a pain, so we stopped.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Time next week Ill be over this. Right now Im miserable and my head is hurting right now and Im not paying much mind to anything, but Im really interested in that. So anytime next week would be fine.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, my husband makes a lot of money. I dont make any money, particularly except for Social Security disability and some disability money that I get, except for this other stuff. I was for a while making a fair amount of money with this real estate kind of stuff, but right now Im too ill to do much of anything. So were used to an income of like 50,000 plus, but hes going to have to retire and I dont know how were going to figure out what to do. So were used to a lot of money. We have a fair amount of money to use, and we have two brains and we have three adult children to help us. I dont know where were going to go, but theres got to be a way. And Im sure if we just did something, wed be okay because everything weve done has actually turned out really well. Unfortunately, we were in that fire in Malibu, and so Im in the process of having to deal with documenting all that crap damage to everything from that fire that was in 2018. So thats occupying some of my time, but I have a lot of time and my brain still works. If anything, it probably works better than it did, at least at this point. I dont know what were going to do. And I just guess its kind of stupid to say you were interested in AI for coaching and expanding your business when you dont even know what youre doing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, that looks like its really interesting, but is there any way I could talk to you next week?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. All right. Well, at least this sounds really interesting. I dont know quite where were going to end up in the long run, but its got to be I mean, theres plenty of people who are making plenty of money and we have things. I just have to theres a lot of things we like to do, but Ive got to figure out what would help people and what would go the right way. So I was thinking about some medical stuff, because of me having a lot of knowledge in this and not any place to put it right now. I used to teach medical students and train medical residents and stuff like that, so Im used to that kind of role, and I like it, definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay. I have COVID and Im kind of sick youre calling me back because you called me last week. Right.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay. And then you can let me know what your kind of thing is, and maybe this will get us going somewhere. Okay, thanks. And.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, basically Im a kidney specialist. My husbands an anesthesiologist. And I was thinking about looking at people about how to prevent or keep that from progressing. Kidney disease, for one thing. I was thinking about Ive been writing a course on that. I was thinking about that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]