[{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"That doesnt mean I wont have any money soon, but, yeah, right now, its been kind of tough for me.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I saw this piece of land on Hawaii. Its, like, 450 acres for nine mil, and just, like to have, like, an artist retreat center and place for my family to retire. What is it? Okay. Thank you. I dont know. Ill take it. Appreciate it. I just got a free milkshake. I dont know. I wanted a milkshake. You mind reader? I dont know. No, Ive been waiting for 10 minutes trying to get one, and nobodys even looked at me. Ill take the milkshake, though. You want to hand it to me? Excuse me?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I made it a few thousand. I had somebody give me $500 for my album.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"What do you say?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Well, I mean, Ive already put about $20,000 into it, but I dont really have a lot of money right this second, to be honest with you. Ive been just trying to play catch up on a lot of things, and I dont like to work regular jobs, so I got a tow truck that Im getting some work done, too, right now, and I can typically make, like, $1,000 a day using that, but, yeah, right now. Got you. Ive just been literally spending, like, whenever I get money, its pretty much just gone already, because Im just trying to catch up on things that Ive neglected in the past.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Phil?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Its not good at all. I definitely got to work on that. I just kind of wasnt really very responsible. Ive had some substance abuse issues in the past, and Im over that now, but I wasnt caring about anything, and I wasnt taking care of my responsibilities. Got you. Yeah, my credit score got pretty bad there.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"One person for like ten songs, and I had another person give me 200. And Ive done a lot of street performing, and I would just be out making money in the streets in Hawaii and stuff like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right. Thank you so much. Whats your name again?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, sorry. No, sorry. Im at Cookout right now, actually. No worries.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Like, Im definitely trying to make millions.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, not at all.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Honestly, I havent checked yet. I was driving.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im good, how are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I dont want to interrupt you, man. I would like to get into this more, but Im like, I am a cookout, and Im trying to make an order real quick.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Hello? Hello.","metadata":{"fillerID":33,"fillerText":"Yeah","category":"E"}},{"pageContent":"You too, man. Thank you. Bye.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, Ive been looking into a lot of different AI stuff. Im trying to figure out how to I dont actually have the business going right. Im building it. I do music and stuff, and Im just trying to figure out the best way to market my music and artwork and apparel and stuff like that. And I guess my algorithm has got all this AI stuff because I keep watching videos about it, but Im just trying to get some stuff going so I can build a piece for my family and stuff like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, once I make money off my music and this project, then Im going to start investing in the other artists and start like, a talent agency. And then I want to have community centers in different towns and stuff like that where people can come in and theyll have all in house, basically build their own brands in the building. Id be able to do art, music and videos and whatever they really want to do and just help kind of build people up. Like, basically want to be the person I always needed in my life. And also I want to start scrap yards so I can save precious metals because obviously, were on a fiat currency anyways, and this whole deal with Russia and China, our money is not going to be worth very much here soon, and probably going to get digital very soon, right? All digital. So its only 3% of money is actually physical anyway. At least thats what I heard. And Im like, okay, so start scrap yards. Save the precious metals wanting to go digital. We havent scrap yards in every county, you know what Im saying? Could eventually have your own currency then. I dont know. Im on a recorded line. I dont know if I should be talking.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right. What kind of investment do I need, anyway?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay. Thank you so for reaching out, man. Yeah. Look forward to talking to you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, well, as soon as I get my truck back on the road, Ill be good. Thatll be no problem at all. Can I save this number?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Um, basically I just have my music, I do my copyright, my own publishing, and then I have art pieces that Im hiring different artists to do from all over the world or not all over, but like, Slovakia, Africa, Australia, and I have a few artists here in America, and Ive got music recorded. I recorded out in Hawaii, did my first album, then I went to Sacramento, California, recorded some music out there, and Im working on music here and just basically Im going to start marketing it soon. I just got to get like, music videos and stuff like that made. Im just trying to build all the business aspects before I start releasing, you know what I mean?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"All right, well, theyre still not even taking my order, really. I just got a lot of people around me, thats all.","metadata":{"fillerID":38,"fillerText":"Ummm yah","category":"F"}}]