[{"pageContent":"Right. I sold everything.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hey, what up, my friend?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, Im right under 20 people a month.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Those are what Im closing.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Im selling $3,000. Business credit services. Im doing that currently. Cool.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Right now Im about 15,000.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"It could be about, lets say, 220.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Im a closer, man, so thats no problem. The thing is this how much is your thing? I dont have 7000, $8,000. I can tell you that now. I wont even be interested if its that much.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thats a good month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That was after.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Is that what your AI is going to help me?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No sir, I dont have a month where Im not making anything. I guess that would be the worst.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Facebook and Instagram. Im getting ready to start up with YouTube.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It sounds like you are the real thing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im third generation money. My grandfather only lived to get 41 years old and had ten kids and left him 157 acres of land right here in Georgia. Okay? There was no credit, no slick shit. No, Im going to borrow here. He had to have the day, Im muttered, okay? I learned from that. And what you do is you instill that into your kids, and you have kids. My kids set around and sell property to one another, okay? They allow their businesses to sell to one another. Thats where Im at now. Im getting ready for grandkids and the United States, as far as Im concerned, Ive been here 60 years. Its going straight to hell. I dont care who you elect. Im not into politics. I dont even vote, okay? This shit doesnt matter to me.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"No, Im not taking all sales calls. Me and my I have two sons.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"New York, are you going to contact me before you call or what?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hey, I keep sending them the email. Thats the thing. Email. I have videos. Thats how I keep them. I keep them enthused. I give them more than they think that theyre going to get. Thats what I do.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats going to happen a lot, man.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"P.m. Eastern for 04:00.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I dont keep up with that, man. I dont even know because when they get to me, they pretty much its time for them to close. Okay. By the time they get to me, youve already came on the ad. Somebodys already talked to them. Sutter has already talked with them. They get ready to make the appointment. Im offering them a discount on my service before I even talk to them. So then they ready. Pretty much like what youre doing with me.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. I create my own economy, and thats what Im trying to do. I know if I can buy some more land and Im trying to buy land in the Caribbean and Africa.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Depends on which one that Im doing. Thats why Im interested in AI. I have several different screens of income. I have about four different businesses. Im a real estate investor too, and Im an insurance.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im going to sell whatever Im trying to sell its whatever Im trying to do the most. If Im working on some real estate, Im not going to be on the business credit right now. Of course I have it and I can give it to my other salespeople if I wanted to, but I pretty much like to handle it myself.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I might sub out some work some folks on upwork, man. Or fiber sometimes. Majority of the times, man, I have people with a pleasant voice, and I teach them a script, and if they hungry, theyll make money. Thats the way I do. If you aint hungry, dont come to me looking for employee. You can make a lot of money, but you go do some work.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"You must be FinTeching also.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Then. Im trying to grow and scale. You understand that Im at every end, but its my money. Im not playing with nobody else.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay. So the real estate, the cars are free. The real estate, any house I want to stay in is free. I didnt tell my kids, work all your life and buy one house. My pop didnt tell me that. He said, get you three houses and get you three people paying off. Then guess what? You wont have a house. Now I know I can afford free. You dont tell your kid to buy one house, hes going to struggle, especially if hes going to do it for 30 years. If hes on that path. It dont take 30 years to pay for a house. It takes 30 years to lose a damn house if you keep paying on, its ridiculous. And you can get other people to pay on it. Okay. I dont even have to close it in my name, man. I can close it in my corporation. They dont even know who owns it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont even keep up with all of that, man. I dont know. I know this. Im going to spend two grand pretty much that month. Its going to be 810. Twelve. Its going to be something like that.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"737 30.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"50,000 and up.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"I guess nothing.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, Im a closer.","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Right? No, Im helping them, but I have my own sources. Im not just talking to them. I have my own people that are funding them.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"If its going to come in off of an ad and theyre just going to call. I told you again, by the time they get to me, man, they pretty much going to be in the loop by the time I talk to them. Other than that, I dont keep up with those numbers, man. On how many turn down. Thats not my job. Not concerned about that. My job is to make those sales and keep shit coming in.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Or theyre just interested. Business credit is foreign to a lot of people, man. Its a foreign subject. Theyre just not founding out about personal credit. And thats nothing. If you think you got 800 score and its so much, tell you what you do. Go buy you a card, watch what happens. Listen to me. Im going to give you a quick answer to everything for me. I dont buy calls in my personal name. I buy them in my business, and I write them off on taxes, and I drop them onto theyre free real estate. Its going to be somebodys hurting, getting ready to lose their house. Its taxes or its something. When I buy, its a situation. You got about three weeks. Are you going to be at your house? Im going to buy it. Im going to rehab it. Im going to refi it. Im going to slap it on airbnb. Im going to rent it out by the road. Thats me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Realistically? Im 60 years old, man. Youre not going to excite me because big houses, Im downsizing, Ive done all of that. The Mercedes, the Lexus, the BMW, everything that you try to say, Ive done that, Im trying to go and buy me 100 acres in different countries.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Really, man, its going to be anywhere from three to about eight.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Go ahead.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Of course. I wouldnt keep doing them if it wasnt profitable. I would change something if its not profitable because its not working if its not profitable.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I buy a car and put it on Turo. I put on my own rental company. Okay. That doesnt excite me.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Business credit? I get credit for businesses, people that own businesses.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im up at 04:00 in the morning.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Of course. Thats pretty awesome.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Man, Im going to try to talk to at least Im going to talk to somebody every day. So its going to be at least 30 people.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Makes sense. So they either get tired of me or Ive worn them out, or they go say, hey, stop.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I would say 6000.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes, I do.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Come on, man. If I couldnt get it that way, I can go get it on home equities. That I havent even used. Thats no problem for liquidity, unless you got a million in cash, not no assets.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Im going to say 30%.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I dont keep up with all of that. Im not in my need. I look at the big picture. If Im losing money, then Im going to stop what Im doing. Then I reset everything. I dont try to tweak. Why? Because I know everything is up and down and its fluctuate. And especially if youre doing a business thats seasonal sometimes, and then the economy, it goes off. What other people think? If they say everything is good, theyll spend some money. They say its bad, they wont spend some money. Do you have some damn money? Thats the thing.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"For you, same thing I send to my clients. So how would I disagree with you when its audio, you know what I mean?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"The what?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Okay, sir?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay. Thats going to be dependent on if I want to report and if I dont, thats different thing. Okay. You the way millionaires play the game. If Im trying to get some loans, Im going to show some money. If Im not trying to pay bucks, Im not going to make much money.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Fintech. Okay. Like, Ive had people soliciting me, like these high ticket items, okay? Fintech. What they do is I have a group that Im getting ready to talk with probably the first of next month. What they do is where I have people $3,000 account. They either going to pay me with a mascot, Visa, American Express, they going to pay half up front and the other half when Im finished. Okay? Now instead of me having to do that, if they have a 550 and up credit score, I can get the fintech companies go ahead and cash me out three grand and they will finance my client at about $150 a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Look, this is the thing with me. Im not going to go for that $100 for an appointment. Im just being honest with you. Im not going to do it. Ive always learned with mentors people that I can actually sit and talk to, okay. Where I can ask my questions, I can see, I can learn more that way. Im not going to pay the $100.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right. I look at everything monthly, then I look at it again quarterly.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Thank you so much, Jake.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I mean, thats the same process I use with my clients. They give me the name, the email, I send them a video.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay, right.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"God bless you too. Bye.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Facebook and Instagram.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Lets say 20 grand.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"How many workers I have working for, Im trying to leave a legacy. Okay. The toys and all that, that dont excite me no more.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thank you, sir. Thank you so much. Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Im single, Im in good health. I work out every day. Im just trying to add on to this, man thats better than most.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I didnt look at that. I want to see that anyway.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. And, man, let me tell you this about you. Youre good. What do you mean? Im talking about your delivery, your demeanor on the phone, everything.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Sounds excellent.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"About two grand.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay. Im trying to learn this AI, okay. Because Im betting that it can make it easier for me. Thats really what Im trying to get on to right now. Im always on the cutting edge. Im AI AI everything. Youre the only one that Ive called. Ive called appointment setters. I call salespeople also. So thats how you do it. Thats how you do anything. You get your lead. You run ads. After you run your ads, you have people that answer the phone. After my people answer the phone, I get setters that go out and make the calls. When they make the calls, then I see the people call in, then I close. Youre closing all your no, that would be a lie. No, youre never going to close all of them right then. No, what I mean is youre taking.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All the YouTube mentors. Yeah. YouTube mentors. Grady Ozzy with the car, russell Brunson with the click funnel.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"They have different businesses. Got you.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"You can save money if your AI is effective.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right. Im interested in it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Are you tracking because the way they are doing it is this with the business credit, they can contact me, they can be talking to me and everything. They can be done. Come in and got set up on appointment. If I dont close them, Im going to close them for the year out or they dont have any money. Because what I do is I have an email sequence that keeps sending them the information, and I have a lot of different content.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"You got to be FinTeching.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im in Georgia.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right. Youre not going to call somebody up business credit. Okay. And then theyre going to send you videos on it, on the process. Im talking about I have hours of content. Okay.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Man, I can drop whatever it takes. I dont even spend money, man. All I need is some food, some clothes. Thats it. The rest of the day, Im trying to make money.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Sounds great. It sounds great.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Expand my content, expand my business.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, I dont.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}}]