[{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Not crazy bad, not crazy bad. Crazy good. Its just like okay. All right, boss, you got my mind running right now. So now all right, so how are we going to package this up? How much would it cost? Because this is a service. That the brainstorm that youre giving to me. This is an idea. Now this idea needs legs because this is something that could be up and running within the week, by next week, you know what I mean?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I hear you. Im not going to say right now its not the best. Were in fours right now.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Thats twelve crazy.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Just starting out, I wouldnt mind making at least three to five k a month. That would be amazing, honestly. And then, of course, Lord willing, if I could scale it to ten k, we go from the ten, and then its just like, go from there. But its just like within two or three months, I could possibly be making at least 2500 to about 4500 a month. That would be amazing, honestly.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"As of right now, the low money I was able to get, thats what I used to really invest in the liquidation, pallet I have right now of the lawnmowers. So that was about $1,000. So right now I have four lawn mowers, and theyre decently priced. I have one for 275, another for 300, and then I have two going for $400 each. So I could easily make the money right there, and I wouldnt have no problem reinvesting into something like this. But thats where most, like, my last bit of change went to. Just really all in about the bed on myself, you know what I mean?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, youre right. Jobs definitely do exist. But however, for me, I just got to the point where its just like, Im willing to work for myself. I feel like Ive done the whole working for people, and its not like its the worst thing in the world. I dont know about you doing it, however, its just like the point where its like I want to own something for myself. Because within my church, Im a leader. I help out with leading the youth, I help out with just regular church things. And I see the respect and I see my capacity to lead. And its just like I have no problem to support and to follow and to learn, for sure. However, Im at that point where its just like I want to be able to stake my claim for something thats my own. And I understand at times it doesnt necessarily mean its less hours at times, because its your own, you have to invest more time than you would if you working for somebody else. So instead of going from a 40 hours work week, it might be a 60 or sometimes 80. Just because its yours. And because its yours, you have to invest a bit more to get the outcome that youre looking for.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Six figures for me, what it would change because as of right now, Im in Georgia, and the school Im going to be going to is in Michigan. Classes start Im doing summer semester, so my classes start May 30. So 120K, that would literally provide me. And lets say that happens within a year. Within a year, that would mean a possible new place to stay, more capital to invest into other things, being able to push back into the community. Like I have plans on, I want to do a podcast, you know what Im saying? Talking about basically relationships, being single, the whole of what it means to bring something to the table as a young Christian within this day and age, being able to tackle that. Im a singer, I do music. That means investing in more into my music, using that support the gospel as well. Just because I love Christ, it doesnt mean I cant dress a bit nicer. I cant drive something a bit nicer. Because even for me, ever Ive been working the most Ive been able to make the most is probably, lets say 20 to year. And off of that Ive made the best of it. Im a man who can be content. However, its just like I want more and I want to be able to provide for more and thats going to ask for more money. So something like that, that would be amazing. But even if thats what Im saying, even if Im not making ten k off the bat, just an extra three k a month or even five, that right there would already be the push. Because my whole thing is what its always been. I grew up not having much. My people are from Haiti coming here, my parents, its not like they were college graduates. Theyve always done what they could, and Ive always been grateful for it. However, I know theres more to life, and its not a sense to want more out of life. However, its always been the thing with me is not necessarily wanting to be greedy, but then understanding. Its not a sin to have a vision. Its not a sin to take advantage of the blessings that already come with where you live. Because I live in America. America is a first world country, and theres opportunities, you know what I mean? I dont necessarily have to just settle. I could work hard, but I dont necessarily have to work hard to make somebody else. If I choose something to myself, you tell me just like, yes.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Now, boss man? Lets see. Give me a second. Credit score as of right now.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"You too. Be blessed. Bro. You are different because you are the first. Like, Ive never gotten a call or text from a company that Ive applied to online within the same day. Never. I love that, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes, sir. Sweet.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yes, sir.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay, well, I mean, currently, right now, 28, Im getting ready to get back into school. Never really finished college like that, never really got too far in. But its just like this time around, Im just definitely dedicated into finishing just my course, what Im trying to get into or what Im going to be doing, lord willing. I want to get into ministry. I love people. I love the whole process of life. I feel like when you just look at everything, life is a process, life is a challenge. Life already challenges you in itself. However, somebody whos dedicated to live by the Bible and live by Christ, and that means the Bible in and of itself. That lifestyle is challenging to the challenge of life already. And that at times theres that in between, its just like, can I do it? Can I make it? Will I fail this down the third? And I feel like thats what ministry comes into play as far as encouraging one another, pushing everybody to be their best, and its just like, yeah, man, I just really want to get serious into that because my life has just been a life where its just like God has been present. Its not like I was necessarily running a drug cartel or anything like that. Theres nothing that serious. However, Ive had my own challenges that Ive had to overcome, and its just like I just really want to get solidified within that. And one of the things Ive had to overcome was going through school. I didnt graduate top of my class or anything, so this time around, I really want to put myself to the challenge of betting on myself and trying to see if its possible while Im in school, I can have a business thats up and running. And so thats why, as of right now, Im not working. Like I said, my husband I have right now, I just really started it, I will say about like a week and a half ago, buying liquidation pallets. I have no storage units right now. I have lawnmowers that Im selling. And so its been kind of slow. So I just been looking for other ways I can diversify my money. And I know one of the best ways, apart from Ive never really found a way to necessarily break through, because though Im young, it still somewhat seems a bit kind of challenging and sometimes that whole feeling of too good to be true. But however, Im determined Im going to find a way. I dont know how long its going to take, but I want that digital presence of knowing that, hey, I dont necessarily have to have something straight in your face. It really goes off of me doing the work that I said I was going to do and making the break from there.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"As of right now, the pallet costed cost me about 880. But from the four that I have posted right now, I could easily make $1,000 back. And I have others that I havent even posted yet because they just havent been processed, but yes, sir.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No. Youre literally hitting it on the head of selling yourself, basically. Yeah, thats basically what youre saying. And thats the best thing that you could sell because nobody knows Sam like Sam. Apart from God, of course.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Itll be 432. So about, like, low fours. Because Im not going to lie, beginning of the year has been a bit rough. I have my car repossessed. Currently, I was at a job working with the airport. I was doing catering for Delta. And so decent job, 18 an hour, paid weekly. It wasnt bad, but unfortunately, from the previous job I had, I had to let it go because it was kind of acting with a lot of stuff I was doing at church. And so I was in a period where I was just kind of, like, just playing catch up, playing catch up. And literally, like, the second week Im at the job. All right, cool. I was able to catch up on certain bills. Im about to go ahead. Im asking my parents, look out, let me pay the car, whatever, blah, blah, blah. And literally, Im waking up at, like, 04:30 A.m. In the morning because my shift starts 530 until two. And so its just like you woke up early in the morning, car gone.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"You actually sat down. You help brainstorm of what worked best for me, bro. Because you dont even know, bro. Ive been looking online, thinking about what could I do online. Ecommerce is cool. Affiliate marketing is cool. However Ever is just like, bro, this right here makes sense to me. But Im done talking. Ill fucking head off.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes. Now, currently I noticed I was going through question on the questionnaire on your website. The only thing is right now I dont necessarily have a business per se. I have some stuff. I still on the side, like a side hustle. However, what Ive been looking to get into is possibly affiliate marketing or something that I could use AI to help generate business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, sir. All right, sir. All right, bye.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Thats why I was just going to watch your case study, just to see just the different ideas and just what happened because I was watching your commercial on YouTube and it was just kind of like you said, AI is the next big revolution online and whatnot. Im just trying to see where I fit in, man.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, youre on the money. Because heres the thing. I thought about getting into motivational speaking, for sure, because I could talk for days, you know what Im saying? However, its just like my whole thing is Im not at the level where Im getting invited by a college to speak to a football team or whatever that entails. However, what youre talking about is modern, right? Because its online, its remote, and like you were saying, its high ticket. Because I remember the whole ad on the YouTube was like, anybody who has high ticket ideas or high ticket business and they want to convert it into the use of AI to basically push it forward. So now, bro, I like what it sounded like so far. So basically high ticket motivation, possibly helping people to change and shift mindset into better thinking, better execution, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hey, how are you doing, boss man?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Annual income? As of right now, last year, whatever.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Annual income, we could say 21. 21k, okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, bro, what youre telling me now, whats going through my mind right now is just like, can this really be real? Bro? This is crazy, bro.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Well, Im not sure. I post it. I make sure theyre clean. Everything runs. However, right now, people are just really playing numbers games. People are giving me low offers. So thats why Im just really sticking to my pricing. Im big on like, okay, if it has value, Ill make sure actually what.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. Im going to do like you said. This is right here. This right here, bro, this is a 2023 idea, bro. This is modern. I feel like this right here will definitely put me in the competitive game of, like you said, helping people. Something where I could really focus in on me, my best qualities, my qualities to speak life into people, and lets help some people, bro. This is right here. This is nice. This is something I dont feel like Im going out of myself or I have to become somebody else to be able to compete with. So Im going to do what I need to do to get them sold. And Ill be calling you back soon. Dont worry about that. For sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]