[{"pageContent":"All right, thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right. How are you doing?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"My media and stuff like that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, really in the marketing, Ive only been back into it for about a month now, so its taking a while to get that going. I know youre not making anything from the marketing agency. Im a musician, so I make money. I make about $1,400 a month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I was network marketing for ten years, and now Im starting my digital marketing, so I got a boat, pretty much.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Whats that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Right now, Im at the ground level because I started completely over pretty much up until March. For the past three years, I worked in a school setting as a safety officer.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I was sitting there waiting for the call.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"You did?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"For the past youre wearing a lot of hats. Yeah, for the past 25 to 30 years is what Ive been doing. And then in 2011, I got into network marketing, and I worked in about five different network markets. Im in one now that Im pushing real strongly, so background of my digital market as well, dude.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Marketing.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I know some of the things that I do and know how to do and all the packages that I offer, and I know what the minimum price for that package is. And combined with my wife, my wife is also a clothes designer. She designed clothes from scratch. Im looking at how much I closed with college when I start marketing her, Im looking at the stuff that already my past, what I was capable of making from the past, from what I were doing, and the sales part of it. And then I know how to as far as merchandising and marketing, if I was actual store, Im a manager, used to be a manager at Dollar General and Walgreens pretty much know how to do the business for us. Now, the 10,000, I just calculated how much I need to sell each day to get to what I want each week by the time I get to the month. If I dont make the 10,000, beat half of that, Id rather see higher than what I can get for low and dont get.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"SheS at 41 a year somewhere in there.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Well, about a week before I stopped doing that, I said about two weeks. One of the principals came to me because she knew what I can do, because every morning we let the kids in off the bus. We have metal detectors and all that. We would talk while were doing that. She know I had a media company. She seen my photography work. She wondered why was I working there and not doing my own thing. The whole three years I worked there, she kept on asking me that. She seen my graphic designs. I do 3D graphic, I do video graphic, I do whatever. I never went to school for any of it. I just started doing it. Shes seen the video, shes in pictures, graphics. So when the day came to where something happened that wasnt completely my fault, I went on a call and the call was already taken care of that nobody told me, and I went after it was taken care of to take care of it. When I entered the office, nobody said a word to me before I approached the student about the situation. And the student pretty much they cant have phone or anything. So I tried asking for his phone and they fell to the ground. And next thing I know, Im getting hit on the back. So I stand up, he comes at me. So basically I have to feel myself. And then he tackles me. I said Im like time I was like 280, and hes a little 14 year old. He actually tagged me, put my leg from under me like a UFC fighter would. I say, okay, I was into martial arts. I took him down along with me and pushing against the wall and held him as all I did. But when the police officer came handcuffed them the boy headbuttered them, and then the police officer ended up hitting the boy while the handcuffs but they had to cover that up. So I got to blame for initiating the whole thing and put me on leave for a whole week. With ten days during spring break. But prior to that, a week before that happening, the lady that I worked with, shes in the business also, and she wanted to learn the AI stuff and some other stuff. So she gave me two websites. She told me, she said, I want to do this, but I know you already into a lot this kind of stuff, so if you learn this, I will be your customer. Ill hire you to do my stuff. And so thats basically how I got back into it. And that was like two weeks prior to me leaving that job. Since I left it, I just got to looking through all my work since I left it, and I had to scroll down my page, my platform that I use about 25 times to get to the back to the top of the list from all the work Ive been doing on it. Ive been doing a lot of advertising, and I got everything put together within a month time, I completed a whole marketing system, everything. And I also have a partner hold on a town end, Demetrius.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, thats my thing. Her thing is to go.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, its being worked on right now as we speak, but its under 600. But Im getting my feedback from it, my points, getting certain points each week coming up. So its getting better.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, I started off I also have my own Moto media company. Im a videographer photographer and graphic designer.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"If there was some WiFi, I know I have to after 1230, I went with my wife, so it was after that. I probably didnt hear the phone.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Like 590 something.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Did you call me? Just earlier. I didnt get a call after you said itll be five minutes.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So I was working with the police department inside the police department at the school for the last three years until March 8.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"My annual income?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay, thatll work.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"But, yeah, she support me in it.","metadata":{"fillerID":19,"fillerText":"Yah umm","category":"C"}},{"pageContent":"The church as our church organize that. And whatever I can get coming in for Im for the marketing.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Ive calculated 10,000 if I do it right.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"What I make now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, the thing is, I had $5,000 put it that way. But for my rent for the last two months, I had to pay two months of rent so far, plus the food and everything. So they pretty much brought me down to hardly anything right now. Thats why Ive been doing marketing the way Ive been marketing lately. I dont even mention my packages up front anymore, so I had to start small with me. Where they at? Pretty much where youre at.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}}]