[{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"That could be one of the avenues that I could take. Definitely. It would be more interesting than actually doing the so tell me more about it. Do you work with people like that?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I would say to have more flexibility and not having to work nine to five and being able to have income if I go and leave the security part right. Of having a paycheck every two weeks.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No, not in a sense of getting paid for it. Definitely, I dont. I work with a friend that has an agency, and hes basically out there trying to get clients. Right. And one of the pictures that he has is, for example, he goes to these affiliate shows and all these people that are on the lead generation business, quite often they work with Paul Centers, and they have a really good business, but mainly for the US. General Market in English? So his approach is kind of like going out to States and said, listen, we can help you with digital marketing. Have you thought about going the Spanish going to the Spanish market? Yeah, we can help you with that. Right now. We havent really gotten any clients out of that. We have talked to several ones, and hes in the process of closing. What I have done is sort of talking strategy. Its like, okay, heres the client. This is what they want to do. This is what we can present them, that sort of thing. So I feel confident on putting strategy in place and telling them and then executing with a team. But thats to the extent of coaching, I guess its not really the one on one coaching or the other programs where you have, like, a group coaching. I havent done that business model.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Good, and you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Steadily? I would say at least ten grand.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"It well, Ive been doing digital marketing for almost ten years, but mainly working for companies. And then the ecommerce is pretty new. Its maybe six months old thats Ive been doing that on the side.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So digital marketing coach will be more talking to agency owners. Want to maybe break through? Lets say one of the avenues could be maybe just being able to strategize and say, listen, if you have this client for the Spanish market Im just saying Spanish market because thats one of my areas of expertise. Right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello? This is Caesar.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. So kind of saying I can coach you on how to get clients.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its a side business that Im looking to start. Okay. I do run an ecommerce store, but its kind of doesnt require a lot of maintenance. I have a nine to five job, and Im trying to see how maybe AI can help me to get some clients outside.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}}]