[{"pageContent":"Yeah, just now, though, I got, like, two messages and then you called, right? I have not.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"You too. Thank you. Bye bye.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Can get COVID, even though negative thing, regardless, across the board or across the whole country, earth, period. But all the way around, being able to virtually do the things that we could do now, it blew the market up, and I was just in our field, you know what I mean? Everywhere, everything.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Stop calling me.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay, I did hear that somebody I was talking to did say something like that before, I think Ethos. Yeah, they asked me the same thing, and I was like, I havent came across that, but I havent sold anything to find out either. But why would they sell me that license? Part of that license?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"They.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im pretty good. And yourself?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I just went through that. I just declined an offer with Lincoln Heritage because I didnt want to. I mean, Im in Florida. Im not walking door to door whenever we have what we have, opportunities now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I havent done anything. Im a little guppy in the water right now, trying to get my feet wet.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"First name, middle name, last name, in between first and middle.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"I have not checked.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right, exactly. Im an African American.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"In Florida.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"On top of your 25?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"All right. Absolutely. I appreciate the time.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, I think as you kind of get into it and get people working for you and everything else, I think youll probably run into some of the same issues that Annuities I did. Some of that I didnt get into it as much. I actually had a company from Atlanta, Georgia, call me to get me involved and I was on the way out at that time, my head just wasnt in it anymore. The other thing is having to buy your own leads.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right, exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"One of the things it wasnt much. One of the things that I learned kind of getting into the Obamacare stuff. And the way things worked is I found that the majority of people that I had for residual were changing almost every three years, changing health insurance companies. So your residual tended to just not be there. But when I started doing focusing on life insurance, and especially the Universal life index, universal Life, I mean, it made all the difference in the world.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, with my license being 215, I havent came across anything as far as that. Maybe in other states they do by county, but State of Florida is all Florida. And then I reached out and got information on a couple of the states, and then all I have to do is apply and pay for that fee to have the license in that state. So maybe another state would be different.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right. Again, especially cost. I dont even mean to cut you off, sorry. But especially because of COVID you know, I what mean, that scared everybody. Sure, absolutely. Across the board. And now people never really ever care to think about it, now have to think about it because they lost loved ones next to them. Didnt think that there would be a possibility that the whole globe was shut down over a flu.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yeah, thats the thing for me too. Right now, financially, starting out, I dont have that safety net for that. Its more so like with the companies that I am trying to get involved with are the ones that produce those leads and then have the option of if you want to go and get more leads, we have this other program where you can pay for. So that kind of is where Im leaning into as of right now, to get starting off until things start. Its hard, man. Absolutely.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"So now it is so different. And thats the reason why I left was because the commission structure changed so much.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Going to have an insurance business. Im an independent contractor here in Florida. Well, Im actually in Florida now, but my license is registered in Florida. And then I have some friends that Im going to bring on board, some other prospects that are thinking about getting their license to sell Health, Life, and annuities. So right now its not really off the ground yet, but I have my license and moving forward with that probably within the next couple of weeks here, then I just got appointed with seven carriers as of yesterday. Okay. Yeah, thats basically that in a nutshell.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Give me 1 second.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"And so the way things worked with prices and everything else, I mean, a family of four was getting decent health insurance for like $650, and now I think its like $1,600, if not more. But the main thing was that with that, even a broker working for a brokerage, even getting 18%, they were advanced the nine months. Of course, they could make three, four sales a week and be making two grand a week.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Absolutely. And then this is your phone number, like a direct line.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Im traveling.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]