[{"pageContent":"Well, I did so many today. I watched part of them and then I bookmarked them so I can watch them at my convenience, like, next week. So I didnt go through it. I loved the Air because that was a great play on the AI, so that was really great. But tell me what your suite does and what it costs and how it could help me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, I still have I have 18 kids, over 100 grandchildren. Basically what I want to do is I want to have some fun. Im looking for something right now that is a side hustle. I have some income coming in, but I spent a lot of money on partially finishing a couple of the things that Ive got on the table. And so I need some cash flow. And actually after I opted in on your program, I saw a guy that wasnt asking for any money that just did an informational video. And he did it in a different way than somebody else Ive seen, and both of them have done these videos, just an informational for free. Theyre not asking for anything. And I loved what they were doing. And its something that I know that I could do and I could build traffic. And compared to all the things that I have to pay for that probably arent going to work. Im thinking of doing that. Ive got some marketing plan, and Ive got software that will create a website and track the marketing plan. And Ive got three or four things that I can use for the marketing plan. Its going to cost me about 25 grand. 35 grand.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, now Im sensing youre asking a different question. So are you asking me if Im interested in marketing what you do, your services to businesses? Is that what youre asking me?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, go ahead.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, this is the difficult part. I have an eclectic set of skills that probably very few people on the planet have. And I mean, Im dumb in a lot of areas, but the two companies I took public were basically owned by somebody else. And one was an MLM before amway. Beat the government in the Supreme Court in 78. And we took an old white front store in the heart of Silicon Valley and converted into a membership like a huge combination of a supermarket and dry goods store. Theres nothing around anymore. It would be more like a catalog store. And we did an MLM and all the experts, everything I ever done, the experts said it cant be done and weve always done it. The problem is I loved what I was doing so much that I wasnt thinking about scaling. I didnt start thinking about scaling it up or really doing something until I passed my sixty s. And so now Im looking what Elon Musk does. I have a tendency to look at stuff and digest it very quickly. I was looking, for example, at a seminar that a couple of the sharks from Shark Tank are giving. And then theres a book that Gals written. I think Im going to buy the book because I can read that through, but I kind of understand those principles. And so now Im putting them together and Im going to take the product creation successes that Ive had or partial, and Im going to take the best ones. And then what Im going to do is I have a low cost way of raising millions of dollars, using the fairly new regd opportunities and doing a website thats already some friends of ours have developed it that handles all of the accredited investors. So I dont have to pitch people anymore. Ive raised about $20 million in my career. So basically Ive been a money.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Thats what Ive been trying to tell you. But I have a couple of ways of creating that very rapidly. So right now, I would say for the next 30 to 45 days, I have some savings that I cant touch. As far as what were talking about, thats not available. But I think to save your time and energy. I dont think Im a good candidate as far as being able to do something, and I really am getting closer. Ive got a couple of potential investors, and Im kind of at the mercy of their time frame. Im not trying to close them or push them. Im letting them come to me. And so I think that while our talk has been informative, and its helped me probably off the top of my head, give you a little bit of a rundown on the kind of eclectic bag of tricks that Ive got that Im looking at and trying to sort out. I dont really feel that your services are something that I can use at this point, but Im sure that I can at some point in the near future.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, you just said that to me, but I think in 90 days it would be a different type of thing. Where are you located?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Out and ready to rock. Well, thats relative. I would have to look at what Im doing and then thats where I shine. I could tell you if I could realistically see, even conservatively, thats something that I can do. For example, Im sitting here in my sweats and Im looking at ways that next week I dont need a lot of money, but I could put together Xx dollars. And then what could I do with that Xx dollars if I take out a couple of supplement the income I already have? Because theres still five of us and we had a six figure income last year, but I felt richer when I was broke than I did with the six figure income last year. I think Ill live at least another ten years, but I dont know what kind of physical condition Im going to be in. So Im looking for something probably in the next three years that I can scale up and I can do a little bit what Elon Musk, which is not any big secret, did. And that is I can give myself stock options in my own company. I can borrow out the money that I need to have a six figure income. And because its borrowed money, its tax free. And then I can either cash out or sell part of it to the other investors and still control the deal or do it again. But Ive got $15 to $35 million in the bank, so Im still playing with the figures right now. But I have to enjoy what Im doing. I cant just do it for the money. I have to enjoy what Im doing. And so Ive got a lot of options, but Im also one thing I cant control, and that is time. And thats something I dont have a lot of I dont have as much as you do. Tell me what you do. Okay, with AI. Tell me what you do. And I know probably its slightly different if youre working with somebody on a different platform than tell me, what tools have you created that youre selling to me or selling to somebody else?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, kind of because one of the things that I explained to people long before younger guys like you were doing on the Internet is I realized that the Internet was going to get to a point where, like somebody said a couple of years ago, nowadays everybody lies, but thats okay because nobody listens. The Internet is so screwed up out there. Theres so many liars that after getting peoples attention, theres so much noise out there, its hard to get their attention. But there are ways of doing that, which you probably know better than I do. But I started looking to create, and I still plan on doing that downline. I plan on moving into franchising because I understand that space. And if we hit, which we will hit at some point, a terrible recession franchise is going to double again like it did and it was before 2008. It was a trillion dollar a year business in the US alone. Its about a year business. And I understand Franchising. So thats what I want to basically do, to add value to raising the million and a half to $5 million in my public offering in the next year to year and a half. But I need to get some money together. I dont think I want to approach small investors. I just want to create my own cash. So Im probably going to do something in the next 90 days, will bring me in 25, $35,000 plus whatever it takes to add to the passive income I already have. And then Im going to take probably 60 days to put this club program together. And Ive got several things. Ive got something thats totally unique for the $1.5 trillion student debt problem. Ive got six figures invested in something that can totally reverse that using three different approaches. One, curated scholarships that arent out on the open market. Ive got a deal with a company that was big on Shark Tank that has an app that will produce $4 million worth of scholarships in about 20 minutes that arent normally available, that theyve curated. I own the rights to a program that can get a B plus or B minus student to increase their chances 100 fold to get into a top ten university. Because we dont have an algorithm. But we have somebody that got into Princeton and was a C student, and he did it because of his personality. And so we put a seminar together. Weve already got the video shot and everything. We can put that online so we can offer a package for a certain price point for a club membership and give this to somebody for free so they get value for the money. But were going to do something different. Were not going to fund a company, lets say its 697. Were going to take $47 and put it into the company, to the club, and were going to put the rest of the money, the $650, into the marketing plan. So Im going to make all my money out of the marketing plan. My associates are going to make all their money. Were not going to make it as investors. Were going to make it work in the market plan. But we can make $100,000 a month after three or four months as this thing builds. And then I want to take that money, and I want to take 90 days and put together the public offering. And Ive got some people that will come into it that are really big. Ive got a friend who has invented the MP3 player. He put together his first company for $38 million and sold it to Sony for 200 million, which became the Walkman. And he lives here in Utah now, and hell be on my management team. So people say, who the hell is Dan Buckley? Weve never heard of him, but they know this guy. I know how to package stuff, I know how to stack it. The problem is, number one, I work best if Ive got a partner. Somebody thats intelligent, that I can bounce things off of. I dont have that anymore right now. So Im missing that if you talk to yourself long enough, they put you in a home. And the second thing is, I need something where I can get leads or get some sort of an audience. And the times Ive tried to do something on the Internet, the patterns I was following took the people that are successful in it two years to do. And I dont want to start for two years. Im too old for that crap.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Ive been ex partners down in Gilbert where Brock Purdy is working out.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Talk to you later. Bye.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Okay. And whats the entry level cost for somebody? Lets say that I want to start doing that Monday morning.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, but what Im saying is, for example, Im looking for something where Im not making a million dollars in 90 days. Im looking for something where I can hit the bricks on Monday and by Friday have ten or 15 grand in my hand. I mean, I know this compared to all of these so called success stories on the Internet and so forth, compared to the whole population, there arent a lot of people out there that have made $50,000 in a month. The most I ever made in a month gross was like $675,000 in six weeks. And I did that by myself, but I also had to pay some other people out of that, so I didnt net that. But Ive got a situation where the last two, three weeks Ive been digging into my savings. Ive been putting something together, and I need to do something next week so that I can go to the next stage. Youre not going to help me do that? What do you mean? Well, what Im saying is I dont have a company for you to help me scale at this point. I need to decide what it is I want to do when I grow up. Then you can help me scale that. Does that make sense? Yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. I know your time is worth money, but its nice to occasionally I dont get it very often. Its nice to talk to an intelligent person. I think youve done a great job. Youve told me nothing specific about your plan or your program, which I would like to know more about at some point, but thanks for getting back to me so quickly. You cant believe, especially at my age, how many pitches I get on the phone and that I dont want to listen to, but it sounds like youve got something of tremendous value, and at some point, I probably am going to need somebody thats run this race before and helped other people do it. This wont be the last time that we talk, but anyway, take care and have a good weekend in.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. I spent back in the was in the cabinet business, and I did virtual manufacturing, kitchen cabinets. And I was making probably as much as 30 grand in a month. And I decided I didnt want to do that anymore. I was going to franchise that. And I saw a successful program that used a matrix, which is not used very much anymore by legitimate companies, but its still, I think, a pretty cool marketing plan. They used the force matrix. This is before the Internet, and it paid out like, three quarters of a million dollars the third month. And it had nothing but instant printed instruction sheets. People were sending in cashiers checks, so there was no 800 numbers, no cell phones. And I saw this thing work, and I found a better way to do it. And I went to one of the top MLM attorneys and paid him 29 grand down in La. I was living in Utah at the time and still am, and I have a club program where people could come in and they could just I dont like the term sponsored. They could refer two or three people who would join the club. We would give them, lets say it was $697, and theyd get two or three people. I prefer two because only 35% can get the third person. 65% of the people can do the two. Most people can only sponsor or bring in one and a quarter people. So I bought from a company that no longer exists down in Brazil. I bought ten pieces of software that will track the force matrix marketing plan, and Im going to customize those and resell some of them. But what I want to do is create a little program that I can go pitch to people and get my own leads and lay out some beautiful literature and maybe bring in 50 people a month. Pardon me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Hi. Yeah, just to kind of be fair to you, I was bookmarking probably 100 different courses like yours because Im putting my third public company together and I wanted to see what other people were doing. And Ive been in the digital space. Im going to be 83 in September. And so Im not looking for side hustle. Im actually looking I own pieces of things. I own software that I can white label. Im just trying to figure out what I want to do when I grow up. And so I know AI is hot, but give me your pitch and tell me maybe what youre doing is something that I can use. But at worst case, I kind of wanted to see what you were doing and see if I could maybe mimic and do something similar with what Im going to be doing, if that makes any sense.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I have crappy credit. My wife has 800 plus credit, but I owe about 104,000. And then if you were to start.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Flow.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay, forgive me. Tell me your first name again. You did. Alex. Alex, okay, let me tell you something but thank you for treating me the way that youve treated me because you personally have interested me because of the way youve handled this. So youve done a phenomenal job. So Im interested in you and Im interested because of you in your company. If you give me another five minutes and Ill try to talk quickly here, let me tell you what one of the things I have thought about doing and may wind up doing. Number one, when I lived in California, I grew up in the Bay Area. Im from Chicago originally, but I live in Utah now. Ive lived in Utah now longer than I lived in California. I never listened to motivational stuff because my life was more exciting and listening, believe it or not, the only motivational stuff there were a couple of unknowns and then Tony Robbins and Ive always liked Tony Robbins because Tony Robbins, hes bigger than life, but hes real. And Ive even thought of when I had some extra money of taking his coaching course just to say that I was trained by Tony Robbins or one of his people, whatever. I worked for a company that was $85 million year company started by three guys here in Utah and one of the partners bought it out and I went to work for them and I was hired immediately because of my background. They didnt even ask me to qualify but I did probably the first resume of my life and they have about 40 high profile coaches that they sell their programs and its a company called Achieve Today and I went to work for them. Usually it takes a month or two and then maybe you get a sale. I got my first sale my second week and I really pissed them off because Id start to read the script, which I can do, but people related to me and they thought I was a coach and I was just a salesman. I wasnt even the closer the problem. I became one of their top salespeople the first month or month and a half but I wasnt getting paid because I wasnt told that unless you got an all cash deal, which you seldom did, you didnt get paid. What I was quoted I was going to get paid and so I wound up leaving them after being there for nine or ten months but I thought about getting because I was coaching people without being a coach and Ive bought some private labels, some white label stuff thats been created and modified. It where I could probably do coaching stuff for $500 a pop. And if I had a way of getting driving leads to me, I could probably make $50,000 a month doing coaching. But its still by the hour thing. Because if youre a doctor and you make $10,000 an hour, if you get sick or you die, your income stops. And so its something that if I was in a wheelchair or something that I could do, I would rather do something that I could build into a scalable business where I was reselling product or something. But the coaching part of it can be piggybacked on product, too. And so I want to stay in touch with you because I think you can help me in a lot of ways, but I dont think now is the right time. Pardon?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, yeah, but Im doing what Im going to do. Youre not offering me and I dont even need to know what youre doing. Youre not offering me a company. Youre offering me a way of taking a company that I already have or that somebody already has and scaling that. So the point is that pardon?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}}]