[{"pageContent":"I did.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And right now, Im doing it on a very small scale in my practice, and Ive got four kids in optometry school right now. Im four for four. Shouldnt even say that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And then Im trying to think of the name of the company that we use to offset the carbon footprint, too. So as soon as you buy them, we paid them to go on the shores of many countries that they work with to pull plastic out of the ocean.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Probably more like 60 to 80, now that I think about it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Great. Right now, private equity is ripping through the industry like dentistry. Youre not going to find many independent dentists left after five years from now. Yeah. And optometry is next. And its coming. And I was just talking to a gentleman today, and hes like, you really should think about selling soon because the money coming through Massachusetts is unbelievable. So if I sell, Im 57. Im going to be 57 this month. I have no desire slowing down, but I want to do more of what I love, and this stuff, I love doing. I love doing the YouTube channel, too, by the way. Ive got probably 3500 subscribers and not a ton.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Do with YouTube right now, its primarily optometry, its education. But what I want to do is theres a big and this is what I want to do, getting out of my practice and into a new life where I dont have to be living in eastern Massachusetts to make a living.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Good, how are you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Boy, it popped up somewhere in front of me. Let me tell you what I do. Im an optometrist. I have a private practice in Massachusetts. I have a YouTube channel that Im always looking for AI to help me out to make that easier. And Ive just, in the past six months, started another company called Go Green Contacts, and there were a couple really cool pieces of let me start with this way as an optometrist. I see a lot of patients that dont want to buy a years supply, or they dont want to go to daily disposable contacts, which are the healthiest option, because theyre worried about the carbon footprint. Theyre going to leave with all the plastic. So what we did is we found a couple of companies that were going to partner with. That one will allow you to bring back all of your contact lens lenses and the cases that they come in, the flat packs, and they will be totally recycled through a company called TerraCycle. And then we have another company that we pay to offset the carbon footprint when you buy them. So were really creating a negative carbon footprint when you buy contact lenses from us.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, you go ahead.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"But as you can imagine, without a big investment up front, the marketing end of it is slow. So thats where I think you could probably help me the most.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"My name Joel Hayden. My bald head and my beard, theres a caricature of me.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, matter of fact, Ive been to multiple Tonys shows.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Its the admissions people at the optometry schools. Even if they just recommend it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I am away starting this weekend. Im away all week next week.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Sedona.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Weve been bringing on undergraduate kids interested in optometry, and Im really excited about optometry to this day. Ive been doing it for 30 years, so Im looking to help those kids. We train them to be technicians to work for me, pay them, and then when its time for them to apply to optometry school, I usually will write a nice long letter. Were going to make it a certificate program at some point so that they can increase their odds of getting in. Now that Ive done this a number of times, Im getting to know the admissions people, and they already know what Im doing, so its really helpful.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Think of that, though. Think of the power Im going to have when I have a lot of optometry school students and somebody like LensCrafters wants to get their hands on them, that Ill have access to charge LensCrafters a fee to meet these students.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, no kidding.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hang on. Hello?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Not yet, but Id love to.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I started looking at this, and I agree, for optometry, I really came up with it. Once I came up with it, Im like, I bet the medical schools do this, and holy shit, they charge 30, 40 grand for this.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah, nobody. Yeah.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Ill say $100,000.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"This is really cool. I will tell you, the biggest issue Ive had so far in setting it up is Im terrified to commit to any one LMS system, worried that Im going to sync everything into it and then have to backpedal and go to something else because theres so many options out there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So $2,000 is nothing compared to not getting in.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So what Id like to begin to do is create courses, or create a course initially for college kids to give them a good taste of what optometry would be like. And then if they decide to go to the next level, its almost going to be like a coaching program where theres only 25 optometry schools in the country, and I literally am going to get them in front of the admissions people and see what they can do to make their odds better getting in.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"You got it?","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Because, like, 97% of them get in.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So that would be what I want to do with my YouTube channel.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Im just getting a little tight of my time.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Not bad. Matter of fact, Lens Crankers now is offering to if the new Grads sign a ten year deal theyll pay off their student loans.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"What we do is we actually have a contact lens website called Go Green Contacts. So when they buy the year supply from us, then the rest of the services within that are free.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Im probably two plus 225 plus okay.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"By the way, I also last year I obtained my higher education teaching certificate through Harvard.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So, first of all, my number one goal in starting this whole thing was to go after the one thing I knew I wanted. When I get out of optometry, I dont want to retire, but I want to be able to make a living doing what I do, what I love from anywhere in the world. And with this, I can I mean, I may go be a guest speaker at a school or something, but I could sit on the beach of Aruba from December until March and do this stuff.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. So I got that because I knew I was going to need the credential.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"For instance, once I let these 25 schools know that Im doing this, what happens if four years down the road, they make it a prerequisite, my course? A prerequisite to apply to optometry school. Now Ive got 20,000 kids a year applying to optometry school that have to take my course.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im not selling it yet, and Im thinking Im going to do it for probably $500.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, my God. They will mentor them, and they will tell them, we guarantee success if your student doesnt get into medical school, we will refund you all the money.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Do you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Nice.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats only 25 people Ive got to sell it to.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I actually know Tonys stepson as well.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thanks so much, buddy. You bet.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"No, other than my YouTube channel, but okay. Yeah, its so wide open, it shouldnt be an issue at all.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Great.","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}},{"pageContent":"I didnt see it.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"And what Im going to try to do and I might up the price when I get this, Im going to try to have the optometry school figure out how to give these kids, like, one or two credit hours for the class.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I live in Framingham, and my office is in Mansfield.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I did a firewalk, yeah.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Thats right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"$165,000.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Im probably best off to give you a buzz back as soon as I get back.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right. And you can imagine these parents are going to want to give those kids every edge getting in.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]