[{"pageContent":"Right? You said that you have basically for the effects of COVID the 800 million people that were affected by COVID that survived. That survived. Whats your resolution for them?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I mean, dont, my knowledge I have a proprietary trading system. Im putting that on hold because this is a bigger play for me. It impacts humanity. The biotech company I have impacts humanity. Do you know, Alex, when the virus hit first hit the healthcare community diagnosis was that the virus was impacting the lung the most. Right. Remember that? We were the first company in the world that said, no, its not the lung, its the brain. Then months later, Mayo Clinic confirmed it, that the virus has affected our brain. LS thats why so many weird violence and killing going on in my opinion, in the world. Have you noticed? Where are you based, by the way? Where are you based?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, go ahead.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, you can do that? Absolutely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, I have to understand Im always the last one to indicate money numbers. I need to know what you what? Im not going to name it. You have to name it. You have to tell me how you cost you service. Meaning I dont even know how. Im really dumb about your kind of business.","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}},{"pageContent":"Yeah, its amazing. Let me get to my office phone number so I can talk you longer. Hold on a second.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. Well, Im very intrigued by whats going on with you guys.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Can you hang this one up for me, Alex?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Three days. Thats all.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Theyre already using stem cell to improve your vision.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"We want to franchise among the first franchise biotech company in the world. In other words, every country. We go every major city. In other countries, we want to have someone. You guys probably could be a global franchise of our country. And you dont have to own a laboratory. You partner with the laboratory, they do the test.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"It sounds like youre an advertising agency, right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Look, so why dont we do something like that?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, Im too stupid to know what I should like at this point.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Please.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Oh, thats neat. Okay. All right, don. Well, Ill definitely do some thinking and thinking.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"How do you like that marble?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Real quick.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"And it destroys your life. In the meantime. I have known friends who are fairly healthy, except they worry about atrial fibrillation, all that stuff they gave him. I went spent a week and a half with him in Cleveland clinic. They put him on this drug, and he declined from there on.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, at phase one of my company that we are in right now, its called precision Medicine. Right? Its molecular medicine.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It sounds like you definitely have the expertise to create a health and wellness offer.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, my God. The thing is that, believe it or not, in a biotech company, I have basically financed this all by myself. I have not gone to venture capital money yet, which is a good thing, because now were going to be very valuable companies. We ever go that route or go public? Of course, I have been doing this for seven years now, or approaching seven years, and I have all the freedom to go anywhere with it, pretty much.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Hello, don hello?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Okay. Then youre lucky, because there are millions and hundreds of millions of, maybe tens of millions of people who are being treated by the doctors. But the problem is the doctors dont really know how to treat them. Its a fishing expedition. Okay? Mainly a lot of frustrations out there. We have the tool, the diagnostic test that can report to the doctor specifically how to treat where the problems are, how to treat them at the molecular level before the symptoms surface at the molecular level. Again, like I said, even doctors dont know. We have the AMA approved course to teach them that. Thats another tool. We are the creator of a professional course for continuing medical education, course for doctors and medical students and nurses and physicians assistant. So thats one thing we have. We have a course online in English and in Spanish. Okay, so in addition to the course, we actually have the ability in our labs in Europe. We have two labs in Europe that actually do the testing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I have five young people who wants to be my intern. One is a majoring in communication in the college. One is a very high level athlete, wants to get into health care and ones very savvy with the internet. And heres what I was thinking of getting the interns as a group to work together on a company wide project is that I want them to come up with one simple question that will get to the consumer level. The man, the girl, the boy, the woman on the street of the future of medicine. We are the future of medicine. Okay. Yeah. If we can make it simplistified, make it a simplified message, have it so that it will entice them to give more information so they can take it to their doctors and say, doc, what do you know about this? I need to take this test.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You should have recorded what I just said because that is exactly the story. What do you call it? Yeah, that is exactly script I want.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, wow. I didnt know that.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"I made my money basically in real estate in Washington, DC. And then I became a stock broker, which I developed my own trading system better than youre not going to believe it. Im the only guy, probably, that can own bookshelf, hathaway, and get pay a dividend. It does not pay dividend.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont know how you operate, because Im telling you, this is that the philosophy of my company based on three Ps. The first P stands for partnership. The second P stands for policy. The third piece for perseverance. Thats my company. That tells you that we are not a typical biotech company thats been financed by a venture capital fund, have $20 million to start with, and we can afford to buy everything and buy people to do this. Thats an outdated model because most of the biotech companies, they dont work. They dont last, they fail.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Wow. Thats pretty cool, right? Okay.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"What?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Yeah. But the good news is that the brain is regenerative organ, meaning it doesnt remake itself. Our company I just told you, were into precision medicine. And the next phase going to be precision nutrition. But before we get to precision nutrition, were going to go to regeneration. You know what regeneration is? Its when you can use your stem cell, your own stem cell, your own body, and create and remake, regenerate your own esophagus, your own eye. Eventually, this is down the road.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Three times.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Its absolutely insane. And no one has mentioned except youre hearing it for the first time for me, its partly impacted by the virus. We have a molecular diagnostics on a neuropsychiatric system of our body.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im an entrepreneur. I made some money.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Even on cholesterol. Thats bullshit. Cholesterol is bullshit. And even Satin drug, if you take a Satin drug for five years, you know how much it lengthened your life?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah. So you may want to ask them the question if they have any medical issues and find out. For example, I want to bet that they have medical issue and our test will be very valuable for their doctor to really right now theyre guessing the medicine practices goes back to in the 1940s, basically.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I think so. And its in two languages, english and Spanish.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No. And thats how you prevent thats.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"All right. Bye. You too. Bye.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. Where are you located?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"This is great. Yeah. About seven years ago, I started a biotech company.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"We have the intellectual property and trade secrets. Okay. To actually file the report on each individual. Very interesting stuff here. So, yeah, I think a health and wellness would be top. Would be top.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Statin drugs will lengthen your life three days.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No. Well, I dont. My partner does. Hes a professor of medicine at the major at George Washington University Medical School in Washington, DC. As well as other in Europe. Hes a PhD and an MD professor.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, come on. No, I think if we can generate, I would say half a million a month, probably this is very early, Alex. You have to understand we are not an established income generating kind of enterprise. This is really cutting edge pioneering.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, like health and wellness.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I want a clickable link. I want to start as small as we can afford to. Im here on the long haul. The third people never persevere. Its almost like we want a few people who discover the automobile.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. The B to C component would be the course itself. In other words, if you can get to all the doctors, the primary care doctors, the cancer doctors, the oncologists surgeons, or the cardiac surgeons, in other all the doctors in the world, they could benefit from our course.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"In medicine and health. How old a man are you, may I ask?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Actually, Im very humble and modest. I am just looking at 10 million. Im sorry?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Thats exactly what Im looking for to do.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So your parents are probably in the most 50s.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Actually, youre right. Actually, you may be the guy Im looking for. No, let me tell you what Im thinking about doing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Ill get back to you. Okay? I will, Don. Perfect.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, I just took you off this speaker. I started a biotech company, molecular Medicine. Molecular diagnostic testing. Were really special in that we now have 30 molecular diagnostic tests for cancer and non cancer medical issues.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Huge.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Okay. So you know how weird the world has become? Our countries become a lot of killings, unexplained.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"But we are helping our part. Our service helps the doctors of the world. Who then helps the patient? You? Its not a B to B. I mean, its not a B to C. Its a B to B we deal with, for example, doctors, hospitals, clinics, insurance companies, government. Like I said, our country right now is considering using our test for the whole country, for all the females. The Social Security fund is thinking about using it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Alex? So quickly. Im not even finished. Thank you for calling.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}}]