[{"pageContent":"The alignment is great.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, so skyscraper living, its basically like real estate, basically, for people who want to get into a high rise in a big city. That is something that seems out of reach to the average person with, say, a bachelors degree. Right. And so having somebody that can come in and say, hey, look, by the way, this is an option.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"That I can hop on, zoom, if thatll keep things up for you.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Not at will, just the boring traditional spreading of just a large presence as far as advertising goes. But thats only the top of the funnel, you know what I mean?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right, understood. How did you get into that in the first place? Im curious how this even became an idea, because this is very unique.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Okay. I dont necessarily want to go into all the details right now just because Im pre launch, and so I dont want to waste your time. But as far as that goes, like, you already named dropped, like, three of those tools. Whats the general principle behind the first one?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I did not.","metadata":{"fillerID":37,"fillerText":"Ummm","category":"F"}},{"pageContent":"Youre saying at the appointment setting level, its good to have that sort of stuff in place, to be able to not only have well, first you were saying legion the first piece.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Thats perfect. Thats all I needed.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Its not as broad as it could be. Obviously some advertising is better than others.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I think I need a real estate license in order to be able to do it properly.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, if Im going to be putting people in apartments or high end condos, places like that right. Thats real estate.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Not necessarily. Again, it was pre launched and never really took off.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Cool. Yeah, I appreciate you reaching out, man.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Basically what Im mostly about is I want the names of five tools dropped, so to speak. The name dropping factors. Its really just a big deal, sort of because theres so much AI out there with chat DBT and stuff that makes chat DBT look like a joke. Its just crazy to see if you found some where you said, look, we tried plugging and playing these ones and the music is good, then Id love to see the synergy.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"When it comes to businesses which have incorporated AI into their operations versus ones which havent, that could be a very significant differentiator. So when it comes to the actual difference at the execution level, its interesting to me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I would be too worried about it. Its pretty easy. Not necessarily the smartest, but its pretty easy. Im not going to go into it right now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"We didnt know that you guys built them, correct?","metadata":{"fillerID":29,"fillerText":"Mhmm","category":"D"}},{"pageContent":"Like, has it been well, sure, alternatively I could do the success coaching sort of stuff and dial that up. The dials would be a little bit different when it comes to the application of the AI.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, definitely not. Definitely not bore me. Im actually curious how that actually works. Is it pretty much like that person who wants to get into that apartment? Lets just say theres different things in that process that theyre not aware of thats going to either cost them more money or prevent them from getting in it in the first place. And then you come in and show them how to get over those things.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"People say that, and then they see what it does and theyre like, whoa, no wonder people understand the no contest concept. You know what I mean? Right. One thing to say, yeah, thats no contest. Another thing to be like, I can see how someone trying their hardest the good old fashioned way didnt stand a chance.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"But I can imagine how it would have panned out. Go ahead. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Projecting. Okay. Its also very doable.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"And Im sure some of that goes over into appointment settings as well.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"All right, take care.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sometimes they go the other way too, and then fucking surprise, right? That is expected.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Compared to being a joke. I get it.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Right, okay. So pretty much for five k, Im going to pretty much learn a streamlined, more efficient and effective process for getting into luxury living as kind of more like average person. I guess thats the simplest way to put it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Rule and actual are very different.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Just go ahead and say for our purposes here, $120,000.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Go ahead, youre fine. I was going to say my high water mark was like a 726, but then I just didnt use my credit.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Have you considered that model? How did you learn about all this? Say that again, you sound like you got like a background in marketing. Thats fantastic.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, Im just saying, as a company, if somebody is kind of serious, you can treat the person kind of serious, kind of a joke, you can kind of treat the person like a joke. Right, I get that. So what youre saying is, look, with a bigger chunk of change, we could have different conversation. Right, I get that.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, I dont have to have personal money for anything. So in other words, if you were to have some CEO who taking his salary and doing something with it and just saving it, that salary saved up to be expended for the business. Just like reinvesting your Ramen money bootstrapping 10,000. Right. Not miraculous, but pretty good. Compared to the average minimum wage worker.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, really quickly, I noticed that you said that the recruiting as well as back end are kind of paired together. I found that kind of interesting. Why do you guys pair those together?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I mean Ive got like less than $200 to my name.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"I havent yet. Itll be an option here shortly. Im pretty excited.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Thats cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Or no, not yet. Thats what Im saying. Literally, I handed the person the dollar bill, and they handed me back my own dollar bill maybe less than five times. I mean, it was really not even a litmus test.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, again, putting it at 120,000, Im putting myself out a year in the future, so to speak. In terms of how much in a lump sum? Probably 40 grand or less. Maybe probably between ten and 40 grand. I know it sounds like a pretty big window.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Im in the middle of kind of an important chat right now. Is it okay if I just take, like, maybe 15 seconds here and let the person know Ive got to take the call?","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"That will include the five tools.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right, okay. And then how much are you planning on charging for that?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Right. And thats one of the things that is kind of exciting. I went from being homeless to now having a job doing gas and electric. So thats going to be a pleasant change of pace. And it is a sales job, so my income is more flexible that way compared to salary position.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Hey. Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I think Im around like 650 ish holds up.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Personal credit score.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay, just a second. All right, go for it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Now, realistically, for the purposes of the conversation, zero.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}}]