[{"pageContent":"What?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"I even wanted my menus on my tables to be digital. So when you sit, the menu will appear in front of the table, be a screen. And I bet youve never seen that before, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"How are you doing?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Well, I have disability to some degree from former work. I did a lot of outside work. I did construction, but people used to do temp labor. So I got like $1,000 a month generally from the government, from the Social Security stuff. But Ive been using that to reinvest it, to try to grow into a bigger business. At least $500 of that at least goes into try to put that into trying to some kind of not savings, because savings wont do it. That just makes you sit there. But you know what Im saying? Reinvesting into businesses to try to really grow, to put that money out, to try to make it bigger or savings, thats actually going to whats going to be used towards going with some investors, towards a property or properties that Im putting in off.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. So thats the way I see it, at least.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, thats why I said, Im always trying to double something. So I told the guy, I said, well, you got to give me yes. And he said, my profile, hes building my record. He works with company to build their scale up their money, because he knows $100,000 will get me a property, some kind of property to double that, you know what I mean? I need a business loan, basically. And based on my business, I can get and forget my PG. I try to keep my PG out because I know its still building. And Ive been trying to repair it for two years. It takes a while to repair it. Like I said, I went to business school. I went to Penn State for two years. Then I went to another business school and I went to another business school, and I got my degree. But it was expensive. Lets just say it was very expensive, you know what I mean? Penn State took four grants to pay the tuition. And then some of the money I didnt even have. I had to get cash, credit cards and stuff at some point. So it was ridiculous. People think it aint cheap, you know, that it aint cheap to get good education so that you can say that youre certified. You know what Im saying? So, I mean, hey, it aint easy. People, they think, theyre like, oh, well, it was cheap. No, not cheap at all. So expensive. Oh, I love Penn State. Not say I didnt love it, but it costs a lot of money.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, I dont have a particular business. Im in the commercial and residential space, development space. So I develop all kind of businesses from dog parks to restaurants to security companies. But the first few companies I have is Im doing a couple of dog parks. Im actually doing a security company. And also I have a restaurant Im opening, and I actually found my own CCTV cameras. Thats why Im doing the security company, because I wanted a reliable security for my businesses in the future, too. So Im going to do the whole ex military hunting thing and build my own team and swim my own culture of doing it from the ground up, everything from the ground up. Building it to be a custom kind of thing because its kind of like with AI and stuff because Im a technology child, so technology is my kids. I used to be able to build it from the ground up. Im used to controlling everything. So thats the whole thing behind it. And even with my restaurant, its all mostly technology. Bartender, sound, newer technologies thats around that I found out about, you know what Im saying? So I already use a lot of AI in there, and I just trying to find any additional information, additional information about any AI technologies as this, you know what Im saying?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Speaking.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thats what I actually do as well. I do have a consulting agency. I consult other businesses.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I think its still trying to probably still trying to get to me. My mail is a little full today.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah. I havent been to Charleston. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thats the role I hope to have. Im still working that in there. I havent had one on one with the membership person yet. Marcy over there, but theyre very small. They dont have a lot of I noticed they dont have a lot of positions that should exist in that kind of chamber. Its like the only person I was in, the one at Hampton, now they have one Upper Virginia, but the one in Hampton only had listed was a membership director. They didnt have other positions listed. Im wondering, but maybe thats because they dont have people in that position. But that just means they need more people with more initiative to come in, you know what Im saying? So Im all about economic development and money. I like money, helping people make some money too. People just dont realize that businesses develop. That means you can assert the cost of that because everything costs when youre in business. I aint got to take a large chunk when its about helping my community of businesses and my fellow brothers and sisters as well as my community. Im all for it. I mean, I do got to make some kind of profit in order to keep giving them help. So I understand that part too. Some people dont. Thats what I mean by that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"The business start up. Well, I used to operate in Philadelphia. I had already had a corporation. Its called Clark Development Group. Im the CEO of the company. But I just moved here to Hampton, so I got my LLC. But COVID slowed down a lot. I was here doing COVID, couldnt do a lot. And it would have been quite hard to do the kind of restaurant I wanted during COVID So a lot of that stuff just started and there was a lot of zoning stuff that didnt exist because of the department not being in existence right there at that point, because they were slowed down because everything going on. So a lot of people just two year marker for everybody. Finally really getting back to the regular, normal business with everything in most cities. So its like dealing with the city over here. Technologically, when it comes to processing paperwork, theyre like country, theyre real slower. Its like one or two people responsible for it. You get my drill. So theyre like backed up from paperwork from other people and then they try to process the new stuff. So its been a whole you know what Im saying? Its been a whole process just trying to learn the zoning department here.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"The money? Yeah, money I could double every day. Oh, that was great. Yeah. Im always looking for opportunity where I can take shooting. I always say if you got $100, you should look to double to $200. And thats the minimum that we can double that will be worth it. Not to say $50 double dont make nothing, but I think $100 double is always better than the 50. Because you double $100, thats 200. You double that against 300, 400, 500 comes real quick. The faster the better, because the closer you get, the 1000, the better, because once you hit the 1000, youre doubling quicker. Its a ten generation kind of thing. But Im like well, why? Because, see, the amount of money Im looking to hit, I had an opportunity to get a loan based on previous from Philadelphias business numbers. They told me I can get $100,000 if I can get them a $3,000 what do you call it or not? Holder its called not a down payment collateral. I have to give them $3,000 worth of collateral in bank money thats in the bank. It has to be $3,000 in the bank to get the $100,000 loan. So its a company thats going to lend me a business loan, $100,000 for the three. So Im like, okay. And it gave me some time.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I just joined my black chamber. I just recently joined the Black Chamber Commerce here in Hampton, Virginia. They dont seem to have much of a field team on things. So I see opportunity for me to be an economic development chair, business and economic development Chair, where I can use my already consulting business to be the independent contractor to really grow my business at the same time, you know what Im saying? So the businesses that come in, theyd be under the chamber, but therell still be clients separately from they can book a session with. You get what Im saying?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And shes something to look at. I mean, shes not some girl. That just girl something to look at. Pre faced a girl, too. That killer brains and killer faces. I think she took a picture. I was laughing. I said, yeah, she do fit right in with California crowd. I mean, if they underestimate just because she looks stupid, that girl aint stupid at all. She know a lot more than you think. You have to compete getting next to her because shes very smart. And being at 20 something she was on Wall Street, that tells you how smart she was. She retired from Wall Street at 20 something, because Im sure she started working in Reverend Young. I dont know how she got into that. I dont even know how she got in. Im not even sure how she got in because I havent read her whole I just met her, like I said, through the group originally looking for a real estate group. Build it up there. I was looking real hard for one, and thats how I found it. Otherwise, I have talked a couple of times about different paying business opportunities we had and trying to she hosts things every week. Its a really interactive group. And even though shes in California, shes still in Philadelphia. Because, like you said, because of the intelligence of the computer, you have zoom meetings. She does Deli, what they call, you know, how they do hunter things she has. They do high state real estate hunts, and they talk about properties thats available. She still buys properties here in Philadelphia. Shes still making money here. Shes making money in California.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"To yeah, thats true. Okay.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Thats part of whats been holding me back as far as just the initial acquisition of the business. Because Im like a high aim when I aim at the properties Id like to develop when I first buy a property and bid in business. So mine is like a 600 at this point, but people still require about 640 even for a mortgage, and they go up 40 points. Seems so hard. And every time I get halfway there, I lose the 40 points. I dont understand from just applying for a credit card or something. Its ridiculous. Theyd be like, Your score went up 40 points. But then I look at them after that statement and says, your score went down 40 points. Get me. So its like, how did I win and lose at the same time? I didnt win. I lost because I applied for something I actually knew was the card that I was trying to get. And I dont get the card at the same time. So thats like another 30 to 60 days where they look at it again, it will go up 30 days before they resend in the new numbers. And Im like, but Im working on it. I have had people working on for a year. I have all the credit, karmas, credit suite, Capital One, whatever. Im constantly monitoring it, trying to work on that. But what Im trying to do right now is my business credit side because that by itself the FICO score of 80 and plus and trying to get the past year Ive been working on being able to buy things for business credit and not relying on my personal PG. Thats what Im trying to get it to. So Im not relying on my business credit. Its not about me. Its about the people that I have in my investment core that can our score together as a business instead buy things, you know what Im saying? And that we can all make good profits for the people thats involved with the investment, the real estate group. So Im trying to make sure it boosts everybody. Now, I do want my personal score high so I could buy properties myself, but I figured each thing would benefit itself. You see what Im saying? The more money I have to benefit from the business, then I can have money to really allow that repair faster. Because you have more money you have in your pocket from the business you can actually repair. You saying your personal credit faster because it costs a lot to repair your personal credit seems like faster than it does to repair your business or Im sorry, build your business credit in reverse. Its like crazy. I dont know why. Its a whole thing. What I really was hoping to gain, I remember why. Because I wanted to get on the right steps to actually doing it the right way. Starting steps to get my because its like I am rebuilding my credit from scratch. Thats what I feel like at this point, because Im building a whole new profile myself for my business and putting myself out there. When people see me, Im trying to get it to the point where I need to have certain goals financially and personally from a wealth angle. You know what Im saying? To the point. Im lining up. I think I have a phone meeting with somebody from JPMorgan Bank, give you example. I mean, the property I have that I want to acquire for the second property in the business is a $500,000 property. Historically, it was for summer home for businessman in Virginia. And its from the 18 hundreds that used to vacation in Virginia. I was in Charleston. I know you heard Charleston, Virginia before, right? Huh?","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Sit down at a restaurant. Yeah, you never sit down. Restaurant. Four menus appear on the table right in front of the people that sitting there, theyre looking for the menu. Wheres the menu? Right in front of you. Yeah, I was trying some new stuff that I came with in my head. Ive never seen that before, though. Never seen the technology. I dont think it exists. And if it dont, it can always exist. Thats what I would say.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I get back per month, though. Its only like two grand right now. Im trying to double the money right now to make better investment for my business. Pretty much got you take about $700 of the money, and Ive been trying to take each month and put it aside and put it into account, but Ive been saving to build it up to something that being meaningful, like, I dont know, at least a couple of grand. Im not saying no more than two grand. Two grand aint nothing that wont do it. Five grand, ten grand there. I figure that then youre talking some numbers you can get doubled from another person or a bank. You say, Listen, I got collateral, you know what Im saying, as collateral kind of money, you know what Im saying? To get more money. Some people dont think you can do that, but you got yeah, exactly. Got to double the money. So Im trying to think of what number would I have to double?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]