[{"pageContent":"Yeah, somebody had messaged me this morning.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I said, somebody had messaged me this morning. Was that you?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Its not significant. Its just where I was before. So I would like to get to that point again. Before COVID I was doing obviously a lot better, but my clientele was all HVAC, plumbing, electrical guys, so it was very hard for most of them to keep their businesses open. And then I had to take a step back and then had to reconfigure my own business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Annually.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"From everything Im doing, about 200.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"This is Kami.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, I do. So are you working with coaches and consultants who just want to create courses?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I would like to end around 250, which is where I ended about two years ago with it. So I would like to get to that point again.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"A little bit more about what you guys are offering and then what platforms you guys are using. And all of that. Whats your process?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Its not where it should be. So lets say under 1000.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"How are you doing?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So, my pricing right now is about $12,000. But the few clients I do have right now, theyre like my best friends brother whos starting a business. Right. Or its my best friend sister whos starting a business or coming up a proposal. So Im doing a lot of other things that I typically wouldnt do with a normal coaching package.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I just launched my own company. I would say I launched it two years ago, but I picked up new clients this year.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im probably around 80%.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Would assume, referring to got it. Yeah, they said that they have some availability, and I said, oh, like an hour and a half. I was fine for a Zoom meeting.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, this is a two folded story. So I own my own coaching and consulting company, and then I also work for an electric toothbrush company. Im their COO. So Im interested for both purposes because most things that I do sprinkle into both of my roles.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Thank you so much.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Were doing courses for the toothbrush company as well as my own. So thats why Im kind of like is that why we have such a distinguishment okay, go ahead.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, no, and I think that because this is probably not a good fit for the toothbrush company, it seems like, at the same time. So I think we should probably just end the call.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"ThatS not an issue. I have income coming from both areas, so Im not too worried about that. Its just more like what is it that I could use possibly in both of my areas that Im looking at.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So Im partnered with a couple of distributors, so my clientele has always been typically HVAC. So I work with a few big distributors here who know me pretty well, and Ive been annulled probably 70 clients through them.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"What I mean specifically is, hey, thats not a downsell. Thats me breaking up the payment, like a payment plan. Thats exactly what you just told me with the other person, so oh, well give you right.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats fine.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"As long as they can afford it, they typically work with me.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hi. How can I help you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Not for my company, no, Ive never needed to.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Thats fine.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Already do that with my client. Perfect.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, no, thats okay.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Like 640.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"That for coaching and consulting? I dont know as of today. I mean, two years ago, it was different.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"So instead of them paying me, lets say $12,000 up front, theyre breaking that up over the year.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So I would be interested in knowing what services you guys provide, and then when it comes to marketing and all of that, that automation piece, I would like to see kind of what that looks like, because were just at the point with the electric toothbrush company that we are starting to run ads. So I would like to see kind of, like, what that would look like and then kind of what is already going out there. Were already using chat GPT. Were very comfortable with it. But I know that obviously theres a lot of other AIS coming out all of a sudden overnight, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im on social media and stuff and Ive gotten a few clients off of that and theyre not HVC related so much. But there are other random businesses. Either theyre startups or theyre somewhere in that ten year frame, typically. Did I lose you?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Just meaning that thats not part of my process. Today, again, Ive been in industry for a while, so most of my clients that come to me, Ive already vetted at some point.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, thats perfect. There you go.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I have just my normal scheduled clients that I work with, so I probably have 20 appointments technically a month.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats why I would use the electric toothbrush company in that sense, you know what I mean? Because I have funds here, I have investors. Its a different world that we can cross into pollinate. Thats why I called about both.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, I dont work like that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"ItS not even ends meet, to be honest. Its more just okay, great. Let me help you out with this for the next however long. Yeah, I mean, I have twelve months contracts with them, but still.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Right, awesome.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, my leads dont walk away, so Im good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, I do.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes, I do.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Ive been coaching for over 20 years, but just not in my own company.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"We take the more educational route versus, hey, we have an electric toothbrush, we have a patient care program. And so we actually teach more dentists how to have an entrepreneurial mindset. And we use that with our program of how to create retention. So its a weird combination of somehow were coaching our dentist, plus we have a product that were working with that on.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So most of these things dont apply because of the fact that how Im generating my clients right now, versus if I was marketing and I was running ads and the things that Im doing right now. So everything youre asking me more applies to my toothbrush company versus my coaching company.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay, thats a game changer. Thats not how you presented it, but I do understand what youre saying.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Do I have what was the last word that you said?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"So any leads that I get, sign up with me, they work with me. I dont let a lead just walk away. Unless theyre completely disqualified, they absolutely have nothing to bring to the table and that doesnt work. Somebody who has an idea to start a business, thats not somebody I want. Somebody who has a business and theyre starting to take the steps and they have some money in the bank, thats the person I want. I can handle that person. I cant handle the person who has a dream and has no money to start the dream.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I think the last five years Ive had one.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I know what is a qualified lead for me and whats not. Yeah. So in the sense of do I have a plan for it or a funnel? No, I dont have a funnel for it because I am the person who qualifies them or my assistant does. I know the business. Yeah.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Theyre 100%.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Being able to cover a month. Yeah. Because they pay smaller amounts and vice versa.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}}]