[{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, Ive been in business for a while, to be honest with you. This is not a great time. Im a CPA. We got a few more days left until April 18. But you did reach me, and I think I did reach out to you. So the long story short is once the 18th is done, I want to pivot back into our marketing efforts. Im seeing a lot of stuff with AI now chat, GBT and various other platforms that are out there to facilitate marketing efforts. We use HubSpot, and were just trying to pivot back into, like I said, the marketing effort and trying to figure out what is going to be the optimal approach. I mean, weve been doing pretty good, but now I think its time to spend a little bit more effort and figure out what we should be doing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I dont give that information out.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, its highly technical.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sal speaking.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"So let me flip this, man. Tell me a little bit about what you guys can do for a business like this.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Well, you got to tell me what you can do. Tell me, because I havent heard yet what you guys can do to scale this business.","metadata":{"fillerID":29,"fillerText":"Mhmm","category":"D"}},{"pageContent":"Right, so you havent explained at all what tools you use to do it and what differentiates what you do versus using products like HubSpot and some of the various dialing platforms that are out there. Im not understanding, really?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Again, theres no closing conversation. I mean, you got to get people interested, get them in the pipeline. This is a marriage, right? Were not trying to sell a $50 Widget. Right. Were selling a whole infrastructure of service just through our HubSpot campaigns. Weve got about 1520 people, 30 people that turn into marketing qualified leads through our efforts. And we just started this maybe about two months ago.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"All right, and then what database are you using to make these phone calls? Database that we provide or a database that you provide.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yes, there is definitely. Again, if these people and again through AI, through Intent Data, these are people that weve acquired that have expressed an interest in our business. Now that doesnt mean that that data is 100% accurate, you know what Im saying? But still we reach out to them and for the most part we have pretty good success. But now were going to go more into the phone follow up. So we send a campaign, we send a follow up campaign. We see people opening emails just like we did here. Some of them click to downloading information that we provide. Some of them go to the website. So we have all kinds of analytics in HubSpot and we see that based on that. Now my inside team is going to go start making phone calls just like you did for me today. And Im just trying to figure out if there is an easier way to automate that process. Maybe not. Maybe its just send out emails, look at people that are expressing an interest and just follow up with phone calls. So I dont know if what you can do can accelerate that or amplify that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Case studies to me are Ive seen so many case studies. Ive seen so many testimonials. Ive seen so much so much of that stuff. It doesnt faze me. What phases me is a factual background of what you guys do thats going to automate and amplify, like I said, amplify, automate the process that we have in place right now. Otherwise, Im sure what you do costs money, and the question is, is it worth the return on my investment? So you need to get somebody if youre call me and let me know specifically what you can do to generate those leads, to get them into this dialer, to make the phone calls, to make the connections, to set up the appointments, thats what I need to know. Otherwise, what were doing now works. Its a good platform. Its maybe not as high scale as what youre doing, but Im sure the amount of money Im paying for it is substantially less than what Id be paying for a service like yours, which you havent even told me about. Right. Lets do this, man, because I got to get going. I got a tight couple of days left. You can call me or have somebody call me after April 18. I wouldnt call me 18th. I wouldnt call me on the 19th. Id call me either the following week because Ill take some time off, and then we could pick this conversation up. I got other people calling me in the same genre of this marketing automation stuff. Theres a lot of people thats out there now leveraging chat, GBT, and various other types of technologies that want to talk to me about this platform. So Im all ears, man, but the week of the 18th, thats not a good time to call. I would say that following week, have somebody reach out, and well take it from there. All right.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I dont know. We could certainly scale to at least a quarter of a million a month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im sorry, say that again.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"So how do you provide this mechanism to get more leads that you would dump into the dialer.","metadata":{"fillerID":29,"fillerText":"Mhmm","category":"D"}},{"pageContent":"But how is that possible? What do you do differently to get a dialer is a dialer. Its only as effective as reaching qualified decision makers with valid contact information that have a valid and authentic interest in your service. So what is it that you do specifically that makes that connection 68% versus 25%?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You getting no, we sign a contract. They sign a contract with us. We become their outsourced CFO firm, and then we have a whole team of people that marry right into their business, and we set them up and do what we do best. So its a whole plethora of internal onboarding and so forth. But Im trying to understand what you could bring to the table here, because I think this whole AI thing is very interesting with respect to marketing, and there are a lot of people that have reached out to us. And the question is, how do we leverage our HubSpot, our lead generation, so to speak, to put us in front of or at least acquire business owners that are looking for CFO services? Now, like I said, there are companies, I guess, like yours, that have somehow scoured the Internet to find people that are downloading forms or requesting information for CFO services. So were trying to automate that process, so to speak, and see if we could get ourselves in a position where we can get more of these leads into our HubSpot and get our internal sales team reaching out.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"We actually are the CFO for about 100 businesses.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Percentage of the leads that I connect with over the phone?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, its been doing it for a while. It works for us.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Sounds good. Yeah, Sal.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"You got it. Bye.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Again, I dont give this kind of information out.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, sure. Why dont you send me the video so I could take a look at the video and then call me on the 19th or the 20th and then we could take it from there.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"We stopped during our tax season. I cant pick up any new business during tax season, but we were picking up maybe four or five appointments.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, we do. We had a service of what do you call it, intent data. Theres lead generation services out there that go out and they actually found people for us that actually are looking for CFO services, and we put them in our Hub spot and started sending campaigns out to them. And now were just trying to once the season is over. We had a number of people interested, and we just got a couple of inside salespeople now that Im going to be putting on board into a HubSpot and chasing people down.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, Im a CPA. I have a CFO business.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So, again, theres always objections in any sales related business, clearly. Right. But Im trying to understand what makes you different than the process that we currently have in place. We send out emails, people show an interest, we follow up with phone calls, we track them down in salesforce or HubSpot, and thats it. And then we go through a closing process and a process for closing. What can you do to accelerate that process? You havent answered that question yet.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"So what were trying to do just to cut to the chase, I mean, were just trying to put ourselves in front of all businesses that do about a million dollars a year. And more in sales and to get the conversation, just like the conversation you and I are having now. So that we introduce our services to these companies and do it in a way that leverages the AI thats out there today.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I would think 250,000 to 350,000 a month.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So again, were at that stage now where were going to be bringing on some inside salespeople. We used to kind of do that internally, but thats a process. But anybody thats expressed an interest usually picks up the phone and we talk to them and then they bring them to me and I talk to them.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Good deal. All right, thank you so much. Take care now.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]