[{"pageContent":"Ill be reaching in next four or five minutes. Im going to pick my daughter from this goddess school, like, daycare after, then Ill be home in next ten minutes. Thats why I said Ill call you back in 30, 40 minutes.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Nick. Hi, Nick.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And marketing. What do you think is marketing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"What I do is I charge them for all the hourly based service, what I do with their market, and then I tell them, put your card on the Google Ad or Facebook Ad, Instagram, wherever you want to do. I just suggest them and I make ads for them. And then I charge them for SEO. But in SEO, I tell them just like, dont expect anything for six to eight months.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont have any packages, so I do, according to client, whatever clients need, I make packages according to the client. Some are making almost like 50,000, some just making 5000. And mostly my clients are small business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, thats my personal I didnt get sorry, bro. Today. I just checked all the clients customers, all that kind of emails from the bank.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"I remember last week I wanted to call you, but both wisdom did, like, on right side, upper side and lower side. Both they were got infected. I cant sleep two nights. Then I went to dentist, and he extracted both of them. And I was in swear pain for, like, four to five days. And today in the morning, I came to office, like, after a week. Im sorry. I know. Even my guy, he also given your message to me, the guy from area, I called you, I was like, yeah, I booked a call with them, and I told them to call Friday. I was like, okay, so Im so sorry about that.","metadata":{"fillerID":39,"fillerText":"Yeah","category":"F"}},{"pageContent":"Ill be there in next three minutes. Ill pick her then. My house is like only four or five minutes, but you know, its a traffic time. Lets say its ten minutes. I can call you around 620 Est on same number.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Can you tell me what email you have on the I dont know, its my work email or my personal one.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"According to business, if you talk about this, like, recent I was doing last week, its a mobile car wash, this guy, so hes like around this area, south Jersey area, theres nothing. We just have to make his website and start doing SEO. And its like, after two, three weeks, it was really impressive. Its like all things, they depend on all this competition. If we say in lawyer office, if we say we have to get like a personal injury client, which is like half a million or 200,000, 300,000 clients, we cant do even like in couple of years. I dont think so. We can compete them. We can just do with ads. But in this case in ads like Google Ads, you have to spend like $50, almost like $40 to $50 per click. And my clients, theyre willing to spend, but I dont want to take a risk for $3,000 them and theyre not getting any leads or not getting any client. So only two, three lawyers who are like Im doing ad with them from like three years. So they are getting good leads and stuff, but they are not from personal injury, they are like other stuff.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You were making and theyre going to close it.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Can I call you like, in 40 minutes? Because actually I am stuck in traffic.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Let me put my phone on my car, like YouTube.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, because this us, like, in New Jersey, we have two offices. So over here, main thing is marketing. Just like in software. Software we dont have to market. Software is like, whatever people demand, we make for them. But in this website and all these mobile applications, we have to do marketing. Clients ask us to promote all these businesses. Then for that, I have a couple of people who do ads and stuff, all these SEOs, SMOS and this PPC stuff. Even I know about it. Im like Google certified to do that. And even right now, Im going to renew it, because after 2020, I didnt renew it. All the certificates due to all this COVID and thing, then we think we have the guys doing that, why should we do that? But now I was like, no, I was having little time because of my other sidekicks. I do house flipping also, but from last like five, six months, its like nothing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Like, net is like around 80, 80,000, with, like, very less clients. Right now, after COVID, I lost almost 40% of my clients because they were the businesses which were like, people were not taking their services or not. I have mostly service based clients. And then these garage owners. After then all this mobile car wash, then car washes. So basically all this then I have more than 15 lawyers, like lawyer offices. So these kind of clients, and theyre always looking for leads and stuff, but I was thinking that I make lead and then I can sell them. But thats something right now, its not working with me.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I look here for AI software. Im pretty interested in these things, especially this AI, because I know that thats the future in coming. Five, six years, its the same. Like, we used to think, like, oh no, about Siri, or about all this technology you were using back in 2011, 2010, when we were kids, like, were going to college and stuff. We cant think about it. But when I did all this computer science, engineering, then I did Masters in It. After then I worked for companies back in India for six months. Then here again six months. I permanently moved here in 2016. That was the first time I moved out of India and I got my green card stuff. Then Im here after that. Then 2017, I started my business after working with couple companies here. One was just like project to project. Other one I joined them, but it was like, I already know what theyre doing. They are already sending the work back to Philippines and stuff. Then I was like, I have people in India. I can send the work over there like 50%, 60%. I can give some discount to my clients. That thing, I was like, Im not going to do this job even from starting, Im not like nine to five guy. I used to wake up at night. I like that. And woke up like around 1130 or twelve in the afternoon. So this was the thing, because I kind of managed team in India, like people in India. And then one of my friend, he has a company over there. So I send almost like 50 60% of work there. Then sales, then automation, then testing we do here.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, now I can hear you. I just connected you to Apple play.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Oh, its going good. How are you doing?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, now its a little better because for two days, it was all cotton. After every couple of hours, I have to remove the cotton and put the new one. It was a kind of cotton. It was like some bluish, like, liquidy thing on the cotton. And doctors are like, you have to put until the blood stops.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]