[{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, I just saw the thing and it says it could help on it. I just wanted to see what you guys had on that offering. I own eight physical art galleries, four manufacturing facilities, and 13 meta galleries.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I put nine art galleries in the 50 yard line locations of the highest volume tourist destinations. I dont spend a nickel on ads.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Not really, because I either sell to them already or I put them out of business already by selling next door. Right. The economy right now is so bad. Its way worse than people think because were the high end luxury good. We feel the facts first. Were the first thing they stop buying. Were the last thing they start buying again. So we get slaughtered off the start. We average 2.6 million a month between the galleries. We did 143,000 in February. 143,000? Whoa. Thats how bad it was. So it happens when the news says the banks are going under after all the rich people got out and said, okay, everybody out. All right, lets talk about banks today.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Everybody back in. All right, everybodys back in. Hey, guess what? The bank starts collapsing. Anyways, pleasure talking to you.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Yeah. And then you got 1% will kick down 20 grand on a piece of art.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"All the people that dont do the work.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Plus, our art is unique on metal and moves. So a picture ad does do shit to it because we have 91 million people a year walking by star doors.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Meta galleries?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah. There used to be hundreds and hundreds of what? Im a publisher. Im an art publisher. In 2008, there was three of us left. So between the three of us, we have 105 cruise ships in every major market out there. So we already sell to all the other galleries. Wow. Thats it. Okay. Well, if you can think of something I can use with all these buckers besides selling them phone parts. Some cases.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"No. People that come in, youll have to look at my website, artgroup Inc.com. We have the most bitching art on the planet. The artists are like, they all invented their own styles. Its very cool, very kick ass. We have shit. We got shit. Tons of people that walk through our galleries all day long, but most of them cant buy 99.99% of the people that enter. So my dumb ass, 15 years later goes, man, I need to get more followers. Because we all ignore the Instagram and shit because ten years ago, its just a bunch of kids cant afford anything. Well, now theyre 35, but they got jobs. Fuck. So I was trying to figure out, how do I get followers? And Im like, oh, fuck. I got them walking out of my door all day long. So now our sole concentration is to try to get every single person that walks out to follow us on our Instagram and Facebook. Were getting, like, I dont know, 600 a day now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Dollars.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Now, my new model is those are high volume generating lead generators that also sells art. Now, our sole goal is to get the followers that come in. They cant buy an affiliate program. Maybe thats something were selling them.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, it is a different sales process, but I have this new sales process.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"A little bit. Im right now trying to find AI artists, artists that can talk to the AI in such a way that they can get it to create just a tool. Its no different than a fucking paintbrush, dude. And if I can think like that, maybe Ill just last a little longer. Well, anyways, well, I was hoping maybe there is something we could do, but I dont think coaching is in my there isnt enough people in this art industry to do it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"ThatS what you guys set that up or I set it up.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah. Okay. Yeah. I think that for us, I dont really care to talk, maybe, but this is about building a coaching business, right? Thats what it is.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hey, hows it going? Im really slammed this week. Okay, I emailed back that Ill get back to you when I can. So were just moving a migration of a system over, and I own 13 companies, so Im kind of overwhelmed actually. You know what? I need a break. I need a break.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Because our average sale price is 9000.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All Right?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I mean, I could I just fired I just fired myself. I put someone else in charge of my company. So I could just develop Web three apps and do the things that I want to do on that for art. I hate running the galleries, so I actually have a lot of free time now. But I dont know, Ive done public speaking for ever. I mean, we do art shows worldwide, front of audiences, like 400 people, because we do big art auctions. But I dont know, I was hoping it was on that end of the sale of what you meant by the big ticket. This is more about just using chat to write your fucking speeches, right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Brain Break. But if you ever think of something I could do with all these leads and something else, then speaking. I mean, I can speak in retail because Ive been doing that for 40 years, but other than that, art. Im an engineer. I didnt know shit about art when I got it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"How.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"All Right. Have a good one, Dave.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right. I almost want to do it and tell them, dont do it, man. Art sucks. Fucking computers. The computer is going to be making all the shit. Ten years. Were the dodo. Were seriously the Blockbuster four years away from fucking Netflix coming out.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Okay, so I dont know what the because I built this whole back end system using chat, helping me write the code, but I didnt know because you said high ticket. I dont know what you mean by a high ticket. Is that volume ticket or high dollars? Like $17,000 and above high ticket.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Not really. I dont want to tell people how I did it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Tell you about how they do the work. None of them have ever done the work.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. So our galleries are in Awakeiki, Lahaina, Maui, Laguna Beach, Key West, Miami, South Beach, Vegas, tahoe Acid and Scottsdale, Arizona.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And then from that, selling fucking phone cases and shit. I dont care. So I am switching my model around, but I was trying to figure out what you guys do. Thats why I was asking on it. So I wasnt being, like, an asshole about it. Im just like, no, what do you.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Youre saying you can find me high ticket clients for leads?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, no. Well, I dont know what youre that ad was the most confusing ad ever. Hey, were a high ticket place. Were going to show you how to help you get increasingly easy to get your money by using the AI. Now, I use the AI for a lot. It writes all my ads because I cant spell for shit. But that ad is very confusing. I dont know what you guys do. Thats what Im asking you right now. So is that what this is? Use the AI to help you, I guess, do public speaking?","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}}]