[{"pageContent":"I need to make at least Im making about ten grand a month now. I need to be making at least I want to make at least, like 30 40 grand.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hey.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hey, say that again?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"How are you, Alex? Whats up, man?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"How do you know youre the right fit? If I never said if you dont know my business model, right? Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I got a certain amount of money.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Before we get to that point, if you dont mind, you said Alex, right? Okay, Alex. All right, Alex. So check this out. What companies have you guys worked with.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I need to make more money. Just want to make more money, man. More money? More money you can put into the business. Better lifestyle, better family, but essentially more into the business so the business can grow. All those other extra stuff, they just come naturally. But the business needs to grow.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I see what youre saying, Alex. I like the idea. Get some coaching, right? Get some coaching up in there, and then at the end of the day, just go out there and just teach the people how to want to see Social Security company.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"My credit score is $800.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Ten k a month. Ill probably make another 5000. Just doing, like, little side jobs, executive protection, things like that. But Alex, dont disrespect my I really appreciate it, though, but I dont want to waste any more of your time, though. The reason why I signed up for the program, it said AI, so I thought something was some sort of artificial intelligence that you guys can use your program to actually help scale my business for our security, physical security. But it seems like you guys can do that and its not a problem. But I do appreciate for reaching out. This is not something Im interested in doing.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Heres the thing, right? My business may be a little different than what you guys usually do. So essentially, I have a security company, right? We deal with a lot of physical security. Eventually, Im going to be segwaying into cybersecurity, but as of right now, were doing everything from physical security. So what I mean by that is its like doing physical security for construction sites, hospitals, peoples homes, executive protection for high level clientels celebrities, asset protection, anything thats obviously of high value to them, we protect them. Money drops, properties, even virtual protection. Monitoring peoples homes, making sure everything is a part to deal with that. So what Im looking for specifically is Alex is to drive up new revenue and new leads. What I mean by that is I need more business. Thats it. I need a system in place where I can have calls, high sales calls every day, where people are going out there, finding new business from bringing those businesses in closing out the deals, or may not necessarily close out the deals, but give them like, a little just like what you just did right there. Give them a 32nd introduction, and Ill just take it from there. Thats what Im looking for. Im looking to drive revenue. So I know all those aspects of the AI and things like that. They deal with a lot of sales, coaching and things like that. But essentially my business could be in sales too as well. But I just need to close out those deals for security, get those leads in. You get what Im saying, right?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, youre fine. You know what youre supposed to be doing. I appreciate it. All right, brother. Have a good one. Thanks.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Brother, thats not a problem. Im just asking what business have you guys worked with already? Thats what Im asking.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Hold on. I asked you for your company. I just said, just be honest with me, dont bullshit me, and ask you for the companies that you guys already had for. But I am interested. And youre going to try to switch that role on me by saying that you dont think this is the right fit for me? Come on, bro. You know thats not professional, right?","metadata":{"fillerID":39,"fillerText":"Yeah","category":"F"}},{"pageContent":"What process is that?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yes. Give me some more info about that, man.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I dont know what you mean by high ticket offer. What do you mean by that?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Worrying about that? That comes down to it. I dont really care about that. My sole priority in life when I get out that bed in the morning is my business. Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Because heres the thing. My thing is, I dont want nobody bullshit you. Get what Im saying? If you just be honest with me. Put it like this. I want to do business with you guys either way, but the only thing is, I just dont want nobody bullshit me. But thats why I ask, is, like, what type of companies have you guys worked with? If you can get the info on that for me, because I dont mind buying whatever you guys are selling.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I have to make a certain amount of money. I got to look the part is what youre saying.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, perfect.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay, you know what? So what do I do then, Alex? I want to make 40 grand right. A month since additional income. So what do I do to teach the people?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"You said a process. You said something about a process. What is your process?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Im doing well, man. Im doing well. Im actually at one of my sites right now. Just doing some paperwork that Im about to roll out of here. Whats going on? Okay, awesome.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, perfect.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yes. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}}]