[{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, my strategy is to bring as much in as humanly possible. So I have a three man team. Were a little different. Were not just the guy whos getting on the phone with a credit company. We actually put a team together. So Im hoping to see 100,000 a month. Im hoping to see 200,000 in sales a month. Im hoping to see 300,000. Theres no limit, and theres no reason that I wouldnt advertise to get to that point. So I want to scale it as big as I can, but somewhere two and a half million dollars a year Id like to see coming in the door.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I just think that as a net profit of 15% to 20%, I just feel that thats where we need to be to be a viable company, you know what I mean? So after the bills and everything else, me and my partner would like to see about 2020 $5,000 a month each on the table. Now, Im realistic. I know that dont happen in two months. It could take us two years, you know what I mean? But thats the goal. Thats the short term goal. Right? I believe we could do it a little faster. I believe we can do it a little faster. Now we have a company thats taking care of our Facebook and doing our ads and stuff like that, so were guaranteed 50 booked appointments a month. Out of those 50, were hoping to turn well, just because were just starting it out to see how it works. Out of those 50, were hoping to see if we turn ten if we start turning ten leads, I mean, 50 leads, 50 booked appointments in those leads, then Ill bump it up a little bit, but I want to just see if its going to work. So that was one approach we were taking. Were doing some Instagram and Twitter and stuff like that. So were about ready to launch that. So were going to do some old traditional advertising, billboards, stuff like that. So we got a couple of different approaches to how were going to get there, and were not scared to spend money to get there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im trying to figure out what the market is right now, and the market is people are telling me Im crazy at 1500. Im not opposed to anything. I was going to touch and feel it as soon as I started getting on the phone. I was going to feel each individual out. But right now the problem is lead generation. Right. So I need the leads.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"100%.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"HereS what I would like to do. This is what I would like to do. Its Saturday. Im in California. My business is in Florida. So theyre three hour difference. But I would love to set up a sales meeting with you on, like, Tuesday. Tuesday is always a good day for me, so we can have the whole team and we could figure out whats up. They could hear everything too, so you dont have to repeat yourself.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"My man.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I got three different business models. One is a credit fixing credit, one is taking MCA loans and converting them into traditional loans. And one is taking MCA loans and restructuring them over a twelve month period and putting people into a situation where after twelve months, we negotiate a deal with the MCA companies. So theres three different companies under one umbrella?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, so Im paying a lot of attention to this artificial intelligence, right. And Im starting to understand it a little better. And we have a friend thats doing some other business. Hes holding it close to the chest, but hes not really letting us in on exactly what hes doing. But its working really well. We just know its some kind of AI. Its costing a lot of money, but its working really well. So now were hearing a lot about AI. Were looking into AI. Were seeing all these advertisements. So you come on this morning with your advertisement. I say, well, this is a good fit. I got another call with another AI company on Monday or Tuesday, so I just feel like this is a good fit. Hold on 1 second. I wont make it by I wouldnt need to know that already. I can definitely be there by 1030. Hold on. Definitely be there by 1030. What were you saying now?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes. Perfect.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, I tried to send an appointment. I thought I had an appointment for 930.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Sounds good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. Youre going to text all that to me? Let me ask you a question. How do you collect $100 from me? I dont have to give you a credit card, do I, or anything?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"We do now, look, we got a very efficient way that theres booked appointments and that the rate of return on those booked appointments should be at least one out of ten. Were hoping for two out of ten, but were being realistic, so were hoping for two out of ten. So if those 50 books turn into ten sources, then ten clients, then Im going to go next month and go 100 book, then Im going to go next month 200 book. But like I said, if you got a better idea, then better, more efficient idea. But you know how it works, you know what I mean? So if the Facebook ads work but as far as the effectiveness of billboards and bus stops and ads and papers, we havent got to see the full effect of that yet. So I cant right what you call it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"If I didnt have to use a human being, I wouldnt.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Hit me up on Monday night or text me or give me some kind of is there going to be a number for all of us to call in? All three of us to call in and kind of all get on the phone at the same time? A bondage call or something? Or something of that nature?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"No, I didnt.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, go ahead.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I could always use assistance. I know some old school guys that know how to work the phones a little bit. Im looking at some other people. I just got ten bondage lines to be able to put them. I got a couple of mortgage brokers out here in California that are out of a job right now that are pretty good phone guys. But no, I could always use more people. Absolutely. I could use better and more technology and AI if that be the way to go. You know what I mean? So yeah, absolutely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And then as soon as deals start coming in and payroll starts loosening up, Ill be at 15 and Ill be at 20, and then I could scale it. Im the kind of guy that it doesnt matter to me if Im turning a dollar, if the business brings in 30 grand. And I can keep scaling with the 30 grand, Ill keep spending 30 grand. My goal and vision is to keep spending and spending and spending until I hit where I want to hit, you know what I mean? Until I get so Im not worried about taking money over the next year. I dont need any money, you know what I mean? So I can work with things. But Im just being brutally honest with you right now. Im covering everyones payroll. Im covering the rent, the electric, the bill. I dont want to over promise and under deliver.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, Im fine with that, but Im fine with that. When you said $100, if I canceled, you said it was $100 or something, and I was like, how are you going to get $100 from me? I didnt get that.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Sounds pretty good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Its okay. No biggie.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Were going to have probably a two pronged approach. Were going to have a set up for the less unfortunate, and then were going to have a set up for people that are kind of okay. So were kind of figuring that out now, but its going to look somewhere between 800 and $1500.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. All right. I got to get going. My wifes giving me the evil eye, so were trying to get the hell out of here.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, the thing is that the booked appointments are pretty streamlined, so its not just, yo, come on, this algorithm and hit with me. Theyre going a step further. And the company works with lots of other companies, and we just happen to know one of them, and thats about where the closing rate is. But they dont take this as serious as we do neither, you know what I mean? They dont take it. So its just an estimated data. Its not in stone. And just from being in the sales world my whole life, one out of every four or five people youre going to sell, if you got a quality product, its just a numbers game. Its been a realistic number out there since the beginning of time. So its about seeing 50 people. But Im also being realistic too. This is not a face to face meeting. This is not a knock on door meeting. This is a phone call meeting. So that probably drops the odds a little bit. So Im curious to see myself. I just know we know another company whos using this, and its working for them. And based on what they say based on what I know and based on the numbers where I came up with that data.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Me up at, like, 1030 or eleven just to make sure everythings on point. Perfect. All right.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Hi. Thank you, buddy. Bye. Hey.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, 100%.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Basically Im looking for a lead generator for sales, different kinds of sales Im looking for to accumulate leads.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hey, how are you doing, buddy?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Well, this year Im not showing much of an income, but roughly it range from 350 grand to about 150 grand. Last year, after this COVID thing, things died out a little bit. So this year, Im in the process of starting a new business. So I just got some income streams from some other things, but maybe 150 grand.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats a good question. Thats really a good question. As the bills start coming off the business, because Im paying everyones payroll and stuff right now, I could be upwards of ten or 20 grand a month if I was in that position. Right now, Im not in that position, I could be 50 grand a month. Ill spend 100 grand a month if I can make it back. But realistically, right now, because it is a growing business and theres no money coming in the door, I might be somewhere between five and ten grand a month right now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. Got you. I was going to say, God forbid I missed it. I dont want to be charged $100, but I dont see why I would miss it.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Whats that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Weve been at it for about four months, but Im in Boca Raton and I have an office, so Im getting all my licensing, Im getting escrow accounts, Im getting everything I need to be 100% legit. And I started working with some SEO companies. Were doing some portals and CRMs, getting all that in line. So I literally had the office. This will be my third month Ive had the office. So were about 99% ready. Were fixing the launch on the first. Were hoping the phones are going to ring on the first. Basically, weve already paid all kinds of advertising companies. Weve already got somebody doing our Facebook ads, so weve already short of this AI. Not knowing. We probably could probably eliminate all that with this phone call.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, I might have messed up by saying that, right. Because its always a bad thing to start different businesses. So let me explain that a little better, okay. The other two businesses that were opening up that were going for is more of a one or two man kind of show, number one. Number two, it goes in line with the credit, right? Because these people are failing in business, so theyre also failing in credit. Right. So were also going to be grabbing all the data to put these people in all different kinds of situations from mortgages. So our main focus right now is the credit. And if one supersedes the other, which the other ones are on hold right now. So the goal is to get the credit up and running. And if we see that $200,000 mark, were going to shoot for the 400,000, were going to shoot for the 600,000, were going to shoot for the million. And then maybe theres just no other time for this other thing, right. But they all go kind of in conjunction with each other. You get what Im saying? I think that if youre going to be able to help us with this credit thing. Its going to convert into the leads for the other thing for us also, so we would be able to go, hey, we like what you did for our credit thing. We can convert this. Look, heres the deal. Im a sales team. Im trying to put a 15 to 20 man sales team together. A traveling sales team. Doesnt matter what the product is right now. The credit is the bread and butter. The credit is going to stabilize the company and pay the bills along the way. All different kinds of sales things can come along. Right? So, I mean, the other day I was looking into prefab homes, so who knows whats next? It could be solar power, it could be whatevers hot for the moment. It could be hard money, loans. But for the most part, the credit is the base of the operation. Thats the stabilizer. And if we can continue to grow that stabilizer, maybe we never look at anything else. But its tough out there just to get into one business when you got three or four partners and you all to try and make the kind of money youre going to need, you know what Im talking about? To make everybody happy and whole, right? So I dont want to overshoot myself. Does the credit is there room for a credit company to be bringing in a million dollars a month? Im sure there is. And if its attainable, well be the ones.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im going to be on the Western Time Zone, and my team will be Eastern, so its probably always around lunchtime. About 12:00 would probably be good. California time.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Perfect.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Its really Steven but its okay. Steven but?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Long as the return on investment is there. Im not opposed to anything. I would much rather have ten clients at three grand than 40 clients at 800. Im not opposed to any of that. No. I would like to be billed as a higher end company, and to boot, Im going to be doing a brick and mortar also. I call all these companies and theyre one man shows. Were kind of going at this as a team. We got some salesmen out in the field, so were not going at this as a one man show. Were going out this to be big.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right. Let me put it to you like this, too. Lets say your stuff is more effective than what part of my bills already are there. So lets just say Im already spending 7000 $8,000 a month in certain areas, and Im willing to spend another five to ten with you. If my five and ten starts converting, I can also pull that seven back over. You get what Im saying, that Im already spending. So I could very quickly, if its working out, I could very quickly get this up to 50 $20,000 within the first month.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, for sure. Definitely. Im getting ready. I got to go now to actually get a car from my kid and I got to go do some things on Saturday. I got a couple of appointments, so I wouldnt be able to do it today, but I could definitely do it on Tuesday for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Youre going to text me over or email me over this stuff?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I dont. Ill see you guys on Tuesday.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"My partner were both over 700.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]