[{"pageContent":"Just think is so beautiful.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Thats awesome. Im much the same way.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"You guys no, weve been split for a few years.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I had some leftover money from another business last year.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And theres just so much collusion. Theres so much money grubbing in the government. I know. Theres good people there, too. Theres good doctors. Im not like anti doctor or anything else, right. Once people get a taste of power and money, its hard to get away from. Its an addiction like anything else, and they get their pockets dusted a little more, a little more every year. Theyre not going to turn those people away who keep giving them money.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I have a lot of different stuff Im interested in and things that Ive been through that I feel like can help other people out. A lot of its mental health related stuff. Lyme disease, healing from abuse and trauma. I just started realizing the last couple of weeks that theres actually a pretty big niche for that, especially in the mindset community, because everyones like, just pull yourself up by your bootstraps and all this shit. If people have trauma in their life, it doesnt matter if you identify as an entrepreneur or a poor person or fucking whatever. If you have stuff thats going on that you havent dealt with, its going to block you from learning. And I know that this is the thing. Its like almost a meme in the personal development. Its like people will buy course after course after course after course and not get anywhere. Its not because theyre not trying, but a lot of people just have theres shit that has to get dealt with in your brain first. Its like its literally like an injury to your brain tissue and the stuff that they know. Sorry, I dont mean to go down the rabbit hole with you, but theres.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I havent done any taxes for two years because of this other business situation. Yeah.","metadata":{"fillerID":16,"fillerText":"Ok gotcha","category":"B"}},{"pageContent":"Oh, cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I mean, I did. I got diagnosed with it, but it completely train wrecked my life. I was living up in Oregon. I lost my business. Had to walk away from so many different things I had going on up there. And most doctors are completely ignorant about it. Doctors like, oh, youre just making it up. Youre just this out because theyre using primitive science. I mean, most doctors dont really know much about how the human body works. Theyre just like, throw some money at it, throw some drugs at it. And if it doesnt work, then just tell the person theyre faking it. Our medical system in a nutshell, and the results speak themselves. Were the sickest, most unhealthy people ever in history, and we spend 4 trillion a year on our chicken health system. Got to give its a lot. And its not just me because Ive been through it, but Ive seen so many people go through so much shit unnecessarily. So theres that stuff. I had a history with addiction for many years after my childhood. I got sober, like 17 years ago. And unfortunately, I was about five years into my recovery when I got sick with Lyme disease and just had the carpet got yanked out from underneath me again.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"I have zero right at this moment until I get this house dealt with. Im not putting any money out in any direction right now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, I need some, like, this week, basically. Not literally.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"All right. Appreciate it. God bless you, maam.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, exactly.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"ThatS quickly approaching its end.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"I do, yes. Thats kind of complicated.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"It as loss, count it as experience. One of the letters of Paul where its like, yeah, or even what Jesus said, hes like, I know it seems rough. I know youre going through a lot, but if you take my yoke instead of yours, even though mine seems really bad right now, Im going to die on the cross. But trust me, if you live for God, its going to be easier in the long run because you get that supernatural power.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"But thats a stretch. Honestly, I dont want any. Im holding all my cards close right now because everything Ive been banking on keeps getting shot. And its not anything against you guys. Its just like the sting of betrayal has now gotten into a bunch of infected wounds. At this point financially and in every department Im just like bleeding out and like, okay, the bleeding has to stop right now.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"God, thats hard to say. Im kind of right in the middle of a lot of it with my daughters. Mother actually was one of the worst events in my life. She has borderline personality disorder, and so thats kind of ongoing. Its one of these things. And Lyme disease as well.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"If you can put a dollar into a system and get $3 back out of it, the system works, right, regardless of the details?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, my schedule is pretty open. I have my daughter every other week. Ive basically learned the weeks that Im with her, I dont really plan on anything. Ill have, like, one or two things during the day if I have appointments or something. But pretty much I dont plan on getting any work done. The week says shes with me. I dont have any child care or anything like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I appreciate that, man. That sounds good.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Id say probably five or six weeks from right now, realistically.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Not exactly. Its probably around 656 40.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, thank you.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"The CDC not treating it like the emergency that it is, especially in light of the last couple of years. If we can shut the whole world down over this virus, but we have all this other shit going on thats just as bad or worse. The opiate epidemic. Were losing like 100,000 people a year, right. More than the entire Vietnam War. Were losing every fucking year in this country. And do you hear a peep about it in the news, in the media? Any of them? Left or right? No, nobodys talking about it.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"I dont have any taxes. Im like, thats not going to work. Give me my deposit back. Hes like, no. Just no. And then COVID hit. That was my intro to California losing ten K, like, all the money I had at the time.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"No, Im not sure. Its been pretty hectic. This week is my daughters birthday and I havent really been in the office at all or checking.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I think ten K a month is kind of the minimum. I like to be somewhere between ten and 30K months, pretty much passive, like 85, 90% passive once the different things are set up. And I have this vision and Im hearing kind of both sides, but people are very much for or very much against it, but Id like to have some lower ticket stuff thats selling on autopilot that I dont have to worry about. And then when Im taking on coaching clients, then I can just take on people that I really want to work with and not whoever will show up because I need the money, because Ive played that game before, and Im not going to do that with coaching. Im not going to get into a steep with people that are all over the place. I really like doing small business, but a lot of them dont want to change. When it comes down to it, theres a lot of ego involved, especially with guys, unfortunately. Theyre like, oh, yeah, I want to do this, I want to do that. And you sit down and start talking to them, and then they get all butthurt. Theyre like, oh, what do you mean? Like, my baby needs to be different? Well, yeah, you created the problems. You built the problems into your company. You have to fucking fix them. Dont take it personally, right? I get tired of people that talk a big game, but then they dont want to take any action when it comes down to it, because thats the opposite of how I am. Ive been taking action my whole life and dont have a lot to show for it in this moment. But, yeah, I agree with you. Like you said, its not totally clear right now, but I think the only reason that my higher self and God has let me go through all this BS is because I have a lot of people that can help. When it comes down to it, theres a lot of change that needs to happen right now in our society and around the world because what were doing is not working.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, thats good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"With the shiny object just last summer, is when I really decided to get serious about doing something online. And its like 50,000 rabbit holes you can go down every single day. I spent, like, months just kind of sorting out, okay, what in the world do I want to do? And then all the marketing stuff and all the funnels, and everybody wants to get you on their method, but its just a lot to sort through.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Everything that Ive been planning on is still, like I dont know. I dont even understand it. Im a contractor. When you put it on paper, I mean, Im from the Midwest. Even more than that, I believe in being able to do business with a handshake. Those days are gone for most of us at this point, but its still like, okay, well, Ive spent 20 years plus as a contractor, you put on paper, thats a legally binding document. And Ive been screwed over like six times from six different directions in the last few years, even with that, because most people I dont know if its a Southern California thing or whats going on, but most people are like, well, its going to be a bigger hassle for them to take me to court, so Im just going to do what I want. It started out with a business I was going to buy. I put $10,000 down on deposit to start doing the due diligence. Like, when I was moving down here in 2019. This guy turned out to be a total fake.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Oh, yeah, I love Russell.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Im kind of in the middle of changing a lot of things around in my life. Im getting into doing coaching and making some courses, like some low ticket and high ticket courses. And I havent launched those yet, but Ive been in trades businesses for like 20 years plus and doing some real estate, some flips and stuff like that. And I had a couple of business partners take advantage of me last year. So Im trying to clean up that mess right now. And Im just like, I need a different way to bring some income in instead of waiting on these big projects and trying to deal with directly with clients and employees and shit like that. First time in my life Im really looking at making money online and using digital tools and stuff like that. Ive always been word of mouth. Ive never advertised or anything for any business Ive worked for. It looks like AI is coming out just kind of at the right time for me, too. So Im pretty. Computer Savvy I have a college degree and everything, but I just have never needed to use it for any of my businesses and its a little bit of a learning curve.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Perfect.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I have zero income at the moment. I had this legal case open up last year in January, and it keeps getting delayed and delayed and delayed. And the flip that I was in the middle of, I was expecting to get back about 60K from the slip last fall or winter, and it got super delayed. We finally put it on the market in December, but everything got really sluggish with the economy, so thats just been sitting there. And now Im like my business partner thats supposed to be handling all of the financials and selling it. And the rehab part of it is like, Im looking at the numbers and theres something off with this numbers, and Im like, okay, Im going to personally have to go to Indiana and go deal with this project and potentially more legal situation where we have to change ownership in our JV agreement because its no longer 50 50. Like my half. Now Im taking on responsibility for his stuff, and theres, like, $100,000 missing out of $280,000.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I mean, I need to look at the stuff you send me, the training and the offer and stuff like that. Really good stretch and I knew there was something on the other side of it, maybe like 1000 or 1500.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"But once thats done, I could probably have like 5000 to deal with.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. Thats the thing that seems like you said leverage on steroids. Im just kind of poking around at the edges of that and Im just blown away.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Good, with which company?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I guess so. I mean, I never had one on me. I never saw it. But they know that they dont really have to latch on. And a lot of times its actually the tiny, tiny little ones that you cant even see. Its not always one of the big fix. And they come with all kinds of other stuff, too. Its not just a Lyme disease, but everybodys body is a little bit different, too. Some people have it for years and dont even know it. Some people get it and theyre in bed basically for the rest of their life. And a lot of people are so miserable they end up killing themselves. The suicide rate is really high because you cant get help from many people, most people.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yeah, potentially.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, yeah, hopefully Ill get this situation with the house straightened out because thats really more of a chunk of money. Im not planning on other streams of income right now. I really had everything kind of loaded into this one deal.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"If that changes in the meantime too, Ill let you know.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"They make a lot more money off sick people.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]