[{"pageContent":"Here.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"All right? And Im sorry. I wasnt trying to be rude initially. This entire call, I just havent caught off guard because Im in a different mode in my head right now on what Im doing. What was your name? What is your name again? Im sorry.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Thank you, Rick.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. No, 03:00 Central. 02:00 your time.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Perfect. Perfectly fine with me. Yes, sir.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Right. Im excited to talk to you. So you give me a call. Well chat it up, okay?","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah. Im currently at my run a liquidation company, a business. Basically, Im an online auctioneer instead of actually somebody that does it in person. I see. So thats what I do. And Im currently busy until 02:00 today working, taking photographs for an estate that I need to get up. So this has really been an inconvenient moment even doing this right now, because my time is preoccupied. Actually, thats why I chose 03:00. And it sounds like since you said that it said 932. It sounds like youre an hour behind me because its right now 1130 my time, so I assume its 1030 your time.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello? Who is this?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Bye bye.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Did you see the time that I did the AI tell you when I responded? Lets find out how intuitive this thing is.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Because I noticed it because I used to be a third party debt collector for a long time.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, Im sorry.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"And check on it. Im pretty sure I scheduled a thing to have a call at a certain time, and it wasnt now. Pretty sure.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Did you read actual text that I actually text?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, I made it, like, 11:00 or midnight or something this morning, actually, or something to that effect. And then I responding back, and I started giving it some uncouth answers because I was getting disappointed that I was being responded to in a way that was like, this is quite intrusive at the moment. Just because I respond doesnt mean I want to start its trying to get me to do business calls and stuff and set up times, and its like, what it should have understood that it was, like, not during normal business hours and maybe not been so forward. So I didnt enjoy that experience, actually.","metadata":{"fillerID":39,"fillerText":"Yeah","category":"F"}}]