[{"pageContent":"Yeah, hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. All right.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"We were going to talk at 330, and I was busy because I wasnt getting my job done, so I didnt answer, and Im still not done, but I actually need a break from that, so Im going to go ahead and take the call with you.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes, we do.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, be 43. Wow. All right.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"All right.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right. Yeah. You must talk to a lot of people. I used to talk to about 160 people a day, actually. I was the cantankerous guy that you spoke to this morning. I was? Yeah. No, I was the cantankerous guy. You were the cantankerous guy? Yes, I was the rude ass. Yes, it was me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Bueno.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I just work when I feel like it right now. After tonight, Ill be pretty much caught up for a little while, but Im going to probably find some more work. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"You cant pay the bills without work.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, Im doing pretty good. Good.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Thank you. All right, bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, that looks really interesting. All right, thank you.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All right, well, go ahead. Lets get into this because I do have to go back to work, but I do want to talk for sure first.","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}},{"pageContent":"Im personally doing really well. Business is starting to pick up. Cant complain. Lifes good. Excellent. Got my granddaughters in town. Theyre leaving tonight, unfortunately.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"What is your I mean, I do consulting because theyve just had a loved one pass away and die. But okay, Im not consulting as in intelligent, knowledge wise, within as an industry, other than maybe, like, the value of items. But my job more entails trying to get them to understand that theres only intrinsic value in items, not sentimental value in items. So thats my actual only real challenge I have, other than trying to get people to not argue in front of me because they want to sell this and dont want to sell that because so and so made this. Wow. Yeah. So really, I just actually just receive leads in for people that need to liquidate either their business, a loved one stuff, a storage unit or storage unit calls me, or impound. Lot has a bunch of cars they need to get rid of. So they call me, and they put it on my website. And instead of you going to the auction house and standing there and holding your card and doing that, they just go online, and it runs for, like, a week or two, and they can launch it. They bid, and when they win, they show up on Monday and pick it up, and theyre gone. Thats pretty much all my businesses other than taking pictures and advertising to sale, and that okay.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Eventually when I get an auction house, yeah, something like that will happen. But right now, its all on site. Its all in their home. We process it in their home. It stays in their home throughout the duration, and then on pickup, they just show up to pick it up. Okay. All right. Yeah. We dont right now take anything off site and bring it to another location. People do do that. Theyll come to my place and bring me stuff. If its not a lot, but usually Im liquidating an entire home or business. Wow. Okay.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Yeah. Todays been crazy. We can say that.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}}]