[{"pageContent":"Yeah, that is exactly true. Ive been trying to do it, but I have gotten no, nothing. I have Ive gone so far.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, trust me, it will change a.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, because Ive always given able things, and its just like, how about I want to start doing I want to step up. I want to step up someone that I can actually be. I dont want to just be that one person to be like, thank you, and then not give it back. I want to give back to my family for everything they have done for me.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, so I have a few questions about just, like, drop shipping by itself.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, Ive been trying to figure it out, and I have my website built already, but Im just trying to scale everything so I can get the max.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hello? Yo, whats up?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I believe I could be. If they really want this dream and everything, and if they really try their hardest, of course shes going to come. But there are some people telling me that they want to be great and they dont really want to put in the effort in, but they want to be called great. So how are you going to be able to be called great when theyre not really working for it? So I would basically be motivating them to do better than their own self so they can have that motivation to be better and great for themselves.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No. To be honest, no, I dont really know right now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"$500.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, like $50,000. Basically, it will help me to provide more things for my family.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"At least a good, like $400 to $500. At least.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"All right. Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Not really, but I really am about to apply for one right now, actually.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"That I support people on?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, I really want to. And if I know if I can do it online without even really touching anything, that would be, like, the most best way for me to scale my website.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Thats a really good question. Ive been asking myself for a long time, and Ive seen that if you can basically make a business online without touching anything, I believe that would be, like, the most efficient way to have some money in your pocket. Because, of course, theres other ways. But Ive seen that theres other ways of making money, and I think that Drop shipping would be the most efficient way because, first of all, youre not even touching anything. Second of all, youre learning how to scale everything. Something like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, I got you. To be honest, I believe that I could be very motivating, to be honest.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"16.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So I think Id be really getting motivated personally.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, no.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"For sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Wait, can you repeat that? I cant hear you. I kind of cut out.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Well, what Im really looking to make is at least $50,000. At least?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"That sounds like a really good game plan, to be honest. So is that not enough?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, so you can get Max results?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"For? Eddie? Ask me if this is a really good question, but I believe that making your own being an entrepreneur already while starting young is going to be way more easier in the end. And I think that if you can do stuff through online because people be going to college and everything, and its just like, okay, but nowadays, in 2023, its just like theres so many other ways of making money. And if I already have that money in my pocket, knowing I can scale the business, I think thatll be the perfect option for me to do.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats the main reason why just to provide things for my family. Thats just the main reason, to be honest.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}}]