[{"pageContent":"But they also worked really hard and long hours. So did I, because I was a working child. So I think its just kind of.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Because its expensive. But when you consider these people who are using daily and theyre spending the cash to get the drugs daily, on a number of occasions theyll go out and breakfast, lunch and dinner. You consider if theyre treated and it costs like, $27,000 a year for them to go through treatment, as opposed to $60,000 a year for them to go to jail or whatever. A lot of times youre dealing with some sort of rehab counseling where theyre in through Medicare, Medicaid or private insurance, et cetera.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im still working on that because there are various ways of being handled.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I did see a mention of it. I think it was in the text. Yes.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Seen it everywhere, and Ive heard of it everywhere, and I saw it when I was a kid. The whole Kent State issue was a result of a Fentanyl dealing, and people didnt realize that was what was killing people. And it started up again. I said, oh, its the same players, only its different generations.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"A lot of that you do have to get through charitable sources.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Oh, great. Hi.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I think when I looked at it, I looked at it briefly and I said, I wonder if this might be able to help somebody. If they were looking for actual scaling, say, if you want to be a speaker and working on obtaining more, I guess, coaching clients.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Computer is acting a little slow today.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"With my parents, you have exactly something.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay, cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Its negligible I cant even say right now.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"I went through it myself. But my parent was actually both my parents were very good parents.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right near me. And one of them was a toddler, and the other one was like, a little person. I said, Here we go again. This is exactly what was going on when I was a kid. Okay. Its a different strength, and its a different group of people doing this, but its clear for Europe.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, I do.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, wonderful.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"You basically bring it into places where they call in to ask for help. Really? So you bring it to the counselors, you bring it to the therapist, you bring it to the nurses that are actually treating them.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Id be a little bit more stable as far as once a month. Im not really in debt, but Id be less in debt than I am. And it would just help emotionally, physically.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Be able to leave the neighborhood I live in now and go back to where I used to do outreach like this. There were several neighborhoods I did that in. It could be here, it could be overseas. It doesnt matter. If you can reach people internationally now the way you can online, in addition to, say, going around and doing in person outreach, theres no limit. You can reach that many more people. And if you can reach social services agencies, which I used to work with on the regular in La county and up in San Francisco and in New York, then all the more better, because then you can work with other people that can do the same thing. I looked at numbers, and they said people that go into certain programs that deal with this, especially with the fentanyl and opioid addiction, that gets them off of it within six months time. It costs around $27,000 a year, but it saves almost another $30,000 a year per person. Thats cleaned up, because youre saving on jail time, because the reciprocity jail time is so much less. And they get work, and they get off the drugs, and they get onto maintenance, and they start working part time, full time, doesnt matter. And then theyre back in the scheme of things, and theyre back where they want to be because a lot of them eat their addiction.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, it was Fentanyl in cocaine. Vancouver. Thats what theyre seeing in Chicago. Theyre seeing it all over the country. Were seeing it here. We just had two overdoses yesterday in Newark.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Im even embarrassed to say it here now. Its below 650 right now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay, good.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I think its because I lost almost 15 people to people doing this to people.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I think for outreach initially, just so you can get a little bit of information, because you can use AI and not necessarily let people know its AI, and so theyre more comfortable with it. And then, like you did, let them know, well, that text, that was AI. And its seamless and its painless, and it just helps you get the numbers up there, I guess, is what it is. Because Im totally familiar with robotics. I have no problem with it because I studied that. But the prompt engineering that you do in AI, which I studied and I worked on as well.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Its just something that would make it more feasible for me to phase out looking for my freelance jobs and looking for this. As opposed to sending out resumes. I can send out packages about what kind of, I dont know, industrial video your location would need for your specific type of client that you get in on a daily basis, be it in college students or be they people who are older that have been on the street a while. I mean, it doesnt matter. Okay. Theres so many different ways.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"All walks of life? Thats the whole thing.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Because I saw a lot of I lost relatives in the Fentanyl, and I see it going on now, and its worse. Its far worse than it was when it first started. I spoke to somebody. They said 2000 plus people, one city block they lost between 2001 to date. And thats in a low rise neighborhood on the East Side in Vancouver. And that has nothing to do with all the high rises that are going up there now. And I said, Are you kidding me? Theyve just been rotating people in and out of the blocks. And I said, thats one city block. Imagine what everybody else in Vancouver went through.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Its interesting because I started out really in entertainment as a cinematographer and a performer who also did choreography. So I did a lot of basically sort of like directing, only its actually teaching physical steps in addition to the direction. And one of the things I also worked on was teaching people who maybe didnt have the skills, I guess, to raise children because I was ordained as a preacher and dealing with the Praise and Praise dances and also dealing with teaching individuals how to raise their children, whether it be feeding them, clothing them properly, learning how to speak to their kids when they were being unruly, that sort of thing. And I did a lot of industrial videos and I was doing a lot of outreach for mental health in addition to that. Because when I grew up, it was the it was the time of, I guess, turning on and tuning out is what they used to call it. So were seeing a lot of that today, and I think a lot of its really relevant. And so Im trying to figure out how to bring this sort of thing to the people that didnt go back to school, the people that didnt stay in school, and trying to figure out how to do outreach because I think its seriously needed.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im sorry, and its terrible.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"You go to Outreach Center.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Go ahead.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Either is fine.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Because everything I did was copyrighted.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im not sure at this moment. Id have to really look into it and sit down and do the actual business plan. Yeah, exactly how I would put this out.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"All.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Right. Yes.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Id be able to do something where I take a skeleton and do it in the center and do it online as well. That would really help.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Everybody knows somebody that has a list of people. I dont care what they do. If I have to come up with the money myself, Ill put this retreat because I know you want to go.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"If theyre at the point where theyre ready to quit one, theyll come crawling in on their knees begging for help.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I see staying in the forefront and doing that all the time, but also having other people that would come in.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It would love to be somewhere in the $5,000 a month range, because that I could do anything with.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I said, I have to admit its terrible, but its come up recently in the last couple of days because were paying it.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Im sorry, Im doing something part time at the moment, so Im looking for something thats full time in addition to that.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I have some outlines because I dont necessarily deal directly with the people that will be using the packages. Like, you would say you deal with someone who does casework or you deal with, say, the food stamp office, or you deal with the churches and other outreach programs that might buy into the packages in order for their clients to be able to use them. So its kind of like a different step as opposed to dealing directly with the end user, although you can do that, too. It can be packaged in different ways.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Exactly. You do it through charities, basically, and you do it through advertising.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im still working on it. Its on the drawing board, shall we say, because literally this whole thing just popped in my head. I said, Ive done this before. I did the industrial videos. I did the outreach to schools, and I actually did some of the client outreach individually with people who needed this sort of service. And its something that I could really scale into and do really quickly if I had my old videos and all this other stuff. But there are still ways for me to come across those.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hold on. I think.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Beautiful. Thank you, Rick, I appreciate it. Perfect.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, its something Ive done in the past and something that Ive considered because I looked at recent numbers from different locations in North America, and I said, this is something thats seriously needed because people dont want to do anything anymore. And what would the Fentanyl and Opioid high course really escalated, and its just like it was in the 60s. Its like were going through the same thing all over again. Its a different amount of the same sort of drug, and its really hitting hard all over North America and in Europe. So I think its kind of valid.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And thats one of the worst hit areas. Imagine the Bronx here.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"That would have used this garbage. One person touches the wrong thing and someones not there to help them, like with the narcan that theyve been using.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Sure. You can hear the sirens now. Im sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I see the clients assessment manager, Paul on the fourth.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, great.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Its familiar, but I like to see other people take on it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"You as well. Thank you.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}}]