[{"pageContent":"Oh, you know, construction folks like to wiggle and bargain and put it on terms if they want to turn, that sort of thing. But Ive done it a long time and I actually enjoy it. So thats what we do.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Super.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Well, if you serve more people, you earn more, whatever you guys have. How can that help me? How can that help me serve more and earn more? Thatd be my question.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Good question. I will look, Im behind the wheel where its not easy for me to look and see that right now. So I dont know, but I suspect if you did, Ill look forward to reviewing it. That said, I know very little less than anybody about AI, but interested in learning and recognizing. Im sure it could help me. Just dont know how and that sort of thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Eastern. So here locally, it is a quarter to two. Its 145 Eastern, and Ive got to meet with some professionals here, and I should be free about 25 minutes. Hows that?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I am an executive search professional who recruits talent for the mechanical contracting industry in the United States. A lot of it is circles around Texas companies, but it can be Kentucky companies or Massachusetts companies. The biggest buyer seems to be Texas of what I do. That said, we also have real estate holdings, rental property, single family, mostly vacation rentals, midterm rentals for medical or traveling professionals, things like that. So we regularly buy and rehab properties as well. So thats what I professionally do for income.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Roughly.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Presently? Not really.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, lets take the low end. Say call it 240. Monthly is 20. It can be 30, it can be 40 in a month. I mean, one fee if the guy earns a buck and a quarter or buck 65, I dont know if you.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, we have property managers that manage some of these properties. We certainly have professionals that oversee the construction and rehab, have a virtual assistant that keeps up with my LinkedIn account and interacts with people. Im not sure what youre asking.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Good. How about yourself?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Headhunters like to serve the clients, and when they ask for a preconstruction manager, Id like to find them one. If they ask for an Estimator, Id like to find them one. Somebody needs a CFO, Id like to find them one. And thats the business model. So hope that answers your question. Its answering truthfully.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont have 20 right now, but I will in about another 25 minutes.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, on the rental side of life, we call it vacation rental, midterm rental, outside that type thing, theres a lot of revenue. Theres just a lot of expenses as well. So theres a half a million in revenue on the rental side, and then theres a lot of expenses that go against it for that. Thats the passive side. And on the active side, I have revenue billed anywhere from a quarter million to three quarters of a million in that range historically.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Dave here. How may I help? Hey, Dave, I am all yours.","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}},{"pageContent":"Yes, maam.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"We charge a third of first year taxable compensation. So if theyre going to earn 100, we get a fee of $33,000, something like that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im glad to have some profits, so thats for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hope you have a great day. Thank you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, Im glad to have some Ill say that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"You can I am at a job site where I need to get out and deal with a workman and a licensed professional. So how long do you need?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}}]