[{"pageContent":"Like I said, look into it and stuff like that. I know they have healthcare consulting program, like, a lot of consulting things for nurses too. I am aware of that. I just dont know exactly what they do that makes any sense.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im kind of already doing, like, the digital AI art with mid journey. And whats the other place? The other one I use is a D or something. I cant remember. Ive been kind of doing that already. But, yeah, thats kind of, like, really as far as Ive gotten. Ive created stuff, and I did set up a shopify store, but I havent launched anything yet. Just kind of started doing stuff.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, lets try to reconnect. That way I could be a little bit more focused, and plus, I would like to actually look into it now that I was talking about the Psych. So would it be like coaching mental health? What would you consider that as?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I would definitely want to know. Im not trying to rush you off the phone. Its just that Im at work on a private key because I am a nurse. But I would definitely want to know more about it. For sure. Thats definitely a thing. For sure. I dont know why everything is falling right now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, that sounds great. That sounds really good. Im freedom. Im off tomorrow, so Ill definitely have some actual time to talk with you, and we can definitely hopefully we can work together. Thatd be great.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Honestly, my focus right now in nursing is psych psychology. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I would have to do my research on it to see what it entails. To be honest with you, I never even really thought about going that route, so its always something I could keep my mind open to and kind of do a little bit more research on it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I mean, Im a nurse. Im going to be doing what my staffing agency launches in September. So, yeah, thats really my only strong area of expertise is stuff like that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"How about how I dont know how you feel about this, but maybe try giving me a call back in a week. I can do some research on some things, and then maybe we can go from there.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, I havent actually havent considered doing anything like that before.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im fine. How are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Can you repeat that last part? I dont know why, but you kind of, like, faded out a little.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Okay, I wasnt aware of that. I was not aware of that. So Im sorry. Im working at the same time, so Im kind of, like, in and out.","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Psych counseling, yeah, thats just what I do kind of almost now, for the most part, but I still need a couple of certifications to actually give advice. Im still in the process of doing school, so thats the passion that Im working towards right now. But when you are a nurse, you have to get certified in certain things before youre able to what is that word that we use in nursing that will be within my scope of practice.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. My name is Tiavanda. I go by Tia, though no one calls me that, but I go by Tia.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"All I did.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Okay, awesome. Thank you so much for giving me a call. I really appreciate it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I got you. I see what you mean now. Okay. I definitely would like to go dive deeper to see how we can make that possible. I wish that I can spend more time on the phone with you, but I am at work. Im on a private case right now, and I dont want to be rude, so yeah. Even if you have some time this weekend, I dont know if you guys do calls on weekends to give me a call so that we can try to maybe figure something out, that would be great. Id be really interested in that.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Awesome. You do the same.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}}]