[{"pageContent":"Give you I dont need to do that anyways. Thats gods job.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, I mean, yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. I have $630 to my name right now, and I need $800 to fix my car.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"So theyre both, I guess, kind of in the beginning ish phases. Like, Im trying to get like, I just got my Ein for everything in the last year and all of everything about a year. Yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I mean, thats fine, but you can still give me things to shoot for and we can revisit and sell.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Actually, both on both sides, finding people who are wanting to spend money, period.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, its Kamariperiodfox at Yahoo.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Everything that you need to have on hand when youre expecting a litter to come? Deaths are going to happen no matter what. Anyways, that I try to be like, okay, now what could I have done differently so that their death doesnt count for nothing, right? I had bottles, but I didnt have tube feeders and little drop feeders and whatever with the first one and okay, well, I had that with the second one, but I didnt have this or that or the other thing. Im still needing an incubator or whatever, but I just try to go through and make a list of everything, especially like, okay, well, make sure you have this a week before youre expecting puppies. Okay, well, now that the puppies are here, make sure you have this, this, and this. Even if its a check sheet, like, okay, well, set your clock for every 2 hours. Youre really going to be feeding them every hour and a half, but make sure everyone you potty them before they go to bed. Or make sure you weigh them after you potty them, but before they eat. Or just like things that when you have been awake for two weeks on end, you dont really remember.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, I havent even checked. My clutch went out this morning, so my day has been a little occupied.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"That would be fantastic.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So Ive tried doing other just, like, little things here and there. I tried it works, and I tried doing that. I absolutely love the products, but I absolutely hate having thousands upon thousands upon thousands of meaningless conversations and trying to build relationships with people that I really dont give a fuck about nor have the energy to talk to. Yeah, exactly. And Im like, okay, I just dont its not my thing, but, I mean, Frenchies, I love them, and Ive wanted one forever and a half, and my ex boyfriend decided to get me locked into paying for one monthly that I told him not to get because I didnt want to spend that much on it. So Im trying to make the best out of that. Yeah, Ive had her for probably five years, and this is the first year that Im actually seeing some kind of money, because before that, all of my other money from my jobs and tips and whatever, working at Super Cuts, all of that was paying for everything. And then as far as the other side of things, I am still an hourly employee with Super Cuts, or at least back to there. But I do eventually want to have my own salon. Thats been my dream for a while. I like catering to men. There arent many places that are, like, nicer establishments that cater to men in the salon industry. Like, theyre mostly great cliffs, Super Hood and whatever. And its like those places are great, but either you have a barber shop or you have a chop shop. You dont really have anything in between.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Honestly, need and want are kind of relative terms because it kind of depends on who the president is and what the hell is going to be happening, considering that money is not a thing anymore and all of the whatever. So were going to go with general ideas as opposed to dollar signs here. General ideas. I want to be able to go to Costco and buy groceries for the month and not stress bite my nails at the cash register hoping I have enough money. Thatd be fantastic. If I could make it so that my dad didnt have to go to work because he has long term COVID, and hes trying to get his disability up and running, and mom died and all the things. So if I could buy his house so that he didnt have to fucking worry about it, that would be fantastic. If I could pay off my student loans, that would be fantastic. But ideally, I just want to be able to function throughout normal human life without constantly living with dread and stress, doom and gloom, everywhere I go.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"All right, you have a wonderful night.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"I had to take a couple of months off for COVID and I got behind on things and my car just got repoed, which didnt really affect me per se because I have another vehicle and my ex boyfriend was the person driving it. But Ive been trying to take care of my dad and barely making ends meet. And I had to move to a salon that was a minute and a half away from my house, which meant completely starting over with clientele and all of the everything.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And you normally call people at 09:00 P.m.?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah, what is up with that? Im one of those people. I have a hard time sleeping. Hence why Im like youre much safer calling me now than its like if youre not meeting me with coffee or sex or somebodys dying or somebody is bleeding, dont wake me up. So waking me up at 06:00 a.m. To try to fucking sell me something does not meet any of that criteria.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Okay. I was just checking because Ive got a shit ton of phone calls at 06:00 A.m., and let me tell you, you are much safer here.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"No, its not. I want to be like, hey, do you want to go to Bermuda this weekend? And be like, yeah, sure. I mean, it might have to be like a month from now this weekend, but I still want to be able to go do fun things.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Oh, yeah. Perfect.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I believe I was sitting at, like, 24,000.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I literally have $600 to my name right now because me and my ex boyfriend broke up, and so I took two months off trying to raise these damn puppies, and then three of them had to be basically charity projects.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"And ideal credit score is probably somewhere in 600.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"That shirt makes your eyes look stunning.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"I think its, like, low 500.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I know 100% for sure and not an actual way to check.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Probably. Im at, like, $500 a month by the time all of their expenses are taken care of. Im actually making money, but Ive been losing money up till this point, so Im counting all the positives. Right.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay, perfect. Thanks. Have a great day. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Are you still there? Hello? Can you hear me now?","metadata":{"fillerID":33,"fillerText":"Yeah","category":"E"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Ive had like ten litters. I mean, Im still learning, but I hope I know.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Probably. I definitely sure crap wouldnt have had $3,000 to pay for it, but were spending out of their pocket, not mine.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I wont be held accountable for the person that they get at 06:00 a.m. Because shes not as nice as I am now.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Screwed. COVID.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"You could have multiple offers theres while youre expecting and then zero to two weeks, two to six weeks finding them homes, what to send with them to their homes, how to help potty train them. Because I dont know if you know anything about Frenchies, but theyre like the most human, like, animal I have ever had. And I understand their dog and I probably overlook them, but thats besides the point. The point is that a lot of people try to punish to train because its like, okay, but if you can literally hurt your dogs feelings and then they are not going to do anything you fucking say until you fix those feelings. I can smack their ass all day and theyre not going to quit peeing inside. But if I start not hyping them up before I go outside but hyping them up, itd be like, get them all super excited. They want that attention, so they do things to get that attention because its positive reinforcement instead of negative reinforcement. Same thing as most humans, thrive under surprise.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Give me just a second. It says downloading, so Im going to go with yes, but I was adding you to my contacts.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Likewise.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I heard you. I just accidentally hit the mute button on my end.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im sorry, who is this?","metadata":{"fillerID":36,"fillerText":"Yah umm","category":"F"}},{"pageContent":"Yeah, like 515, something like that, I think.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im doing all right, thanks.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, Im pretty sure.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay. What was your name again?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I mean, technically, thats a trick question without me doing the math in my head for multiple weeks on end. But were just going to say technically, two.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Perfect. And then youre wanting me to reply to that?","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Probably not. I mean, Id love to say yes, but probably not.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Well, thank you. I appreciate that. And thank you for reaching out. That was very nice.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, yeah, but its like, wait, okay, well, theres seven days in a week, so now thats like, every third foot. And Im like, okay, thats too late for me to care that much right now.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"If I get to a point where Im making $5 million a year, that would be absolutely fantastic. But do I need $5 million a year? No, not really. I dont even need $50,000 use a year. Ive been surviving on 24.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]