[{"pageContent":"I guess to get the money coming in, the response Ive gotten is kind of like I didnt expect to get that great of response for it. I knew it was a good shampoo, but the things people are telling me, its more than I expected. So with the funds, I could also invest into there for a little more marketing and get some more exposure for the brand. I know once it gets out there, its going to do tremendous.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Thats a good question. I guess as much as possible, you know, but yeah, I mean yeah, just I mean, thats thats a good question because with art, you never know what what youre going to get coming in. So thats thats a question I never really sat there or thought about. But I guess you can put 10,000 a month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. They can send you a text on this number?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, great.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I do not have two grand available to do this business right now. But what Im saying is pretty soon Im looking to have some funds come in and if this is going to help me increase this is something I would definitely be interested.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, Ive been using some AI lately, and I think that the capabilities are tremendous. So once I see that theres AI thats attached to increasing your business, I just did it out of curiosity. Im wondering, what is it all about?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. The different ways to create artwork and.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Ive been an artist for over 20 years.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I create art, and I sell art as original copies, prints, NFTs, also high quality gclaves. So I produce original art. I sell the artwork, and then I also sell the artwork as NFT.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, that sounds good. Now let me ask you, if I refer to someone to you particularly, can they reach you directly?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay. So youre going to send the information to my email when I take a look at it, then I can reach out to you when Im in the position financially to start doing it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, so can you tell me very in a small sentence, basically the upscaling and what basically is it?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"But this year, I really would like to have some real good success with selling NFT. Last year, the NFT market made about it generated about $24 billion. This year, its projected to generate more. And so were trying to really get our foot in there to get some of that this year because last year we werent prepared. The NFT market.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Sometimes more, sometimes less. Somebody could come up and purchase a piece of art for make an offer for eight grand for one painting. So you never know which way its going to go with the artwork. Thats about the highest Ive gotten offered for art. Thats impressive. But its going up because of different putting myself in the right position. Its going up right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"You want to be at the beach. You dont want to be sitting somewhere working a job. So freedom is youre at the beach instead of being at the job. So thats what I mean by freedom. Or you see somebody that needs a couple of bucks on the street and you dont have it to give it to them, so you dont have no freedom to do that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, Alex. Thank you very much. I appreciate it. Thank you for your time.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"I definitely could coach somebody in the process of creating art.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Well, that helps me scale up on some of the other projects Im working on. I also have a natural brand shampoo I invested in, and Im getting some really good feedback from it, from the customers, and so I would like to kind of get that out there in the marketplace and get more exposure on that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, so youre saying basically I charge a client so they can learn from me what Im capable of doing. Correct?","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yeah. Show them how to turn their art into money. Different things that they can do to make money with their artwork.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I have some huge now if theres a way we can make some money being an artist, I run into some really wealthy people and I have one particular friend of mine whos very successful in the business world and hes always looking for ways to increase his money.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. It can be that much. In the years Ive pulled in 50 00 10,000 in different things that Ive been doing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So I guess you could say the money would be to invest in other ventures.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I guess freedom is if you want to eat a steak, you dont want to have to eat a burger. You know what I mean? So you have a freedom to choose between the burger and the steak.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont have an exact number. I really dont. Because I make art, I might sell a piece for a couple of grand, and then I take the money and I make more art. So its just like I dont have a set number on how much Im putting in every year.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"For two grand. Okay. I have a painting someone is looking to purchase for about 25 grand. And so theyre going through the process because of the fact that these people.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, hello.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. It buys you some freedom. Buys you some freedom. You can kind of be where you want to be instead of be where you have to be. So I guess it buys you some freedom. And also it puts you in a position to help other people that might need a little help.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"What does something like this cost? Just give me a high end number and a low end number just so I can see, because I dont want to waste anybodys time. I just want to know on the low end, how much does this cost? On the high end, how much does this cost? What I can do, if its too much for me, I can reach out to a couple of people that I know who do have the funds that are looking to get into certain things.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Doing good, thank you.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I havent checked in a while. I have not dealt anything with credit in years, so its probably pretty good, but I dont know, Id be making it up.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay, super. Send that over to me. Ill take a look at it. Whats your name?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}}]