[{"pageContent":"Im good. How are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Hello? Hello? Yes?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Not yet, no.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Administrative work.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Provided its consistent.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Well, speaking about the real estate, its not that in the digital income as well. Digital business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Good question. Thank you. Monthly wise, lets just say something double digit, something 10,000 upward, if not ten to 30.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That sounds good to me. Absolutely.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Retired, but also in addition to just providing home care, health care as well? A little bit of that as well.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, Ive been kind of contemplating different businesses to actually start up with. Maybe I havent set them on any as of yet. So, like I said, Im just going to put my toe in the waters.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"A little bit. Somewhat not officially, but somewhat unofficially doing something on my own.","metadata":{"fillerID":47,"fillerText":"Mhmm","category":"G"}},{"pageContent":"Actually, Im semi retired. To be honest, I havent quite done so yet. Im not there yet. Im on the cusp of retiring, sort of. Like I said, I was providing home care to a couple of siblings as well as my own parents. So thats why I wasnt really working officially, but just providing home care for them while earning a bit. Thats what I mean by that. I dont want to particularly go back to work with somebody else. No, I want to do something on my own.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Ecommerce that makes the most money. Why its not.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay? All right, sounds good.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I mean, that would create a nice little cushion that would allow me to just woos off, have a little breathing cushion that actually do a little bit more maneuvering about. Otherwise Im depressed for other things.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Thank you. All right, you have a great day.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, actually, I was just trying to get a little bit of tidbit about the business stuff because I havent just trying to get some messages. Havent really started my business yet, so just trying to get a little bit info.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Lets just say roughly about four no, about 06:00 or so. Is that time good for you?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, go ahead.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Havent considered it, but if I were to do it on a regular basis, Im sure I would be open to the idea and possibilities. Yeah, absolutely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Anything in particular that sticks? Either, like I said, it would be the real estate, or either maybe even a little bit of ecommerce or if not anything along. Traveling too, incorporating that too. Because after all, life is to be lived, right? So you want to explore other avenues that you can see in the world as well. More days are behind me than before me, so Im going to make them count. My daughter at the moment trying to get her fitted for the dress that shes trying to get. Can we talk at a later time?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its been a minute, so I will have to say probably six something.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Eastern standard time.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}}]