[{"pageContent":"Okay. Yeah. The basic work that I need help with is funneling my people to me or to my business. Better.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"This is correct.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay. So, Brandon, I do have a question because I like your questions, but theyre kind of, like, in depth to the technicalities of my business, but sometimes this is given in peoples personal zones or group calls. And so whats the reason why youll be inclined to this lifestyle business that I have?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im sorry? Which business.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"2200 a month.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, I can double check that. Ive been trying to get my email acclimated to my new phone.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, the Gold package basically that would get you access to my group, to a certain group, but I dont know. Im sorry, can I get your name again?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"I will be open for that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, all of that I have written down, but Im kind of at a different season now to where I do need to recalibrate it, so to speak, because I have gained more knowledge and more that I would love to get out, and I think that would be very useful for people. So I would actually need to recalibrate that. But if I could just give you a ballpark number right now. The Go package would be if a person thats a person that I will be speaking to, I would say at least 24 times a week. I mean, 24 times a month. Thats almost a whole month. Right. It does take a lot to do what I do. So I would say that I dont know, thats between 300 a month, but that would also be, like, my highest package right now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Im sorry, the phone is kind of breaking up a bit. Can you say that again?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Would it have came through email?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yes, I am rebranding, and I know all this AI chitchatter is going on, and you guys add sort of excited me questions.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Basically like how you said in packages, its basically what you need from me within packages. So I would name the packages how I would like and the amount of influence or help Im able to get to them. Me and my team get together to where we can make sure we can accommodate it.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Because I want to be careful.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah, I do, but I know that it will be from an overturn, so its going to be at least six to nine months that I will be able to do it at this point, I want to be able to do it when Im ready, so I need to already have it. So that doesnt mean that Im not really negative nine years. Its just like, I got some work to do, and Id like to make it to where I can have that freedom.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. So you guys are big on scaling, basically, right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"All right, Brandon, that sounds good. Thank you so much.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Thats great. I think thats really awesome because that sort of ensures or it guarantees growth. So thats pretty awesome.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I believe it was on one it could have been between 650 and 700, and I think on the other it was between 630 and 675.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes, right now, basically what I have is a consulting business, a lifestyle consulting business. I have a background in behavior education with the community. So largely what I do is work with families or people that are influenced to hit certain goals at a certain point in time. Thats where I would help. But with you guys, like I said, just a couple of questions as far as branding and how we could possibly do this online, because honestly, I dont see where anywhere happening. So this might be a first. So Im kind of really excited and I just kind of want to get in depth with talking to someone about it because I dont even see the hashtag.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, it kind of seems like its on the actually for me to have seen it where I saw it. I believe I saw this online on maybe Instagram or something, but it just seemed like something that I dont think Im so much as a beginner, but possibly moderate in understanding how to put my business together. And so really I want some help on building my business paperwork for my LLC.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, no, I do see yes, I saw one that actually came in for me to have the invitation for that call.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes, I do. You say credit score and what its based off of the credit score and income?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"About 22 a month.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Would it have came through email?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Honestly, Brandon, about 15 years I told my mom I was going to rebuild her house, and Im like, I have to at least make enough for that, if not double that. Those are my only two choices. So even if I surpass something, I still have a goal. And that means that Im still winning. That means that were all still winning. Because what Im going to do, its a we thing, its not just a new thing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, Brandon like freedom for me, looks like. Ill be frank. Were sitting here with nothing on the phone, and if someone calls me, I want to be able to be there in the fashion that they would need me or whatever I could provide at that time, because I do have to also keep myself at a certain point. But I want my freedom to be that wide. I believe that I can go everywhere. I can do anything, honestly, to the depth, but, yeah, I want to be able to do that. So, like I said, its not about me thing. Its a wee thing for me, and Im just trying to figure out how Im going to navigate that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, yeah, Ive been doing it for a little over half a decade. Its my baby. Ive more so been doing the education part of it right now, especially since Im in my first ten years, Ive still been sort of putting myself through like an educational part, but its very hands on. So Ive been working in the community, like with certain universities or private organizations and communities and working with families. And when Im working with these families, Im also working with certain conglomerates of certain societies within communities. And so basically theres different people that have different types of lifestyles, but they may have kids, they have similar situations, which kind of puts them in the same boat. So I have found that it is a certain audience. I know that I know how to speak to them. I just need help putting together my business. And thats what I thought that you guys did or your AI had the capability of doing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Not today specifically. It is something to where every day when I listen to my mentors or I speak with someone, I know that I could kick it off from that day. Honestly, what I want to say is a part of the journey, and youre starting to make me feel like I really do need to write this book, but I dont want to give too much.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Bye news world. Bye now.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, see, value that right there, Brandon, is part of why Ive been reaching out, because the certain people that I have that shoulders Im standing on, or people I watch and we watch each other, we support one another. I can see how things are increasing, but in my surroundings, I believe their proximity is power. And in the circles that Ive been in lately, everybody does not do what I do, and they dont have a certain mindset. So I dont know, hey, what possibly I could put on that, especially with the certain packages, because sometimes its split to where my calendar may be, to where I need to focus more so on a different type of package or certain people that are coming because I want to be able to serve my people. Its not about me trying to hit a certain package. Its just where are people more so? What I found in these nine packages is that sometimes people, they more so have to just go along with what they have, and sometimes they will go to the closest package that they can get to you, possibly. And it may be a package where you dont have, like, a face to face. It may just be a product. It could be, like, a book or something, but thats as much as you could get at that time. I may have $35 here or things of that nature. Wow. I just had a whole thought. I need to actually write that down. $35. You could still do that sizzle or online pay, where you can do, like, monthly. Right? You can put that on your page.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Fast enough is a different question. And I will also say I have not necessarily thought of that direct question, but I have been reevaluating what is bringing me profit, because I do need that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, its about 5000.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im sorry, what was this?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"I want to be able to be at the part of my business or the season of my business, where I know where to look at for my numbers that are connected to my audience and not so much what theyre looking for next, but just to kind of see where theyre at. Sure. Yeah.","metadata":{"fillerID":5,"fillerText":"Ok yah","category":"A"}},{"pageContent":"Im sorry, say that again?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Because Ill be giving me I dont think people, like, a lot of times in the work that you guys are doing or promoting its in the face or its on the same platform as influencers. So I cant bypass the thought that you guys have not worked with influencers. And so the thing is, if you influence people, your life is also looked at. These are things that I think that people are staring away from AI about because it can take a lot of time and a lot of time with technology or in tech areas, its like, no, TikTok, we got to go. What is this about? What do we need to do? But right now, a lot of people, especially influencers, we can see when people I watch the news, people are passing because theyre not speaking about certain things. Theyre feeling. You have to be careful because when a certain light is shown, theres also darkness somewhere. And regardless of what you see, you dont know what that person is necessarily going through.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Because that will be time that Im devoting specifically. So thats why that would be, like, the golden package. But there are up to, I believe, nine different packages at this time.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]