[{"pageContent":"Yeah. What does it do?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"No, other than what I said before, self confidence. But I mean, I can get over that if I got into it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Oh, yeah. Before I actually did it, I had a marketing not a marketing job, but I kind of ran marketing for different companies and shit. That sorry, excuse my language.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, so kind of embarrassing. Not really, but I run the good old Go high level SaaS reselling right now. Im sure youre probably familiar with that. If not, I can kind of okay. I only have one or two, three clients. Hopefully three by tomorrow. Ive got three meetings booked right now, man, Im doing great. But as far as outreach, I really only do cold calling. Yeah, thats all I really have for you as far as information, is what I do and everything I have going on.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I know. Nothings stopping me, really, except for wanting to wait. So I am eventually planning on moving into that space. But I want to one because the biggest reason that I didnt do it to start out was I wasnt sure I was able to do it at the level they would need it. I did marketing for family businesses that I knew they werent huge, but sorry, Im running around, Im out of breath for some reason, but they werent huge businesses. So I dont know that I could provide value yet. And so Im starting out with the lower ticket agency model to kind of gain those skills. And thats why Im offering basically what an SMMA would provide in a SaaS price. Im offering that now to gain the skill to do it for bigger, higher ticket businesses later on.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, actually, Ill just read it to you because, I dont know, top of my head. So I have standard professional premium, $97 a month, 297 a month, 497 a month respectively. Do you want to know all the features with them? Im sure you dont.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, exactly. Im going to be honest, I dont know what Im doing when it comes to that stuff yet. I want to know and I am trying to learn, but I dont think I know at least. So my problem was I didnt want to offer something I didnt know how to do. And then its like my reputation is the most important thing to me and so I dont want to go in and say, hey, give me what did you say? 4500 for three months. Okay. And then I did nothing for you. And its not like I just couldnt. And so now Im like I feel like an asshole.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Right? Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes. One final question. Its kind of unrelated. Kind of. And you dont have to answer if you dont want to. Whats your commission on this call? If I go in and I sell you sell me? Im doing transparency.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah. All right. And so I know you probably dont like to talk about this on the phone because its kind of not smart, but what is your pricing?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I usually try to put in right now, because its small, I usually only put in, like, $1,000 a month, and Ill put in $250 a week or something like that. But thats just because its starting out. I mean, I dont need anything in the business account right now.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"What are those right things?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Plus yeah, it would be nice if I had the skill. I 100% would, and I probably do its just more of a self confidence thing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Dude.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, its my first thing thats happening.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, yeah, always open to new stuff.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No, its not there. Actually. Hold on, let me check my spam come. Assuming its automated. No, not there.","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"So what youre saying is offer the higher ticket prices up front and basically use the SaaS side to downsell. Im really not interested. Really not interested. Cant get them to get moved, cant get them to budge. And youre like, well, here essentially its kind of what youre saying. Plus as a retainer to keep them retained if they dont want the marketing side after.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Oh, yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"What was that? Sorry, it was kind of muffled.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Well, I work as an electrician apprentice. Im only 18 years old, man, but I make 47,840 a year.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Oh, yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"You too, man.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Because my parents, they own small businesses. Ive got a bunch of family. I did all their marketing, all their Facebook ads. So, I mean, Im selling essentially an SMMA at the price of a SaaS start out high level. To do that. Originally, I was getting paid good money, but what I basically provide for them is, one, the skill in go high level that I have over the years. Only two, but whatever. And then also a little bit of a background in marketing and all that fun stuff.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"My grandma made it for me.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Currently, its taking a hit because I had to take a car loan out. But its at 672 not too, like, two months ago.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Closing the deal? I could probably close a deal. I like to think of myself as a good salesman. My confidence lacks in product delivery. And so my biggest thing when I started this was I wanted to learn go high level, inside and out. I already knew a lot about it, but I didnt want to go into it and be like, all right, I can do all this for you, this great software. And then Im like I go in there and I dont know what Im doing and Im sitting there at a computer like, oh, I hope you stay.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Because I like to target smaller businesses and I dont feel like they have the money to spend like 2000, $3,000 a month on something thats not too difficult to do, especially with go high level.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"No. Theres a guy, I do his cold call sometimes for the experience, but were not partners or anything. Hes got his own agency.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, yeah, I dont know. I really dont know. I have no words. But yeah, Im on board with you. Im following.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, thats the email Im looking for it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"One of the things I like to know yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"It should be good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Peace. East. Bye.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I havent even looked. I didnt think it was sent it to me. Let me check.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, four or five. I want to get to, like, five before I quit, just so it makes sense.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Cool. All right. Appreciate it. Monday. Have a nice day, sir.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"They need to be in place.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. Cool. Thats what I was trying to say. My bad.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"If I get over ten K in a month, in 60 days, Ill sign up on whatever agency or whatever youre running at two K. You dont even got to provide me nothing, and Ill put it in writing.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Fair enough. Thank you. I was just curious.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Wow.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, man, you guys called? Im good, how are you?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, no, thats Eastern. I was just saying central Ohio.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Oh, yeah. Ive done the math a million times.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, it makes sense. Id do the same thing if I could.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, no, my biggest bottleneck right now is time. So I get home, and Ill get home at 230, and Ill hop on the phone, and I mean, I dont like to call personally. Latest I call is about 07:00, but people stop answering around 536 oclock. So I only get a couple of hours a day to call as soon as I was able to, gone, none of that. So I can focus full time and skill that way.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I just started rewatching it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I didnt know that. Youre doing that tonight?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I have Monday. Ill get off a meeting. 430. Just anytime after, like, five. Okay, yeah.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, I check it almost every other day.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, I just have one more question. Yeah, that does sound great, but I have one more question. This isnt a hard one. Okay, so that call goes well, I sign up that day. What does it look like on my end?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"No, I dont mind. Go ahead. Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Fair enough. All right.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Oh yeah, whenever you send it over, Ill probably get on it as soon as I could.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Ohio. Ohio? I live in Columbus.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"I mean, it varies. Like one client I have a meeting, not client I have, but a meeting I have. Wednesday I was on the call. I probably shouldnt have booked the appointment because dude was like, I dont even have a computer. And so for some clients Ill be willing to build that out real quick because its not like something that takes horribly long, but typically no. I actually have a course that on Gho. Its a little tab at the bottom, custom menu link and it goes through all the features of go high level and how to use them and stuff.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, yeah, personally, Im the type of guy that takes any knowledge. Its good knowledge and Ill take it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Both. Because the training I have is by myself working with people I know. And the experience is the same. Its just people I knew and if I didnt do well, it didnt really matter. I wasnt going to be paid horrible, I wasnt going to pay a fuck ton to do it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It always has been. I dont know why. I just like doing it. Thinking about making it grow.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]