[{"pageContent":"That works. Thatd be fine. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah. What we collect off our show, we have five short term rentals right now, probably going to gross around 250 to 275. Just those four. Right. We have another lot up its in World Park thats not going to gross as much. Then we have three lots in Silva that could gross. Definitely equivalent, if not more. Probably equivalent. So you talk about $500,000 gross there. I want to say thats bare minimum, but that would complement all that income because thats gross. Im speaking gross. Im not talking about net. Right? Because I think weve done things smart, especially her. And we dont have a ton of overhead in the Wilmington deal, but on our lots in Silver, we will, because we have to put up build the structures right. On our lot in Marriage, 26 acres out there. We have to build structures. Plus we have enormous amount of equity and assets in that land. Once you put houses on there, that property could easily be close to a million dollars just in itself, the 26 acres, because its right on the water with 500ft or whatever. Its right outside of Atlantic we believe in actually, shes convinced me multiple streams of income, even in retirement, because its something that I could still do. We bring up this maybe its cliche, I dont know, but we bring up like, Jen Fond or Robert Denier, whatever you care about them personally, theyre in the freaking eighty s, and they certainly dont need to make any more money, but theyre still up there working because it gives them a purpose in life. And were going to do the same thing, whether its running short term rentals and doing what you and I are talking about, possibly, or just sticking an insurance, her doing, her nonprofit that she runs, were going to do that as long as we can because we believe in it. I dont want to say its bare minimum, but I think that will be fine to augment the other businesses.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, Im not married to anything right now. Im open.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay, yeah, that makes sense. Im really pressed with Hard, man, so.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Hello? Hello?","metadata":{"fillerID":33,"fillerText":"Yeah","category":"E"}},{"pageContent":"And my skill set? Its readily what Ive done, from wire houses to really every type of different theres wire houses that put away from the more holistic financial planning and then I got into more tactical money management. So I was all over that space. And insurance, I used insurance as an asset class, and Medicare was a natural transition to being able to offer to people that were aging into Medicare, and theyre already with my clients. So its just where my skill set sits, and it seems like a natural transition. Im not exactly young, so to come out of nowhere and do something brand new that Id have to really learn would be very difficult for me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"It very well could be. I can admit that, absolutely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay. I really would.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I understand the sales process and its changed throughout the years, right? I grew up with Morgan Stanley going through White Pages. But that being said, you got Edward Jones and you got Medicare people. Theyre still going door to door, which is freaking unbelievable in my opinion. I think thats even efficient and effective. Im not 100% sure where Id want to fit in that space at this point as I transition and all that and all the things were juggling. So I cant really answer that 100% right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Why dont you walk through that a little bit? Im transitioning. Right. So I was in wealth management and got clobbered in 2022, and Im just tired of dealing with it. So even though life insurance and health, Medicare and all that was part of that wealth management, the more focus was actually wealth management, money management. Im pulling away from that 100% and just going to deal with the insurance aspect of that. I guess in a way, I guess I am, because it was never my focal point. It was always accelerator Im sorry, secondary, or obviously something else I offered. So in a way, I guess Im starting brand new as I look at digital and AI, all those ways to market and scale and build.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, I can probably do that.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So Im going to have to run, too, because I do have to run out to the appointment. But my point is, what I mean by that is I think it needs help. The problem is, I always view myself as this little guy, right? I cant compete with the Goldman Sachs, the big time investors, the big time hedge funds and all that. They have all the influence, and a lot of them, too many of them, I say, are up to no freaking good. Right. And were seeing that, were seeing a concentration of more wealth in smaller and smaller hands, and its really unfortunate. So I like the industry. I think the industry is very important. I think people need to learn about it and understand it better. Maybe theyll make better decisions. But my friend Frank, Ill say this beforehand, hes a good example of a post chart of an average person that saved the max all through his life, even through divorces, which is unheard of. Right. And he has a million six or whatever, his house is paid off. He can live relatively comfortably. Right. With Social Security and all that. Very few people get there, unfortunately, for whatever reasons. Sometimes its their fault, sometimes its not their fault, sometimes its a medical condition, sometimes its divorces. Sometimes theres an issue with the kid. Who knows? Theres so many things you cant control. So I think people do need to learn and understand things better. Are they open to it? You brought that up. I dont know. I mean, the media is very powerful. Unfortunately, a lot of them told everybody the wrong freaking thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, go ahead. Put me on the schedule.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I didnt hear that. That was my fault. Eastern time zone.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Okay, buddy. How are you?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"It seems like. Yeah, and I completely understand the vision there. And obviously you being in wealth management for so long, youve had that foresight for a long time now. What I found is, like, my dad retired, I dont know, Jesus, six or seven years ago at this point. He was 65, and he got offered to start working again as a consultant. And hes like, right when I start getting a paycheck, then I have to go do things, and I dont want to do that. But he got me thinking, like, consulting was like the Shangrila word that you would have as a job title between your last job and retirement, where you got paid a whole bunch of money to travel around the world, make $1,000 an hour, $500 an hour, and tell people what the hell theyre doing wrong with their business. Now, in this day and age, thats transformed in some capacity because COVID didnt do a whole lot of good. But one thing that it did do was streamline businesses immeasurably with Zoom and everything like that, to where consulting businesses, coaching programs is a different variation. Its like the 2023 variation of the 1990s, where youre flying all over the country six days a week, making way more money than you should, consulting businesses. So as youre in this part of your work life, do you still enjoy the wealth management field, or do you want to get the hell away from it? Thats a huge deciding factor with this.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"It sounds interesting at this point, I will admit that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I did. Im in the middle of putting all that together and gathering all the information. A, it would be insurance, mostly in the life insurance, health insurance space. Thats what Im looking to scale, but Im trying to balance CRMs, and Im trying to do a bunch of different things. So Im right at the exploratory stage, I guess, as I put everything together. For sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"What time is it? Yeah, go ahead. Real quick.","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Well, my target would probably be, at a minimum, probably twelve to 15 a month. Because were also not stupid. Morris, my wife, whatever you want to call her, her business, she runs short term rentals, right. She has Ford, Wilmington, North Carolina, one here in Newburn were going to spend on that because we got land in the mountains, and thats going to be part of our income. Right. But that cant be all of our income. So I would definitely need to at least be that minimum monthly income there. Sure. Okay.","metadata":{"fillerID":7,"fillerText":"Yah totally","category":"A"}},{"pageContent":"Real quick. Retirement, right? We talk about her and I talk about this all time. What the hell is this? Like everybody said in their head, Im retiring at 65. I want to retire early at 50. What are you going to do for 40, 45 years? Because people will be kept alive, I guarantee you that. Now, I dont know what the quality is going to be, but your ass is going to be alive. And you better be very disciplined in saving money, because that 100, 200, $300,000 is not going to freaking cut it. I guarantee you that. Ill finish what you were saying.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im sorry, say that again.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Okay, man. I appreciate it, man. Thank you.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"About 25 years.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I mean, Im pretty flexible. Im at the house most of the time, and the rest of this week Im pretty flexible.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah. And the reason why I ask is because the reason why I ask is the reason you just gave. Because, I mean, listen, I dont know a whole lot about the field, and its not really my job to, but for the people I do talk to that are coming from that field, that are either transitioning into insurance, as you mentioned, or away from Medicare and into IULs or things like that. These are terms that Im learning. I sound like I know what Im talking about, but I dont. Im a good listener. Well, is people dont know what the hell theyre doing. Feel like thats pretty safe way to say it. And theres such a void there for potent literacy teaching that thats why I always kind of pivot towards that, because just as an aside, like, thats where we eat. I mean, we help people. Weve helped hundreds and hundreds of people build out high ticket offers in the coaching space. So when you talk about the wealth of knowledge that you have 25 years of this, and Im sorry that personally, you had a rough go in 2022, and Im sure thats the understatement of the century. So I dont mean to be insensitive, but thats like, youve got this just.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Actually, my girlfriend brought that to my attention a couple of times, and thatd be something Im definitely open to, so I want to be opposed to that. I know financial you speak of financial literacy, right. A lot of the problems and the unrealistic expectations of people, even when they get to their forty s, fifty s and sixty s, is because theres no basis of financial literacy. Nothing really detailed, real basic economics, how money works, how taxes work, and all that stuff. And the fact that that is so lacking is so evident in the problems we have in society today, at least in America, right. Probably worldwide as well. So theres definitely a need there. I mean, there is no doubt, and it hasnt been really addressed by the K through twelve education market, or I would even honestly say even college. That being said, because youre getting one leaning view, and its really not necessarily how money works. Thats why everybodys out there I want this should be free, I should have to pay for this, I should have to pay this back, or whatever. Thats just the ignorance of how money works. Somebody always has to pay for it. And theres so many people out there that dont believe that such people that work in government and the people that are coming through the colleges now, probably for the last 15 years think that way. And thats really problematic. So thats something I definitely would entertain. Theres no doubt about it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Like, treasure trove, this chest about that, too. My industry gets stuck, right? I was just talking to somebody else about that. Even marketing, the industry is so stone aged, and Im not a young man. Im not young like you. Im 55, right? But I realized that when you hear people, and very successful, smart people that make a hell of a lot of money, okay, they sit there and say, well, this reminds me of 1970s, this reminds me of 1986, and I want to just put my head to a wall. Theres nothing going to be equal to that. But things that exist today never existed in 86, never existed in the hell David exists on an 808 crisis. And you have to evolve and realize things change, mindsets change, behaviors change. And Im not saying you dont take pieces of that, but my point is, I guess, is even though I have that knowledge, I also realize, like 2022, I dont fill up my hands and say, I dont know. I honestly dont know. Now, I do think, in my personal opinion, theres a lot of corruptions and make it shorts, and the corruption, theres always been there, but its really bad now in the market. Thats part of it. But I just think you have to evolve. And even in the space of coaching or I forget what other words you used, you really need to realize that that even though Im 55 and Ive been through such and such, whatever the next crisis is, if you want to call 2022 a crisis, its still different. Right? Because you have millennials and gen zs that really werent in existence in eight. Right. The way they look at things is very different. The way they were educated is very different. Technology has evolved even since eight. High frequency trading, dog poles, all this stuff that really werent as prevalent back then. So thats the one thing I think teaching as a whole. My girlfriend would talk really about the psychology industry, which shes frustrated with. People get stuck, especially my age women not her age, but my age, right? And thats sad because you can still bring all that wealth and knowledge and experience, but you have to realize it changes and you have to adapt to that to be effective. Does that make sense?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I have a broad overview. Obviously its a search engine optimization. Its engaging people, having them having whatever catch their eye and they get lost a pill shit. So I have a broader review but not in depth and well known idea of how that goes from one point to the next point. Final point, dont know how it goes from that. Okay.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure, absolutely.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"That is funny. You mentioned that. I had difficulty getting the case study. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}}]