[{"pageContent":"Yeah, were basically a family office. We do the planning theyre not going to find in their own neck of the woods. Typically, its one or two things. The guys got a successful business. Hes building, hes growing, wants to pay less tax. The other way, hes going to sell the business or sell a big piece of real estate and doesnt want to pay the capital gains tax. Those are our two people.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So its all said and done, you make more.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, I love that. Okay, so five to ten K for that five to ten K, busy business owner comes in, and you guys are going to come in hands on and help them maximize their tax bill and pay as little taxes as possible.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Correct. Lets just hypothetically say for, like, ten grand, a business hired you or paid you to essentially come in and lets just say maybe coach their in house accounting team or something like that, coach them on how to do these things, and then they would actually do all the work. And then you would just get paid essentially for your expertise.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"How much is this program?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I got four kids and my dad is a full blown workaholic, and I dont want my kids to have that dad.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"There exactly, that my dad was a business owner, worked his ass off and he was gone a lot. Didnt really save him in eight either. So our main focus is basically how do we internalize wealth in a business and make it recession proof, right.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Yeah, we could definitely evaluate and see what we could put together because we want to find more of less. So Id definitely be interested in seeing what we could do. Right. Im a little apprehensive just because its so different than what Im used to doing. Not exactly what I had in mind, but it is what it is.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So basically, an accountant the tax code is over 80,000 pages long, just federally. And accountants are really just focused on reporting the tax. They have no obligation to do proactive stuff. So were more on the front end. We do every October. We sit down with every client, figure out what the tax bill is going to be, and spend the next month and a half finding ways of reducing or eliminating it. Were most known for eliminating capital gains and income tax. We have some pretty elaborate and creative estate tax elimination as well, but it is what it is. So basically, how do we go about it? Well, when you have 15 different tax attorneys, they each run a practice of anywhere from three to 80 different attorneys. Under them, we specialize in just whatever the problem is. You need a team like ours because every guy on the team specializes only a handful of things. There are no generalists, and so depending on their needs and what theyre looking to do, well do it. Most financial planners do not like working with us because we dont have a focus on creating assets to manage. This is a big problem. How do we get rid of it? And we typically zero out peoples income tax liabilities every single year. If they have enough. If they have a tax bill of like, $100,000 or more, its a piece of cake.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"But thats a piece of I guess.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Im in the office at 07:00 A.m.. Thats basically, lets see, youre Eastern, so thats just 3 hours ahead of me. Youre basically at ten. So the earliest I could do a call is at 10:00 A.m., your time, and I could do it dan, why are we looking at.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, Im pacific.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Good. Whats? Air AI? What?","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Well, we help them with it. Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"For the video or the call.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. Wheres the business at now per month in revenue?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, it would definitely be interesting and everything to be better and more efficient is always helpful if it ended up getting us in front of our deal clients. And all we really need is a phone call. You want to save tax or not? Okay, cool. And if they dont? Well, biden loves you. See you later. I think itd be pretty helpful. I guess Im already coach just showing them how we do things, what we do, and if they want to work with us, great. They dont, well, thats how we would do it. And good luck in finding the guy to help you do it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Kind of some guy just got let go from the group because he was just charging basically for access to the team and, like, a hand off, and he disappeared kind of thing, and they didnt really like that. Id have to really look, I hear what youre saying. I also have to keep everybody happy because these guys are not wanting its not a bad thing. Id have to figure it out. Im really just hoping for some AI that find the guy and the right people dont know how. I dont know what things could access without breaking laws. But just say, hey, your revenue is $6 million or $18 million, and you probably have a tax bill way above 100 grand. We can make that go away, and we augment what your CPA is doing. And truthfully told, I want to make the CPA like us because I want to buy his book of business and mind the fuck out of it. Right? Yeah. If you guys could do that, Id be thrilled. Or finding the information that our clients ask for, because a finder sees a $200 million deal at 1% is not a bad way to make money every month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, for sure. Before we could jump into the different stuff with the AI stuff, I want to get a better understanding of kind of the foundation here. Have you ever done or do you do any consulting where someone could come to you on just a pure advisory basis and you just walk them through what to do and then your hands off?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Oh, yeah, I can object to ten of those a month.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats a piece of perspective I was going to offer, is you can essentially just have a ladder, right? So you could ask yourself, all right, for ten grand, right? If I were to do a group coaching with business owners, put together a video course and offer that to them, fundamentally speaking, do you feel like you know things currently that they dont that if they pay ten grand for it would inevitably be a value to them? Obviously, theres certain things that maybe wouldnt make sense to go over in that, but of things that would that business owners would truly get value from, do you think that would actually be like a benefit to them at that price point?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, that works.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"12:00 your time.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I dont even have a lunch break on Monday.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Appreciate it. Cool.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Yeah, its 100% me.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah. I have meetings from 07:00 A.m. To 09:00 P.m. On Monday, so the next day would be I could do 07:00 A.m. My time on the 18th or the 19th.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah. I just figured AI and other systems would allow me to do more with less. Or if I flip one switch here is automated and can handle a lot more than me just doing everything right now.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. Does it have to be tonight?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Monday is theyre terrible. I dont know what it is. All weekend people are thinking about problems, I guess, and Monday, thats where they uncork them. Tuesday, I have time at 07:00 A.m., and then I have time thats Paul. Okay. I have time at 01:00 P.m Pacific Time on Tuesday 07:00 A.m to 08:00 p.m or 08:00 A.m is open on Tuesday 01:00 01:00 P.m. Excuse me. On Tuesday is open and then Wednesday is pretty open. Thursday 07:00 A.m to 09:00 A.m is open.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Thats fine.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Anyway, whats up? Anyways, thats basically what I was trying to do, is find more of these guys and more opportunities. I dont know, I kind of want to get out of having to write so much to do. Just kind of want to grow to a point where I have enough income and staff, where I personally dont have to do the insurance, I dont have to do the assets, I dont have to do the investments. Other people are handling it, and I can not work so much.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, Im going to lay awake all night thinking of this question mark. Is it like ten grand? Is 100 grand? Im that guy. Ive called people in the middle, and I like, you got to give me an answer. I cant sleep.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Which time would you 07:00 A.m.?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Okay, thats fine. With multiple offers, its not just one. Right. And I dont have to this isnt where I got to do it myself on top of the pile of everything else I got to deal with.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right, right. I mean, honestly, for something like that, you could probably smoothly charge like, 20 or 30K for something like that?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"All right. Okay. Yeah. Lets more willing to have that phone call and see this training video. Probably be tomorrow when Im sober.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"All right, thank you, sir. I appreciate it.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Im not going to lie, mondays are the worst day of the week for me. Its more wednesday is a lot more open. Tuesday morning. I have time are you Eastern? What time zone are you?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I have no idea. To be honest. I was just kind of interested to see how AI could help us better things and try to be more on the front edge of the marketing side with AI in our industry. And I clicked on it. Truth be told, my Internet sucked and I got frustrated and that was the end of it. So I dont even know if I filled it out. Sounds like I filled out something at least partially.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So I usually charge a fee for my guiding services and coaching services. Nobody would ever know these guys existed or let alone how to interact with them. They dont know what to expect or whats available out there. Unless you came from the training that I did, you would never know about these guys. Right, right. Long story short, I charge oh, thank you, darling. You brought me an old Fashioned? Yeah, I do. Hang on a second. Sure. I appreciate liquor is liquor. I appreciate you. Ill be done here in a little bit. Im waxing the wheels on the escalade. Anyways, my gal brought me out in old Fashioned. Shes so nice. Anyways, so basically I charge a fee relatively upfront. Ill ask a bunch of questions, see what were dealing with and everything. Theyll send me their tax returns, fill out our questionnaire. Well have a long in depth conversation, or ask them a million questions that theyve never been asked before, and then itll give me a basic idea how much work its going to be I charge them a fee and then I take the information to my team. We come up with proposals and strategy solutions. We start introducing them to the specific attorneys and CPAs that can solve the problem. They all have their own cost and expenses. Some guys are hourly, one guy is 2800 an hour. One guy charges you a flat rate. But some people say thats a lot. Well, if it costs you 100 grand, you save over a million in taxes every year, and it compounds every year. Its not a bad cost. So thats what we do. I was just trying to find a more efficient, modern way of finding more of these guys because right. Well, theres got to be a way AI could do that. And I could also not just automate the whole marketing system, but also our process, like taking their information and then analyzing the tax implications and all these other things and speed up the process. Then I can do more with less.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Dallas, whats the cost of this private training video?","metadata":{"fillerID":33,"fillerText":"Yeah","category":"E"}},{"pageContent":"Well, fuck you. Ill find value. Who wouldnt find value in that? Let me ask you something. So this isnt any different than basically what Im already doing where I charge a fee up front. To basically be their guide to these solutions and whatnot, and lead them through all these lead them to these solutions. And whatnot if it doesnt fit? They dont like this attorney, they dont like the CPA. I just help them find another one. Correct. Basically like a wealth concierge or something. And this is any different? This would just basically help me get to the guys, more people that are actually serious about it. And I could, instead of being concerned, instead of concerned so much as getting paid on XYZ and all these follow up products, just more concern on getting my fee, more of the fees up front versus products on the back end. Right?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, cool. Wheres the light bulb? Go ahead.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Well, how much is the typical cost for this? Are we talking like $10 million?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay. Why do you think theres so much fluctuation?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Interesting. And then what would the average client pays you for that?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Right. And then you do it for them, right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"We guide them through the whole process.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, basically my industry, I guess you could say were kind of in the financial industry. We basically were a team of 52 nationally recognized experts that have a focus on how to reduce taxes. Kind of like you hear stories of the Rockefellers and Trump and other people that pay nothing. We do that kind of stuff. Our primary referral sources are CPAs and tax attorneys, to be honest. And I was trying to find a more automated, easier way to find and communicate with our ideal clients that may be all over the states, because the guys were working with cant be the only ones in America that got a tax bill of $100,000 or more and want to get rid of it. And thats after a CPA does their stuff. Anyway, thats why Im basically the guide, the director of the team. I translate for the client so they understand what the hell a tax attorney is saying. And youre kind of the intermediary between everybody. Yeah, interesting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Is this whole program constrained to one offer? Like, can we do other offers for the same group price?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"Man you too. Take care. Bye.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"07:00 A.m.. Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]