[{"pageContent":"Im the owner of the company.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Wow, that sounds like a good plan.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"When Im saying 80, we get, like, about really we send out, like, 6000 connections. We get, like, close to 300 or whatever out of that 80 interact with us. And from the 80, probably eight calls that are meaningful.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"What I was thinking about. The dialer.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"We always get that we know how to kind of beat it. Weve been in the market. Right.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Usually we have yes, about 50%. We get it.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Be able to pay us?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Absolutely, yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Pardon me?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Makes sense.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Exactly.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So its really like yeah. So something about eight a week is what is currently going on. The meaningful conversation. Thats the real appointment. If we say hi, thats not thats just a good conversation.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"But you have to send me the invite, though, okay?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"On the other side, lets do Tuesday then.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"This is about 16 years. Wow. But I had an additional sister company which we had just exited last year, so that was also with it. So we were very huge in size when we exited the other one. So were still rebuilding it again back to that other company size and then exit at that point.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Thank you. And you too. Bye.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"1 second. 1 second. Let me just see really quick. Monday, how does it look? Like 24th it is. Yeah. 24. Monday is a pretty busy day. The only time I have you on 60 minutes is, like, highly impossible on Monday. Yeah, I think I only have, like, 30 minutes on Monday, but thats pretty much what I have.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"12:00 is the max because I have a stop at 02:00.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im in the east coast.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"No, its not. The reason it is not is because of this. We dont want to work at the leads and not reach out to them. So the leads sometimes get added up into our CRM, and then were lagging behind and then still making the calls. If we can get this calling methodology solved, that can save a lot of time.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, but only after I see the video. I can kind of jump on that. That way I know what were dealing with.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"They pay every month because these employees are on our payroll.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Perfect.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Jackson. Okay, awesome. Then, Jackson, Ill wait for your email, and then we can go ahead from there.","metadata":{"fillerID":3,"fillerText":"Ok gotcha","category":"A"}},{"pageContent":"Yes, thank you and likewise. And your name again, please?","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Good. Hows it going, Jackson? Weve been missing I guess you have different numbers. Different numbers. I get the calls.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"North Star group. Im not sure if you have heard of them, but yeah, North Star Group. Yes.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Technically, we keep at least maybe like 35% to 40% about our cost so that we can net out 20%. So thats how we kind of like budget it as a ballpark number.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And then if it is a wise mail, I believe AI can figure it out and then not waste time.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I mean, if youre doing it a monthly rate for some people, whatever hours they work, it can go up or down. The minimum we have done is like 10,400. Thats the minimum that we have done, but we have done higher than that too. But 10,000 a month per employee is what we get.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"We do not. We do not have the solution. Thats what Im looking for. If theres anything like that, I know that exists, but I dont know if AI can do that. Thats one thing. The other piece is if were also looking possibly not right away, but possibly in the future when the client actually kind of engages with us, we can send them a link wherein the AI will be asking them some questions, qualifying them, which will save us a lot of time.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"These are good conversations. Im talking about meaningful conversations. And some will be just like, well reach out to you next week or following week, and it just goes on that way.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right now, when we use Connected, I dont know if you know that software, we use that in order to utilize the leads that we get from LinkedIn. And then when we call these things now, we know that there are a couple of other calling software where it can call everybody, and then when the call actually connects, thats when its going to connect and then it continues the process, which will save a lot of time because we get 80 leads per day. To call them is like a humongous task, and we dont have so many salespeople, but at the same time, if you have a system, we can scale the sales team, and then instead of 80, we can make those leads, like probably 160 or anything like that, which will double the revenue.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Tuesday would be perfect.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yes, Tuesday would be better.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Otherwise theres a budget issue. After we have a conversation, sometimes we have seen that, hey, the budget is not yet approved, which is waste like another, like a month process.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Its 5 million.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"No, what Im saying is we can definitely kind of preach that model to our clients because if theyre able to get that extra money to hire these resources, they would just go for it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yes, so we run job ads for that, and we have not run any ads in terms of services yet for clients because in this space, we only bid on projects, the government projects we bid on, which is required. We have to, what do you call, send them proposals. So thats not really any ad related work, but only thing that we have is job ads. Right. And sometimes we do training, but right now were not doing it post COVID. But before we used to do training, then we are training ads to attract people interested in training.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"From 80, we may get like, eight to ten. Thats all we get.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"It is based on actually both. Its time and material. So if the project requires five people, then for each of them, they can either pay hourly, that way we keep a margin and pay the employees, or they pay a fixed bid, and then we just hire employees for that and then execute it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Vijay.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"How many appointments?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I mean, currently what were looking at, we may probably at least become seven to 8 million by the end of this year. But it again depends on the market condition. But it is favoring. Even though the clients are kind of very what do you call cutting their budgets, we are able to kind of service them. So thats really sometimes in our favor when theyre cutting the budgets, because we have people at lower budgets that we can present to them and still execute the project because we have an offshore team as well. But in essence, if youre asking, at least 7 million is what were going to become by the end of this year.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"That can solve some of the issues the clients have if they need to work with us, because if theyre willing to pay that upfront are you able to hear me?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. So currently I have a staffing business. So one of the things that we do is we generate leads using the two types of leads we have. One is a customer whos looking for a technology professional, and then the second lead is a technology consultant whos looking for a project. So what we do is we need both types of leads, and in order to get the clients, we are currently using LinkedIn Navigator and sending them emails in order to get the responses from them regarding the type of projects we handle. Thats how we get the client leads for the employees. We post positions and job boards, and then they apply, and then we have conversations with them and then go from there. Thats pretty much it. Very simplistic model. And if the client requires somebody to start with them, we may have them in our database. We present them, and then they start, and then we have a contract. Thats our business model.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"That is without AI or any other type of extra help.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"No, not that many. Sorry. Its like eight is what we get in a week because they dont give us the appointment same day. When we talk to them, they say, okay, lets talk in more detail on this date.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"We havent done that. Only thing is we do net 30 payment terms, which gives them time to pay us. Thats all it is.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}}]