[{"pageContent":"You working on a Saturday?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, maam.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"I think last year I was I think 57,000 was my gross. So my job was a little weird because what I would make, I would spend back into the company for travel, license, license, camera guys, everything like that. So I didnt really pocket I only pocket half of what I made through sponsorships and speaking engagement. So I would say right under $60,000 is what I was grossing on my own. Everything else was going back to the business.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Lower than 600, somewhere in the range. Its not great enough for me to secure capital to do anything. Like I said, Im dealing with medical bills, all that stuff. So like I said, Im in the rebuild process from the situation.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I dont see anything from Air, but it could be covered. My service and everything where I am. I mean, it could just not upload it yet, but I dont see it in my inbox or in my spam. So, like I said, it could be a matter of time. I dont have an email since 530, so that could be the reason of it.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Perfect, thank you. Thats all I need to know. I just need kind of a game plan now. Is that a one time investment? Is that multiple payments? How is that set up?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I applied for a job a couple of months ago, and I told the guy that. I told him I wanted to make ten grand a month, and he laughed at me. He said, if our employees dont want to make more than 60 grand a month, we dont even look at them. So that put me in a different mindset. So I want to make as much as possible. I mean, Id love to have those 100K months. Thats where I want to set my minimum at. Thats the goal that I want to achieve, and I want to scale from there.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"So let me ask you a question. No, youre good. What email would that have been coming from?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"Im not seeing it yet. But it could have went to spam or something like that. Let me see.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Okay, so heres my situation to be completely transparent with you. This is a whole new field to me. Before this, I was in the outdoor industry. I had an outdoor TV show, traveled the country, filmed an outdoor TV host, an outdoor TV motivational speaker, spokesperson for companies all that jazz, had a great life. I had a doctor perform a surgery on my back in August. Completely destroyed my back, made me complete paraplegic from it. So currently, right now, Im in rehab in a hospital bed right now, have this conversation with you but I knew that my life had changed, and Im not one thats going to sit back and take it. I want to make if my life is going to change, I want to make sure it changes in a way thats going to benefit me the most. So I started looking at ways to do things to grow and scale to provide a better life than what I had, because Im all about growing to the next level. So Im looking to do something thats going to put me in a field or zone that Ive never been in before, and I want to get there and be secure in that situation. So thats why Ive looked into you guys, seeing your work, seeing what you do. I just want to make the investment in myself to prosper and grow with the situation that Ive been faced with.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Like I said with Situation, Ive lost everything Ive owned. I am in the rebuilding process of everything, so Im not considering a lot to you. I probably do not qualify right now, but I want to know what its going to take for me to qualify, because I will qualify. It may not be today, but I will make sure that I meet those standards to qualify because I want to make those numbers that youre talking about and be as successful as possible.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"As of right now? No, but I am making those motions to get to that point to where you wont have this conversation again. I will be ready for that.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yes, maam.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"So thats completely fair. I would like to know what I need to make this happen so that I have a blueprint to go off of to make this happen. So pretty much you give me the information I need to get to where I can work with you guys and Ill make that happen.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, no, Im taking all those notes in. So like I said, when we do have phone call again, I want to make sure that its going to be moving forward.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Give me a second. Ill have to look, I hadnt had a chance to check. 1 second.","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"I truly appreciate you.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yes. So its a funny story. I actually applied for a marketing job about a month ago because, like I said, everythings changed for me a little different, but I do have a background in marketing and things like that. So I applied for a marketing job, got my interview for the company. They offered me a position higher than what I applied for. The co owner went back to the owner, told them my story, everything that Ive been through, had conversations with the owner. They came back and presented me with they want me to host a show based on motivational speaking, life coaching, and business development. So that is where Im moving forward to, and I want to have all the means and resources to scale that as high as possible.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hey.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Its Joshsonofthesout@icloud.com.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Thank you. You have a wonderful Saturday, too.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, just can I get clarification of what your expectations are? What credit score are you looking for and what amount do I need to have to invest?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"You know, its not a bad day. How are you doing?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Its going to take me a couple of months. Like I said, Ill take on this new position here in the next month or so. I said, Im in rehab currently. Im trying to get my situation figured out to where I can be able to stay for myself and do for myself. So Ive been in hospital to rehab for surgery. Happened in August. This is April. So probably a total of five months Ive been in rehab facility or hospital. So Im starting to get a little bit of a leeway to that I can manage and do for myself a little bit better. So from here, Im going to take every ounce that I have in me to get to the next level and get back everything that I had and more. So give me a couple of months, three months and I should be sitting pretty solid.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}}]