[{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay. Yeah, because right now Im documenting my journey and everything just to practice in front of a camera.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, I havent checked yet. I havent logged onto my computer yet.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"It was a text message.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"But Im sure its going to be temporary. I get a psychiatrist every now and then to make sure Im still disabled enough not to be able to support myself with a full time job. So they just do a few evaluations.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"I have received a couple of text messages before, right before you call. Are you talking about those?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"No, Ive never been in the military.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, let me see. Hold on, hold on. Yeah, the last text message I see is the one I sent.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay. So is this about creating a digital product like Webinar or something like that?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay, let me check. I got one of my computers on and Im just going to go to the email. Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Yeah, Ive been doing a lot of its going to take some time. Im just going to get into general bookkeeping eventually. As far as bookkeeping concerned, I want to get into consulting as far as accounting is concerned, as far as taxes and bookkeeping is concerned, analyzing financial reports for small companies. I help them read, tell the story that financial report is telling. Consulting, but generally just bookkeeping their taxes, then maybe consulting and then analyzing financial reports and stuff like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"What documents? What now? Say it again?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Okay, sure.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Okay. Im doing pretty good. How about yourself?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, Im kind of modest with my first goal, but my first goal so I looked at the bookkeeping and I learned that working for in a company, they say as far as in Georgia, the average bookkeeper may make anywhere between 38 and 43,000 a year. But as a solo bookkeeper running my own company, like me with an LLC or something like that, there have been people claiming to make anywhere from $75 to $200,000 a year. And my goal is to just do better than what it would be to work for a company. If I did 40 or 50, Ill be straight, but my future goal is to at least reach 100,000 just starting out. And then Im studying here and there. I havent bought an official course yet. Im looking at some theres a school textbook, and then they got these extravagant coaches and mentors that cost about five times more. So I dont know if Im going to study the textbook or go for one of those all the courses.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Just advertising was interesting. Im into AI. Im new to it. But I had a Jasper subscription last year when I was just working with Content Creation, which is about to run out this year and probably next month. This year, actually. My background is in business administration, and Ive been trying my hand as a freelance virtual assistant, general virtual assistant, which is a lot of administration. This year Im going to niche down and get into bookkeeping. So Im just going to form an LLC and everything. I got a website that Im working on right now. I just got to populate it with my own content. We got a lot of dummy information on there.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hey.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, eventually I want to become an enrollment agent and specialize in taxes. But I want to start out in bookkeeping because I took a few accounting classes, and Im studying to become a pro advisor right now with QuickBooks. So all I really got to do I know a little bit about accounting, and I just want to get the pro advisor certification. And I got the website. I dont have an LLC yet. Im working on that Ive been looking into. Im just a lot of legal stuff, forgot who to go with. So I just want to start off in bookkeeping, maybe add a few more services, like tax services and stuff like that. But this is it for me. I wanted something that I could do that I can see myself doing at home, something I can grow into my retirement, something I could probably even do after my retirement. Okay, cool.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I live in Georgia. Atlanta, Georgia. I just moved to Decatur, Georgia, this year.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Okay. Now, I got a lot of my family in the military, even my older brothers in the military. I got, like, uncles and stuff. That was in the military.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, heres the thing. I just been freelancing here and there and for the last couple of years, actually. Im legally qualified as being disabled, and I receive Social Security.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Im really keeping a law and a lot of the stuff I was thinking in the future, starting a YouTube channel, like going to more detail of my journey once Ive got it off the ground and turned the profit. Yeah, webinar sounds like really close to what I could be doing in the future.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I was writing that when you called me. I was telling you I just sent it again.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Oh, a text message. Okay, hold on.","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}}]