[{"pageContent":"Im trying to look for it right now. The Tldrdeepmind.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"I dont remember exactly, but yes. Thank you for calling.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Interesting. Its completely your responsibility to actually generate the lead and take them from that all the way to closing and converting.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, I think its more about I dont know how old you are, but late 20s, early thirty, s about thats what Im guessing. So Im like 52, right? So Ive been a Chiropractor for 25 years, so Ive kind of been there, done that. Ive grown and built four practices, and then, I guess just the piece of I guess probably why I reached out to your company or was snooping around your company. I always want to stay up on whats going on, especially with AI and that kind of stuff, and just kind of see whats the next five to ten years look like. If Im not doing this, what would I be doing? Obviously nothing. And just sit around and play pickleball or anything like that. Just see what else is out there as far as how to make money, and obviously still spend lots of time with the family and that kind of stuff.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Just depend on the amount of time invested and that sort of thing. So, yeah, Id be interested in learning more. For sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Monday is slammed.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right. And how does the fulfillment work for you? Is it like a pure consulting basis? Are you giving them a course or what exactly are you doing once they actually do convert?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Otherwise I probably would have never answered. Mondays are good. If that doesnt work, then I dont know, we might have an issue right now.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"We sell high ticket medical protocols to chiropractors and physicians. Basically between a personal injury protocol, diabetes, and an osteoarthritis protocol. And they run between, I dont know, 229,119 thousand. So a pretty high ticket, all inclusive protocols that doctors can run inside their practices to generate more revenue.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Theyre doctors, so its tricky because it can be from like I had a call this morning, I have my marketing guy generated a revenue this week, got the call on initial I got the guy on initial sales call and booked him for the presentation today, and he signed up today. So that was like less than three days, but normally it can be three weeks to three months. So thats kind of the tricky part.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah, I understand for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"My best day that I am available because Im not at the practice or working with my sales job is Friday. So if we could work something for Friday, that would be best.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, no, Im still the old guy involved in one. I have one practice that I still treat patients out of part time that I still have ownership in. So, yeah, Im still kind of doing it, but Im just like 1ft out.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Ten. What? At what time are you guys what time zone are you?","metadata":{"fillerID":31,"fillerText":"Ummm","category":"E"}},{"pageContent":"Interesting. So its like a combination of, like, consulting and equipment actually being exactly. Love that. Okay. How long have you been running this business for?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I dont think that I would ever be like one or the other. But I could see part coaching and part co if I could balance that somehow.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, probably right now I work two and a half days and pretty good with that schedule.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, no worries. Why dont we just hold off, then on the call, and then if you want to send me the video and give me some more info, great. And then well work that out from there, for sure.","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}},{"pageContent":"And one of the core four values are ways to make money. I can go through them, but basically one of them is coaching, consulting. Thats one of the core four. So Im always interested in learning more about it. For sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right. Interesting. And then when it comes to all kind of the back end systems of actually youre generating your leads, your appointments, kind of the whole nine yards there, does the company take care of that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Another job I dont know about that I can get behind, but it just depends on how much time needs to be invested in it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Good, how are you doing?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, lets do that.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I probably do, I dont know, at least one to two sales a month. So it could be like between 15,030 thousand a month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sure, yeah. Either that or send me info. Either one I can learn on my own. Or if you want to go ahead and break a little bit down for me, thatd be fine too.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"How does two mountain work?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, maybe something along that line. Maybe two and a half, three days a week. And then yeah, Im just doing what I want to do the rest of the time.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah, it all depends on I love what youre saying. I just would love to learn more about your company in general first.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Im mountain.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, that and I still want to build stuff and I still want to learn and grow, but I dont want to be tied down like 100% of the time and not be able to go and do what I want to do as well.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Interesting. Okay. And so then whats your commission on that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"630 p. M. Probably not. Thats one of my family time. So thats family dinner. So thats probably not going to work, right?","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"All right. Thank you, Rick.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, Id love to watch the initial video. Thatd be great. And I dont know if I want to book a call right now, but I would definitely be interested in watching the initial video and then from there I love what youre saying. So as long as I feel like after I watch that, if things are still on track, Id love to book the call.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Do you have drickyroopdc at Gmail? I guess I dont see the email. I must have looked all right, okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"No, I appreciate it. Yeah, that makes sense.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Well, Im in the office from nine to twelve and then lunch from twelve to one, and then one to two. Im taking a call and then lets see, let me see. Tuesday afternoons actually probably would work pretty good too. Let me see.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Not Monday. On Tuesday.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Yeah, I think so. I think thats what he does. One of those core four is coaching and consulting. Core four is four different ways to make money, right? Basically.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, if you could send me some info, Id be interested only in the fact that I know that. Have you ever heard of the core four before?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Give me a call at 02:00 p.m. On Monday.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Exactly. So you can treat more patients and generate more money. So if youre seeing ten new Pi patients a month, we can get you up to 30. If youre seeing 20, we can get you up to 50. And then if youre not treating osteoarthritis or diabetes in your practice, we have protocols for that too. So yeah, its just showing them, explaining them to them how they can make more money and generate and see more people.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right. Interesting. Okay. And then how long is that sales cycle?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, because I love managing my sales team now because I have people all over the country all the way from California to New Jersey, Atlanta. So I have a team, like I said, a team of ten salespeople that I run and I love interacting and helping them actually succeed in their business. I like that part. So I like managing people but I also like getting my hands dirty a little bit too.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"No, nothing like that. But just letting them do their due diligence, sending over information, letting them vet the company, vet the technology, that kind of stuff. So it can be quick. It can be but it also can be arduous.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I havent. Just because, I dont know, Ive looked into some affiliate marketing stuff just on my own, but other than that, not really now.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Interesting. Are you like a sales rep for the company?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Sounds good.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}}]