[{"pageContent":"Sure.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Hello? Hi.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I remember it, but I dont remember what the artificial intelligence proposition was.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Phil, okay.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"Id be an idiot, say no.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"The securities world is very limited in what you can say. Its not like we wouldnt do it, but its not easy to market in the securities world.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, I venture reviewed someone from LinkedIn and he seems to think he could do miracle things. But other than LinkedIn, we have not seen any promising parts.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"About 750.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im in the middle of something.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"What is it?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Im not going to no show. I want to be there.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I dont think we need a better tracking or management of the assets. Thats really immaterial. All we have to do is if you gave me $5 million in two days, we have it deployed, then it basically takes care of itself. The investment makes money over time. We just need more money.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Absolutely awesome.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Okay, Phil, its a pleasure meeting with you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"And whats your phone number? My phone number is 845-845-8078 073-014-3014.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah, thats phenomenal. Thats awesome, man.","metadata":{"fillerID":4,"fillerText":"wow","category":"A"}},{"pageContent":"Absolutely.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"I was just talking in terms of.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"Im in the mountain time zone.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, accounting, tracking the investments. But we dont one for building our client base. The clients that we have are basically rich friends that I have got you slow growth.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So refresh my mind. What is air AI do?","metadata":{"fillerID":26,"fillerText":"Ummm yah","category":"D"}},{"pageContent":"Got you. Okay, no, I get what youre saying. So you have this investment firm and how long have you guys been around for?","metadata":{"fillerID":2,"fillerText":"Yah gotcha","category":"A"}},{"pageContent":"Theres no way to invest in investing in gold.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"We need to get in front of a lot of leads.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Its very hard to say. Some months its 10 million, and some months its nothing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I am, but I dont know what happened to you.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Five grand a month, I guess. But we dont have a strategy of what we would do with it.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Strategic planning. Hello?","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"10 million a month?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And whats your name?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I sound stupid, but I dont know.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"Serendipity yeah, absolutely. Be in the right place at the right time. And if we could figure out how to get for example, I had one pipe dream that if we could get in front of gold mining companies, they put money in the ground to go build their mine to get more gold. Well, we can help them make more money on the gold that theyre making when they mine it. And that is like the only thing I have been able to think about in our quest to get more clients. Now, if we can get a gold mining company to say, dont sell it at $1,900, hold it and sell it at $2,200, and well generate income for you in the meantime with our strategies so you can optimize your cash flow, thats just one idea. But other people, just to give you some food for thought, they say, oh, well, we should go and invest in bonds. Because theres a split, they call it the 60 40 split, where they would put so much into fixed income in bonds and then they would take the income flow and that would be their profit. We have a different strategy because if you remember I told you we are able to generate income instead of putting it in a corner and hoping that gold goes up. So were actively managing the gold so I can make an income flow for like a gold mining company even though they are just holding the income, the gold.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Yeah. Hello? What happened?","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Im very open to being a creative problem solver. I just have to know what is available to solve the problem.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Um, its just more capital. $2 million. Hes happy with what were making, but hes plowing a certain amount back into the business. Thats good for us. I just dont know how to address the question.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, 01:00 p.m would be good.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Well, my partner was a partner in Price Waterhouse so hes familiar with systems. Our problem is we dont have a system.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Establish a predetermined goal of putting more money in, for sure.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Higher.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Lets go. All right, so you guys are still fairly new and it sounds like you guys are doing very well. Thats incredible, man.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Hello? Hold on. Hello here.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Right. So I guess, whats, like a typical month of net profit for you guys?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"We provide investments in gold, and we make seven to 12% return when most people just put the investment in gold to a safe and hope that it goes up.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"What is the business? What are you getting eyeballs looking at?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Yeah, those are all people that could put large investments in our firm.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yes, hes the price quarter house partner.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, it would be nice if they keep putting money in, but they dont money. But what would be interesting is maybe plowing more money back into the investment.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Like, a rough range. Just so I can kind of get a general idea of where your business are right now.","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"No, Im open to it. Im looking forward to it.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Were open to anything, but wed like to do it in a systematic way.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Our profit center is basically the management fee, and so we have basically two management type fees. One is a flat 2%, one is our favorite one. We dont make any money, but if we generate a large return for that quarter, then we get like 30% of it. Thats a lot of money, but we dont make anything if we dont hit it out of the park. So its like feast or famine.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"If we can do that, we can excite many people who are sitting there looking for opportunities, but there are none. The stock market sucks. The bond market sucks, and they have no place to put their money.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Im sure Im not thinking about this right, but it actually occurred because I was a money manager and we had COVID and they had something called forbearance where people were borrowing money, like a mortgage money, and then they were deciding that I cant make the payment. So their attorney would say, oh, just tell them that youre going to forbear. And I was getting pissed off that we make good loans, but they would tell me that theyre not going to pay. So I called my partner Jim Up, and hes a former partner at Price Waterhouse. And I said, hey, Jim, I love gold and silver. Figure out a way to make a profit every month on gold and silver, and then I dont have to worry about these assholes who are going to tell me that theyre going to forbear. So our funny story is he calls me up and that was Wednesday. He calls me up on Friday and he says, hey, Bruce, I figured out how to make a what do you call the candy that has peanut butter and chocolate? Reeses Peanut. He says, I figured out how to make the Reeses Peanut Butter Cup of Investment. I said, what the hell are you talking about? He said, I could make an investment that generates income every month based on the earnings of gold and silver. Okay, how do you do that? I could basically generate 6% to 12% on a pool of money every month, but gold really only makes money over time if it goes up. So he was an active component to gold.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Subject to the securities laws? Oh, of course.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"My credit score has no bearing on the fund. Yeah, its usually for startups are multimillionaires and all the people that are surrounding them are saying, oh, that could never work and were weve been making it work and it goes up and thats how it starts and then they put more money in. So its kind of frustrating and its actually very opportune that you call while Im making dinner.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, its hard to make a yearly number because some people put in 5 million and some people put in 2 million. So it really depends.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hey, whos this?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"We sell investments in the millions.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Well, were making money, were making money. We just want more money to make more money.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"I dont know.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Right.","metadata":{"fillerID":41,"fillerText":"Yah gotcha","category":"G"}},{"pageContent":"We can actually scale an endless amount. The gold market is trillions. Very few people invest like we do.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Well, we have raised, like, $10 million, and were making people 30% a year, and we can increase that. We just need more money. The people are thrilled.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}}]