[{"pageContent":"Hey, good, man. How are you?","metadata":{"fillerID":11,"fillerText":"For sure","category":"A"}},{"pageContent":"Im in Jupiter, Florida.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"68 currently.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Off hand? My partner Brett would be able to tell me that a buddy of mine handles that aspect of the business because he was very heavily into the car warranty business for fucking years. And thats what he used to build. They used to build, obviously, call centers all around. I know hes got one in Vegas right now that hes using for another business that hes got, but this has just kind of been pretty decent.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"So they pay me specifically for cases. So lets hypothetically say for mass tort, lets say that they are looking for a particular lets call it hernia mesh, right? And lets just say they currently are looking at herniams cases and say that herniams cases are worth about one thousand five hundred dollars to two thousand dollars per case per sign up. Right. Obviously fitting certain criteria, then obviously go out and grab those, find those people and do it through 100 infinite means, but go out to that. But once again, some of these other things are very structured. So its a little harder for a chemical called paraquat using all the agriculture across the United States. And its linked to Parkinsons disease. And its a very small field of people because you have to be an applicator and whatnot. There are certain finite things to it to make you qualify to actually be part of this class action lawsuit. Right. And thats worth like $4,000 to the attorneys as far as paying out marketing firms and stuff like that. So thats one avenue. And then the ERC is kind of like the bigger ticket right now, just because thats making me 50 to 100 grand every month like clockwork. And Im not really doing so much to actually ascertain that business, but we have room to expand, which is huge.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Okay. Yeah, it sucks. The 95 is a nightmare. The turnpike is a nightmare. Its great. We dont ever have to jump on like I dont ever jump on a highway here unless Im going to go golf at one of my other golf courses.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"All right, cool. Awesome.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Lets do 01:00 because then I definitely landed already.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Listen, just growing it. I mean, listen, itd be nice to hire a team. Problem being is the fact that its such a convoluted marketplace that Ive had independent sales reps in the past, and I hate to say it and hate to use the words, but theyre fucking retarded and trying to sell something that doesnt exist or constantly trying to qualify an unqualified candidate, which is car salesman, one on one. So its like thats the bigger thing. My biggest thing is to really get online and create that presence that I have holistically, right? Just that I have throughout the country. My phone holds what I got 63,000 contacts that are like clients that are like monsters from billionaires. Ive got the owner Panda Express on speed dial. Ive got Phil Ruffman. Those are Treasure Island. Just these guys. So its like Im using these guys left and right. And I mean, I own like 17 different businesses. Like theyre small. So when I was looking at the AI aspect of it, its more towards start sourcing and figuring out the online component. I dont believe in SEO. I think its outdated, antiquated. I think its been done, overly done, and its not cost effective. Thats just kind of the way Ive been with it. Had multiple firms that Ive worked with in the past on things, on the hotel casino stuff that weve had in house. I do know that. Ill give you a prime example. What works really well in the legal world, because its such an antiquated world, is Facebook. Facebook is a monster because people are so easy. I dont know what it is. Instagram doesnt work as well. But Facebook, as far as the support groups, the mommy groups, the father groups, prostate cancer, you name a plethora of people out there, its easy to go ahead and ascertain that business and get it. The other firms, the bigger firms around the country that do hundreds of millions of dollars a year in marketing in this space, they throw billboards in that. And its simple. Its billboards ad campaigns, $10 million a month in TV, radio, whatever. Right. And theyre just throwing it out there and see who bites. Right. Or a call center marketing. Right. I own a call center in the Philippines right now that we work with.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Yeah, definitely.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"DonT have the answer.","metadata":{"fillerID":38,"fillerText":"Ummm yah","category":"F"}},{"pageContent":"So for the marketing side of the Mass Tort, I think we did, like, 16 mil last year.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"But look, now youre good. I just know money. I just dont know. Im flying to Tulsa, Oklahoma. So one of my other businesses, I consult in the golf industry, so Im consulting for live golf right now. So Im actually on my way to Tulsa on Monday. What time did you say you had my flight?","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yes. Whos this?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Can we circle back or have them reset the appointment for literally available to.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"I appreciate you. Thanks, man. Appreciate it. Thanks, bro. Bye.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"YouRe delivering right now? Its small business owners. Thats all we need. Small business owners that have more than three to five employees, all the way up to 500 employees. Thats what youre looking for that are not 1099 contracted. I used to run hotels and casinos. Ive got one of the biggest databases in the country for as far as high end clients, casino players, gamblers, you name it, whatever have you. So everything Ive done has been like total organic. Just hey, John, its Reg. Whats going on? Hey, did you guys file for this yet? No, its been that quick. Its literally 2 hours worth a week. Its like very minimal work for a very big ROI.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Palm Beach Gardens is great. Were on the cusp. Were in a place called Old Palm Country Club. Its, like, right on the cusp of Jupiter. Palm Beach Gardens. Dude, we lived in lamps. Yeah, theyre too fucking much. I mean, its stupid. I dont know. Everything in the last two years has doubled. Its crazy. Like, two years, things have doubled. So we picked our house up in November, and weve already made, like, 300 racks on it since November. Stupid. I thought we overpaid. Yeah, but I still think we overpaid it doesnt matter how you look at it. I mean, a 2500 square foot single story house, which is hard to find out here. Theyre going to run you between 1.2 to 1.7, obviously, depending on the area. Right. And theres not really any shitty area unless you start going into West Palm, then you kind of get very urban areas, whatever. But up here, its super white, super affluent. Like the affluency rate up here. Listen, its slower paced, theres no question. So if Miami is the scene that you enjoy as a younger dude and girl, its hard to beat that. But at the same time, we lived in Coral Gables for a minute and I fucking hated it.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"Ive got a business development marketing platform for mass tort litigation. So do lawsuits and stuff with lawyers. And then I also do work with another set of lawyers doing the ERC claims filing through lawyers.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]