[{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"So, my packaging yes. I have 650 offer. I have a 1350 offer. And then after those first offers, those are just the first part, and then I have a monthly thats anywhere from $50 a month to $200 a month.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I hate to do this to you, Im 2 minutes to my next call. Im spending about just to answer your question, Im spending about 2500 a month.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, exactly. Theres things coming in. I just bolstered up my resistance as far as just making the qualified leads a little bit longer. Right. Asking a little bit deeper questions.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah. So I have a seven, eight, and nine next 3 hours. So I dont know. Im open to continuing to have this discussion, and Im not trying to get you off the phone. I really do have some sales calls. Is there a time that works for you tomorrow, Elliot?","metadata":{"fillerID":28,"fillerText":"Uh-huh","category":"D"}},{"pageContent":"Elliot, grinding. Just fucking getting some leads like you, man.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Yeah. So we help high school athletes get recruited to play soccer in college.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Id be open to the conversation, yes.","metadata":{"fillerID":18,"fillerText":"Ok yah","category":"C"}},{"pageContent":"Right.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Correct.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yes.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Facebook ads to an opt in to a VSL, to a booking page, and then on the phone with me for, like, a zoom. They got to be with the family, the kid and the parents. Thats what it looks like right now.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, Im good. Give me 1 second. Closing my door.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"Hey, whats up, man? How are you doing?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"I havent checked.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Im doing about seven to eight K a month.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Three months. Now. I started selling six months ago.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Yeah, I would like to incrementally grow to $250,000 in the next six months and $500,000 within the next year.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I havent had great success. Im training a bunch of sales guys right now. Im not a good sales guy. I know my limitations. Right. Im a good customer success manager. Im not good closer on the phone. If I could get my hands on good closers, then ideally wed be doing a lot better.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"And.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Classic sales call? Im trying to get as much fucking money as I can.","metadata":{"fillerID":6,"fillerText":"Totally","category":"A"}},{"pageContent":"Yeah, I was curious how you guys leverage the AI to help book appointments so I could get rid of my fucking appointment setter whos garbage, and get qualified leads into my calls.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"And I work with a company called Conversionly for scaling stuff. Its a little whats the word? They do a decent job, but for me, its more about efficiency as far as cutting out a human whos making mistakes. And I dont have the time to train him, so I cant blame it all on him. Right. At the end of the day, it falls on me as a business owner, but the reality is that I got too much shit on my plate. So Ive been looking into some things like Wu Send and a couple of other platforms to help me really go through the 100,000 leads that I have that are somewhat qualified. As in they all are soccer players, they all have gone to ID camps. Theyre all pretty much, Id say 80% of them are going to be playing college soccer, or at least trying to.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"I think its the quality of leads that were getting in. And I agree with you. The price structure is a little different. It needs to be broken down maybe a little bit differently. I also think that I think having a higher ticket offer in there for the right people, for the right segment of people is the right thing. Right. But targeting those people.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"And Im just struggling to get the right people on the phone and then dealing with this guy to actually do this stuff correctly. So its just taking a lot of time out of my out of my day when I could be doing things like Im doing tomorrow? Just being on podcast and getting the Face out there.","metadata":{"fillerID":15,"fillerText":"Gotcha","category":"B"}},{"pageContent":"Hello? This is Elliot.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"I just got to do a better job targeting the demographic. I think thats what Im not doing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}}]