[{"pageContent":"I dont know, its just instagram thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, it was a theme with five AI.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah, I kind of understand. Its more like digital, right?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Yeah.","metadata":{"fillerID":21,"fillerText":"Yeah","category":"C"}},{"pageContent":"Okay, the reason is because I do concerts, I do events, I do TV production, I do different things. The income is not coming from first only. Its not a residual income. Thats what Im trying to explain to you. We do a bunch of stuff for a different kind of different clients.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"No, Ive been doing since Pandemic.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"You provide, but its only one to 60. Its simple. You need all this stuff. If you dont have it, youre not trust me.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"This is the thing you dont understand. I repeat myself like, two times. There is different products, there is different services. There is no one who service you cannot measure. You cannot even complete 30 years. So once you want to, whats the product? Right. How to make money. How to make the money? Well, different companies, they expect different services. Im going to give you an example. Im doing right now something for a company in Latin America. They do a conference. So its very simple. Gig. They hire me to do the conference, and there is different products around that conference. AV systems, switcher, cameras, technicians, audio, video, lets screen, PowerPoint, presentation. That is thats a revenue.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"One more time.","metadata":{"fillerID":30,"fillerText":"Yah umm","category":"E"}},{"pageContent":"Its not about that. Its what do they need? Okay, I provide the AV. They need lead screen, I provide information, and thats it. Thank you, man.","metadata":{"fillerID":43,"fillerText":"Ok yah","category":"G"}},{"pageContent":"I got it.","metadata":{"fillerID":1,"fillerText":"Gotcha","category":"A"}},{"pageContent":"I just told you, man.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"I dont have one client. I have 51 clients, and every single one of them wants something different, maybe on the same thing.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Well, you can imagine yourself you are a producer, right? Or you are a client, you have a business. So I say, well, were going to do your corporate event, were going to do your TV commercial, were going to do social media content, were going to do your talking, were going to help you to create your NFD. If you are a musician, were going to help you to be in the meta. Were going to create content around that space.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Whats that?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}},{"pageContent":"If you want, we can reschedule a call for next week or something.","metadata":{"fillerID":42,"fillerText":"Ok gotcha","category":"G"}},{"pageContent":"So this is the thing. Pandemic nobody was making income. I start to get into metabol conference, virtual events and stuff like that and start moving. As soon Pandemic is over, people start to do more of it. Right, okay. Im so tired because Im tired. Im fucking tired right now.","metadata":{"fillerID":17,"fillerText":"wow","category":"B"}},{"pageContent":"The net is not even.","metadata":{"fillerID":40,"fillerText":"Gotcha","category":"G"}},{"pageContent":"No, same thing as far as you.","metadata":{"fillerID":46,"fillerText":"Uh-huh","category":"G"}},{"pageContent":"Well, my rate right now is like, between 30 a month. I want to create simplified processes through AI. Im looking right now into calendars schedules, CRMs, stuff like that.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Hello?","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Bro, I just told you that Im doing right now a client $20,000 for a conference, different product, different things. Its a service technician. What is the point that you dont understand about that?","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"I can hear you.","metadata":{"fillerID":45,"fillerText":"Yeah","category":"G"}},{"pageContent":"Thats correct. Thats my email.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Well, Pandemic was zero. Right. After Pandemic, Ive been increasing 5000, 6000, 12,000, 15,000, 20,000, 8000. Its not I have a load of I have to extend a lot of hours to.","metadata":{"fillerID":9,"fillerText":"Interesting","category":"A"}},{"pageContent":"Yeah. Okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Yeah, okay.","metadata":{"fillerID":22,"fillerText":"Okay","category":"C"}},{"pageContent":"Okay. Basically we are content creation company. We have more than 30 years in broadcast industry and we do spiritual events, NFCs, we create tokens, we do a bunch of stuff. But recently I start to deal with so far and different content creation. AI platforms help us to develop or capture or create software or codes for certain applications into the content creation environment. So we want to the elemental reality creating the space to create virtual studios. But at the same time we want to create a company that provides services for businesses with AI. So Im very into AI mode in this next three to six months that Im trying to get all the knowledge that possible can exist.","metadata":{"fillerID":10,"fillerText":"Definitely","category":"A"}},{"pageContent":"Okay, lets do it more simple. Can you send me an email with your proposal or your service? What do you do and how you can bring benefits?","metadata":{"fillerID":27,"fillerText":"Yeah","category":"D"}}]